Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/import_plugins.po
Languages: de, es, fr, ja, zh_cn

source: Now that the enum is defined, let's keep looking at the methods of an import plugin:
de: Da das Enum nun definiert ist, lassen Sie uns die Methoden eines Import-Plugins weiter betrachten:
es: Ahora que la enumeración está definida, sigamos mirando los métodos de un complemento de importación:
fr: Maintenant que l’énumération est définie, revenons aux méthodes d’un plugin d’importation :
ja: 列挙型が定義されたので、インポート プラグインのメソッドを見てみましょう:
zh_cn: 既然定义了枚举, 让我们继续看一下导入插件的方法:

source: The :ref:`get_preset_count() <class_EditorImportPlugin_method_get_preset_count>` method returns the amount of presets that this plugins defines. We only have one preset now, but we can make this method future-proof by returning the size of our ``Presets`` enumeration.
de: Die Methode :ref:`get_preset_count() <class_EditorImportPlugin_method_get_preset_count>` gibt die Anzahl der Presets zurück, die dieses Plugin definiert. Wir haben jetzt nur ein Preset, aber wir können diese Methode zukunftssicher machen, indem wir die Größe unserer ``Presets``-Aufzählung zurückgeben.

source: Here we have the :ref:`get_preset_name() <class_EditorImportPlugin_method_get_preset_name>` method, which gives names to the presets as they will be presented to the user, so be sure to use short and clear names.
de: Hier haben wir die Methode :ref:`get_preset_name() <class_EditorImportPlugin_method_get_preset_name>`, die den Presets Namen gibt, wie sie dem Benutzer präsentiert werden, also achten Sie darauf, kurze und klare Namen zu verwenden.

source: We can use the ``match`` statement here to make the code more structured. This way it's easy to add new presets in the future. We use the catch all pattern to return something too. Although Godot won't ask for presets beyond the preset count you defined, it's always better to be on the safe side.
de: Wir können hier die ``match``-Anweisung verwenden, um den Code besser zu strukturieren. Auf diese Weise ist es einfach, in Zukunft neue Presets hinzuzufügen. Wir verwenden das Catch-All-Schema, um auch etwas zurückzugeben. Obwohl Godot nicht nach Presets jenseits der von Ihnen definierten Preset-Anzahl fragen wird, ist es immer besser, auf Nummer sicher zu gehen.
es: Aquí podemos usar la sentencia ``match`` para hacer el código más estructurado. De esta manera es más fácil añadir nuevos presets en el futuro. Usamos el patrón de catch all para devolver algo también. Aunque Godot no pedirá presets más allá del número de presets que definiste, siempre es mejor ser precavido.
fr: On peut utiliser l’instruction ``match`` pour mieux structurer le code. Il sera ainsi facile d’ajouter des nouveaux préréglages à l’avenir. On utilise aussi le pattern joker pour toujours retourner quelque chose. Bien que Godot ne demande pas de préréglages au-delà du nombre que vous avez défini, il vaut toujours mieux être prudent.
ja: ここで ``match`` ステートメントを使用して、コードをより構造化できます。 これにより、将来的に新しいプリセットを簡単に追加できます。catch allも何かを返す時に使います。Godotでは、定義したプリセット数を超えるプリセットは要求されませんが、常に安全側にあることをお勧めします。
zh_cn: 我们可以在这里使用 ``match`` 语句来使代码更加结构化. 这样, 将来很容易添加新的预设. 我们使用catch all模式来返回一些东西. 虽然Godot不会要求超出你定义的预设计数的预设, 但最好是安全起见.

source: If you have only one preset you could simply return its name directly, but if you do this you have to be careful when you add more presets.
de: Wenn Sie nur eine Voreinstellung haben, können Sie den Namen einfach direkt zurückgeben. Wenn Sie dies jedoch tun müssen Sie beim hinzufügen mehrerer Voreinstellungen vorsichtig sein.
es: Si sólo tiene un preset puede simplemente devolver su nombre directamente, pero si lo hace debe tener cuidado al añadir más presets.
fr: Si vous n’avez qu’un seul préréglage, vous pouvez simplement retourner directement son nom, mais il faut dans ce cas faire attention quand vous ajouterez d’autres préréglages.
ja: プリセットが1つしかない場合は、名前を直接返すだけですが、これを行う場合は、プリセットを追加するときに注意する必要があります。
zh_cn: 如果你只有一个预设, 则可以直接返回其名称, 但如果你这样做, 则在添加更多预设时必须小心.

source: This is the method which defines the available options. :ref:`get_import_options() <class_EditorImportPlugin_method_get_import_options>` returns an array of dictionaries, and each dictionary contains a few keys that are checked to customize the option as its shown to the user. The following table shows the possible keys:
de: Dies ist die Methode, die die verfügbaren Optionen definiert. :ref:`get_import_options() <class_EditorImportPlugin_method_get_import_options>` gibt ein Array von Wörterbüchern zurück, und jedes Wörterbuch enthält einige Schlüssel, die überprüft werden, um die Option so anzupassen, wie sie dem Benutzer angezeigt wird. Die folgende Tabelle zeigt die möglichen Schlüssel:

source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: キー
zh_cn: 键

source: Type
de: Art
es: Tipo
ja: タイプ(型)
zh_cn: 类型

source: Description
de: Beschreibung
es: Descripción
ja: 説明
zh_cn: 描述

source: String
de: Zeichenkette
es: Cadena
fr: Chaîne de caractères
ja: 文字列
zh_cn: 字符串

source: The name of the option. When showed, underscores become spaces and first letters are capitalized.
de: Der Name der Option. Unterstriche werden zu Leerzeichen und Anfangsbuchstaben werden groß geschrieben.
es: El nombre de la opción. Cuando se muestran, los guiones bajos se convierten en espacios y las primeras letras se escriben en mayúscula.
fr: Le nom de l’option. À l’affichage, les tirets bas deviennent des espaces et les premières lettres des mots sont passées en capitales.
ja: オプションの名前。表示すると、アンダースコアはスペースになり、最初の文字は大文字になります。
zh_cn: 选项的名称. 显示时, 下划线变为空格, 首字母大写.

source: Any
de: beliebig
es: Algún
fr: N’importe
ja: 任意
zh_cn: 任何类型

source: The default value of the option for this preset.
de: Der Standardwert der Option für diese Voreinstellung.
es: El valor por defecto de la opción para este preset.
fr: La valeur par défaut de l’option pour ce préréglage.
ja: このプリセットのオプションの既定値。
zh_cn: 此预设的选项的默认值.

source: Enum value
de: Aufzählungswert
es: Valor de enumeración
fr: Valeur d’énumération
ja: 列挙値
zh_cn: 枚举值

source: One of the :ref:`PropertyHint <enum_@GlobalScope_PropertyHint>` values to use as hint.
de: Einer der :ref:`PropertyHint <enum_ @ GlobalScope_PropertyHint>` Werte, der als Hinweis verwendet werden soll.
es: Uno de los valores: ref: `PropertyHint <enum_ @ GlobalScope_PropertyHint>` para usar como sugerencia.
fr: Une des valeurs de :ref:`PropertyHint <enum_@GlobalScope_PropertyHint>`, à utiliser pour comme indication.
ja: ヒントとして使用する :ref:`PropertyHint <enum_@GlobalScope_PropertyHint>` 値の1つ。
zh_cn: :ref:`PropertyHint <enum_@GlobalScope_PropertyHint>` 中的一个值, 作为提示使用.

source: The hint text of the property. The same as you'd add in the ``export`` statement in GDScript.
de: Der Hinweistext der Eigenschaft. Das gleiche, wie Sie es in der Anweisung ``export`` in GDScript hinzufügen würden.
es: El texto de sugerencia de la propiedad. Lo mismo que agregaría en la declaración ``exportar`` en GDScript.
fr: Le texte d’indication de la propriété. Le même qu’on ajouterait à l’instruction ``export`` en GDScript.
ja: プロパティのヒントテキスト。GDScriptの ``export`` ステートメントに追加するのと同じです。
zh_cn: 属性的提示文本. 与你在GDScript中的 ``export`` 语句中添加相同.

source: One of the :ref:`PropertyUsageFlags <enum_@GlobalScope_PropertyUsageFlags>` values to define the usage.
de: Einer der :ref:`PropertyUsageFlags <enum_ @ GlobalScope_PropertyUsageFlags>` Werte, um die Verwendung zu definieren.
es: Uno de los valores: ref: `PropertyUsageFlags <enum_@GlobalScope_PropertyUsageFlags>` para definir el uso.
fr: Une des valeurs de :ref:`PropertyUsageFlags <enum_@GlobalScope_PropertyUsageFlags>` définissant l’usage.
ja: 使用法を定義する :ref:`PropertyUsageFlags <enum_@GlobalScope_PropertyUsageFlags>` 値の1つ。
zh_cn: :ref:`PropertyUsageFlags <enum_@GlobalScope_PropertyUsageFlags>` 中的一个值来定义用途.

source: The ``name`` and ``default_value`` keys are **mandatory**, the rest are optional.
de: Die Schlüssel ``name`` und ``default_value`` **müssen** angegeben werden, der Rest ist optional.
es: Las claves ``nombre`` y ``valor_predeterminado`` son **obligatorias**, el resto son opcionales.
fr: Les clés ``name`` et ``default_value`` sont **obligatoires**, les autres sont optionnelles.
ja: ``name`` キーと ``default_value`` キーは\ **必須**\ で、残りは省略可能です。
zh_cn: ``name`` 和 ``default_value`` 键是 **强制** , 其余是可选的.

source: Note that the ``get_import_options`` method receives the preset number, so you can configure the options for each different preset (especially the default value). In this example we use the ``match`` statement, but if you have lots of options and the presets only change the value you may want to create the array of options first and then change it based on the preset.
de: Beachten Sie, dass die Methode ``get_import_options`` die Preset-Nummer erhält, so dass Sie die Optionen für jedes verschiedene Preset konfigurieren können (insbesondere den Standardwert). In diesem Beispiel verwenden wir die Anweisung ``match``, aber wenn Sie viele Optionen haben und die Voreinstellungen nur den Wert ändern, möchten Sie vielleicht zuerst das Array mit den Optionen erstellen und es dann basierend auf dem Preset ändern.

source: The ``get_import_options`` method is called even if you don't define presets (by making ``get_preset_count`` return zero). You have to return an array even it's empty, otherwise you can get errors.
de: Die Methode ``get_import_options`` wird auch dann aufgerufen, wenn Sie keine Presets definiert haben (indem Sie ``get_preset_count`` 0 zurück geben lassen). Sie müssen ein Array zurückgeben, auch wenn es leer ist, sonst können Sie Fehler erhalten.

source: For the :ref:`get_option_visibility() <class_EditorImportPlugin_method_get_option_visibility>` method, we simply return ``true`` because all of our options (i.e. the single one we defined) are visible all the time.
de: Für die Methode :ref:`get_option_visibility() <class_EditorImportPlugin_method_get_option_visibility>` geben wir einfach ``true`` zurück, weil alle unsere Optionen (d.h. die einzige, die wir definiert haben) immer sichtbar sind.

source: If you need to make certain option visible only if another is set with a certain value, you can add the logic in this method.
de: Wenn Sie eine bestimmte Option nur sichtbar machen müssen, wenn eine andere mit einem bestimmten Wert belegt ist, können Sie die Logik in dieser Methode hinzufügen.
es: Si necesita hacer visible cierta opción solo si se establece otra con un valor determinado, puede agregar la lógica en este método.
fr: Si vous devez rendre certaines options visibles uniquement si une autre est définie avec une certaine valeur, vous pouvez ajouter la logique dans cette méthode.
ja: 特定のオプションを表示する必要がある場合は、別のオプションが特定の値で設定されている場合にのみ、このメソッドにロジックを追加できます。
zh_cn: 如果只有在使用某个值设置了另一个选项时才需要使某个选项可见, 则可以在此方法中添加逻辑.

source: The ``import`` method
de: Die ``import`` Methode
es: El método de ``importación``
fr: La méthode ``import``
ja: ``import`` メソッド
zh_cn: ``import`` 方法

source: The heavy part of the process, responsible for converting the files into resources, is covered by the :ref:`import() <class_EditorImportPlugin_method_import>` method. Our sample code is a bit long, so let's split in a few parts:
de: Der schwere Teil des Prozesses, der für die Umwandlung der Dateien in Ressourcen verantwortlich ist, wird von der Methode :ref:`import() <class_EditorImportPlugin_method_import>` abgedeckt. Unser Beispielcode ist ein bisschen lang, also teilen wir ihn in ein paar Teile auf:

source: The first part of our import method opens and reads the source file. We use the :ref:`File <class_File>` class to do that, passing the ``source_file`` parameter which is provided by the editor.
de: Der erste Teil unserer Importmethode öffnet und liest die Quelldatei. Wir verwenden dazu die Klasse :ref:`File <class_File>` und übergeben den Parameter ``source_file``, der vom Editor bereitgestellt wird.

source: If there's an error when opening the file, we return it to let the editor know that the import wasn't successful.
de: Wenn beim Öffnen der Datei ein Fehler auftritt, geben wir diesen zurück, um dem Editor mitzuteilen, dass der Import nicht erfolgreich war.
es: Si hay un error al abrir el archivo, lo devolvemos para que el editor sepa que la importación no se realizó correctamente.
fr: S'il y a une erreur lors de l'ouverture du fichier, nous la retournons pour faire savoir à l'éditeur que l'importation n'a pas réussi.
ja: ファイルを開くときにエラーが発生した場合は、それを返して、インポートが失敗したことをエディタに知らせます。
zh_cn: 如果打开文件时出错, 我们将其返回以让编辑器知道导入不成功.

source: This code takes the line of the file it read before and splits it in pieces that are separated by a comma. If there are more or less than the three values, it considers the file invalid and reports an error.
de: Dieser Code nimmt die Zeile der Datei, die er zuvor gelesen hat, und teilt sie in Teile auf, die durch ein Komma getrennt sind. Wenn mehr oder weniger als die drei Werte vorhanden sind, betrachtet er die Datei als ungültig und meldet einen Fehler.
es: Este código toma la línea del archivo que leyó antes y la divide en partes separadas por una coma. Si hay más o menos de los tres valores, considera que el archivo no es válido y reporta un error.
fr: Ce code prend la ligne du fichier qu'il a lu auparavant et la divise en morceaux séparés par une virgule. S'il y a plus ou moins que les trois valeurs, il considère le fichier comme non valide et signale une erreur.
ja: このコードは、前に読み込んだファイルの行を取得し、コンマで区切られた断片に分割します。 3つよりも多いまたは少ない場合、ファイルは無効であると見なされ、エラーが報告されます。
zh_cn: 此代码获取之前读取的文件行, 并将其拆分为以逗号分隔的片段. 如果有多于或少于三个值, 则认为该文件无效并报告错误.

source: Then it creates a new :ref:`Color <class_Color>` variable and sets its values according to the input file. If the ``use_red_anyway`` option is enabled, then it sets the color as a pure red instead.
de: Dann erzeugt es eine neue Variable :ref:`Color <class_Color>` und setzt ihre Werte entsprechend der Eingabedatei. Wenn die Option ``use_red_anyway`` aktiviert ist, dann setzt es die Farbe stattdessen als reines Rot.
es: Luego crea una nueva variable: ref: `Color <class_Color>` y establece sus valores de acuerdo con el archivo de entrada. Si la opción `` use_red_anyway '' está habilitada, entonces establece el color como rojo puro.
fr: Ensuite, il crée une nouvelle variable :ref:`Color <class_Color>` et fixe ses valeurs en fonction du fichier d'entrée. Si l'option ``use_red_anyway`` est activée, alors elle définit la couleur comme un rouge pur à la place.
ja: 次に、新しい :ref:`Color <class_Color>` 変数を作成し、入力ファイルに従ってその値を設定します。\ ``use_red_anyway`` オプションが有効な場合、代わりに色を純粋な赤に設定します。
zh_cn: 然后它创建一个新的 :ref:`Color <class_Color>` 变量, 并根据输入文件设置其值. 如果启用了 ``use_red_anyway`` 选项, 那么它将颜色设置为纯红色.

source: This part makes a new :ref:`SpatialMaterial <class_SpatialMaterial>` that is the imported resource. We create a new instance of it and then set its albedo color as the value we got before.
de: Dieser Teil erstellt ein neues :ref:`SpatialMaterial <class_SpatialMaterial>`, als importierte Ressource. Wir erstellen eine neue Instanz davon und setzen dann die Albedofarbe als den Wert, den wir zuvor erhalten haben.

source: This is the last part and quite an important one, because here we save the made resource to the disk. The path of the saved file is generated and informed by the editor via the ``save_path`` parameter. Note that this comes **without** the extension, so we add it using :ref:`string formatting <doc_gdscript_printf>`. For this we call the ``get_save_extension`` method that we defined earlier, so we can be sure that they won't get out of sync.
de: Dies ist der letzte Teil und ein ziemlich wichtiger, denn hier wird die erstellte Ressource auf der Festplatte gespeichert. Der Pfad der gespeicherten Datei wird generiert und vom Editor über den Parameter ``save_path`` mitgeteilt. Beachten Sie, dass dieser **ohne** die Erweiterung kommt, also fügen wir sie mit :ref:`String-Formatierung <doc_gdscript_printf>` hinzu. Dazu rufen wir die Methode ``get_save_extension`` auf, die wir zuvor definiert haben, so dass wir sicher sein können, dass sie nicht aus dem Takt geraten.

source: We also return the result from the :ref:`ResourceSaver.save() <class_ResourceSaver_method_save>` method, so if there's an error in this step, the editor will know about it.
de: Wir geben auch das Ergebnis der Methode :ref:`ResourceSaver.save() <class_ResourceSaver_method_save>` zurück, so dass der Editor weiß, wenn in diesem Schritt ein Fehler auftritt.
es: También devolvemos el resultado del método :ref:`ResourceSaver.save() <class_ResourceSaver_method_save>`, así que si hay un error en este paso, el editor lo sabrá.
fr: Nous renvoyons également le résultat de la méthode :ref:`ResourceSaver.save() <class_ResourceSaver_method_save>`, donc s'il y a une erreur dans cette étape, l'éditeur en sera informé.
ja: また、\ :ref:`ResourceSaver.save() <class_ResourceSaver_method_save>` メソッドから結果を返すため、このステップでエラーが発生した場合、エディタはそれを認識します。
zh_cn: 我们还返回 :ref:`ResourceSaver.save() <class_ResourceSaver_method_save>` 方法的结果, 所以如果这一步有错误, 编辑器会知道.

source: Platform variants and generated files
de: Plattformvarianten und generierte Dateien
es: Variantes de plataforma y archivos generados
fr: Variantes de plate-forme et fichiers générés
ja: プラットフォームバリアントと生成されたファイル
zh_cn: 平台变体和生成的文件

source: You may have noticed that our plugin ignored two arguments of the ``import`` method. Those are *return arguments* (hence the ``r`` at the beginning of their name), which means that the editor will read from them after calling your import method. Both of them are arrays that you can fill with information.
de: Sie haben vielleicht bemeraufkt, dass unser Plugin zwei Argumente der Methode ``import`` ignoriert hat. Diese sind *Rückgabe-Argumente* (daher das ``r`` am Anfang ihres Namens), was bedeutet, dass der Editor nach dem Aufruf Ihrer Import-Methode aus ihnen liest. Beides sind Arrays, die Sie mit Informationen füllen können.
es: Habrás notado que nuestro plugin ignoró dos argumentos del método ``import``. Esos son * argumentos de retorno* (de ahí la ``r`` al principio de su nombre), lo que significa que el editor los leerá después de llamar a su método de importación. Ambos son arrays que puedes rellenar con información.
fr: Vous avez peut-être remarqué que notre plugin a ignoré deux arguments de la méthode ``import``. Ce sont des *arguments de retour* (d'où le ``r`` au début de leur nom), ce qui signifie que l'éditeur les lira après avoir appelé votre méthode d'importation. Les deux sont des tableaux que vous pouvez remplir avec des informations.
ja: お気付きかもしれませんが、このプラグインは ``import`` メソッドの2つの引数を無視しています。これらは\ *戻り引数*\ (したがって、名前の先頭に ``r`` があります)で、これはエディタがimportメソッドを呼び出した後にこれらの引数から読み込むことを意味します。どちらも情報を格納できる配列です。
zh_cn: 你可能已经注意到我们的插件忽略了 ``import`` 方法的两个参数。那些是\ *返回参数*\ （因此它们的名称以 ``r`` 开头），这意味着编辑器会在调用你的 import 方法之后读取它们。它们都是可以填充信息的数组。

source: The ``r_platform_variants`` argument is used if you need to import the resource differently depending on the target platform. While it's called *platform* variants, it is based on the presence of :ref:`feature tags <doc_feature_tags>`, so even the same platform can have multiple variants depending on the setup.
de: Das Argument ``r_platform_variants`` wird verwendet, wenn Sie die Ressource je nach Zielplattform unterschiedlich importieren müssen. Während es *Plattform*-Varianten genannt wird, basiert es auf dem Vorhandensein von :ref:`Feature-Tags <doc_feature_tags>`, so dass sogar die gleiche Plattform je nach Einrichtung mehrere Varianten haben kann.
es: El argumento ``r_platform_variants`` se usa si necesita importar el recurso de manera diferente según la plataforma de destino. Si bien se llama variantes de * plataforma *, se basa en la presencia de: ref: `etiquetas de características <doc_feature_tags>`, por lo que incluso la misma plataforma puede tener múltiples variantes según la configuración.
fr: L'argument ``r_platform_variants`` est utilisé si vous avez besoin d'importer la ressource différemment selon la plate-forme cible. Bien qu'il soit appelé variantes de *plate-forme*, il est basé sur la présence de :ref:`feature tags <doc_feature_tags>`, donc la même plateforme peut avoir plusieurs variantes selon la configuration.
ja: ターゲットプラットフォームに応じて異なる方法でリソースをインポートする必要がある場合、\ ``r_platform_variants`` 引数が使用されます。\ *platform* バリアントと呼ばれますが、\ :ref:`feature tags <doc_feature_tags>` の存在に基づいているため、同じプラットフォームでも設定に応じて複数のバリアントを使用できます。
zh_cn: ``r_platform_variants`` 参数用于需要根据目标平台导入不同的资源. 虽然被称为 *平台* 变体, 但它是基于 :ref:`feature tags <doc_feature_tags>` 的存在, 所以即使是同一个平台也可以有多个变体, 这取决于设置.

source: To import a platform variant, you need to save it with the feature tag before the extension, and then push the tag to the ``r_platform_variants`` array so the editor can know that you did.
de: Um eine Plattformvariante zu importieren, müssen Sie sie mit dem Feature-Tag vor der Erweiterung speichern und dann das Tag in das Array ``r_platform_variants`` schieben, damit der Editor weiß, dass Sie es getan haben.
es: Para importar una variante de plataforma, necesitas guardarla con la etiqueta de la característica antes de la extensión, y luego empujar la etiqueta a un array ``r_platform_variants`` para que el editor pueda saber que lo hiciste.
fr: Pour importer une variante de plate-forme, vous devez l'enregistrer avec la balise de fonctionnalité avant l'extension, puis pousser la balise dans le tableau ``r_platform_variants`` pour que l'éditeur sache que vous l'avez fait.
ja: プラットフォームバリアントをインポートするには、拡張機能の前に機能タグを付けて保存してから、タグを ``r_platform_variants`` 配列にプッシュして、エディタがそれを認識できるようにする必要があります。
zh_cn: 要导入平台变体, 需要在扩展名之前使用feature标记保存它, 然后将标记推送到 ``r_platform_variants`` 数组, 以便编辑可以知道你做了.

source: For example, let's say we save a different material for a mobile platform. We would need to do something like the following:
de: Angenommen wir speichern ein anderes Material für eine mobile Plattform. Wir müssten so etwas tun:
es: Por ejemplo, digamos que guardamos un material diferente para una plataforma móvil. Necesitaríamos hacer algo como lo siguiente:
fr: Par exemple, disons que nous enregistrons un matériau différent pour une plate-forme mobile. Nous aurions besoin de faire quelque chose comme ceci :
ja: たとえば、モバイルプラットフォーム用に別のマテリアルを保存したとします。次のような処理を行う必要があります:
zh_cn: 例如, 假设我们为移动平台保存一个不同的材质. 我们将需要做如下的事情:

source: This is also an array and should be filled with full paths of the files you save. As an example, let's create another material for the next pass and save it in a different file:
de: Dies ist auch ein Array und sollte mit vollständigen Pfaden der von Ihnen gespeicherten Dateien gefüllt sein. Als Beispiel erstellen wir ein anderes Material für den nächsten Durchgang und speichern es in einer anderen Datei:
es: Esto también es un array y debería estar lleno de rutas completas de los archivos que guardas. Por ejemplo, creamos otro material para la siguiente pasada y lo guardamos en un archivo diferente:
fr: Il s'agit également d'un tableau et doit être rempli avec les chemins d'accès complets des fichiers que vous enregistrez. À titre d'exemple, créons un autre matériau pour la prochaine passe et enregistrons-le dans un fichier différent :
ja: これは配列でもあるので、保存するファイルの完全なパスで埋められます。たとえば、次のパス用に別のマテリアルを作成し、別のファイルに保存してみましょう:
zh_cn: 这也是一个数组, 应该填充你保存的文件的完整路径. 例如, 让我们为下一个传递创建另一个材质并将其保存在不同的文件中:

source: Trying the plugin
de: Das Plugin ausprobieren
es: Probar el complemento
fr: Essayer le plugin
ja: プラグインを試す
zh_cn: 试试这个插件

source: ``name``
es: nombre

source: ``default_value``
es: ``valor por defecto``

source: ``property_hint``
es: ``sugerencia_propiedad``

source: ``usage``
es: ``uso``
