Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/import_plugins.po
Languages: de, es, fr, ja, zh_cn

source: Import plugins
de: Erweiterungen importieren
es: Importar plugins
fr: Importer des plugins
ja: プラグインのインポート
zh_cn: 导入插件

source: This tutorial assumes you already know how to make generic plugins. If in doubt, refer to the :ref:`doc_making_plugins` page. This also assumes you are acquainted with Godot's import system.
de: In dieser Anleitung wird davon ausgegangen, dass Sie bereits wissen wie man generische Plugins erstellt. Im Zweifelsfall lesen Sie bitte die Seite :ref:`doc_making_plugins`. Dies setzt auch voraus, dass Sie mit dem Importsystem von Godot vertraut sind.
es: Este tutorial asume que ya sabe cómo crear complementos genéricos. En caso de duda, consulte la página: ref: `doc_making_plugins`. Esto también asume que está familiarizado con el sistema de importación de Godot.
fr: Ce tutoriel suppose que vous savez déjà comment créer des plugins génériques. En cas de doute, reportez-vous à la page :ref:`doc_making_plugins`. Cela suppose également que vous connaissiez le système d'importation de Godot.
ja: このチュートリアルでは、汎用プラグインの作成方法を理解していることを前提としています。よく理解していない場合は、\ :ref:`doc_making_plugins`\ ページを参照してください。また、Godotのインポートシステムに精通していることを前提としています。
zh_cn: 本教程假设你已经知道如何制作通用插件. 如有疑问, 请参阅 :ref:`doc_making_plugins` 页面. 这也假设你熟悉Godot的导入系统.

source: Introduction
de: Einführung
es: Introducción
ja: はじめに
zh_cn: 前言

source: An import plugin is a special type of editor tool that allows custom resources to be imported by Godot and be treated as first-class resources. The editor itself comes bundled with a lot of import plugins to handle the common resources like PNG images, Collada and glTF models, Ogg Vorbis sounds, and many more.
de: Ein Import-Plugin ist eine spezielle Art von Editor-Tool, mit dem benutzerdefinierte Ressourcen von Godot importiert und als erstklassige Ressourcen behandelt werden können. Der Editor selbst wird mit vielen Import-Plugins geliefert, die die gängigen Ressourcen wie PNG Bilder, Collada und glTF Modelle, Ogg Vorbis Sounds und vieles mehr verarbeiten.
es: Un complemento de importación es un tipo especial de herramienta de edición que permite que Godot importe recursos personalizados y los trate como recursos de primera clase. El editor en sí viene incluido con una gran cantidad de complementos de importación para manejar los recursos comunes como imágenes PNG, modelos Collada y glTF, sonidos Ogg Vorbis y muchos más.
fr: Un plugin d'importation est un type spécial d'outil de l'éditeur qui permet aux ressources personnalisées d'être importées par Godot et d'être traitées comme des ressources de première classe. L'éditeur lui-même est fourni avec de nombreux plugins d'importation pour gérer les ressources communes comme les images PNG, les modèles Collada et glTF, les sons Ogg Vorbis, et bien d'autres.
ja: インポートプラグインは、カスタムリソースをGodotによってインポートし、ファーストクラスのリソースとして扱うことができる特別なタイプのエディタツールです。エディタ自体には、PNG画像、ColladaおよびglTFモデル、Ogg Vorbisサウンドなどの一般的なリソースを処理するための多くのインポートプラグインがバンドルされています。
zh_cn: 导入插件是一种特殊的编辑器工具, 它允许Godot导入自定义资源, 并将其作为一级资源对待. 编辑器本身捆绑了很多导入插件来处理常见的资源, 如PNG图片, Collada和glTF模型, Ogg Vorbis声音等等.

source: This tutorial will show you how to create a simple import plugin to load a custom text file as a material resource. This text file will contain three numeric values separated by comma, which represents the three channels of a color, and the resulting color will be used as the albedo (main color) of the imported material. In this example it will contain the pure blue color (zero red, zero green, and full blue):
de: Diese Anleitung zeigt Ihnen, wie Sie ein einfaches Import-Plugin erstellen, um eine benutzerdefinierte Textdatei als Materialressource zu laden. Diese Textdatei enthält drei durch Komma getrennte numerische Werte, die die drei Kanäle einer Farbe darstellen. Die resultierende Farbe wird als Albedo (Hauptfarbe) des importierten Materials verwendet. In diesem Beispiel enthält es die reine blaue Farbe (null Rot, null Grün und volles Blau):

source: Configuration
de: Konfiguration
es: Configuración
ja: 構成
zh_cn: 配置

source: First we need a generic plugin that will handle the initialization and destruction of our import plugin. Let's add the ``plugin.cfg`` file first:
de: Zuerst brauchen wir ein generisches Plugin, das die Initialisierung und Zerstörung unseres Import-Plugins übernimmt. Fügen wir zuerst die Datei ``plugin.cfg`` hinzu:
es: Primero necesitamos un complemento genérico que se encargue de la inicialización y destrucción de nuestro complemento de importación. Primero agreguemos el archivo `` plugin.cfg '':
fr: Tout d'abord, nous avons besoin d'un plugin générique qui va prendre en charge l'initialisation et la destruction de notre plugin d'importation. Ajoutons d'abord le fichier ``plugin.cfg`` :
ja: まず、インポートプラグインの初期化と破棄を処理する汎用プラグインが必要です。最初に ``plugin.cfg`` ファイルを追加してみましょう:
zh_cn: 首先, 我们需要一个通用插件来处理导入插件的初始化和销毁. 让我们先添加 ``plugin.cfg`` 文件:

source: Then we need the ``material_import.gd`` file to add and remove the import plugin when needed:
de: Dann brauchen wir die Datei ``material_import.gd``, um das Import-Plugin bei Bedarf hinzuzufügen und zu entfernen:
es: Luego, necesitamos el archivo `` material_import.gd '' para agregar y eliminar el complemento de importación cuando sea necesario:
fr: Puis, nous avons besoin du fichier ``material_import.gd`` pour ajouter et enlever le plugin d'importation quand nous en aurons besoin :
ja: 次に、必要に応じてインポート プラグインを追加および削除する ``material_import.gd`` ファイルが必要です:
zh_cn: 然后我们需要 ``material_import.gd`` 文件来在需要时添加和删除导入插件:

source: When this plugin is activated, it will create a new instance of the import plugin (which we'll soon make) and add it to the editor using the :ref:`add_import_plugin() <class_EditorPlugin_method_add_import_plugin>` method. We store a reference to it in a class member ``import_plugin`` so we can refer to it later when removing it. The :ref:`remove_import_plugin() <class_EditorPlugin_method_remove_import_plugin>` method is called when the plugin is deactivated to clean up the memory and let the editor know the import plugin isn't available anymore.
de: Wenn dieses Plugin aktiviert wird, erzeugt es eine neue Instanz des Import-Plugins (das wir bald erstellen werden) und fügt es dem Editor mit der Methode :ref:`add_import_plugin() <class_EditorPlugin_method_add_import_plugin>` hinzu. Wir speichern eine Referenz darauf in einem Klassenmitglied ``import_plugin``, damit wir später beim Entfernen darauf verweisen können. Die Methode :ref:`remove_import_plugin() <class_EditorPlugin_method_remove_import_plugin>` wird aufgerufen, wenn das Plugin deaktiviert wird, um den Speicher aufzuräumen und den Editor wissen zu lassen, dass das Import-Plugin nicht mehr verfügbar ist.
es: Cuando este complemento está activado, creará una nueva instancia del complemento de importación (que pronto crearemos) y lo agregará al editor usando el método: ref: `add_import_plugin () <class_EditorPlugin_method_add_import_plugin>`. Almacenamos una referencia a él en un miembro de la clase ``import_plugin`` para que podamos consultarlo más adelante cuando lo eliminemos. El método: ref: `remove_import_plugin () <class_EditorPlugin_method_remove_import_plugin>` se llama cuando el complemento está desactivado para limpiar la memoria y hacerle saber al editor que el complemento de importación ya no está disponible.
fr: Quand ce plugin est activé, il va créer une nouvelle instance du plugin d'importation (que nous allons bientôt faire) et l'ajouter à l'éditeur en utilisant la méthode :ref:`add_import_plugin() <class_EditorPlugin_method_add_import_plugin>`. Nous stockons une référence à cette méthode dans un membre de classe ``import_plugin`` pour pouvoir y faire référence plus tard lors de sa suppression. La méthode :ref:`remove_import_plugin() <class_EditorPlugin_method_remove_import_plugin>` est appelée quand le plugin est désactivé pour nettoyer la mémoire et laisser l'éditeur savoir que le plugin d'importation n'est plus disponible.
ja: このプラグインがアクティブになると、インポートプラグインの新しいインスタンス(間もなく作成します)が作成され、\ :ref:`add_import_plugin() <class_EditorPlugin_method_add_import_plugin_plugin>` メソッドを使用してエディタに追加されます。クラスメンバー ``import_plugin`` に参照を保存し、後で削除するときに参照できるようにします。\ :ref:`remove_import_plugin() <class_EditorPlugin_method_remove_import_plugin>` メソッドは、メモリをクリーンアップするためにプラグインが非アクティブ化されたときに呼び出され、インポートプラグインが利用できなくなったことをエディタに知らせます。
zh_cn: 当这个插件被激活时, 它将创建一个新的导入插件实例(我们很快就会制作), 并使用 :ref:`add_import_plugin() <class_EditorPlugin_method_add_import_plugin>` 方法将其加入编辑器. 我们在类成员 ``import_plugin'`` 中存储它的引用, 这样我们就可以在以后删除它时引用它. :ref:`remove_import_plugin() <class_EditorPlugin_method_remove_import_plugin>` 方法在插件停用时被调用, 以清理内存并让编辑器知道导入插件不再可用.

source: Note that the import plugin is a reference type, so it doesn't need to be explicitly released from memory with the ``free()`` function. It will be released automatically by the engine when it goes out of scope.
de: Beachten Sie, dass das Import-Plugin ein Referenztyp ist, so dass es nicht explizit mit der Funktion ``free()`` aus dem Speicher freigegeben werden muss. Es wird automatisch von der Engine freigegeben, wenn es den Gültigkeitsbereich verlässt.
es: Tenga en cuenta que el complemento de importación es un tipo de referencia, por lo que no es necesario liberarlo explícitamente de la memoria con la función ``free ()``. Será liberado automáticamente por el motor cuando salga del alcance.
fr: Notez que le plugin d'importation est de type référence, il n'as donc pas besoin d’être explicitement libéré de la mémoire en utilisant la fonction ``free()``. Il sera libéré automatiquement par le moteur.
ja: インポートプラグインは参照型なので、 ``free()`` 関数を使用してメモリから明示的に解放する必要はありません。スコープ外になると、エンジンによって自動的に解放されます。
zh_cn: 注意, 导入插件是一个引用类型, 所以它不需要明确地用 ``free()`` 函数从内存中释放. 当它超出范围时, 将被引擎自动释放.

source: The EditorImportPlugin class
de: Die EditorImportPlugin-Klasse
es: La clase EditorImportPlugin
fr: La classe EditorImportPlugin
ja: エディタインポートプラグイン クラス
zh_cn: EditorImportPlugin 类

source: The main character of the show is the :ref:`EditorImportPlugin class <class_EditorImportPlugin>`. It is responsible for implementing the methods that are called by Godot when it needs to know how to deal with files.
de: Die Hauptfigur der Show ist die :ref:`EditorImportPlugin-Klasse <class_EditorImportPlugin>`. Sie ist für die Implementierung der Methoden verantwortlich, die von Godot aufgerufen werden, wenn sie wissen muss, wie sie mit Dateien umgehen soll.
es: El personaje principal del programa es: ref: `EditorImportPlugin class <class_EditorImportPlugin>`. Es responsable de implementar los métodos que llama Godot cuando necesita saber cómo manejar archivos.
fr: Le personnage principal de ce spectacle est la classe :ref:`EditorImportPlugin class <class_EditorImportPlugin>`. Elle est responsable de l'implémentation des méthodes qui sont appelée par Godot quand il a besoin de savoir comment gérer des fichiers.
ja: ショーの主役は :ref:`EditorImportPluginクラス <class_EditorImportPlugin>` です。ファイルの処理方法を知る必要がある場合にGodotによって呼び出されるメソッドの実装を担当します。
zh_cn: 这个展示的主角是 :ref:`EditorImportPlugin 类 <class_EditorImportPlugin>`. 它负责实现Godot需要知道如何处理文件时调用的方法.

source: Let's begin to code our plugin, one method at time:
de: Beginnen wir mit der Programmierung unseres Plugins, eine Methode nach der anderen:
es: Comencemos a codificar nuestro complemento, un método a la vez:
fr: Commençons a coder notre plugin, une méthode a la fois :
ja: プラグインのコーディングを始めましょう:
zh_cn: 让我们开始编写我们的插件, 一个方法:

source: The first method is the :ref:`get_importer_name()<class_EditorImportPlugin_method_get_importer_name>`. This is a unique name for your plugin that is used by Godot to know which import was used in a certain file. When the files needs to be reimported, the editor will know which plugin to call.
de: Die erste Methode ist die :ref:`get_importer_name()<class_EditorImportPlugin_method_get_importer_name>`. Dies ist ein eindeutiger Name für Ihr Plugin, der von Godot verwendet wird, um zu wissen, welcher Import in einer bestimmten Datei verwendet wurde. Wenn die Dateien erneut importiert werden müssen, weiß der Editor, welches Plugin er aufrufen muss.

source: The :ref:`get_visible_name()<class_EditorImportPlugin_method_get_visible_name>` method is responsible for returning the name of the type it imports and it will be shown to the user in the Import dock.
de: Die Methode :ref:`get_visible_name()<class_EditorImportPlugin_method_get_visible_name>` ist für die Rückgabe des Namens des importierten Typs verantwortlich und wird dem Benutzer im Import-Panel angezeigt.

source: You should choose this name as a continuation to "Import as", e.g. *"Import as Silly Material"*. You can name it whatever you want but we recommend a descriptive name for your plugin.
de: Sie sollten diesen Namen als Fortsetzung von "Importieren als" wählen, z. B. *"Importieren als Silly Material "*. Sie können es benennen, wie Sie wollen, aber wir empfehlen einen beschreibenden Namen für Ihr Plugin.
es: Debe elegir este nombre como continuación de "Importar como", p. Ej. * "Importar como material" *. Puede nombrarlo como desee, pero le recomendamos un nombre descriptivo para su complemento.
fr: Vous devez choisir ce nom comme suite à "Import as", par exemple *"Import as Silly Material "*. Vous pouvez lui donner le nom que vous voulez, mais nous vous recommandons d'utiliser un nom descriptif pour votre plugin.
ja: この名前は、「名前を付けてインポート」の続きとして選択する必要があります。 例えば、 \ *「愚かな素材としてインポート」*\ 。 好きな名前を付けることができますが、プラグインにはわかりやすい名前を付けることをお勧めします。
zh_cn: 你选择的名字应该可以接到“导入为”后面，例如\ *“导入为 Silly Material”*\ 。你可以随心所欲地命名，但我们建议为你的插件起一个描述性的名字。

source: Godot's import system detects file types by their extension. In the :ref:`get_recognized_extensions()<class_EditorImportPlugin_method_get_recognized_extensions>` method you return an array of strings to represent each extension that this plugin can understand. If an extension is recognized by more than one plugin, the user can select which one to use when importing the files.
de: Das Importsystem von Godot erkennt Dateitypen anhand ihrer Erweiterung. In der Methode :ref:`get_recognized_extensions()<class_EditorImportPlugin_method_get_recognized_extensions>` geben Sie ein Array von Strings zurück, die jede Erweiterung darstellen, die dieses Plugin verstehen kann. Wenn eine Erweiterung von mehr als einem Plugin erkannt wird, kann der Benutzer auswählen, welches beim Importieren der Dateien verwendet werden soll.

source: Common extensions like ``.json`` and ``.txt`` might be used by many plugins. Also, there could be files in the project that are just data for the game and should not be imported. You have to be careful when importing to validate the data. Never expect the file to be well-formed.
de: Gängige Erweiterungen wie ``.json`` und ``.txt`` werden möglicherweise von vielen Plugins verwendet. Außerdem könnte es Dateien im Projekt geben, die nur Daten für das Spiel sind und nicht importiert werden sollten. Sie müssen beim Importieren vorsichtig sein, um die Daten zu validieren. Erwarten Sie niemals, dass die Datei wohlgeformt ist.
es: Muchos complementos pueden usar extensiones comunes como ``.json`` y ``.txt``. Además, podría haber archivos en el proyecto que sean solo datos del juego y no se deben importar. Debe tener cuidado al importar para validar los datos. Nunca espere que el archivo esté bien formado.
fr: Des extensions fréquentes comme ``.json`` et ``.txt`` peuvent être utilisées par plusieurs plugins. Il peut aussi y avoir des fichiers dans le projet qui ne contiennent que des données pour le jeu et ne doivent pas être importés. Il faut faire attention au moment de l’importation de valider les données, et ne jamais compter sur le fait que le fichier soit bien formaté.
ja: ``.json`` や ``.txt`` などの一般的な拡張機能は、多くのプラグインで使用される場合があります。また、プロジェクト内には、ゲームのデータにすぎず、インポートしてはならないファイルが存在する可能性もあります。データを検証するには、インポート時に注意が必要です。ファイルが整形式であることを期待しないでください。
zh_cn: 许多插件可能会使用像 ``.json`` 和 ``.txt`` 这样的常见扩展. 此外, 项目中可能存在仅作为游戏数据的文件, 不应导入. 导入时必须小心以验证数据. 永远不要指望文件格式正确.

source: The imported files are saved in the ``.import`` folder at the project's root. Their extension should match the type of resource you are importing, but since Godot can't tell what you'll use (because there might be multiple valid extensions for the same resource), you need to declare what will be used in the import.
de: Die importierten Dateien werden im Ordner ``.import`` im Stammverzeichnis des Projekts gespeichert. Ihre Erweiterung sollte mit dem Typ der Ressource übereinstimmen, die Sie importieren, aber da Godot nicht sagen kann, was Sie verwenden werden (weil es mehrere gültige Erweiterungen für dieselbe Ressource geben könnte), müssen Sie angeben, was beim Import verwendet wird.
es: Los archivos importados se guardan en la carpeta ``.import`` en la raíz del proyecto. Su extensión debe coincidir con el tipo de recurso que está importando, pero dado que Godot no puede decir qué usará (porque puede haber varias extensiones válidas para el mismo recurso), debe declarar qué se usará en la importación.
fr: Les fichiers importés sont enregistrés dans le dossier ``.import`` à la racine du projet. Leur extension doit correspondre au type de ressource que vous importez, mais comme Godot ne peut pas savoir ce que vous utiliserez (car il peut y avoir plusieurs extensions valides pour la même ressource), il faut déclarer ce qui sera utilisé pour l’importation.
ja: インポートされたファイルは、プロジェクトのルートにある ``.import`` フォルダに保存されます。それらの拡張子は、インポートするリソースの種類と一致する必要がありますが、Godotは何を使用するのかを知ることができないため(同じリソースに対して複数の有効な拡張機能が存在する可能性があるため)、インポートで使用される内容を宣言する必要があります。
zh_cn: 导入的文件被保存在项目根部的 ``.import`` 文件夹中. 它们的扩展名应与你要导入的资源类型相匹配, 但由于Godot不能告诉你将使用什么(因为同一资源可能有多个有效的扩展名), 你需要声明将在导入时使用的内容.

source: Since we're importing a Material, we'll use the special extension for such resource types. If you are importing a scene, you can use ``scn``. Generic resources can use the ``res`` extension. However, this is not enforced in any way by the engine.
de: Da wir ein Material importieren, werden wir die spezielle Erweiterung für solche Ressourcentypen verwenden. Wenn Sie eine Szene importieren, können Sie ``scn`` verwenden. Generische Ressourcen können die Erweiterung ``res`` verwenden. Dies wird jedoch von der Engine in keiner Weise erzwungen.
es: Dado que estamos importando un Material, usaremos la extensión especial para tales tipos de recursos. Si está importando una escena, puede usar ``scn``. Los recursos genéricos pueden usar la extensión ``res``. Sin embargo, esto no se aplica de ninguna manera por el motor.
fr: Puisqu’on importe un Material, nous allons utiliser une extension spéciale pour ce type de ressource. Si vous importez une scène, vous pouvez utiliser ``scn``. Les ressources génériques peuvent utiliser l’extension ``res``. Cependant, le moteur n’impose rien.
ja: マテリアルを読み込むので、このようなリソースタイプには特別な拡張子を使用します。シーンをインポートする場合は、``scn`` を使うことができます。汎用リソースは ``res`` 拡張子を使用できます。ただし、これはエンジンによって強制されません。
zh_cn: 由于我们正在导入材质, 因此我们将对此类资源类型使用特殊扩展. 如果要导入场景, 可以使用 ``scn`` . 通用资源可以使用 ``res`` 扩展名. 但是, 引擎不会以任何方式强制执行此操作.

source: The imported resource has a specific type, so the editor can know which property slot it belongs to. This allows drag and drop from the FileSystem dock to a property in the Inspector.
de: Die importierte Ressource hat einen bestimmten Typ, damit der Editor weiß, zu welchem Eigenschafts-Slot sie gehört. Dies ermöglicht das Ziehen und Ablegen aus dem FileSystem-Panel auf eine Eigenschaft im Inspector.
es: El recurso importado tiene un tipo específico, por lo que el editor puede saber a qué ranura de propiedades pertenece. Esto permite arrastrar y soltar desde el panel de Sistema de Archivos a una propiedad en el Inspector.
fr: La ressource importée a un type spécifique, pour que l’éditeur puisse savoir à quel emplacement de propriété elle appartient. Cela permet de faire un glisser-déposer depuis le dock Système de fichiers vers une propriété dans l’Inspecteur.
ja: インポートされたリソースには特定のタイプがあるため、エディタはリソースがどのプロパティスロットに属しているかを知ることができます。これにより、 「ファイルシステム」 ドックから 「インスペクタ」 のプロパティーにドラッグ&ドロップできます。
zh_cn: 导入的资源具有特定类型，编辑器可以据此知道它属于哪个属性槽。这样就能够将其从文件系统面板拖放到检查器的属性之中。

source: In our case it's a :ref:`class_SpatialMaterial`, which can be applied to 3D objects.
de: In unserem Fall handelt es sich um ein :ref:``class_SpatialMaterial`, das auf 3D-Objekte angewendet werden kann.

source: If you need to import different types from the same extension, you have to create multiple import plugins. You can abstract the import code on another file to avoid duplication in this regard.
de: Wenn Sie verschiedene Typen aus derselben Erweiterung importieren, müssen Sie mehrere Import-Plugins erstellen. Sie können den Importcode auf eine andere Datei abstrahieren, um diesbezüglich Doppelarbeit zu vermeiden.
es: Si necesita importar diferentes tipos de la misma extensión, debe crear varios complementos de importación. Puede abstraer el código de importación en otro archivo para evitar la duplicación en este sentido.
fr: Si vous avez besoin d’importer différents types depuis la même extension, il faudra créer plusieurs plugins d’importation. Vous pouvez abstraire le code d’importation dans un autre fichier pour éviter la duplication.
ja: 同じ拡張子から異なるタイプをインポートする必要がある場合は、複数のインポートプラグインを作成する必要があります。インポートコードを別のファイルに抽象化して、重複を避けることができます。
zh_cn: 如果需要从同一扩展中导入不同类型, 则必须创建多个导入插件. 你可以在另一个文件上抽象导入代码, 以避免在这方面出现重复.

source: Options and presets
de: Optionen und Voreinstellungen
es: Opciones y presets
fr: Options et préréglages
ja: オプションとプリセット
zh_cn: 选项和预设

source: Your plugin can provide different options to allow the user to control how the resource will be imported. If a set of selected options is common, you can also create different presets to make it easier for the user. The following image shows how the options will appear in the editor:
de: Ihr Plugin kann verschiedene Optionen bereitstellen, mit denen der Benutzer steuern kann, wie die Ressource importiert werden soll. Wenn eine Menge ausgewählter Optionen üblich ist, können Sie auch verschiedene Presets erstellen, um es dem Benutzer zu erleichtern. Das folgende Bild zeigt, wie die Optionen im Editor angezeigt werden:
es: Su complemento puede proporcionar diferentes opciones para permitir al usuario controlar cómo se importará el recurso. Si un conjunto de opciones seleccionadas es común, también puede crear diferentes ajustes preestablecidos para que sea más fácil para el usuario. La siguiente imagen muestra cómo aparecerán las opciones en el editor:
fr: Votre plugin peut offrir différentes options pour permettre à l’utilisateur de contrôler la manière dont la ressource sera importée. Si un ensemble d’options est courant, vous pouvez aussi créer des préréglages pour simplifier la vie à l’utilisateur. L’image suivante montre comment les options apparaîtront dans l’éditeur :
ja: プラグインは、ユーザーがリソースのインポート方法を制御できるように、さまざまなオプションを提供できます。選択したオプションのセットが一般的な場合は、異なるプリセットを作成して、ユーザーが簡単に使用できるようにすることもできます。次の図は、エディタでオプションがどのように表示されるかを示しています:
zh_cn: 你的插件可以提供不同的选项, 以允许用户控制资源的导入方式. 如果一组选定的选项很常见, 你还可以创建不同的预设以使用户更容易. 下图显示了选项在编辑器中的显示方式:

source: Since there might be many presets and they are identified with a number, it's a good practice to use an enum so you can refer to them using names.
de: Da es viele Presets geben kann und diese mit einer Nummer identifiziert werden, ist es eine gute Praxis, ein Enum zu verwenden, damit Sie über Namen auf sie verweisen können.
es: Dado que puede haber muchos ajustes preestablecidos y se identifican con un número, es una buena práctica usar una enumeración para poder referirse a ellos usando nombres.
fr: Puisqu’il peut y avoir de nombreux préréglages et qu’ils sont identifiés par un nombre, il est de bonne pratique d’utiliser une énumération pour pouvoir s’y référer en utilisant des noms.
ja: プリセットが多く、数値で識別される可能性があるため、名前を使用して参照できるように列挙型を使用することをお知めします。
zh_cn: 由于可能有许多预设并且它们用数字标识, 因此使用枚举是一个很好的做法, 因此你可以使用名称来引用它们.
