Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/installing_plugins.po
Languages: de, es, fr, ja, zh_cn

source: Installing plugins
de: Plugins installieren
es: Instalando plugins
fr: Installation de plugins
ja: プラグインのインストール
zh_cn: 安装插件

source: Godot features an editor plugin system with numerous plugins developed by the community. Plugins can extend the editor's functionality with new nodes, additional docks, convenience features, and more.
de: Godot verfügt über ein Editor-Plugin-System mit zahlreichen Plugins, die von der Community entwickelt wurden. Plugins können die Funktionalität des Editors um neue Nodes, zusätzliche Docks, Komfortfunktionen und mehr erweitern.
es: Godot tiene un sistema de plugins de edición con numerosos plugins desarrollados por la comunidad. Los plugins pueden extender la funcionalidad del editor con nuevos nodos, docks adicionales, características convenientes y más.
fr: Godot dispose d'un système d'édition de plugins avec de nombreux plugins développés par la communauté. Les plugins peuvent étendre les fonctionnalités de l'éditeur avec de nouveaux nœuds, des docks supplémentaires, des fonctions de commodité, et plus encore.
ja: Godotは、コミュニティが開発した多数のプラグインを備えたエディタプラグインシステムを備えています。プラグインは、新しいノード、追加のドック、便利な機能などでエディタの機能を拡張できます。
zh_cn: Godot提供了一个编辑器插件系统, 其中包含了社区开发的众多插件. 插件可以插件可以通过新的节点, 额外附加脚本, 更多便捷的特性等来扩展编辑器的功能.

source: Finding plugins
de: Plugins finden
es: Encontrando plugins
fr: Trouver des plugins
ja: プラグインの検索
zh_cn: 查找插件

source: The preferred way to find Godot plugins is to use the `Asset Library <https://godotengine.org/asset-library/>`_. While it can be browsed online, it's more convenient to use it directly from the editor. To do so, click the **AssetLib** tab at the top of the editor:
de: Der bevorzugte Weg, um Godot-Plugins zu finden, ist die Verwendung der `Bestandsbibliothek <https://godotengine.org/asset-library/>` _. Es kann zwar online durchsucht werden, es ist jedoch bequemer, es direkt im Editor zu verwenden. Klicken Sie dazu oben im Editor auf die Registerkarte **AssetLib**:
es: La forma preferida de encontrar los plugins de Godot es usar la `Biblioteca de Activos <https://godotengine.org/asset-library/>`__. Aunque se puede navegar en línea, es más conveniente utilizarlo directamente desde el editor. Para ello, haga clic en la pestaña **AssetLib** en la parte superior del editor:
fr: Le moyen préféré pour trouver les plugins Godot est d'utiliser la `Bibliothèque d'Assets <https://godotengine.org/asset-library/>`_. Bien qu'il soit possible de la parcourir en ligne, il est plus pratique de l'utiliser directement depuis l'éditeur. Pour ce faire, cliquez sur l'onglet **AssetLib** en haut de l'éditeur :
ja: Godotプラグインを見つける好ましい方法は、\ `Asset Library <https://godotengine.org/asset-library/>`_ を使用することです。オンラインで閲覧できますが、エディタから直接使用する方が便利です。これを行うには、エディタの上部にある **AssetLib** タブをクリックします:
zh_cn: 寻找 Godot 插件的首选方法是使用 `Asset Library 资产库 <https://godotengine.org/asset-library/>`_\ 。虽然它可以在线浏览，但直接在编辑器中使用更方便，点击编辑器顶部的 **AssetLib** 选项卡：

source: You can also find assets on code hosting websites such as GitHub.
de: Sie finden Assets auch auf Webseiten die Programmcodes bereitstellen wie GitHub.
es: También puedes encontrar activos en sitios web de alojamiento de código como GitHub.
fr: Vous pouvez également trouver des ressources sur des sites d'hébergement de codes tels que GitHub.
ja: GitHubなどのコードホスティングWebサイトでもアセットを見つけることができます。
zh_cn: 您还可以在 GitHub 等代码托管网站上找到资产。

source: Some repositories describe themselves as "plugins" but may not actually be *editor* plugins. This is especially the case for scripts that are intended to be used in a running project. You don't need to enable such plugins to use them. Download them and extract the files in your project folder.
es: Algunos repositorios se describen a sí mismos como "plugins", pero en realidad pueden no ser plugins *editores*. Este es el caso especialmente de los scripts que están destinados a ser utilizados en un proyecto en curso. No es necesario habilitar tales plugins para usarlos. Descárgalos y extrae los archivos de tu carpeta de proyecto.
fr: Certains dépôts se décrivent comme des "plugins" mais ne sont pas forcément des plugins *éditeurs*. C'est notamment le cas des scripts qui sont destinés à être utilisés dans un projet en cours. Vous n'avez pas besoin d'activer ces plugins pour les utiliser. Téléchargez-les et extrayez les fichiers dans votre dossier de projet.
ja: 一部のリポジトリは、自身を「プラグイン」と記述していますが、実際には *エディタ* プラグインではない場合があります。これは特に、実行中のプロジェクトで使用することを目的としたスクリプトの場合です。これらのプラグインを有効にする必要はありません。それらをダウンロードして、プロジェクトフォルダ内のファイルを抽出します。
zh_cn: 有些仓库将自己描述为“插件”，但实际上可能不是\ *编辑器*\ 插件。对于那些打算在运行中的项目中使用的脚本来说尤其如此。你不需要启用这些插件来使用它们。下载它们并将文件解压到你的项目文件夹中。

source: One way to distinguish editor plugins from non-editor plugins is to look for a ``plugin.cfg`` file in the repository that hosts the plugin. If the repository contains a ``plugin.cfg`` file in a folder placed in the ``addons/`` folder, then it is an editor plugin.
es: Una forma de distinguir los plugins de edición de los que no lo son es buscar un archivo ``plugin.cfg`` en el repositorio que alberga el plugin. Si el repositorio contiene un archivo ``plugin.cfg`` en una carpeta colocada en la carpeta ``addons/``, entonces es un plugin editor.
fr: Une façon de distinguer les plugins éditeurs des plugins non-éditeurs est de chercher un fichier ``plugin.cfg`` dans le dépôt qui héberge le plugin. Si le dépôt contient un fichier ``plugin.cfg`` dans un dossier placé dans le dossier ``adddons/``, alors il s'agit d'un plugin d'éditeur.
ja: エディタプラグインと非エディタプラグインを区別する1つの方法は、プラグインをホストするリポジトリで ``plugin.cfg`` ファイルを探すことです。リポジトリの ``addons/ `` フォルダにあるフォルダに ``plugin.cfg`` ファイルが含まれている場合、それはエディタプラグインです。
zh_cn: 一种区分编辑器插件和非编辑器插件的方法是在存放插件的仓库中查找 ``plugin.cfg`` 文件。如果仓库的 ``addons/`` 中包含 ``plugin.cfg`` 文件，那么它就是编辑器插件。

source: Installing a plugin
de: Ein Plugin installieren
es: Instalando un plugin
fr: Installation d'un plugin
ja: プラグインのインストール
zh_cn: 安装插件

source: To install a plugin, download it as a ZIP archive. On the Asset Library, this can be done using the **Download** button, either from the editor or using the Web interface.
de: Um ein Plugin zu installieren, laden Sie es als ZIP-Archiv herunter. In der Bestandsbibliothek kann dies über die Schaltfläche **Herunterladen** entweder im Editor oder über die Web-Oberfläche erfolgen.
es: Para instalar un plugin, descárguelo como un archivo ZIP. En la Biblioteca de Activos, esto se puede hacer usando el botón **Descargar**, ya sea desde el editor o usando la interfaz web.
fr: Pour installer un plugin, téléchargez-le sous forme d'archive ZIP. Dans la bibliothèque d'Asset, cela peut se faire en utilisant le bouton **Télécharger**, soit à partir de l'éditeur, soit en utilisant l'interface Web.
ja: プラグインをインストールするには、ZIPアーカイブとしてダウンロードします。アセットライブラリでは、エディタから、またはWebインターフェイスを使用して、\ **ダウンロード** ボタンを使用してこれを実行できます。
zh_cn: 要安装插件，请将其下载为 ZIP 存档。在资产资源库中，可以使用\ **下载**\ 按钮（通过编辑器或使用 Web 界面）来完成此操作。

source: On GitHub, if a plugin has *tags* (versions) declared, go to the **Releases** tab to download a stable release. This ensures you download a version that was declared to be stable by its author.
es: En GitHub, si un plugin tiene *tags* (versiones) declaradas, ve a la pestaña **Releases** para descargar una versión estable. Esto te asegura que descargas una versión que fue declarada estable por su autor.
fr: Sur GitHub, si un plugin a un *tags* (versions) déclarés, allez dans l'onglet **Releases** pour télécharger une version stable. Cela vous permet de télécharger une version qui a été déclarée stable par son auteur.
ja: GitHubで、プラグインに *tags* (バージョン) が宣言されている場合は、**Releases** タブに移動して安定版リリースをダウンロードします。これにより、作成者によって安定していると宣言されたバージョンを確実にダウンロードできます。
zh_cn: 在 GitHub 上，如果插件已打 *Tag*\ （标签、版本），请转到 **Releases** 选项卡下载稳定的版本。这样就能确保你下载到的是作者发布的稳定版本。

source: On GitHub, if the plugin doesn't have any *tags* declared, use the **Download ZIP** button to download a ZIP of the latest revision:
de: Wenn auf Github beim Plugin keine * Tags * deklariert sind, verwenden Sie die Schaltfläche **ZIP herunterladen**, um die neuste Version per ZIP herunterzuladen:
es: En GitHub, si el plugin no tiene ninguna *tags* declarada, usa el botón **Download ZIP** para descargar un ZIP de la última revisión:
fr: Sur GitHub, si le plugin n'a pas de *tags* déclarés, utilisez le bouton **Télécharger ZIP** pour télécharger un ZIP de la dernière révision :
ja: GitHubでは、プラグインに *tags* が宣言されていない場合、\ **Download ZIP** ボタンを使用して最新リビジョンのZIPをダウンロードします。
zh_cn: 在 GitHub 上，如果插件没有声明任何 *Tag*\ ，请使用 **Download ZIP** 按钮下载最新版本的 ZIP：

source: Extract the ZIP archive and move the ``addons/`` folder it contains into your project folder. If your project already contains an ``addons/`` folder, move the plugin's ``addons/`` folder into your project folder to merge the new folder contents with the existing one. Your file manager may ask you whether to write into the folder; answer **Yes**. No files will be overwritten in the process.
es: Extraiga el archivo ZIP y mueva la carpeta ``addons/`` que contiene a su carpeta de proyectos. Si tu proyecto ya contiene una carpeta ``addons/``, mueve la carpeta ``addons/`` del plugin a tu carpeta de proyectos para fusionar el contenido de la nueva carpeta con la existente. Su administrador de archivos puede preguntarle si debe escribir en la carpeta; responda **Sí**. Ningún archivo será sobrescrito en el proceso.
fr: Extrayez l'archive ZIP et déplacez le dossier ``addons/`` qu'elle contient dans votre dossier de projet. Si votre projet contient déjà un dossier ``addons/``, déplacez le dossier ``addons/`` du plugin dans votre dossier de projet pour fusionner le contenu du nouveau dossier avec celui de l'ancien. Votre gestionnaire de fichiers peut vous demander si vous voulez écrire dans le dossier ; répondez **Oui**. Aucun fichier ne sera écrasé au cours du processus.
ja: ZIPアーカイブを解凍し、そこに含まれる ``addons/`` フォルダをプロジェクトフォルダに移動します。プロジェクトに既に ``addons/`` フォルダが含まれている場合、プラグインの ``addons/`` フォルダをプロジェクトフォルダに移動して、新しいフォルダの内容を既存のフォルダとマージします。ファイルマネージャーは、フォルダに書き込むかどうかを尋ねる場合があります。\ **はい** と答えてください。このプロセスで上書きされるファイルはありません。
zh_cn: 解压 ZIP 压缩包，并将其包含的 ``addons/`` 文件夹移动到你的项目文件夹中。如果您的项目已经包含了一个 ``addons/`` 文件夹，请将插件的 ``addons/`` 文件夹移到您的项目文件夹中，将新的文件夹内容与现有的文件夹合并。你的文件管理器可能会问你是否要写入该文件夹，回答\ **是**\ 。在这个过程中，不会有任何文件被覆盖。

source: Enabling a plugin
de: Ein Plugin aktivieren
es: Habilitando un plugin
fr: Activation d'un plugin
ja: プラグインの有効化
zh_cn: 启用插件

source: To enable the freshly installed plugin, open **Project > Project Settings** at the top of the editor then go the **Plugins** tab. If the plugin was packaged correctly, you should see it in the list of plugins. Click on the gray **Inactive** text and choose **Active** to enable the plugin. The word **Active** will display in green to confirm the plugin was enabled.
es: Para activar el plugin recién instalado, abre **Proyecto > Configuración del proyecto** en la parte superior del editor y luego ve a la pestaña **Plugins**. Si el plugin fue empaquetado correctamente, deberías verlo en la lista de plugins. Haz clic en el texto gris **Inactivo** y elige **Activo** para activar el plugin. La palabra **Activo** se mostrará en verde para confirmar que el plugin fue habilitado.
fr: Pour activer le plugin fraîchement installé, ouvrez **Projet > Paramètres du projet** en haut de l'éditeur puis allez dans l'onglet **Plugins**. Si le plugin a été correctement empaqueté, vous devriez le voir dans la liste des plugins. Cliquez sur le texte gris **Inactif** et choisissez **Actif** pour activer le plugin. Le mot **Actif** s'affichera en vert pour confirmer que le plugin a été activé.
ja: 新しくインストールされたプラグインを有効にするには、エディタの上部にある **プロジェクト → プロジェクト設定** を開き、\ **プラグイン** タブに移動します。プラグインが正しくパッケージ化されていれば、プラグインのリストに表示されるはずです。灰色の **Inactive** テキストをクリックし、\ **Active** を選択してプラグインを有効にします。プラグインが有効になったことを確認するために、\ **Active** という単語が緑色で表示されます。
zh_cn: 要启用新安装的插件，请打开编辑器顶部的\ **项目 > 项目设置**\ ，然后进入\ **插件**\ 标签。如果插件被正确安装，你应该在插件列表中看到它。点击灰色的\ **未启用**\ 文字，选择\ **启用**\ 来启用该插件。\ **启用**\ 字样将显示为绿色，以确认该插件已启用。

source: You can use the plugin immediately after enabling it; there's no need to restart the editor. Likewise, disabling a plugin can be done without having to restart the editor.
es: Puedes usar el plugin inmediatamente después de activarlo; no hay necesidad de reiniciar el editor. Del mismo modo, la desactivación de un plugin se puede hacer sin tener que reiniciar el editor.
fr: Vous pouvez utiliser le plugin immédiatement après l'avoir activé ; il n'est pas nécessaire de redémarrer l'éditeur. De même, la désactivation d'un plugin peut être effectuée sans avoir à redémarrer l'éditeur.
ja: プラグインを有効にした直後に使用できます。エディタを再起動する必要はありません。同様に、エディタを再起動することなく、プラグインを無効にすることができます。
zh_cn: 启用插件后，你可以立即使用它，不需要重新启动编辑器。同样，禁用一个插件也可以不用重新启动编辑器。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
zh_cn: 翻译状态
