Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/plugins/editor/spatial_gizmos.po
Languages: es, fr, zh_cn

source: Spatial gizmo plugins
es: Plugins de gizmos Spatial
fr: Gadget spatial plugins
zh_cn: Spatial 小工具插件

source: Introduction
es: Introducción
zh_cn: 前言

source: Spatial gizmo plugins are used by the editor and custom plugins to define the gizmos attached to any kind of Spatial node.
es: Los complementos de gizmos espaciales son utilizados por el editor y los complementos personalizados para definir los gizmos adjuntos a cualquier tipo de nodo espacial.
fr: Les plugins de gizmo spatial sont utilisés par l'éditeur et les plugins personnalisés pour définir les gizmos attachés à tout type de nœud spatial.
zh_cn: Spatial 小工具插件是由编辑器和自定义插件来定义附加到任何类型的 Spatial 节点的小工具。

source: This tutorial will show you the two main approaches to defining your own custom gizmos. The first option works well for simple gizmos and creates less clutter in your plugin structure, while the second one will let you store some per-gizmo data.
es: Este tutorial le mostrará los dos enfoques principales para definir sus propios gizmos personalizados. La primera opción funciona bien para gizmos simples y crea menos desorden en la estructura de su complemento, mientras que la segunda le permitirá almacenar algunos datos por gizmo.
fr: Ce tutoriel vous montrera les deux principales approches pour définir vos propres gizmos personnalisés. La première option fonctionne bien pour les gizmos simples et crée moins d'encombrement dans la structure de votre plugin, tandis que la seconde vous permettra de stocker des données par gizmo.
zh_cn: 本教程将向您展示定义您自己的自定义小工具的两种主要方法。第一种方法对于简单的小工具来说效果很好，并且在你的插件结构中较少的混乱，而第二种方法将让你存储每个小工具的一些数据。

source: This tutorial assumes you already know how to make generic plugins. If in doubt, refer to the :ref:`doc_making_plugins` page.
es: Este tutorial asume que ya sabe cómo crear complementos genéricos. En caso de duda, consulte la página: ref: `doc_making_plugins`.
fr: Ce tutoriel suppose que vous savez déjà comment créer des plugins génériques. En cas de doute, reportez-vous à la page :ref:`doc_making_plugins`.
zh_cn: 本教程假设您已经知道如何制作通用插件。如有疑问，请参阅 :ref:`doc_making_plugins` 页面。

source: The EditorSpatialGizmoPlugin
es: El EditorSpatialGizmoPlugin
fr: L'EditorSpatialGizmoPlugin
zh_cn: EditorSpatialGizmoPlugin

source: Regardless of the approach we choose, we will need to create a new :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>`. This will allow us to set a name for the new gizmo type and define other behaviors such as whether the gizmo can be hidden or not.
es: Independientemente del enfoque que elijamos, necesitaremos crear un nuevo: ref: `EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>`. Esto nos permitirá establecer un nombre para el nuevo tipo de gizmo y definir otros comportamientos, como si el gizmo se puede ocultar o no.
fr: Quelle que soit l'approche que nous choisissons, nous devrons créer un nouveau :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>`. Cela nous permettra de définir un nom pour le nouveau type de gizmo et de définir d'autres comportements, par exemple si le gizmo peut être masqué ou non.
zh_cn: 不管我们选择什么方式，都需要创建一个新的 :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>`\ 。我们可以为新建的小工具类型设置名称并定义其他行为，比如是否可以隐藏。

source: This would be a basic setup:
es: Esta sería una configuración básica:
fr: Ce sera une configuration de base :
zh_cn: 这是一个基本设置:

source: For simple gizmos, just inheriting :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` is enough. If you want to store some per-gizmo data or you are porting a Godot 3.0 gizmo to 3.1+, you should go with the second approach.
es: Para gizmos simples, simplemente heredar: ref: `EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` es suficiente. Si desea almacenar algunos datos por gizmo o está transfiriendo un gizmo Godot 3.0 a 3.1+, debe optar por el segundo enfoque.
fr: Pour les gizmos simples, hériter simplement de :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` suffit. Si vous souhaitez stocker des données par gizmo ou si vous portez un gizmo Godot 3.0 vers 3.1+, vous devriez opter pour la deuxième approche.
zh_cn: 简单的小工具只要继承 :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` 就足够了。如果你想存储每个小工具的一些数据，或者你要把 Godot 3.0 的小工具移植到 3.1+，你应该选择第二种方法。

source: Simple approach
es: Enfoque simple
fr: Approche simple
zh_cn: 简单方法

source: The first step is to, in our custom gizmo plugin, override the :ref:`has_gizmo()<class_EditorSpatialGizmoPlugin_method_has_gizmo>` method so that it returns ``true`` when the spatial parameter is of our target type.
es: El primer paso es, en nuestro complemento de gizmo personalizado, anular el método: ref: `has_gizmo () <class_EditorSpatialGizmoPlugin_method_has_gizmo>` para que devuelva ``verdadero`` cuando el parámetro espacial es de nuestro tipo de destino.
fr: La première étape consiste, dans notre plugin de gizmo personnalisé, à remplacer la méthode :ref:`has_gizmo()<class_EditorSpatialGizmoPlugin_method_has_gizmo>` afin qu'elle renvoie ``true`` lorsque le paramètre spatial est de notre type cible.
zh_cn: 第一步，在我们的自定义小工具插件中，重写 :ref:`has_gizmo()<class_EditorSpatialGizmoPlugin_method_has_gizmo>` 方法，当空间参数为目标类型时，它将返回 ``true``\ 。

source: Then we can override methods like :ref:`redraw()<class_EditorSpatialGizmoPlugin_method_redraw>` or all the handle related ones.
es: Entonces podemos anular métodos como: ref: `redraw () <class_EditorSpatialGizmoPlugin_method_redraw>` o todos los relacionados con el identificador.
fr: Ensuite, nous pouvons remplacer des méthodes comme :ref:`redraw()<class_EditorSpatialGizmoPlugin_method_redraw>` ou toutes les poignées associées.
zh_cn: 我们可以重写譬如 :ref:`redraw()<class_EditorSpatialGizmoPlugin_method_redraw>` 的方法，或所有与句柄相关的方法。

source: Note that we created a material in the `_init` method, and retrieved it in the `redraw` method using :ref:`get_material()<class_EditorSpatialGizmoPlugin_method_get_material>`. This method retrieves one of the material's variants depending on the state of the gizmo (selected and/or editable).
es: Note que creamos un material en el método `_init`, y lo recuperamos en el método` redraw` usando: ref: `get_material () <class_EditorSpatialGizmoPlugin_method_get_material>`. Este método recupera una de las variantes del material dependiendo del estado del gizmo (seleccionado y / o editable).
fr: Notez que nous avons créé un matériau dans la méthode `_init`, et l'avons récupéré dans la méthode `redraw` en utilisant :ref:`get_material()<class_EditorSpatialGizmoPlugin_method_get_material>`. Cette méthode récupère une des variantes du matériau en fonction de l'état du gizmo (sélectionné et/ou modifiable).
zh_cn: 请注意，我们在 `_init` 方法中创建了一个材质，并在 `redraw` 方法中使用 :ref:`get_material()<class_EditorSpatialGizmoPlugin_method_get_material>` 取得它。该方法根据小工具的状态（选择中和/或可编辑）来获取材质的变体。

source: So the final plugin would look somewhat like this:
es: La escena final del plugin debería verse similar a esta:
fr: Le plugin final ressemblerait donc un peu à ceci :
zh_cn: 您最后的场景应该是这样的:

source: Note that we just added some handles in the redraw method, but we still need to implement the rest of handle-related callbacks in :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` to get properly working handles.
es: Tenga en cuenta que acabamos de agregar algunos identificadores en el método de redibujo, pero aún necesitamos implementar el resto de devoluciones de llamada relacionadas con identificadores en: ref: `EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` para que los identificadores funcionen correctamente.
fr: Notez que nous venons d'ajouter quelques poignées dans la méthode de rafraîchissement, mais nous devons toujours implémenter le reste des rappels liés aux poignées dans :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` pour obtenir des poignées fonctionnant correctement.
zh_cn: 注意，我们只是在重绘方法中添加了一些句柄，但是我们仍然需要在 :ref:`EditorSpatialGizmoPlugin <class_EditorSpatialGizmoPlugin>` 中实现其他与句柄相关的回调，以获得正确的工作句柄。

source: Alternative approach
es: Enfoque alternativo
fr: Approche alternative
zh_cn: 替代方法

source: In some cases we want to provide our own implementation of :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>`, maybe because we want to have some state stored in each gizmo or because we are porting an old gizmo plugin and we don't want to go through the rewriting process.
es: En algunos casos, queremos proporcionar nuestra propia implementación de: ref: `EditorSpatialGizmo <class_EditorSpatialGizmo>`, tal vez porque queremos tener algún estado almacenado en cada gizmo o porque estamos portando un complemento de gizmo antiguo y no queremos ir a través del proceso de reescritura.
fr: Dans certains cas, nous voulons fournir notre propre implémentation de :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>`, peut-être parce que nous voulons avoir un état stocké dans chaque gizmo ou parce que nous portons un ancien plugin de gizmo et nous ne voulons le réécrire.
zh_cn: 在某些情况下，我们希望提供自己的 :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>` 实现，也许是因为我们想要在每个小工具中存储一些状态，或者正在移植一个旧的小工具插件，而不想经历重写过程。

source: In these cases all we need to do is, in our new gizmo plugin, override :ref:`create_gizmo()<class_EditorSpatialGizmoPlugin_method_create_gizmo>`, so it returns our custom gizmo implementation for the Spatial nodes we want to target.
es: En estos casos, todo lo que tenemos que hacer es, en nuestro nuevo complemento de gizmo, anular: ref: `create_gizmo () <class_EditorSpatialGizmoPlugin_method_create_gizmo>`, por lo que devuelve nuestra implementación de gizmo personalizada para los nodos espaciales que queremos apuntar.
fr: Dans ces cas, tout ce que nous devons faire est, dans notre nouveau plugin gizmo, remplacer :ref:`create_gizmo()<class_EditorSpatialGizmoPlugin_method_create_gizmo>`, afin qu'il renvoie notre implémentation de gizmo personnalisée pour les nœuds spatiaux que nous voulons cibler.
zh_cn: 在这些情况下，我们需要做的就是在我们的新小工具插件中覆盖 :ref:`create_gizmo()<class_EditorSpatialGizmoPlugin_method_create_gizmo>`，让它返回我们想要实现的目标 Spatial 节点的自定义小工具。

source: This way all the gizmo logic and drawing methods can be implemented in a new class extending :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>`, like so:
es: De esta manera, toda la lógica del gizmo y los métodos de dibujo se pueden implementar en una nueva clase que se extiende: ref: `EditorSpatialGizmo <class_EditorSpatialGizmo>`, así:
fr: De cette façon, toutes les méthodes de logique et de dessin du gizmo peuvent être implémentées dans une nouvelle classe étendant :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>`, comme ça :
zh_cn: 这样，所有的小工具逻辑和绘图方法都可以在一个新的类中实现，这个类扩展自 :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>`\ ，像这样：

source: Note that we just added some handles in the redraw method, but we still need to implement the rest of handle-related callbacks in :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>` to get properly working handles.
es: Tenga en cuenta que acabamos de agregar algunos identificadores en el método de redibujo, pero aún necesitamos implementar el resto de devoluciones de llamada relacionadas con identificadores en: ref: `EditorSpatialGizmo <class_EditorSpatialGizmo>` para que los identificadores funcionen correctamente.
fr: Notez que nous venons d'ajouter quelques poignées dans la méthode redraw, mais nous devons toujours implémenter le reste des rappels liés aux poignées dans :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>` pour obtenir des poignées fonctionnant correctement.
zh_cn: 请注意，我们刚刚在重绘方法中添加了一些句柄，但我们仍然需要在 :ref:`EditorSpatialGizmo<class_EditorSpatialGizmo>` 中实现其余的与句柄相关的回调，以获得正确工作的句柄。

source: Translation status
fr: État de la traduction
zh_cn: 翻译状态
