Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/asset_library/using_assetlib.po
Languages: es, fr, zh_cn

source: Using the Asset Library
es: Uso de la biblioteca de activos
fr: Utilisation de l'Asset Library
zh_cn: 使用资产库

source: On the website
es: En el sitio web
fr: Sur le site
zh_cn: 在网站上

source: Overview
es: Sinopsis
fr: Vue d'ensemble
zh_cn: 概览

source: As mentioned before, you can access the web frontend of the Asset Library on `Godot's official website <https://godotengine.org/asset-library/asset>`_. This is what it looks like when you first visit it:
es: Como se mencionó anteriormente, puede acceder a la interfaz web de la biblioteca de activos en el `sitio web oficial de Godot <https://godotengine.org/asset-library/asset>`_. Así es como se ve cuando lo visita por primera vez:
fr: Comme mentionné précédemment, vous pouvez accéder à l'interface web de l'Asset Library sur `le site officiel de Godot <https://godotengine.org/asset-library/asset>`_. Voici à quoi elle ressemble lorsque vous la visitez pour la première fois :
zh_cn: 如前所述，你可以在 `Godot 的官方网站 <https://godotengine.org/asset-library/asset>`_\ 上访问资产库的 Web 前端。这是你第一次访问它时的样子：

source: At the top, you see the **header**, which takes you to various other parts of the AssetLib - at the moment, it's empty, as we are not logged in.
es: En la parte superior se encuentra la **cabecera** que nos conduce a otras partes del AssetLib - en este momento se encuentra vacío ya que no estamos conectados.
fr: En haut, vous voyez l' **en-tête**, qui vous amène à diverses autres parties de l'AssetLib - pour le moment, il est vide, car nous ne sommes pas connectés.
zh_cn: 在顶部, 你看到 **header** , 它导航到AssetLib的各个其他部分, 目前, 它是空的, 因为我们没有登录.

source: Searching
es: Búsqueda
fr: Recherche
zh_cn: 搜索

source: In the center is the **search bar + settings** section, and the **assets** section below it - this lets you filter out certain kinds of assets based on a host of criteria. These include the asset **category** (such as 2D tools, scripts and demos), **engine version** they are intended for, **sorting order** (by update date, by name, etc.) and **support level**.
es: En el centro está la sección **barra de búsqueda + ajustes**, y la sección **activos** debajo de ella - esto te permite filtrar ciertos tipos de activos en base a una gran cantidad de criterios. Estos incluyen el activo **categoría** (como herramientas 2D, scripts y demostraciones), **versión del motor** para el que están destinados, **orden de clasificación** (por fecha de actualización, por nombre, etc.) y **nivel de soporte**.
fr: Au centre se trouve la section **barre de recherche + paramètres**, et la section **assets** en dessous - cela vous permet de filtrer certains types d'assets en fonction d'une foule de critères. Il s'agit notamment de la **catégorie d'assets** (tels que les outils 2D, les scripts et les démos), de la **version du moteur** à laquelle ils sont destinés, de l'**ordre de tri** (par date de mise à jour, par nom, etc.) et du **niveau de support**.
zh_cn: 在中心是 **搜索栏 + 设置** 部分。以及它下面的 **资源** 部分 - 这使你可以根据一系列标准过滤掉某些类型的资源。这些包括资源的 **类别** (例如2D工具，脚本和演示)， **引擎版本** ， **排序** (按更新日期, 按名称等)和 **支持级别** 。

source: While most other filter settings should be fairly self-explanatory, it's worth going over what "support level" means in the Asset Library. Currently there are three support levels, and each asset can belong to only one.
es: Aunque la mayoría de los demás ajustes de los filtros deberían explicarse por sí mismos, vale la pena repasar lo que significa "nivel de apoyo" en la Biblioteca de activos. Actualmente hay tres niveles de soporte, y cada activo puede pertenecer a uno solo.
fr: Alors que la plupart des autres paramètres de filtre devraient être assez explicites, il vaut la peine de vérifier ce que signifie le "niveau de support" dans la bibliothèque d'assets. Actuellement, il existe trois niveaux de support et chaque élément ne peut appartenir qu'à un seul.
zh_cn: 虽然大多数其他过滤器设置是不言自明的，但值得讨论是资产库中“支持级别”的含义。目前有三个支持级别，每个资产只能属于一个。

source: **Official** assets are created and maintained by the official Godot Engine developers. Currently, these include the official engine demos, which showcase how various areas of the engine work.
es: Los activos **Official** son creados y mantenidos por los desarrolladores oficiales de Godot Engine. Actualmente, estos incluyen las demostraciones oficiales del motor, que muestran cómo funcionan varias áreas del motor.
fr: Les assets **Official** sont créés et maintenus par les développeurs officiels du moteur Godot. Actuellement, il s'agit des démonstrations officielles du moteur, qui montrent comment fonctionnent les différents domaines du moteur.
zh_cn: **官方** 资源由官方Godot Engine开发人员创建和维护. 目前, 这些资源包括官方引擎演示, 它们展示了引擎工作的各个方面.

source: **Community** assets are submitted and maintained by the members of the Godot community.
es: Los activos **Community** son presentados y mantenidos por los miembros de la comunidad Godot.
fr: Les assets de la **Community** sont soumis et entretenus par les membres de la communauté Godot.
zh_cn: **社区** 资源由Godot社区成员提交和维护.

source: **Testing** assets are works-in-progress, and may contain bugs and usability issues. They are not recommended for use in serious projects, but you are encouraged to download, test them, and submit issues to the original authors.
es: Los activos de **Testing** son trabajos en curso, y pueden contener errores y problemas de uso. No se recomiendan para su uso en proyectos serios, pero se le anima a que los descargue, los pruebe y envíe los problemas a los autores originales.
fr: Les assets de **Testing** sont des travaux en cours, et peuvent contenir des bogues et des problèmes d'utilisation. Leur utilisation n'est pas recommandée dans le cadre de projets sérieux, mais vous êtes encouragé à les télécharger, à les tester et à soumettre les problèmes aux auteurs originaux.
zh_cn: **测试** 资源是正在开发中的资源，可能包含错误和可用性问题。建议不要将它们用于正式的项目中，但建议你下载并测试它们从而向原作者报告问题。

source: You can mix and match any of the search filters and criteria, and upon clicking the Search button, receive the list of all assets in the Library that match them.
es: Puede mezclar y hacer coincidir cualquiera de los filtros y criterios de búsqueda, y al hacer clic en el botón Buscar, recibirá la lista de todos los activos de la Biblioteca que coincidan con ellos.
fr: Vous pouvez combiner tous les filtres et critères de recherche et, en cliquant sur le bouton Recherche, recevoir la liste de tous les assets de la bibliothèque qui y correspondent.
zh_cn: 你可以混合和匹配任何搜索过滤器和条件，并在单击“搜索”按钮后，接收库中与其匹配的所有资源的列表。

source: Note that the search results are not updated in real-time, so you will have to re-submit the search query each time you change the query settings.
es: Tenga en cuenta que los resultados de la búsqueda no se actualizan en tiempo real, por lo que tendrá que volver a enviar la consulta de búsqueda cada vez que cambie la configuración de la misma.
fr: Notez que les résultats de recherche ne sont pas mis à jour en temps réel, il vous faudra renvoyer la requête à chaque fois que vous en modifierez les paramètres.
zh_cn: 请注意, 搜索结果不会实时更新, 因此每次更改查询设置时都必须重新提交搜索查询.

source: Breakdown of an asset
es: Desglose de un recurso
fr: Composition d'un asset
zh_cn: 资源的细分

source: Now let's take a look at what an asset's page looks like and what it contains.
es: Ahora veamos cómo es la página de un recurso y qué contiene.
fr: Regardons maintenant à quoi ressemble la page d'une ressource et ce qu'elle contient.
zh_cn: 现在让我们来看看资源的页面是什么样的以及它包含的内容.

source: Asset's thumbnail/icon.
es: La miniatura/icono del recurso.
fr: La miniature / icône de la ressource.
zh_cn: 资源的缩略图/图标.

source: Asset's name.
es: Nombre del recurso.
fr: Le nom de la ressource.
zh_cn: 资源的名称.

source: Current version number of the asset.
es: Actual número de versión del recurso.
fr: Le numéro de version actuel de la ressource.
zh_cn: 资源的当前版本号.

source: Asset's category, Godot version, and support status.
es: La categoría del recurso, la versión de Godot, y el estado de apoyo.
fr: Catégorie de l'asset, version Godot et statut de support.
zh_cn: 资源类别,Godot版本和支持状态.

source: Asset's original author/submitter.
es: El autor/presentador original del Recurso.
fr: L'auteur/fournisseur originel de l'asset.
zh_cn: 资源的原作者/提交者.

source: The license the asset is distributed under.
es: La licencia con la que el recurso esta distribuido.
fr: La licence sous lequel l'asset est distribué.
zh_cn: 资源分配的许可证.

source: The date of the asset's latest edit/update.
es: La fecha de la última edición/actualización del recurso.
fr: La date de la dernière modification / mise à jour de la ressource.
zh_cn: 资源的最新编辑/更新日期.

source: A textual description of the asset.
es: Una descripción textual del recurso.
fr: Une description textuelle de la ressource.
zh_cn: 资源的文字描述.

source: Links related to the asset (download link, file list, issue tracker).
es: Enlaces relacionados con el recurso (enlace de descarga, lista de archivos, rastreador de problemas).
fr: Liens relatifs à la ressource (lien de téléchargement, liste de fichiers, suivi des problèmes).
zh_cn: 与资源相关的链接(下载链接, 文件列表, 问题跟踪器).

source: Images and videos showcasing the asset.
es: Imágenes y videos que muestran el recurso.
fr: Images et vidéos présentant la ressource.
zh_cn: 展示资源的图片和视频.

source: Registering and logging in
es: Registro e inicio de sesión
fr: Inscription et connexion
zh_cn: 注册并登录

source: In order to upload assets to the AssetLib, you need to be logged in, and to do that, you need a registered user account. In the future, this may also give you access to other features, such as commenting on or rating the existing assets. You do *not* need to be logged in to browse and download the assets.
es: Para poder cargar activos en la AssetLib, es necesario iniciar sesión, y para ello es necesario tener una cuenta de usuario registrada. En el futuro, esto también puede darle acceso a otras características, como comentar o calificar los recursos existentes. No es necesario iniciar sesión para navegar y descargar los recursos.
fr: Pour télécharger des assets dans l'AssetLib, vous devez être connecté et pour ce faire, vous avez besoin d'un compte d'utilisateur enregistré. À l'avenir, cela pourra également vous donner accès à d'autres fonctionnalités, telles que commenter ou évaluer les assets existants. Vous n'avez *pas* besoin d'être connecté pour parcourir et télécharger les assets.
zh_cn: 要将资源上传到AssetLib，你需要登录，为此，你需要一个注册用户帐户。在将来，这还可以让你访问其他功能，例如对现有资源评论或评级。你 *不* 需要登录就可以浏览和下载资源。

source: The login/registration page can be accessed from the AssetLib header.
es: Se puede acceder a la página de inicio de sesión/registro desde el encabezado de AssetLib.
fr: La page de connexion/enregistrement est accessible à partir de l'en-tête AssetLib.
zh_cn: 可以从AssetLib标题部分访问登录/注册页面.

source: From here, you can register your account, which requires a valid email address, a username, and a (preferably strong) password.
es: Desde aquí, puedes registrar tu cuenta, que requiere una dirección de correo electrónico válida, un nombre de usuario y una contraseña (preferiblemente fuerte).
fr: De là, vous pouvez enregistrer votre compte, ce qui nécessite une adresse électronique valide, un nom d'utilisateur et un mot de passe (de préférence fort).
zh_cn: 在这里，你可以注册你的帐户，该帐户需要有效的电子邮件地址，用户名和密码（最好是强密码）。

source: Then, you can use your username and password to log in.
es: Entonces, puedes usar tu nombre de usuario y contraseña para entrar.
fr: Ensuite, vous pouvez utiliser votre nom d'utilisateur et votre mot de passe pour vous connecter.
zh_cn: 然后，你可以使用你的用户名和密码登录。

source: This will change the look of the AssetLib header. Now you get access to a handful of new functions:
es: Esto cambiará el aspecto de la cabecera de AssetLib. Ahora tienes acceso a un puñado de nuevas funciones:
fr: Cela modifiera l'apparence de l'en-tête d'AssetLib. Vous avez maintenant accès à une poignée de nouvelles fonctions :
zh_cn: 这将改变AssetLib标题的外观. 现在你可以访问一些新的功能:

source: The feed, which shows a list of status updates on your submitted assets (and possibly more in the future).
es: El feed, que muestra una lista de actualizaciones de estado de sus recursos presentados (y posiblemente más en el futuro).
fr: Le flux, qui affiche une liste des mises à jour de l'état des assets que vous avez soumis (et peut-être plus à l'avenir).
zh_cn: Feed, 显示已提交资源的状态更新列表(将来可能更多).

source: A list of your uploaded assets.
es: Una lista de sus recursos cargados.
fr: Une liste de vos assets téléchargés.
zh_cn: 你上传的资源列表。

source: The ability to submit new assets.
es: La capacidad de presentar nuevos recursos.
fr: La possibilité de soumettre de nouveaux assets.
zh_cn: 提交新资源的能力.

source: You can learn how to submit assets to the Library, and what the asset submission guidelines are, in the next part of this tutorial, :ref:`doc_submitting_to_assetlib`.
es: Puedes aprender cómo enviar activos a la Biblioteca, así como conocer las pautas para enviar activos, en la siguiente parte de este tutorial: :ref:`doc_submitting_to_assetlib`.
fr: Vous pouvez apprendre comment soumettre des assets à la Bibliothèque, et quelles sont les directives de soumission d'asset, dans la prochaine partie de ce tutoriel, :ref:`doc_submitting_to_assetlib`.
zh_cn: 你可以在本教程的下一部分 :ref:`doc_submitting_to_assetlib` 中学习如何向库中提交资产，以及资产提交规范是什么。

source: In the editor
es: En el editor
fr: Dans l'éditeur
zh_cn: 在编辑器中

source: The Project Manager's **Asset Library Projects** tab will only display assets that are standalone projects by themselves. This is denoted on the asset library with the *Templates*, *Demos* and *Projects* categories.
zh_cn: 项目管理器的\ **资产库项目**\ 选项卡只会显示本身是独立项目的资产。在资产库中用 *Templates*\ 、\ *Demos* 和 *Projects* 类别来表示。

source: The editor's **AssetLib** tab will only display assets that are *not* standalone projects by themselves. In other words, it will display assets from all categories except *Templates*, *Demos* and *Projects*.
es: La pestaña **Biblioteca de Recursos(AssetLib)** del editor sólo mostrará activos que *no* sean proyectos independientes por sí mismos. En otras palabras, mostrará recursos de todas las categorías excepto *Plantillas*, *Demos* y *Proyectos*.
fr: L'onglet **AssetLib** de l'éditeur n'affiche que les ressources qui ne sont *pas* des projets autonomes. En d'autres termes, il affichera les ressources de toutes les catégories sauf *Modèles*, *Démos* et *Projets*.
zh_cn: 编辑器的 **AssetLib** 选项卡将只显示本身 *不是* 独立项目的资产。换句话说，它将显示除 *Template*\ 、\ *Demos* 和 *Projects* 以外的所有类别的资产。

source: You can also access the AssetLib directly from Godot:
es: También puede acceder a la Biblioteca de Recursos(AssetLib) directamente desde Godot:
fr: Vous pouvez également accéder à l'AssetLib directement depuis Godot :
zh_cn: 你也可以直接从Godot访问AssetLib:

source: Click on it, and Godot will fetch info about the assets from the AssetLib. Once it's finished, you will see a window similar to what the AssetLib website looks like, with some differences:
es: Haz clic en él, y Godot obtendrá información sobre los activos de la AssetLib. Una vez que haya terminado, verás una ventana similar a la del sitio web de AssetLib, con algunas diferencias:
fr: Cliquez dessus, et Godot ira chercher des informations sur les assets dans l'AssetLib. Une fois terminé, vous verrez une fenêtre similaire à celle du site AssetLib, avec quelques différences :
zh_cn: 单击它，Godot 将从 AssetLib 获取有关资源的信息。一旦完成，你将看到一个类似于 AssetLib 网站的窗口，但有一些不同之处：

source: Similarly to the web version of the AssetLib, here you can search for assets by category, name, and sort them by factors such as name or edit date.
es: De manera similar a la versión web de la AssetLib, aquí puede buscar recursos por categoría, nombre y ordenarlos por factores como el nombre o la fecha de edición.
fr: Comme dans la version web de l'AssetLib, vous pouvez ici rechercher des assets par catégorie, par nom et les trier en fonction de facteurs tels que le nom ou la date d'édition.
zh_cn: 与 AssetLib 的网页版本类似，你可以在此处按类别、名称搜索资源，并按名称或编辑日期等因素对其进行排序。

source: Notably, you can only fetch assets for the current version of Godot you are running. Projects, Demos and Templates can be downloaded from the Project Manager view of the AssetLib. Addons (tools, scripts, materials etc.) can be downloaded from the in-project AssetLib and added to the current project. In addition, unlike when using the web frontend, the search results are updated in real-time (you do not have to press Search after every change to your search query for the changes to take place).
es: Destacablemente, solo puedes obtener activos para la versión actual de Godot que estás utilizando. Los proyectos, demos y plantillas pueden descargarse desde la vista del Administrador de Proyectos de la AssetLib. Los complementos (herramientas, scripts, materiales, etc.) se pueden descargar desde la AssetLib dentro del proyecto y añadirse al proyecto actual. Además, a diferencia de cuando se utiliza la interfaz web, los resultados de búsqueda se actualizan en tiempo real (no es necesario pulsar "Buscar" después de cada cambio en la consulta de búsqueda para que los cambios surtan efecto).
fr: Notamment, vous ne pouvez récupérer des assets que pour la version actuelle de Godot que vous utilisez. Les projets, démos et modèles peuvent être téléchargés à partir de la vue Gestionnaire de projet de l'AssetLib. Des addons (outils, scripts, matériel, etc.) peuvent être téléchargés à partir de l'AssetLib dans le projet et ajoutés au projet en cours. En outre, contrairement à l'utilisation de l'interface web, les résultats de la recherche sont mis à jour en temps réel (il n'est pas nécessaire d'appuyer sur la touche Recherche après chaque modification de votre requête de recherche pour que les changements aient lieu).
zh_cn: 显然，你只能获取与你所运行的 Godot 版本一致的资产。项目、演示、模板可以从项目管理器的 AssetLib 里下载。扩展（工具、脚本、材质等）可以从项目的 AssetLib 里下载并添加到当前项目。此外，与网页前端不同，这些搜索结果是实时更新的（每次修改搜索内容后无需点击搜索按钮）。

source: In the future, you will be able to choose a different AssetLib provider to fetch assets from (using the Site dropdown menu), however currently only the official `Godot website <https://godotengine.org>`_ version of the AssetLib is supported, as well as the version that may be running on your local machine's web server (the localhost option).
es: En el futuro, usted podrá elegir un proveedor diferente de AssetLib para obtener recursos (usando el menú desplegable Site), sin embargo actualmente sólo se admite la versión oficial `Página web de Godot <https://godotengine.org>`__ de la AssetLib, así como la versión que puede estar ejecutándose en el servidor web de su máquina local (la opción localhost).
fr: À l'avenir, vous pourrez choisir un autre fournisseur d'AssetLib pour récupérer des assets (en utilisant le menu déroulant du Site), mais actuellement, seule la version officielle du site web `Godot <https://godotengine.org>`_ de l'AssetLib est prise en charge, ainsi que la version qui peut être exécutée sur le serveur web de votre machine locale (l'option localhost).
zh_cn: 将来，你将能够选择一个不同的 AssetLib 提供程序来获取资源（使用站点下拉菜单），但是目前只支持官方的 `Godot 网站 <https://godotengine.org>`_ 版本的 AssetLib，和可能在本地 Web 服务器上运行的资产库（即 localhost 选项）。

source: When you click on an asset, you will see more information about it.
es: Cuando haga clic en un recurso, verá más información sobre él.
fr: Lorsque vous cliquez sur un asset, vous obtenez plus d'informations à son sujet.
zh_cn: 单击资源时，你将看到有关它的更多信息。

source: If you click on the Install button, Godot will fetch an archive of the asset, and will track download progress of it at the bottom of the editor window. If the download fails, you can retry it using the Retry button.
es: Si haces clic en el botón Instalar, Godot buscará un archivo del activo y seguirá el progreso de la descarga en la parte inferior de la ventana del editor. Si la descarga falla, puedes reintentarlo usando el botón Reintentar.
fr: Si vous cliquez sur le bouton Installer, Godot ira chercher une archive de l'asset, et suivra la progression du téléchargement de celui-ci au bas de la fenêtre de l'éditeur. Si le téléchargement échoue, vous pouvez le réessayer en utilisant le bouton Réessayer.
zh_cn: 如果单击 Install 按钮，Godot 引擎将下载资源的压缩包，并将在编辑器窗口的底部显示它的下载进度。如果下载失败，你可以使用 Retry 按钮重试。

source: When it finishes, you can proceed to install it using the Install button. This will bring up the Package Installer window.
es: Cuando termine, puede proceder a instalarlo usando el botón de instalación. Esto hará que aparezca la ventana del Instalador de paquetes.
fr: Lorsqu'il est terminé, vous pouvez procéder à son installation en utilisant le bouton Installer. La fenêtre de l'installateur de paquets apparaîtra alors.
zh_cn: 完成后，你可以使用 Install 按钮继续安装它。这将打开 Package Installer 窗口。

source: Here you can see a list of all the files that will be installed. You can tick off any of the files that you do not wish to install, and Godot will also inform you about any problems with files that it cannot install. These files will be shown in red, and hovering over them will show you a message stating why it cannot be installed.
es: Aquí puede ver una lista de todos los archivos que se instalarán. Puedes marcar cualquiera de los archivos que no deseas instalar, y Godot también te informará sobre cualquier problema con los archivos que no puede instalar. Estos archivos se mostrarán en rojo, y al pasar el ratón por encima de ellos te mostrará un mensaje que te indicará por qué no se puede instalar.
fr: Vous trouverez ici une liste de tous les fichiers qui seront installés. Vous pouvez cocher tous les fichiers que vous ne souhaitez pas installer, et Godot vous informera également de tout problème concernant les fichiers qu'il ne peut pas installer. Ces fichiers s'affichent en rouge, et si vous les survolez, un message vous indique pourquoi ils ne peuvent pas être installés.
zh_cn: 在这里，你可以看到将要安装的所有文件的列表。你可以勾选不想安装的任何文件，Godot引擎也会告知你无法安装的文件的任何问题。这些文件将以红色显示，将鼠标悬停在它们上方会显示一条消息，说明无法安装的原因。

source: Once you are done, you can press the Install button, which will unzip all the files in the archive, and import any assets contained therein, such as images or 3D models. Once this is done, you should see a message stating that the Package installation is complete.
es: Una vez que haya terminado, puede pulsar el botón Instalar, que descomprimirá todos los archivos del archivo, e importará cualquier activo que contenga, como imágenes o modelos 3D. Una vez hecho esto, debería ver un mensaje que indica que la instalación del Paquete se ha completado.
fr: Une fois que vous avez terminé, vous pouvez appuyer sur le bouton Installer, ce qui dézippera tous les fichiers de l'archive et importera tous les éléments contenus dans celle-ci, tels que les images ou les modèles 3D. Une fois que cela est fait, vous devriez voir un message indiquant que l'installation du paquet est terminée.
zh_cn: 完成后，你可以按 Install 按钮，该按钮将解压缩存档中的所有文件，并导入其中包含的所有资源，例如图像或3D模型。完成此操作后，你应该会看到一条消息，指出 Package 安装已完成。

source: You may also use the Import button to import asset archives obtained elsewhere (such as downloading them directly from the AssetLib web frontend), which will take you through the same package installation procedure as with the assets downloaded directly via Godot that we just covered.
es: También puede utilizar el botón Importar para importar archivos de recursos obtenidos en otro lugar (como descargarlos directamente del frontend web AssetLib), lo que le llevará al mismo procedimiento de instalación de paquetes que con los recursos descargados directamente vía Godot que acabamos de cubrir.
fr: Vous pouvez également utiliser le bouton Importer pour importer des archives d'assets obtenues ailleurs (par exemple en les téléchargeant directement depuis l'interface web d'AssetLib), ce qui vous fera suivre la même procédure d'installation de paquets que pour les assets téléchargés directement via Godot que nous venons de couvrir.
zh_cn: 你还可以使用 Import 按钮导入在其他位置获取的资源压缩包（例如直接从AssetLib 网页前端下载的），这将引导你完成与我们刚刚通过 Godot 引擎实现的程序包安装过程。
