Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/asset_library/using_assetlib.po
Languages: es, fr, zh_cn

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
