Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/code_style_guidelines.po
Languages: es, fr, zh_cn, zh_tw

source: Code style guidelines
es: Directrices de estilo de código
fr: Lignes directrices pour le style du code
zh_cn: 代码风格规范
zh_tw: 程式碼樣式方針

source: When contributing to Godot's source code, you will be expected to follow the style guidelines outlined below. Some of them are checked via the Continuous Integration process and reviewers will ask you to fix potential issues, so best setup your system as outlined below to ensure all your commits follow the guidelines.
es: Cuando contribuyas al código fuente de Godot, se espera que sigas las pautas de estilo descritas a continuación. Algunas de ellas son verificadas a través del proceso de Integración Continua, y los revisores te pedirán que corrijas posibles problemas. Por lo tanto, es recomendable configurar tu sistema de la manera que se describe a continuación para asegurarte de que todos tus commits cumplan con las pautas.
fr: Lorsque vous contribuez au code source de Godot, vous devez suivre les directives de style décrites ci-dessous. Certaines d'entre elles sont vérifiées par le biais du processus d'intégration continue et les examinateurs vous demanderont de résoudre les problèmes potentiels. Il est donc préférable de configurer votre système comme indiqué ci-dessous pour vous assurer que tous vos commits respectent les directives.
zh_cn: 在给 Godot 的源代码做贡献时，你需要遵循下面概述的样式规范。其中一些是通过持续集成过程进行检查的，评审人员将要求你修复潜在的问题，因此最好按照下面概述的方式设置系统，以确保所有提交都遵循规范。
zh_tw: 在參與貢獻 Godot 原始碼時需要遵守下述樣式方針。其中的一些規則會在 CI (持續整合, Continuos Integration) 過程中自動檢查，而審閱者也會要求你修正一些潛在的問題。因此，最好先依照下屬方式設定系統，並確保你的 Commit 都有符合本方針。

source: C++ and Objective-C
es: C++ y Objective-C
fr: C++ et Objective-C
zh_cn: C++ 和 Objective-C
zh_tw: C++ 與 Objective-C

source: There are no written guidelines, but the code style agreed upon by the developers is enforced via the `clang-format <https://clang.llvm.org/docs/ClangFormat.html>`__ code beautifier, which takes care for you of all our conventions. To name a few:
zh_tw: C++ 與 Objective-C 沒有明文的方針，但我們有由各個開發者認定的樣式，且會依照 `clang-format <http://clang.llvm.org/docs/ClangFormat.html>`__ 程式碼美化工具強制套用。該工具會處理我們所有的管理。下面舉例幾個：

source: Indentation and alignment are both tab based (respectively one and two tabs)
es: La indentación y alineación están basadas en tabulaciones (respectivamente una y dos tabulaciones)
fr: L'indentation et l'alignement sont tous les deux basés sur des tabulations (respectivement une et deux tabulations)
zh_cn: 缩进和对齐都是基于制表符的（分别是一个和两个制表符）
zh_tw: 縮排與對齊都是使用 Tab 字元 (分別使用 1 個與 2 個 Tab)

source: One space around math and assignments operators as well as after commas
es: Un espacio alrededor de operadores matemáticos y de asignación, así como después de comas
fr: Un espace autour des opérateurs mathématiques et d'affectation, ainsi qu'après les virgules
zh_cn: 数学和赋值运算符以及逗号后面有一个空格
zh_tw: 在數學與賦值運算子的周圍以及逗號後加上 1 個空格

source: Pointer and reference operators are affixed to the variable identifier, not to the type name
es: Los operadores de puntero y referencia se colocan después del identificador de la variable, no después del nombre del tipo
fr: Les opérateurs de pointeurs et de références sont attachés à l'identifiant de la variable, pas au nom du type
zh_cn: 指针和引用运算符附加到变量标识符，而不是类型名称
zh_tw: 指標與參照運算子要加到變數識別項前，而不是型別名稱前

source: See further down regarding header includes
es: Más adelante, se darán más detalles sobre las inclusiones de encabezados
fr: Voir plus loin concernant les inclusions en en-tête
zh_cn: 有关头文件的引入，请参见下文
zh_tw: 有關標頭檔引用，請繼續閱讀以瞭解詳情

source: The rules used by clang-format are outlined in the `.clang-format <https://github.com/godotengine/godot/blob/master/.clang-format>`__ file of the Godot repository.
es: Las reglas utilizadas por clang-format se detallan en el archivo `.clang-format <https://github.com/godotengine/godot/blob/master/.clang-format>`__ del repositorio de Godot.
fr: Les règles utilisées par clang-format sont décrites dans le fichier `.clang-format <https://github.com/godotengine/godot/blob/master/.clang-format>`__ du dépôt de Godot.
zh_cn: Clang 格式使用的规则在 Godot 仓库的 `.clang-format <https://github.com/godotengine/godot/blob/master/.clang-format>`__ 文件中进行了概述。
zh_tw: clang-format 所使用的規則列在 Godot 儲存庫中的 `.clang-format <https://github.com/godotengine/godot/blob/master/.clang-format>`__ 檔案內。

source: Third-party code is usually included in the ``thirdparty/`` folder and can thus easily be excluded from formatting scripts. For the rare cases where a third-party code snippet needs to be included directly within a Godot file, you can use ``/* clang-format off */`` and ``/* clang-format on */`` to tell clang-format to ignore a chunk of code.
es: El código de terceros generalmente se incluye en la carpeta ``thirdparty/`` y, por lo tanto, puede excluirse fácilmente de los scripts de formato. Para los casos raros en los que sea necesario incluir directamente un fragmento de código de terceros dentro de un archivo de Godot, se puede utilizar ``/* clang-format off */`` y ``/* clang-format on */`` para indicarle a clang-format que ignore esa parte del código. De esta manera, el código de terceros mantendrá su estilo original y no se verá afectado por las reglas de formato de Godot.
fr: Le code tiers est généralement inclus dans le dossier ``thirdparty/`` et peut donc être facilement exclu des scripts de formatage. Dans les rares cas où un extrait de code tiers doit être inclus directement dans un fichier Godot, vous pouvez utiliser ``/* clang-format off */`` et ``/* clang-format on */`` pour indiquer au "clang-format" d'ignorer une partie du code.
zh_cn: 第三方代码通常包含在 ``thirdparty/`` 文件夹中, 因此可以很容易地从格式化脚本中排除. 在极少数情况下, 第三方代码片段需要直接包含在Godot文件中, 你可以使用 ``/* clang-format off */`` 和 ``/* clang-format on */`` 来告诉clang-format忽略某块儿的代码.
zh_tw: 第三方程式碼通常放在 ``thirdparty/`` 資料夾內，因此可以輕鬆地在格式化腳本中排除掉。但有些稀有的例子，我們可能會直接在 Godot 的檔案中使用第三方程式碼片端，這時候可以使用 ``/* clang-format off */`` 與 ``/* clang-format on */`` 來讓 clang-format 忽略一段程式碼。

source: These guidelines only cover code formatting. See :ref:`doc_cpp_usage_guidelines` for a list of language features that are permitted in pull requests.
es: Estas pautas solo abarcan el formato del código. Consulta :ref:`doc_cpp_usage_guidelines` para obtener una lista de características del lenguaje que están permitidas en las solicitudes de extracción (pull requests).
fr: Ces directives ne couvrent que le formatage du code. Voir :ref:`doc_cpp_usage_guidelines` pour une liste des caractéristiques du langage qui sont autorisées dans les pull requests.
zh_cn: 这些规范只涉及代码的格式化。拉取请求中所允许的语言特性列表请参阅 :ref:`doc_cpp_usage_guidelines`\ 。
zh_tw: 這些規範只涉及程式碼的格式化。拉取請求中所允許的語言功能列表請參閱 :ref:`doc_cpp_usage_guidelines`。

source: Using clang-format locally
es: Usando clang-format localmente
fr: Utiliser clang-format localement
zh_cn: 在本地使用 clang-format
zh_tw: 在本機上使用 clang-format

source: First of all, you will need to install clang-format. As of now, you need to use **clang-format 13** to be compatible with Godot's format. Later versions might be suitable, but previous versions may not support all used options, or format some things differently, leading to style issues in pull requests.
es: Primero que nada, necesitarás instalar clang-format. En este momento, necesitas usar **clang-format 13** para que sea compatible con el formato de Godot. Versiones posteriores podrían ser adecuadas, pero versiones anteriores podrían no admitir todas las opciones utilizadas o formatear algunas cosas de manera diferente, lo que podría provocar problemas de estilo en las solicitudes de extracción.
fr: Tout d'abord, vous devez installer clang-format. À partir de maintenant, vous devez utiliser **clang-format 13** pour être compatible avec le format de Godot's. Les versions ultérieures peuvent convenir, mais les versions précédentes peuvent ne pas supporter toutes les options utilisées, ou formater certaines choses différemment, ce qui entraîne des problèmes de style dans les pull requests.
zh_cn: 首先，你需要安装 clang-format。截至目前，你需要使用 **clang-format 13** 才能与 Godot 的格式兼容。后续版本可能也能用，但更早的版本就可能无法支持所有用到的选项，或者使用不同的格式，导致拉取请求存在样式问题。
zh_tw: 首先，必須要安裝 clang-format。目前，必須要使用 **clang-format 8.x** 以相容 Godot 的格式。更新版本可能適用，但較舊版本有 Bug 且會使目前程式碼的格式跑掉。

source: Installation
es: Instalación
zh_cn: 安装
zh_tw: 安裝

source: Here's how to install clang-format:
es: Aquí te mostramos cómo instalar clang-format:
fr: Voici comment installer clang-format :
zh_cn: 以下是如何安装 clang-format：
zh_tw: 下列為如何安裝 clang-format：

source: Linux: It will usually be available out-of-the-box with the clang toolchain packaged by your distribution. If your distro version is not the required one, you can download a pre-compiled version from the `LLVM website <https://releases.llvm.org/download.html>`__, or if you are on a Debian derivative, use the `upstream repos <https://apt.llvm.org/>`__.
zh_tw: Linux：通常直接於發行版的 clang 工具鏈中附帶提供。若你使用的發行版提供了不合需求的版本，可以從 `LLVM 網站 <http://releases.llvm.org/download.html>`__ 上下載預先編譯好的版本。而若使用 Debian 衍生版本，則可以使用這個 `上游軟體倉 <http://apt.llvm.org/>`__ 。

source: macOS and Windows: You can download precompiled binaries from the `LLVM website <https://releases.llvm.org/download.html>`__. You may need to add the path to the binary's folder to your system's ``PATH`` environment variable to be able to call ``clang-format`` out of the box.
zh_tw: macOS 與 Windows：可以從 `LLVM 網站 <http://releases.llvm.org/download.html>`__ 下載預先編譯好的二進位檔。可能會需要將二進位檔的資料夾加到系統的 ``PATH`` 環境路徑中以便直接呼叫 ``clang-format``。

source: You then have different possibilities to apply clang-format to your changes:
es: A continuación, tienes diferentes opciones para aplicar clang-format a tus cambios:
fr: Vous avez alors différentes possibilités pour appliquer le clang-format à vos modifications :
zh_cn: 然后, 你就有不同的可能性将clang-format应用于你的更改:
zh_tw: 要將 clang-format 套用到修改中有幾個方法：

source: Manual usage
es: Uso manual
fr: Utilisation manuelle
zh_cn: 手动使用
zh_tw: 手動使用

source: ``-i`` means that the changes should be written directly to the file (by default clang-format would only output the fixed version to the terminal).
es: Exacto, ``-i`` indica que los cambios deben escribirse directamente en el archivo (por defecto, clang-format solo mostraría la versión corregida en la terminal).
fr: ``-i`` signifie que les modifications doivent être écrites directement dans le fichier (par défaut, clang-format n'affichera la version corrigée que dans le terminal).
zh_cn: ``-i`` 表示更改应直接写入文件(默认情况下,clang-format只会将固定版本输出到终端).
zh_tw: ``-i`` 代表改動應直接寫入到檔案內 (clang-format 預設只會將修正後的版本輸出到終端機上)。

source: The path can point to several files, either one after the other or using wildcards like in a typical Unix shell. Be careful when globbing so that you don't run clang-format on compiled objects (.o and .a files) that are in Godot's tree. So better use ``core/*.{cpp,h}`` than ``core/*``.
es: El camino puede apuntar a varios archivos, ya sea uno tras otro o usando caracteres comodín como en una típica terminal Unix. Ten cuidado al usar globbing para no ejecutar clang-format en objetos compilados (archivos .o y .a) que se encuentren en el árbol de Godot. Es mejor usar ``core/*.{cpp,h}`` en lugar de ``core/*``.
fr: Le chemin peut pointer vers plusieurs fichiers, soit l'un après l'autre, soit en utilisant des * comme dans un shell Unix typique. Faites attention lors de l'utilisation des * afin de ne pas utiliser le format clang sur des objets compilés (fichiers .o et .a) qui se trouvent dans l'arbre de Godot. Il vaut donc mieux utiliser ``core/*.{cpp,h}`` que ``core/*``.
zh_cn: 该路径可以指向几个文件, 一个接一个, 也可以使用如在典型的Unix shell中的通配符. 在通配时要小心, 以免对Godot树中的已编译对象(.o和.a文件)运行clang格式. 因此, 最好使用 ``core/*. {cpp,h}`` 而不是 ``core/*``.
zh_tw: 該路徑可指向多個檔案，可以直接指定多個檔案，或是像一般 Unix Shell 一樣使用萬用字元。在使用萬用字元時請注意不要將 clang-format 套用到 Godot 資料夾內編譯後的物件上 (.o 與 .a 檔案)。因此最好使用 ``core/*.{cpp,h}`` 而不是 ``core/*`` 。

source: For ease of use, we provide a pre-commit hook for Git that will run clang-format automatically on all your commits to check them, and let you apply its changes in the final commit.
es: Para facilitar su uso, proporcionamos un "pre-commit hook" para Git que ejecutará automáticamente clang-format en todos sus commits para verificarlos, y le permitirá aplicar sus cambios en el commit final.
fr: Pour faciliter l'utilisation, nous fournissons un crochet de pré-commission pour Git qui s'exécutera automatiquement au format clang sur tous vos commits pour les vérifier, et vous permettra d'appliquer ses changements dans le commit final.
zh_cn: 为了易于使用, 我们为Git提供了一个预提交钩子, 它将在你的所有提交上自动运行clang-format来检查它们, 并允许你在最终提交中应用其更改.
zh_tw: 為了更容易使用，我們提供了用於 Git 的 Pre-commit Hook，可以自動在所有 Commit 上執行 clang-format 並進行檢查，然後能將其更改套用到最終 Commit 上。

source: If your clang-format is not in the ``PATH``, you may have to edit the ``pre-commit-clang-format`` to point to the correct binary for it to work. The hook was tested on Linux and macOS, but should also work in the Git Shell on Windows.
es: Si tu clang-format no está en la variable ``PATH``, es posible que tengas que editar el archivo ``pre-commit-clang-format`` para indicar la ruta correcta del binario para que funcione correctamente. Este "hook" fue probado en Linux y macOS, pero también debería funcionar en Git Shell en Windows.
fr: Si le format de votre clang n'est pas dans le ``PATH``, vous devrez peut-être modifier le ``pre-commit-clang-format`` pour qu'il pointe vers le binaire correct et qu'il fonctionne. Le crochet a été testé sous Linux et macOS, mais devrait également fonctionner dans le Git Shell sous Windows.
zh_cn: 如果你的clang-format不在 ``PATH`` 中, 你可能需要编辑 ``pre-commit-clang-format`` 来指向正确的二进制格式才能工作. 钩子在Linux和macOS上测试过, 但也应该在Windows上的Git Shell中运行.
zh_tw: 如果 clang-format 不在 ``PATH`` 中的話，則可能需要編輯 ``pre-commit-clang-format`` 來指向正確的二進位檔才能使用。該 Hook 已在 Linux 與 macOS 上測試過，但在 Windows 上的 Git Shell 應該也可以使用。

source: IDE plugin
es: Complemento IDE
fr: Plugin IDE
zh_cn: IDE插件
zh_tw: IDE 外掛

source: Here is a non-exhaustive list of beautifier plugins for some IDEs:
es: Aquí tienes una lista no exhaustiva de complementos de embellecimiento para algunos IDEs:
fr: Voici une liste non exhaustive de plugins d'embellissement pour quelques IDE :
zh_cn: 以下是一些IDE的美化插件的非详尽列表:
zh_tw: 此處僅列出部分用於一些 IDE 的美化外掛：

source: CLion: Starting from version ``2019.1``, no plugin is required. Instead, enable `ClangFormat <https://www.jetbrains.com/help/clion/clangformat-as-alternative-formatter.html#clion-support>`__
es: CLion: A partir de la versión ``2019.1``, no se requiere un complemento. En su lugar, habilita `ClangFormat <https://www.jetbrains.com/help/clion/clangformat-as-alternative-formatter.html#clion-support>`__
fr: CLion : À partir de la version ``2019.1``, aucun plugin n'est nécessaire. A la place, activez `ClangFormat <https://www.jetbrains.com/help/clion/clangformat-as-alternative-formatter.html#clion-support>`__
zh_cn: CLion：从 ``2019.1`` 版本起不再需要插件。启用 `ClangFormat <https://www.jetbrains.com/help/clion/clangformat-as-alternative-formatter.html#clion-support>`__ 即可
zh_tw: CLion：從 ``2019.1`` 版本起不再需要外掛程式。啟用 `ClangFormat <https://www.jetbrains.com/help/clion/clangformat-as-alternative-formatter.html#clion-support>`__ 即可

source: Header includes
es: Incluciones de encabezado
fr: L'en-tête comprend
zh_cn: 头文件的引入
zh_tw: 標頭引用

source: When adding new C++ or Objective-C files or including new headers in existing ones, the following rules should be followed:
es: Cuando se agreguen nuevos archivos de C++ o Objective-C o se incluyan nuevos encabezados en los archivos existentes, se deben seguir las siguientes reglas:
fr: Lors de l'ajout de nouveaux fichiers C++ ou Objective-C ou de l'inclusion de nouveaux en-têtes dans des fichiers existants, les règles suivantes doivent être suivies :
zh_cn: 当添加新的C++或Objective-C文件或在现有文件中引入新的标头时, 应遵循以下规则:
zh_tw: 建立新的 C++ 或 Objective-C 檔案或在現有檔案內引用新標頭檔時，必須遵守下列規則：

source: The first lines in the file should be Godot's copyright header and MIT license, copy-pasted from another file. Make sure to adjust the filename.
es: Las primeras líneas del archivo deben ser el encabezado de derechos de autor y la licencia MIT de Godot, copiados y pegados desde otro archivo. Asegúrate de ajustar el nombre del archivo.
fr: Les premières lignes du fichier doivent être l'en-tête de copyright de Godot et la licence du MIT, copiées-collées à partir d'un autre fichier. Veillez à ajuster le nom du fichier.
zh_cn: 文件中的第一行应该是Godot的版权标头和MIT许可证, 从另一个文件复制粘贴. 确保调整文件名.
zh_tw: 檔案的頭幾行必須為 Godot 的版權標頭與 MIT 授權協議，請從其他檔案內複製過來。請記得更改檔案名稱。

source: In a ``.h`` header, include guards should be used with the form ``FILENAME_H``.
es: En un archivo de encabezado ``.h``, se deben utilizar protecciones de inclusión (include guards) con la forma ``NOMBREARCHIVO_H``.
fr: Dans un en-tête ``.h``, les gardes d'inclusion doivent être utilisés sur ce modèle : ``FILENAME_H``.
zh_cn: 在 ``.h`` 头文件中, 引入防护应该与 ``FILENAME_H`` 形式一起使用.
zh_tw: 在 ``.h`` 標頭檔內，Include 防護 (Include Guard) 應為 ``FILENAME_H`` 的格式。

source: In a ``.cpp`` file (e.g. ``filename.cpp``), the first include should be the one where the class is declared (e.g. ``#include "filename.h"``), followed by an empty line for separation.
es: En un archivo ``.cpp`` (por ejemplo, ``filename.cpp``), la primera inclusión debería ser aquella donde se declara la clase (por ejemplo, ``#include "filename.h"``), seguido de una línea en blanco para separación.
fr: Dans un fichier ``.cpp`` (par exemple ``filename.cpp``), le premier include doit être celui où la classe est déclarée (par exemple ``#include "filename.h"``), suivi d'une ligne vide pour la séparation.
zh_cn: 在 ``.cpp`` 文件(如 ``filename.cpp`` )中, 第一个引入应该是声明类的那个(例如 ``#include "filename.h"``), 然后使用空行分隔.
zh_tw: 在 ``.cpp`` 檔案 (如 ``filename.cpp``) 中，第一個 Include 應為類別定義的檔案 (如 ``#include "filename.h"``)，並接上一行空行以作分隔。

source: Then come headers from Godot's own code base, included in alphabetical order (enforced by ``clang-format``) with paths relative to the root folder. Those includes should be done with quotes, e.g. ``#include "core/object.h"``. The block of Godot header includes should then be followed by an empty line for separation.
es: A continuación, deben aparecer los encabezados del propio código base de Godot, incluidos en orden alfabético (aplicado por ``clang-format``) con rutas relativas a la carpeta raíz. Esas inclusiones deben realizarse con comillas, por ejemplo, ``#include "core/object.h"``. Después del bloque de inclusiones de encabezados de Godot, debe haber una línea en blanco para separación.
fr: Puis viennent les en-têtes de la base de code de Godot, inclus dans l'ordre alphabétique (imposé par le ``clang-format``) avec les chemins relatifs au dossier racine. Ces inclusions doivent être faites avec des guillemets, par exemple ``#inclure "core/object.h"``. Le bloc des includes de l'en-tête Godot doit alors être suivi d'une ligne vide pour la séparation.
zh_cn: 然后来自Godot自己的代码库的标头, 按字母顺序(由 ``clang-format`` 强制)引入, 并具有相对于根文件夹的路径. 这些引入应该用引号来完成, 例如 ``#include "core/object.h"``. 然后,Godot标头引入的块应用一个空行以进行分隔.
zh_tw: 接下來的是 Godot 程式碼的其他標頭檔，按字母順序引入 (會由 ``clang-format`` 強制執行)，並使用相對於根目錄的路徑。這些 Include 應以引號包含，如 ``#include "core/object.h"`` 。Godot 標頭檔 Include 區塊後方應包含一行空行以作分隔。

source: Finally, third-party headers (either from ``thirdparty`` or from the system's include paths) come next and should be included with the < and > symbols, e.g. ``#include <png.h>``. The block of third-party headers should also be followed by an empty line for separation.
es: Finalmente, los encabezados de terceros (ya sea de la carpeta ``thirdparty`` o de las rutas de inclusión del sistema) deben venir a continuación y deben incluirse con los símbolos < y >, por ejemplo, ``#include <png.h>``. El bloque de inclusiones de encabezados de terceros también debe estar seguido por una línea en blanco para separación.
fr: Enfin, les en-têtes tiers (provenant soit de ``thirdparty`` soit des chemins d'inclusion du système) viennent ensuite et doivent être inclus avec les symboles < et >, par exemple ``#include <png.h>``. Le bloc des en-têtes tiers doit également être suivi d'une ligne vide pour la séparation.
zh_cn: 最后, 第三方头文件(无论是来自 ``thirdparty`` 还是来自系统的包含路径)接下来, 应该用 < and > 符号包含, 例如 ``#include <png.h>`` . 第三方头文件块的后面也应该有一个空行来分隔.
zh_tw: 最後接著是第三方標頭檔 (也就是從 ``thirdparty`` 或系統 Include 路徑內來的)，應以 < 與 > 符號來 Include，如 ``#include <png.h>`` 。第三方標頭檔區塊後也應加上一行空行以作區隔。

source: Godot and third-party headers should be included in the file that requires them, i.e. in the `.h` header if used in the declarative code or in the `.cpp` if used only in the imperative code.
es: Los encabezados de Godot y de terceros deben incluirse en el archivo que los requiere, es decir, en el archivo `.h` si se utilizan en el código declarativo o en el archivo `.cpp` si se utilizan solo en el código imperativo.
fr: Les en-têtes Godot et tiers doivent être inclus dans le fichier qui les requiert, c'est-à-dire dans l'en-tête `.h` si utilisé dans le code déclaratif ou dans le `.cpp` si utilisé uniquement dans le code impératif.
zh_cn: Godot和第三方标头应包含在需要它们的文件中, 即, 如果在声明性代码中使用, 则在 `.h` 标头中；如果仅在命令性代码中使用, 则在 `.cpp` 中.
zh_tw: Godot 標頭檔與第三方標頭檔都應在需要這些標頭檔的檔案內 Include，也就是當使用宣告式程式碼時應在 **.h** 標頭內，只有使用命令式程式碼時才應在 **.cpp** 內引入。

source: Example:
es: Ejemplo:
fr: Exemple :
zh_cn: 示例：
zh_tw: 範例：

source: Godot's Java code (mostly in ``platform/android``) is also enforced via ``clang-format``, so see the instructions above to set it up. Keep in mind that this style guide only applies to code written and maintained by Godot, not third-party code such as the ``java/src/com/google`` subfolder.
es: El código Java de Godot (principalmente en ``platform/android``) también se aplica a través de ``clang-format``, así que consulta las instrucciones anteriores para configurarlo. Ten en cuenta que esta guía de estilo solo se aplica al código escrito y mantenido por Godot, no al código de terceros, como la subcarpeta ``java/src/com/google``.
fr: Le code Java de Godot (principalement en ``platform/android``) est également mis en forme par ``clang-format``, donc voir les instructions ci-dessus pour le régler. Gardez à l'esprit que ce guide de style ne s'applique qu'au code écrit et maintenu par Godot, et non au code d'une tierce partie comme le sous-dossier ``java/src/com/google``.
zh_cn: Godot的Java代码(主要在 ``platform/android`` 中)也是通过 ``clang-format`` 来执行的, 所以请看上面的说明来设置它. 请记住, 本风格规则只适用于Godot编写和维护的代码, 而不是第三方代码, 如 ``java/src/com/google`` 子文件夹.
zh_tw: Godot 的 Java 程式碼 (大部分都在 ``platform/android`` 內) 也會強制由 ``clang-format`` 套用，因此請參考上方的說明設定 clang-format。請注意，樣式指南僅套用至由 Godot 撰寫且由 Godot 維護的程式碼，如 ``java/src/com/google`` 子資料夾內的第三方程式碼則不應套用。

source: Godot's SCons buildsystem is written in Python, and various scripts included in the source tree are also using Python.
es: El sistema de construcción SCons de Godot está escrito en Python, y varios scripts incluidos en el árbol de código fuente también utilizan Python.
fr: Le système de construction SCons de Godot est écrit en Python, et divers scripts inclus dans l'arbre des sources utilisent également Python.
zh_cn: Godot的SCons构建系统是用Python编写的, 源代码树中包含的各种脚本也使用Python.
zh_tw: Godot 的 SCons 建置系統是以 Python 撰寫的，而程式碼中還有多個腳本也是使用 Python。
