Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/code_style_guidelines.po
Languages: es, fr, zh_cn, zh_tw

source: For those, we follow the `Black style guide <https://github.com/psf/black#the-black-code-style>`__. Blacken your Python changes using `Black <https://pypi.org/project/black/>`__.
es: Para estos scripts y el sistema de construcción SCons de Godot, seguimos la `guía de estilo de Black <https://github.com/psf/black#the-black-code-style>`__. Utiliza `Black <https://pypi.org/project/black/>`__ para formatear automáticamente tus cambios en Python.
fr: Pour ceux-là, nous suivons le `Guide du style Black <https://github.com/psf/black#the-black-code-style>`__. Noircissez vos changements Python en utilisant `Black <https://pypi.org/project/black/>`__.
zh_cn: 对于这些, 我们遵循 `黑色风格指南 <https://github.com/psf/black#the-黑色代码样式>`__ . 使用 `Black使Python 更改变黑 <https://pypi.org/project/black/>`__ .
zh_tw: 這些檔案，我們遵守 `Black style guide <https://github.com/psf/black#the-black-code-style>`__ 。請使用 `Black <https://pypi.org/project/black/>`__ 來黑化你的 Python 程式碼。

source: Using black locally
es: Usando black localmente
fr: Utiliser black localement
zh_cn: 本地使用 black
zh_tw: 在本機上使用 Black

source: First of all, you will need to install Black. Black requires Python 3.7+ to run.
zh_cn: 首先你需要安装 Black。Black 需要 Python 3.7+ 才能运行。
zh_tw: 首先，必須要先安裝 Black。要執行 Black 需要至少 Python 3.6.0+。

source: Here's how to install black:
es: He aquí cómo instalar negro:
fr: Voici comment installer black :
zh_cn: 下面介绍如何安装black:
zh_tw: 安裝 Black：

source: You then have different possibilities to apply black to your changes:
es: Luego, tienes diferentes posibilidades para aplicar Black a tus cambios:
fr: Vous avez alors différentes possibilités pour appliquer black à vos modifications :
zh_cn: 然后, 你有不同的可能性将黑色应用于你的更改:
zh_tw: 接著有幾種方式可以將 Black 套用至修改上：

source: You can apply ``black`` manually to one or more files with the following command:
es: Puedes aplicar ``black`` manualmente a uno o más archivos con el siguiente comando:
fr: Vous pouvez appliquer manuellement ``black`` à un ou plusieurs fichiers avec la commande suivante :
zh_cn: 你可以使用以下命令将 ``black`` 手动应用于一个或多个文件:
zh_tw: 可以使用下列指令手動套用 ``black`` 至一個或多個檔案：

source: ``-l 120`` means that the allowed number of characters per line is 120. This number was agreed upon by the developers.
es: ``-l 120`` significa que el número permitido de caracteres por línea es 120. Este número fue acordado por los desarrolladores.
fr: ``-l 120`` signifie que le nombre de caractères autorisés par ligne est de 120. Ce nombre a été convenu par les développeurs.
zh_cn: ``-l 120`` 表示每行允许的字符数为 120。这个数字是经过开发者们商定的。
zh_tw: ``-l 120`` 表示每行最多允許 120 個字元。這個數字是由多位開發人員公認的。

source: The path can point to several files, either one after the other or using wildcards like in a typical Unix shell.
es: La ruta puede apuntar a varios archivos, ya sea uno tras otro o usando comodines como en una típica terminal Unix.
fr: Le chemin peut pointer vers plusieurs fichiers, soit l'un après l'autre, soit en utilisant des wildcards comme dans un shell Unix typique.
zh_cn: 该路径可以指向多个文件, 可以一个接一个, 也可以像典型的unixshell一样使用通配符.
zh_tw: 路徑可以指向多個檔案，可以直接寫出多個檔案，或是使用如一般 Unix Shell 的萬用字元。

source: For ease of use, we provide a pre-commit hook for Git that will run black automatically on all your commits to check them, and let you apply its changes in the final commit.
es: Para facilitar el uso, proporcionamos un "pre-commit hook" para Git que ejecutará black automáticamente en todos tus commits para verificarlos y te permitirá aplicar sus cambios en el commit final.
fr: Pour faciliter l'utilisation, nous fournissons un pre-commit hook pour Git qui exécutera automatiquement black sur tous vos commits pour les vérifier, et vous permettra d'appliquer ses changements dans le commit final.
zh_cn: 为了便于使用, 我们为Git提供了一个预提交钩子, 它将在你的所有提交上自动运行以检查你的提交, 并让你在最终提交中应用其更改.
zh_tw: 為了簡化使用，我們也提供了用於 Git 的 Pre-commit Hook，會在所有 Commit 上自動執行 Black，並允許將這些修改套用至最終的 Commit 上。

source: This "hook" is a script which can be found in ``misc/hooks``. Refer to that folder's ``README.md`` for installation instructions.
es: Este "hook" es un script que se puede encontrar en ``misc/hooks``. Consulta el archivo ``README.md`` de esa carpeta para obtener instrucciones de instalación.
fr: Ce "hook" est un script qui peut être trouvé dans ``misc/hooks``, reportez-vous au ``README.md`` de ce dossier pour les instructions d'installation.
zh_cn: 这个 "hook" 是一个脚本, 可以在 ``misc/hooks`` 中找到. 请参考该文件夹的 ``README.md`` , 了解安装说明.
zh_tw: 該「hook」是放在 ``misc/hooks`` 內的一個腳本檔。請參考該資料夾中的 ``README.md`` 以瞭解安裝說明。

source: Editor integration
es: Integración del editor
fr: Intégration à l'éditeur
zh_cn: 编辑器集成
zh_tw: 編輯器整合

source: Comment style guide
es: Guía de estilo para comentarios
fr: Guide de style pour les commentaires
zh_cn: 注释风格指南
zh_tw: C# 風格指南

source: This comment style guide applies to all programming languages used within Godot's codebase.
es: Esta guía de estilo de comentarios se aplica a todos los lenguajes de programación utilizados dentro del código base de Godot.
fr: Ce guide de style de commentaires s'applique à tous les langages de programmation utilisés dans la base de code de Godot.
zh_cn: 本注释风格指南适用于Godot代码库中使用的所有编程语言.
zh_tw: 本注釋風格指南適用於Godot程式碼庫中使用的所有程式設計語言.

source: Begin comments with a space character to distinguish them from disabled code.
es: Comienza los comentarios con un espacio para distinguirlos del código deshabilitado.
fr: Commencez les commentaires par un caractère espace pour les distinguer du code désactivé.
zh_cn: 以空间字符开始注释, 以将其与禁用代码区分开来.
zh_tw: 以空間字元開始注釋, 以將其與禁用程式碼區分開來.

source: Use sentence case for comments. Begin comments with an uppercase character and always end them with a period.
es: Usa mayúscula inicial en los comentarios (sentence case). Comienza los comentarios con un carácter en mayúscula y siempre termínalos con un punto.
fr: Utilisez la casse pour les commentaires. Commencez vos commentaires par une majuscule et terminez-les toujours par un point.
zh_cn: 注释使用句子大小写. 注释以大写字母开头, 并始终以句号结束.
zh_tw: 注釋使用句子大小寫. 注釋以大寫字母開頭, 並始終以句號結束.

source: Reference variable/function names and values using backticks.
es: Haz referencia a los nombres de variables y funciones, así como a los valores, utilizando comillas invertidas (backticks).
fr: Référencez les noms et les valeurs des variables/fonctions en utilisant des backticks.
zh_cn: 使用反引号引用变量和函数名和值.
zh_tw: 使用反引號引用變數和函式名和值.

source: Wrap comments to ~100 characters.
es: Agrupa los comentarios en aproximadamente 100 caracteres.
fr: Limitez les commentaires à ~100 caractères.
zh_cn: 将注释控制在~100个字符。
zh_tw: 將注釋控制在~100個字元。

source: You can use ``TODO:``, ``FIXME:``, ``NOTE:``, or ``HACK:`` as admonitions when needed.
zh_tw: 你可以在需要的時候使用 ``TODO:`` , ``FIXME:`` , ``NOTE:`` , ``HACK:`` 作為強調.

source: **Example:**
es: **Ejemplo:**
fr: **Exemple :**
zh_cn: **示例:**
zh_tw: **範例**

source: Don't repeat what the code says in a comment. Explain the *why* rather than *how*.
es: No repitas lo que el código ya dice en un comentario. Explica el *por qué* en lugar del *cómo*.
fr: Ne répétez pas ce que dit le code dans un commentaire. Expliquez le *pourquoi* plutôt que *comment*.
zh_cn: 不要在注释中重复代码的内容. 解释 *为什么* 而不是 *如何* .
zh_tw: 不要在注釋中重複程式碼的內容. 解釋 *為什麼* 而不是 *如何* .

source: **Bad:**
es: **Mal:**
fr: **Mauvais :**
zh_cn: **错误做法：**
zh_tw: **錯誤例** :

source: You can use Javadoc-style comments above function or macro definitions. It's recommended to use Javadoc-style comments *only* for methods which are not exposed to scripting. This is because exposed methods should be documented in the :ref:`class reference XML <doc_updating_the_class_reference>` instead.
es: Puedes usar comentarios con estilo Javadoc encima de definiciones de funciones o macros. Se recomienda usar comentarios con estilo Javadoc *únicamente* para métodos que no están expuestos a la secuencia de comandos (scripting). Esto se debe a que los métodos expuestos deben documentarse en la :ref:`referencia de clase XML <doc_updating_the_class_reference>` en su lugar.
fr: Vous pouvez utiliser des commentaires de style Javadoc au-dessus des définitions de fonctions ou de macros. Il est recommandé d'utiliser les commentaires de style Javadoc *seulement* pour les méthodes qui ne sont pas exposées aux scripts. En effet, les méthodes exposées doivent être documentées dans la référence XML :ref:`class <doc_updating_the_class_reference>` à la place.
zh_cn: 你可以在函数或宏定义上面使用Javadoc风格的注释. 建议只对不公开给脚本的方法使用Javadoc风格的注释. 这是因为公开的方法应该在 :ref:`class reference XML <doc_updating_the_class_reference>` 中进行记录.
zh_tw: 你可以在函式或巨集定義上面使用Javadoc風格的注釋. 建議只對不公開給腳本的方法使用Javadoc風格的注釋. 這是因為公開的方法應該在 :ref:`class reference XML <doc_updating_the_class_reference>` 中進行記錄.

source: For member variables, don't use Javadoc-style comments but use single-line comments instead:
es: Para variables miembro, no uses comentarios con estilo Javadoc, en su lugar, utiliza comentarios de una sola línea:
fr: Pour les variables membres, n'utilisez pas de commentaires de type Javadoc mais plutôt des commentaires d'une seule ligne :
zh_cn: 对于成员变量, 不要使用Javadoc式的注释, 而是使用单行注释:
zh_tw: 對於成員變數, 不要使用Javadoc式的注釋, 而是使用單行注釋:

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: Pre-commit hook
es: Gancho Pre-commit
fr: Crochet de pré commit
zh_cn: 预提交钩子
