Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_meshes.po
Languages: de, es, fr, ja, pt_br, ru, uk, zh_cn

source: 2D meshes
es: Mallas 2D
fr: maillages 2D
ja: 2Dメッシュ
pt_br: Malhas 2D
ru: 2D-сетки
uk: 2D меші (сітки)
zh_cn: 2D 网格

source: Introduction
de: Einführung
es: Introducción
ja: はじめに
pt_br: Introdução
ru: Введение
uk: Вступ
zh_cn: 前言

source: In 3D, meshes are used to display the world. In 2D, they are rare as images are used more often. Godot's 2D engine is a pure two-dimensional engine, so it can't really display 3D meshes directly (although it can be done via ``Viewport`` and ``ViewportTexture``).
de: In 3D werden Meshes verwendet um die Welt anzuzeigen. In 2D sind sie selten, da häufiger Bilder verwendet werden. Die 2D-Engine von Godot ist eine reine zweidimensionale Engine, sodass 3D-Meshes nicht direkt angezeigt werden können (obwohl dies über ``Viewport`` und ``ViewportTexture`` möglich ist).
es: En 3D, las mallas son usadas para mostrar el mundo, en 2D son raras porque las imágenes son más usadas. El motor 2D de Godot es un motor de dos dimensiones puro, así que no se pueden mostrar mallas 3D directamente (aunque se puede lograr mediante un ``Viewport`` y ``ViewportTexture``).
fr: En 3D, les maillages sont utilisés pour afficher le monde. En 2D, ils sont rares car les images sont plus souvent utilisées. Le moteur 2D de Godot est un moteur purement bidimensionnel, donc il ne peut pas vraiment afficher directement les maillages 3D (bien que cela puisse être fait via ``Viewport`` et ``ViewportTexture``).
pt_br: Em 3D, as malhas são usadas para exibir o mundo. Em 2D, eles são raros, pois as imagens são usadas com mais frequência. A engine 2D do Godot é uma engine bidimensional pura, então ela não pode realmente exibir malhas 3D diretamente (embora isso possa ser feito via ``Viewport`` e ``ViewportTexture``).
ru: В 3D сетки используются для отображения мира. В 2D они редки, так как изображения используются намного чаще. 2D движёк в Godot полностью двухмерен, поэтому он не может отображать 3D сетки напрямую (но это можно сделать используя ``Viewport`` и ``ViewportTexture``).
uk: У 3D меші використовуються для відображення світу. У 2D вони рідкісні, оскільки зображення використовуються частіше. 2D рушій Godot є чистим двовимірним, тому, насправді, він не може відображати 3D меші безпосередньо (хоча це можна зробити за допомогою ``Viewport`` і ``ViewportTexture``).
zh_cn: 在 3D 中，网格用于显示世界。在 2D 中它们不常见，因为图片使用得更频繁。Godot 的 2D 部分是一个纯 2D 引擎，因此它不能直接显示 3D 网格（尽管它可以通过 ``Viewport`` 和 ``ViewportTexture`` 来实现）。

source: If you are interested in displaying 3D meshes on a 2D viewport, see the :ref:`doc_viewport_as_texture` tutorial.
de: Wenn Sie 3D-Meshes in einem 2D-Ansichtsfenster anzeigen möchten, lesen Sie die Anleitung :ref:`doc_viewport_as_texture`.
es: Si quieres mostrar meshes 3D en un viewport 2D, revisa el tutorial :ref:`doc_viewport_as_texture`.
fr: Si vous êtes intéressé par l'affichage de maillages 3D sur une vue 2D, consultez le tutoriel :ref:`doc_viewport_as_texture`.
ja: 3Dメッシュを2Dビューポートに表示する方法については、 チュートリアルの \ :ref:`doc_viewport_as_texture` を参照してください。
pt_br: Se você estiver interessado em exibir malhas 3D em uma janela de exibição 2D, consulte o tutorial :ref:`doc_viewport_as_texture`.
ru: Если вас интересует отображение 3D сеток в 2D режиме, смотрите уроки :ref:`doc_viewport_as_texture`.
uk: Якщо ви зацікавлені в відображенні 3D моделей у 2D режимі, перегляньте посібник з :ref:`doc_viewport_as_texture`.
zh_cn: 如果你对在二维视口上显示三维网格感兴趣, 请参见 :ref:`doc_viewport_as_texture` 教程.

source: 2D meshes are meshes that contain two-dimensional geometry (Z can be omitted or ignored) instead of 3D. You can experiment creating them yourself using ``SurfaceTool`` from code and displaying them in a ``MeshInstance2D`` node.
de: 2D-Meshes enthalten anstelle von 3D eine zweidimensionale Geometrie (Z kann weggelassen oder ignoriert werden). Sie können ausprobieren selbst welche mittels ``SurfaceTool`` aus Code zu erstellen und in einem ``MeshInstance2D``-Knoten anzeigen.
es: Las mallas 2D son mallas que contienen una geometría bidimensional (Z puede ser omitido o ignorado) en lugar de 3D. Puedes experimentar creándolas con ``SurfaceTool`` desde código y mostrándolas en un nodo ``MeshInstance2D``.
fr: Les maillages 2D sont des maillages qui contiennent une géométrie bidimensionnelle (Z peut être omis ou ignoré) au lieu de 3D. Vous pouvez expérimenter de les créer vous-même en utilisant ``SurfaceTool`` à partir du code et les afficher dans un nœud ``MeshInstance2D``.
pt_br: As malhas 2D são malhas que contêm geometria bidimensional (Z pode ser omitido ou ignorado) em vez de 3D. Você pode experimentar criá-los usando ``SurfaceTool`` a partir de código e exibi-los em um nó ``MeshInstance2D``.
ru: 2D-сетки - это сетки, которые содержат двумерную геометрию (Z можно опустить или игнорировать) вместо 3D. Вы можете поэкспериментировать, создав их самостоятельно с помощью ``SurfaceTool`` из кода и отобразив их в узле ``MeshInstance2D``.
uk: 2D меші містять двовимірну геометрію (Z можна пропустити, або проігнорувати) замість 3D. Ви можете експериментувати, створюючи їх самостійно, використовуючи ``SurfaceTool`` у коді і відображаючи їх у вузлі ``MeshInstance2D``.
zh_cn: 2D 网格是包含二维几何（Z 轴可以省略或忽略）而不是三维几何的网格。你可以尝试使用代码中的 ``SurfaceTool`` 创建它们，并在 ``MeshInstance2D`` 节点中显示它们。

source: Currently, the only way to generate a 2D mesh within the editor is by either importing an OBJ file as a mesh, or converting it from a Sprite2D.
zh_cn: 目前，在编辑器中生成 2D 网格的唯一方法是导入 OBJ 文件作为网格，或者从 Sprite2D 转换而来。

source: Optimizing pixels drawn
de: Pixelrendering optimieren
es: Optimizando los píxeles dibujados
fr: Optimisation des pixels dessinés
ja: 描画するピクセルの最適化
pt_br: Otimizando pixels desenhados
ru: Оптимизация нарисованного изображения
uk: Оптимізація намальованих пікселів
zh_cn: 优化绘制的像素

source: This workflow is useful for optimizing 2D drawing in some situations. When drawing large images with transparency, Godot will draw the whole quad to the screen. The large transparent areas will still be drawn.
de: Dieser Arbeitsablauf ist in einigen Situationen nützlich um das 2D-Zeichnen zu optimieren. Wenn Sie große transparente Bilder zeichnen, zeichnet Godot das gesamte Quadrat auf den Bildschirm. Die großen transparenten Bereiche werden weiterhin gezeichnet.
es: Este modo de trabajo es útil para optimizar el dibujado 2D en algunas situaciones. Cuando se dibujan imágenes grandes con transparencia, Godot dibujará todo el quad en pantalla. El área transparente también será dibujada.
fr: Ce flux de travail est utile pour optimiser le dessin 2D dans certaines situations. Lorsque vous dessinez de grandes images avec transparence, Godot va dessiner tout le quadrant à l'écran. Les grandes surfaces transparentes seront toujours dessinées.
ja: このワークフローは、2D図面を最適化する場合に便利です。大きなイメージを透明で描画する場合、Godotは四角形全体を画面に描画します。大きな透明領域は描画されます。
pt_br: Este fluxo de trabalho é útil para otimizar o desenho 2D em algumas situações. Ao desenhar imagens grandes com transparência, Godot desenha todo o quad para a tela. As grandes áreas transparentes ainda serão desenhadas.
ru: Этот рабочий процесс полезен для оптимизации 2D-изображений в некоторых ситуациях. При отображении больших картинок с прозрачностью Godot будет рисовать на экране изображение полностью. И большие прозрачные области все равно будут нарисованы.
uk: Цей робочий процес корисний для оптимізації 2D малювання в деяких ситуаціях. При малюванні великих зображень з прозорістю Godot намалює весь квадрат на екрані. Великі прозорі ділянки все одно будуть намальовані.
zh_cn: 在某些情况下, 这个工作流程对于优化二维绘图比较有用. 当绘制具有透明度的大型图像时,Godot将把整个四方形(quad)绘制到屏幕上. 大片的透明区域还是会被绘制.

source: This can affect performance, especially on mobile devices, when drawing very large images (generally screen sized), or layering multiple images on top of each other with large transparent areas (for example, when using ``ParallaxBackground``).
de: Dies kann die Leistung beeinträchtigen, insbesondere auf mobilen Geräten, wenn sehr große Bilder (generell bei Anzeige in Bildschirmgröße) gezeichnet oder mehrere Bilder mit großen transparenten Bereichen übereinander gelegt werden (z. B. bei Verwendung von ``ParallaxBackground``).
es: Esto puede afectar el desempeño, especialmente en dispositivos móviles, cuando se dibujan imágenes grandes generalmente de tamaño de la pantalla), o se superponen muchas imágenes con grandes áreas transparentes (por ejemplo cuando se utiliza ``ParallaxBackground``).
fr: Cela peut affecter les performances, en particulier sur les appareils mobiles, lorsque vous dessinez de très grandes images (généralement de la taille d'un écran) ou lorsque vous superposez plusieurs images les unes sur les autres avec de grandes zones transparentes (par exemple, lorsque vous utilisez "ParallaxBackground").
ja: ただし、非常に大きな画像(通常は画面サイズ)を描画するとき、または大きな透明領域を使用して複数の画像を重ね合わせるとき(特に ``ParallaxBackground`` を使用するとき)、特にモバイルデバイスでパフォーマンスに影響を与える可能性があります。
pt_br: Isso pode afetar o desempenho, especialmente em dispositivos móveis, ao desenhar imagens muito grandes (geralmente do tamanho da tela) ou colocar várias imagens umas sobre as outras com grandes áreas transparentes (por exemplo, ao usar ``ParallaxBackground``).
ru: Это может повлиять на производительность, особенно на мобильных устройствах, при рисовании очень больших изображений (размером с экран), или наложении нескольких изображений друг на друга с большими прозрачными областями (например, при использовании `ParallaxBackground`).
uk: Це може вплинути на продуктивність, особливо на мобільних пристроях, при малюванні дуже великих зображень (як правило, з розмір екрану), або нашаруванні декількох зображень один на одного з великими прозорими областями (наприклад, при використанні ``ParallaxBackground``).
zh_cn: 如果绘制非常大的图像时（大概屏幕大小），或者将多个有大透明区域的图像叠加在一起（例如使用 ``ParallaxBackground`` 时），这会影响性能，尤其是在移动设备上。

source: Converting to a mesh will ensure that only the opaque parts will be drawn and the rest will be ignored.
de: Das Konvertieren in ein Netz stellt sicher, dass nur die undurchsichtigen Teile gezeichnet und der Rest ignoriert wird.
es: Convertir a malla asegura que sólo las áreas opacas se dibujarán y el resto será ignorado.
fr: La conversion en maillage garantit que seules les parties opaques seront dessinées et que le reste sera ignoré.
ja: メッシュに変換すると、不透明な部分だけが描画され、残りは無視されます。
pt_br: A conversão para uma malha garantirá que apenas as partes opacas serão desenhadas e o restante será ignorado.
ru: Конвертирование в сетку гарантирует, что только непрозрачные части будут нарисованы, а остальные проигнорированы.
uk: Перетворення в меш гарантує, що тільки непрозорі частини будуть малюватися, а інші будуть проігноровані.
zh_cn: 转换成网格能确保只绘制不透明部分, 其余部分被忽略.

source: Converting Sprite2Ds to 2D meshes
zh_cn: 将 Sprite2D 转换为 2D 网格

source: You can take advantage of this optimization by converting a ``Sprite2D`` to a ``MeshInstance2D``. Start with an image that contains large amounts of transparency on the edges, like this tree:
zh_cn: 你可以通过把 ``Sprite2D`` 转换为 ``MeshInstance2D`` 的方法来利用这种优化。从边缘有大量透明的图片开始，就像这棵树：

source: Put it in a ``Sprite2D`` and select "Convert to 2D Mesh" from the menu:
zh_cn: 把它放到一个 ``Sprite2D`` 中，从菜单选择“转换为 2D 网格”：

source: A dialog will appear, showing a preview of how the 2D mesh will be created:
de: Ein Dialogfeld wird angezeigt mit einer Vorschau des 2D-Mesh:
es: Un diálogo aparecerá, mostrando una previsualización de cómo será creada la malla 2D:
fr: Une boîte de dialogue apparaîtra, montrant un aperçu de la façon dont le maillage 2D sera créé :
ja: ダイアログが表示され、2Dメッシュの作成方法のプレビューが表示されます:
pt_br: Uma caixa de diálogo será exibida, mostrando uma visualização de como a malha 2D será criada:
ru: Появится диалоговое окно, показывающее предварительный просмотр того, как будет выглядеть 2D сетка:
uk: З'явиться діалогове вікно з попереднім переглядом того, який 2D меш буде створено:
zh_cn: 会出现一个对话框, 显示将要创建的二维网格预览:

source: The default values are good enough for many cases, but you can change growth and simplification according to your needs:
de: Die Standardwerte sind für viele Fälle gut genug, aber Sie können Wachstum und Vereinfachung entsprechend Ihren Anforderungen ändern:
es: Los valores por defecto suelen estar bien para muchos casos, pero puedes cambiar el crecimiento y simplificación de acuerdo a tus necesidades:
fr: Les valeurs par défaut sont suffisantes dans de nombreux cas, mais vous pouvez modifier la croissance et la simplification en fonction de vos besoins :
ja: 大体の場合はデフォルト値で十分ですが、必要に応じて拡大(growth)や単純化(simplification)を変更できます:
pt_br: Os valores padrão são bem bons para muitos casos, mas você pode alterar o crescimento e a simplificação de acordo com suas necessidades:
ru: Значения по умолчанию достаточно хороши для многих случаев, но вы можете изменить "Рост" и "Упрощение" в соответствии с вашими потребностями:
uk: Значення за замовчуванням гарно підходять для багатьох випадків, але ви можете змінити зростання (growth) та спрощення (simplification) відповідно до ваших потреб:
zh_cn: 很多情况下, 默认值已经足够好, 但是你可以根据需要改变growth(增长)和simplication(简化):

source: Finally, push the ``Convert 2D Mesh`` button and your Sprite2D will be replaced:
zh_cn: 最后，按下 ``转换 2D 网格`` 按钮，你的 Sprite2D 将被替换：

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
pt_br: Progresso da Tradução
ru: Статус перевода
uk: Стан перекладу
zh_cn: 翻译状态

source: Currently, the only way to generate a 2D mesh within the editor is by either importing an OBJ file as a mesh, or converting it from a Sprite.
ja: 現在、エディタ内で2Dメッシュを生成する唯一の方法は、OBJファイルをメッシュとしてインポートするか、それをSpriteから変換することです。

source: Converting Sprites to 2D meshes
ja: スプライトを2Dメッシュに変換

source: You can take advantage of this optimization by converting a ``Sprite`` to a ``MeshInstance2D``. Start with an image that contains large amounts of transparency on the edges, like this tree:
ja: ``Sprite`` を ``MeshInstance2D`` に変換することでこの最適化を利用できます。下記の木の画像のように、端に大量の透過部分を含む画像から始めます:

source: Put it in a ``Sprite`` and select "Convert to 2D Mesh" from the menu:
ja: それを\ ``Sprite``\ に入れて、メニューから "Convert to 2D Mesh" を選択してください:

source: Finally, push the ``Convert 2D Mesh`` button and your Sprite will be replaced:
ja: 最後に、 ``Convert 2D Mesh`` を押すとSpriteが置き換えられます:
