Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/2d/2d_transforms.po
Languages: de, fr, ja, pt_br, zh_cn

source: Viewport and canvas transforms
de: Ansichtsfenster und Canvas Transformationen
fr: Modifications de la fenêtre d'affichage et du canevas
ja: Viewportおよびキャンバスの幾何学変換
pt_br: Transformações de janela de exibição e tela
zh_cn: Viewport(视口)和画布变换

source: Introduction
de: Einführung
ja: はじめに
pt_br: Introdução
zh_cn: 简介

source: This is an overview of the 2D transforms going on for nodes from the moment they draw their content locally to the time they are drawn onto the screen. This overview discusses very low level details of the engine.
de: Dies ist eine Übersicht über die 2D-Transformationen, die für Nodes vom Zeitpunkt des lokalen Zeichnens ihres Inhalts bis zum Zeitpunkt des Zeichnens auf dem Bildschirm ausgeführt werden. In dieser Übersicht werden grundlegende Details des Engine erläutert.
fr: Ceci est une vue d'ensemble des transformations 2D qui ont lieu pour les nœuds, depuis le moment où ils réalisent leur contenu localement, jusqu'au moment où ils le réalisent à l'écran. Cet aperçu traite des détails très bas niveau du moteur.
ja: ここでは、ノードがコンテンツをローカルに描画してから画面に描画するまでの間に行われる2D幾何学変換の概要について説明します。この概要では、エンジンの非常に低いレベルの詳細について説明します。
pt_br: Esta é uma visão geral das transformações 2D que ocorrem para os nós desde o momento em que eles desenham seu conteúdo localmente até o momento em que são desenhados na tela. Esta visão geral discute detalhes de nível muito baixo do mecanismo.
zh_cn: 本小节概述了节点从绘制本地内容开始到显示到屏幕上结束的过程中的2D变换。 本概述讨论了一些比较低级的的引擎的细节。

source: Canvas transform
de: Canvas Transformationen
fr: Transformation du canevas
ja: キャンバスの幾何学変換
pt_br: Transformação de tela
zh_cn: 画布变换

source: As mentioned in the previous tutorial, :ref:`doc_canvas_layers`, every CanvasItem node (remember that Node2D and Control based nodes use CanvasItem as their common root) will reside in a *Canvas Layer*. Every canvas layer has a transform (translation, rotation, scale, etc.) that can be accessed as a :ref:`Transform2D <class_Transform2D>`.
de: Wie in der vorherigen Anleitung :ref:`doc_canvas_layers` erwähnt, befindet sich jeder CanvasItem-Node in einer *Canvas-Ebene* (denken Sie daran, dass Node2D- und Control-basierte Nodes CanvasItem als gemeinsame Wurzel verwenden). Jede Canvas-Ebene verfügt über eine Transformation (Verschiebung, Drehung, Skalierung usw.), auf die wie folgt zugegriffen werden kann :ref:`Transform2D <class_Transform2D>`.
fr: Comme mentionné dans le tutoriel précédent, ref:`doc_canvas_layers`, tous les nœuds CanvasItem (rappelez-vous que les nœuds basés sur Node2D et Control utilisent CanvasItem comme racine commune), résideront dans un *Calque de canevas*. Chaque couche du canevas a une transformation (translation, rotation, échelle, etc.) accessible en tant que :ref:`Transform2D <class_Transform2D>`.
ja: 前のチュートリアルの \ :ref:`doc_canvas_layers` で説明したように、すべてのCanvasItemノード(Node2DおよびControlベースのノードはCanvasItemを共通のルートとして使用することに注意してください)は*キャンバス・レイヤー*に存在します。 すべてのキャンバス・レイヤーには、 \ :ref:`Transform2D <class_Transform2D>` としてアクセスできる幾何学変換(平行移動、回転、拡大縮小など)があります。
pt_br: Como mencionado no tutorial anterior, :ref:`doc_canvas_layers`, cada nó CanvasItem (lembre-se que os nós baseados em Node2D e Control usam CanvasItem como sua raiz comum) residirão em uma *Canvas Layer*. Cada camada de canvas tem uma transformação (translação, rotação, escala, etc.) que pode ser acessada como :ref:`Transform2D <class_Transform2D>`.
zh_cn: 正如前面教程 :ref:`doc_canvas_layers` 中提到的那样 ，每个CanvasItem节点(要记得Node2D和基于Control的节点使用CanvasItem作为它们的公共根)将驻留在 *CanvasLayer* 中。 每个CanvasLayer都有一个变换(平移，旋转，缩放等)，可以作为 :ref:`Transform2D <class_Transform2D>` 进行访问。

source: Also covered in the previous tutorial, nodes are drawn by default in Layer 0, in the built-in canvas. To put nodes in a different layer, a :ref:`CanvasLayer <class_CanvasLayer>` node can be used.
de: Ebenfalls im vorherigen Kapitel behandelt, werden Nodes standardmäßig in Ebene 0 in der integrierten Zeichenfläche gezeichnet. Um Nodes in einer anderen Ebene zu platzieren, kann ein :ref:`CanvasLayer <class_CanvasLayer>`-Node verwendet werden.
fr: Également abordé dans le didacticiel précédent, les nœuds sont réalisés par défaut dans la couche 0, dans le canevas intégré. Pour placer les nœuds dans une autre couche, vous pouvez utiliser un nœud :ref:`CanvasLayer <class_CanvasLayer>`.
ja: 前のチュートリアルでも説明したように、ノードはデフォルトでレイヤー0の組み込みキャンバスに描画されます。 ノードを別のレイヤーに配置するには、 a \ :ref:`CanvasLayer <class_CanvasLayer>` ノードを使うことができます。
pt_br: Também abordado no tutorial anterior, os nós são desenhados por padrão na Camada 0, na tela embutida. Para colocar nós em uma camada diferente, um nó :ref:`CanvasLayer <class_CanvasLayer>` pode ser usado.
zh_cn: 在上一个教程中也有介绍，默认情况下，节点默认被绘制在第0层中。 要将节点放在不同的层中，可以使用 :ref:`CanvasLayer <class_CanvasLayer>` 节点。

source: Global canvas transform
de: Globale Canvas Transformation
fr: Transformation globale du canevas
ja: グローバル・キャンバスの幾何学変換
pt_br: Transformação global de canvas
zh_cn: 全局画布变换

source: Viewports also have a Global Canvas transform (also a :ref:`Transform2D <class_Transform2D>`). This is the master transform and affects all individual *Canvas Layer* transforms. Generally, this transform is not of much use, but is used in the CanvasItem Editor in Godot's editor.
de: Ansichtsfenster haben auch eine globale Canvas-Transformation (auch eine :ref:`Transform2D <class_Transform2D>`). Dies ist die Master-Transformation und betrifft alle einzelnen *Canvas-Ebenen* -Transformationen. Im Allgemeinen ist diese Transformation nicht sehr nützlich, wird jedoch im CanvasItem-Editor in Godots Editor verwendet.
fr: Les fenêtres d'affichages ont également une transformation globale de canevas (aussi un :ref:`Transform2D <class_Transform2D>`). Il s’agit de la transformation principale qui affecte toutes les transformations *Couche de canevas* individuelles. Généralement, cette transformation n’est pas très utile, mais elle est utilisée dans l’éditeur CanvasItem de l’éditeur Godot.
ja: Viewportにはグローバル・キャンバスの幾何学変換もあります(これも \ :ref:`Transform2D <class_Transform2D>` です)。 これはマスターの幾何学変換であり、すべての個々の *Canvas Layer* の幾何学変換に影響します。通常、この幾何学変換はあまり使用されませんが、GodotのエディタのCanvasItemエディタで使用されます。
zh_cn: Viewport还具有全局画布变换(也是 :ref:`Transform2D <class_Transform2D>` )。 这是一个影响所有单独的 *画布层* 的主变换。 通常这种变换用得不多。它被用在了Godot的编辑器中的画布项编辑器中。

source: Stretch transform
de: Dehnungstransformation
fr: Transformation par étirement
ja: ストレッチ幾何学変換
pt_br: Transformação de alongamento
zh_cn: 拉伸变换

source: Finally, viewports have a *Stretch Transform*, which is used when resizing or stretching the screen. This transform is used internally (as described in :ref:`doc_multiple_resolutions`), but can also be manually set on each viewport.
de: Schließlich verfügen Ansichtsfenster über eine *Dehnungstransformation*, die beim Ändern der Größe oder Strecken des Bildschirms verwendet wird. Diese Transformation wird intern verwendet (wie in :ref:`doc_multiple_resolutions` beschrieben), kann aber auch manuell für jedes Ansichtsfenster festgelegt werden.
fr: Enfin, les fenêtres d'affichages ont une *Transformation par étirement*, utilisée lors du redimensionnement ou de l’étirement de la fenêtre. Cette transformation est utilisée en interne (comme décrit dans :ref:`doc_multiple_resolutions`), mais peut également être définie manuellement dans chaque fenêtre d'affichage.
ja: 最後に、Viewportには*Stretch Transform*があります。これは、画面のサイズ変更やストレッチを行うときに使用されます。 この幾何学変換は( \ :ref:`doc_multiple_resolutions` で説明されているように)内部的に使われますが、各Viewportで手動で設定することもできます。
pt_br: Finalmente, as viewports possuem uma *Stretch Transform*, que é usada ao redimensionar ou esticar a tela. Esta transformação é usada internamente (conforme descrito em :ref:`doc_multiple_resolutions`), mas também pode ser configurada manualmente em cada viewport.
zh_cn: 最后，Viewport有 *拉伸变换* ，用于调整大小或拉伸屏幕。 此变换在内部使用(见 :ref:`doc_multiple_resolutions` )，但也可以在每个Viewport上手动设置。

source: Input events received in the :ref:`MainLoop._input_event() <class_MainLoop_method__input_event>` callback are multiplied by this transform but lack the ones above. To convert InputEvent coordinates to local CanvasItem coordinates, the :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` function was added for convenience.
de: Eingabeereignisse, die im :ref:`MainLoop._input_event() <class_MainLoop_method__input_event>`-Callback empfangen qurden, werden mit dieser Transformation multipliziert, aber es fehlen die oben genannten. Um InputEvent-Koordinaten in lokale CanvasItem-Koordinaten zu konvertieren, wurde der Einfachheit halber die Funktion :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` hinzugefügt.
fr: Les événements d'entrées reçus dans le rappel :ref:`MainLoop._input_event() <class_MainLoop_method__input_event>` sont multipliés par cette transformation, mais ils sont absents de ceux mentionnés plus haut. Pour convertir les coordonnées InputEvent en coordonnées locales CanvasItem, la fonction :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` a été ajoutée pour plus de commodité.
ja: \ :ref:`MainLoop._input_event() <class_MainLoop_method__input_event>` コールバックで受け取った入力イベントは、この変換によって乗算されますが、上記のものはありません。 InputEvent座標をローカルのCanvasItem座標に変換するために、便宜上 \ :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` 関数が追加されました。
zh_cn: 在 :ref:`MainLoop._input_event() <class_MainLoop_method__input_event>` 回调中接收的输入事件上应用了拉伸变换，但没有应用上面那些变换。 为了方便将InputEvent坐标转换为本地画布项坐标，引擎添加了 :ref:`CanvasItem.make_input_local() <class_CanvasItem_method_make_input_local>` 函数。

source: Transform order
de: Transformationsreihenfolge
fr: Ordre de transformation
ja: 変換の順序
pt_br: Ordem de transformação
zh_cn: 变换顺序

source: For a coordinate in CanvasItem local properties to become an actual screen coordinate, the following chain of transforms must be applied:
de: Damit eine Koordinate in den lokalen CanvasItem-Eigenschaften zu einer tatsächlichen Bildschirmkoordinate wird, muss die folgende Transformationskette angewendet werden:
fr: Pour qu'une coordonnée dans les propriétés locales de CanvasItem devienne une coordonnée d'écran réelle, vous devez appliquer la chaîne de transformations suivante :
ja: CanvasItemローカルプロパティの座標を実際の画面座標にするには、次の一連の変換を適用する必要があります:
zh_cn: 要使CanvasItem的本地属性中的坐标成为实际屏幕坐标，必须应用以下一系列变换:

source: Transform functions
de: Transformationsfunktionen
fr: Fonctions de transformation
ja: 変換関数
pt_br: Funções de transformação
zh_cn: 变换函数

source: Obtaining each transform can be achieved with the following functions:
de: Das Ausführen jeder Transformation kann mit den folgenden Funktionen erreicht werden:
fr: L'obtention de chaque transformation peut être réalisée avec les fonctions suivantes :
ja: 各変換を取得するには、次の関数を使用します:
zh_cn: 通过以下函数可以获取各个转换:

source: Type
de: Art
ja: タイプ(型)
zh_cn: 类型

source: Transform
de: Transformation
fr: Transformation
ja: トランスフォーム
zh_cn: 变换

source: CanvasItem
ja: キャンバス・アイテム
zh_cn: CanvasItem(画布项)

source: CanvasLayer
ja: キャンバス・レイヤー
zh_cn: CanvasLayer(画布层)

source: CanvasLayer+GlobalCanvas+Stretch
fr: CanvasLayer+GlobalCanvas+Etirement
ja: キャンバス・レイヤー+グローバル・キャンバス+ストレッチ
zh_cn: CanvasLayer(画布层)+GlobalCanvas(全局画布)+Stretch(拉伸)

source: Finally, then, to convert a CanvasItem local coordinates to screen coordinates, just multiply in the following order:
de: Um die lokalen CanvasItem-Koordinaten in Bildschirmkoordinaten umzuwandeln, multiplizieren Sie sie einfach in der folgenden Reihenfolge:
fr: Enfin, pour convertir les coordonnées locales de CanvasItem en coordonnées d'écran, multipliez-les simplement dans l'ordre suivant :
ja: 最後に、CanvasItemのローカル座標をスクリーン座標に変換するには、次の順序で乗算します:
pt_br: Finalmente, para converter as coordenadas locais de um CanvasItem em coordenadas de tela, basta multiplicar na seguinte ordem:
zh_cn: 那么最后，要将CanvasItem的本地坐标转换为屏幕坐标，只需按以下顺序相乘:

source: Keep in mind, however, that it is generally not desired to work with screen coordinates. The recommended approach is to simply work in Canvas coordinates (``CanvasItem.get_global_transform()``), to allow automatic screen resolution resizing to work properly.
de: Beachten Sie jedoch, dass es im Allgemeinen nicht erwünscht ist, mit Bildschirmkoordinaten zu arbeiten. Der empfohlene Ansatz besteht darin, einfach in Canvas-Koordinaten (``CanvasItem.get_global_transform()``) zu arbeiten, damit die automatische Größenänderung der Bildschirmauflösung ordnungsgemäß funktioniert.
fr: Gardez toutefois à l'esprit qu'il n'est généralement pas souhaitable de travailler avec des coordonnées d'écran. L'approche recommandée consiste à travailler simplement en coordonnées Canvas (``CanvasItem.get_global_transform ()``), pour permettre au redimensionnement automatique de la résolution d'écran de fonctionner correctement.
ja: ただし、通常は画面座標で作業することは望ましくないことに注意してください。推奨される方法は、画面の自動解像度のサイズ変更が正しく機能するように、単純にCanvas座標( ``CanvasItem.get_global_transform()`` )で作業することです。
pt_br: Tenha em mente, no entanto, que geralmente não é desejável trabalhar com coordenadas de tela. A abordagem recomendada é simplesmente trabalhar nas coordenadas do Canvas (``CanvasItem.get_global_transform()``), para permitir que o redimensionamento automático da resolução da tela funcione corretamente.
zh_cn: 但请记住，通常情况最好不要使用屏幕坐标。 推荐的方法是， 仅仅使用画布坐标( ``CanvasItem.get_global_transform()`` )，以保证自动分辨率调整能正常工作。

source: Feeding custom input events
de: Benutzerdefinierte Eingabeereignisse einlesen
fr: Alimentation d'événements d'entrées personnalisés
ja: カスタム入力イベントのフィード
pt_br: Alimentando eventos de entrada personalizados
zh_cn: 提供自定义输入事件

source: It is often desired to feed custom input events to the scene tree. With the above knowledge, to correctly do this, it must be done the following way:
de: Es ist häufig erwünscht, dem Szenenbaum benutzerdefinierte Eingabeereignisse zuzuführen. Mit dem oben genannten Wissen muss dies folgendermaßen geschehen:
fr: Il est souvent souhaitable de transmettre des événements d'entrées personnalisés à l'arborescence de la scène. Avec les connaissances ci-dessus, pour le faire correctement, il faut procéder de la manière suivante :
ja: 多くの場合、カスタム入力イベントをシーンツリーにフィードすることが望まれます。上記の知識をもとに、これを正しく行うには、次のようにしなければなりません:
zh_cn: 通常需要将自定义输入事件提供给场景树。 有了上述知识，要正确地做到这一点，必须通过以下方式完成:

source: Translation status
pt_br: Progresso da Tradução
