Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_second_3d_shader.po
Languages: es, fr, ja, zh_cn

source: Your second 3D shader
es: Tu segundo shader 3D
fr: Votre deuxième shader 3D
zh_cn: 你的第二个 3D 着色器

source: From a high-level, what Godot does is give the user a bunch of parameters that can be optionally set (``AO``, ``SSS_Strength``, ``RIM``, etc.). These parameters correspond to different complex effects (Ambient Occlusion, SubSurface Scattering, Rim Lighting, etc.). When not written to, the code is thrown out before it is compiled and so the shader does not incur the cost of the extra feature. This makes it easy for users to have complex PBR-correct shading, without writing complex shaders. Of course, Godot also allows you to ignore all these parameters and write a fully customized shader.
es: Desde un alto nivel, lo que Godot hace es dar al usuario un montón de parámetros que pueden ser opcionalmente establecidos (``AO``, ``SSS_Strength``, ``RIM``, etc.). Estos parámetros corresponden a diferentes efectos complejos (oclusión ambiental, dispersión de la sub-superficie, iluminación del borde, etc.). Cuando no se escribe, el código se desecha antes de ser compilado y así el shader no incurre en el costo de la característica extra. Esto hace que sea fácil para los usuarios tener un shader complejo y correcto de PBR, sin tener que escribir shaders complejos. Por supuesto, Godot también permite ignorar todos estos parámetros y escribir un shader totalmente personalizado.
fr: Au plus haut niveau, ce que fait Godot, c'est donner à l'utilisateur un tas de paramètres qui peuvent être définis de manière optionnelle (``AO``, ``SSS_Strength``, ``RIM``, etc.). Ces paramètres correspondent à différents effets complexes (Ambient Occlusion, SubSurface Scattering, Rim Lighting, etc.) Lorsqu'il n'est pas écrit, le code est jeté avant d'être compilé et le shader n'encourt donc pas le coût de la fonction supplémentaire. Il est ainsi facile pour les utilisateurs d'avoir des shaders complexes PBR-correct, sans avoir à écrire des shaders complexes. Bien sûr, Godot vous permet également d'ignorer tous ces paramètres et d'écrire un shader entièrement personnalisé.
ja: 高いレベルから、Godotが行うことは、オプションで設定できる一連のパラメーターをユーザーに提供することです(``AO``\ 、\ ``SSS_Strength``\ 、\ ``RIM`` など)。これらのパラメーターは、さまざまな複雑な効果(アンビエントオクルージョン、サブサーフェススキャタリング、リムライティングなど)に対応しています。書き込まれていない場合、コードはコンパイルされる前に破棄されるため、シェーダーは追加機能のコストを負担しません。これにより、ユーザーは複雑なシェーダーを作成せずに、複雑なPBR補正シェーディングを簡単に作成できます。もちろん、Godotではこれらのパラメーターをすべて無視して、完全にカスタマイズされたシェーダーを作成することもできます。
zh_cn: 从高级设置开始,Godot所做的是为用户提供一组可选设置的参数("环境光遮蔽" , "次表面散射强度" , "边缘" 等等)这些参数对应不同的复杂效应(环境遮挡, 次表面散射, 边缘照明等等)如果没有写入, 代码在编译之前被抛出, 因此着色器不会产生额外特性的成本. 这使得用户很容易拥有复杂的支持PBR着色, 而不需要编写复杂的着色器. 当然,Godot还允许你忽略所有这些参数, 并编写一个完全定制的着色器.

source: For a full list of these parameters see the :ref:`spatial shader <doc_spatial_shader>` reference doc.
es: Para una lista completa de estos parámetros ver el documento de referencia :ref:`spatial shader <doc_spatial_shader>`.
fr: Pour une liste complète de ces paramètres, voir le document de référence :ref:`spatial shader <doc_spatial_shader>`.
ja: これらのパラメーターの完全なリストについては、\ :ref:`spatial shader <doc_spatial_shader>` リファレンスドキュメントを参照してください。
zh_cn: 有关这些参数的完整列表, 请参见 :ref:`空间着色器 <doc_spatial_shader>` 参考文档.

source: Your first spatial fragment function
es: Su primera función de fragmento espacial
fr: Votre première fonction fragment spatial
ja: 最初のspatialフラグメント関数
zh_cn: 第一个空间片段函数

source: As mentioned in the previous part of this tutorial. The standard use of the fragment function in Godot is to set up different material properties and let Godot handle the rest. In order to provide even more flexibility, Godot also provides things called render modes. Render modes are set at the top of the shader, directly below ``shader_type``, and they specify what sort of functionality you want the built-in aspects of the shader to have.
es: Como se mencionó en la parte anterior de este tutorial. El uso estándar de la función de fragmento en Godot es establecer diferentes propiedades materiales y dejar que Godot se encargue del resto. Con el fin de proporcionar aún más flexibilidad, Godot también proporciona cosas llamadas modos de representación. Los modos de renderización se establecen en la parte superior del shader, directamente debajo del ``shader_type``, y especifican qué tipo de funcionalidad quieres que tengan los aspectos incorporados del shader.
fr: Comme mentionné dans la partie précédente de ce tutoriel. L'utilisation standard de la fonction fragment dans Godot est de mettre en place différentes propriétés matérielles et de laisser Godot s'occuper du reste. Afin d'offrir encore plus de flexibilité, Godot fournit également des choses appelées modes de rendu. Les modes de rendu sont définis en haut du shader, directement en dessous de ``shader_type``, et ils spécifient le type de fonctionnalité que vous voulez que les aspects intégrés du shader aient.
ja: このチュートリアルの前の部分で述べたように。 Godotのフラグメント関数の標準的な使用法は、さまざまなマテリアルプロパティを設定し、Godotに残りを処理させることです。さらに柔軟性を提供するために、Godotはレンダリングモードと呼ばれるものも提供します。レンダリングモードは、シェーダーの上部、\ ``shader_type`` のすぐ下に設定され、シェーダーのビルトイン要素にどのような機能を持たせるかを指定します。
zh_cn: 如本教程前一部分所述. 在Godot中, 片段函数的标准用法是设置不同的材质属性, 然后让Godot处理剩下的部分. 为了提供更大的灵活性,Godot还提供了渲染模式. 渲染模式设置在着色器的顶部, 直接在 "着色_方式" 下面, 它们指定了你想要着色器的内置方面具有什么样的功能.

source: For example, if you do not want to have lights affect an object, set the render mode to ``unshaded``:
es: Por ejemplo, si no quieres que las luces afecten a un objeto, establece el modo de renderización en ``unshaded``:
fr: Par exemple, si vous ne voulez pas que les lumières affectent un objet, réglez le mode de rendu sur ``unshaded`` :
ja: たとえば、ライトをオブジェクトに影響させたくない場合は、レンダリングモードを ``unshaded`` に設定します:
zh_cn: 例如, 如果你不想让灯光影响一个物体, 设置渲染模式为 "无阴影":

source: You can also stack multiple render modes together. For example, if you want to use toon shading instead of more-realistic PBR shading, set the diffuse mode and specular mode to toon:
es: También puedes apilar varios modos de renderización. Por ejemplo, si quieres usar el toon shading en lugar del shader PBR más realista, establece el modo difuso y el modo especular en toon:
fr: Vous pouvez également empiler plusieurs modes de rendu. Par exemple, si vous voulez utiliser toon au lieu de PBR plus réaliste, réglez le mode diffus et le mode spéculaire sur toon :
ja: 複数のレンダリングモードをスタックすることもできます。たとえば、よりリアルなPBRシェーディングの代わりにトゥーンシェーディングを使用する場合は、拡散モードと鏡面反射モードをトゥーンに設定します:
zh_cn: 你还可以将多个渲染模式堆叠在一起。例如，如果你想使用卡通材质而不是更真实的 PBR 材质，将漫反射模式和镜面反射模式设置为卡通：

source: This model of built-in functionality allows you to write complex custom shaders by changing only a few parameters.
es: Este modelo de funcionalidad incorporada te permite escribir complejos shaders personalizados cambiando sólo unos pocos parámetros.
fr: Ce modèle de fonctionnalité intégrée vous permet d'écrire des shaders personnalisés complexes en ne modifiant que quelques paramètres.
ja: ビルトイン機能のこのモデルを使用すると、いくつかのパラメーターを変更するだけで複雑なカスタムシェーダーを作成できます。
zh_cn: 这个内置功能模型允许你通过更改几个参数来编写复杂的自定义着色器.

source: For a full list of render modes see the :ref:`Spatial shader reference <doc_spatial_shader>`.
es: Para una lista completa de los modos de renderizado, ver :ref:`Spatial shader reference <doc_spatial_shader>`.
fr: Pour une liste complète des modes de rendu, voir le :ref:`Spatial shader reference <doc_spatial_shader>`.
ja: レンダリングモードの完全なリストについては、\ :ref:`Spatialシェーダーリファレンス <doc_spatial_shader>` を参照してください。
zh_cn: 有关渲染模式的完整列表, 请参见空间着色器参考 :ref:`Spatial shader reference <doc_spatial_shader>`.

source: In this part of the tutorial, we will walk through how to take the bumpy terrain from the previous part and turn it into an ocean.
es: En esta parte del tutorial, veremos cómo tomar el terreno accidentado de la parte anterior y convertirlo en un océano.
fr: Dans cette partie du tutoriel, nous allons voir comment prendre le terrain bosselé de la partie précédente et le transformer en océan.
ja: チュートリアルのこの部分では、前の部分からでこぼこの地形を取り、海に変える方法を説明します。
zh_cn: 在本教程的这一部分中, 我们将介绍如何将前一部分的崎岖地形变成海洋.

source: First let's set the color of the water. We do that by setting ``ALBEDO``.
es: Primero fijemos el color del agua. Lo hacemos poniendo ``ALBEDO``.
fr: Commençons par définir la couleur de l'eau. Nous le faisons en définissant ``ALBEDO``.
ja: まず、水の色を設定しましょう。これを行うには、\ ``ALBEDO``を設定します。
zh_cn: 首先让我们设置水的颜色. 我们通过设置 ``ALBEDO`` 来做到这一点.

source: ``ALBEDO`` is a ``vec3`` that contains the color of the object.
es: ``ALBEDO`` es un ``vec3`` que contiene el color del objeto.
fr: ``ALBEDO`` est un ``vec3`` qui contient la couleur de l'objet.
ja: ``ALBEDO`` はオブジェクトの色を含む ``vec3`` です。
zh_cn: ``ALBEDO`` 是一个 ``vec3`` , 包含物体的颜色.

source: Let's set it to a nice shade of blue.
es: Pongámoslo en un bonito tono de azul.
fr: Mettons une belle nuance de bleu.
ja: 青の素敵な色合いに設定してみましょう。
zh_cn: 我们把它调成蓝色.

source: We set it to a very dark shade of blue because most of the blueness of the water will come from reflections from the sky.
es: Lo pusimos en un tono azul muy oscuro porque la mayor parte del azul del agua vendrá de los reflejos del cielo.
fr: Nous l'avons réglé sur une teinte de bleu très sombre car la plus grande partie du bleu de l'eau proviendra des reflets du ciel.
ja: 水の青さのほとんどは空からの反射から来るため、非常に暗い青に設定しました。
zh_cn: 我们将其设置为深蓝色, 因为水的大部分蓝色来自天空的反射.

source: The PBR model that Godot uses relies on two main parameters: ``METALLIC`` and ``ROUGHNESS``.
es: El modelo de PBR que Godot utiliza se basa en dos parámetros principales: ``METALLIC`` y ``ROUGHNESS``.
fr: Le modèle de PBR que Godot utilise repose sur deux paramètres principaux : ``METALLIC`` et ``ROUGHNESS``.
ja: Godotが使用するPBRモデルは、\ ``METALLIC`` と ``ROUGHNESS`` の2つの主要なパラメーターに依存しています。
zh_cn: PBR模型的Godot用户两个主要参数:"金属度" 和 "粗糙度".

source: ``ROUGHNESS`` specifies how smooth/rough the surface of a material is. A low ``ROUGHNESS`` will make a material appear like a shiny plastic, while a high roughness makes the material appear more solid in color.
es: ``ROUGHNESS`` especifica cuan suave es la superficie de un material. Una baja ``ROUGHNESS`` hará que un material parezca un plástico brillante, mientras que una alta rugosidad hace que el material parezca más sólido en color.
fr: Le terme ``ROUGHNESS`` indique le degré de lissage ou de rugosité de la surface d'un matériau. Une faible ``ROUGHNESS`` fait apparaître un matériau comme un plastique brillant, tandis qu'une forte rugosité fait apparaître un matériau de couleur plus solide.
ja: ``ROUGHNESS``は、材料の表面の滑らかさ/粗さを指定します。\ ``ROUGHNESS`` が低いと、素材は光沢のあるプラスチックのように見えますが、粗さが大きいと、素材の色はより均一になります。
zh_cn: 粗糙度是指材料表面的光滑程度. 低 "粗糙度" 会使材料看起来像闪亮的塑料, 而高粗糙度使材料在颜色上看起来更坚实.

source: ``METALLIC`` specifies how much like a metal the object is. It is better set close to ``0`` or ``1``. Think of ``METALLIC`` as changing the balance between the reflection and the ``ALBEDO`` color. A high ``METALLIC`` almost ignores ``ALBEDO`` altogether, and looks like a mirror of the sky. While a low ``METALLIC`` has a more equal representation of sky color and ``ALBEDO`` color.
es: ``METALLIC`` especifica cuánto se parece el objeto a un metal. Es mejor ponerlo cerca de ``0`` o ``1``. Piensa en ``METALLIC`` como un cambio en el balance entre el reflejo y el color ``ALBEDO``. Un alto ``METALLIC`` casi ignora al ``ALBEDO`` por completo, y se ve como un espejo del cielo. Mientras que un ``METALLIC`` bajo tiene una representación más igualitaria del color del cielo y el ``ALBEDO`` color.
fr: Le terme ``METALLIC`` indique à quel point l'objet ressemble à un métal. Il est préférable qu'il soit proche de ``0`` ou ``1``. Pensez que le ``METALLIC`` modifie l'équilibre entre le reflet et la couleur ``ALBEDO``. Un haut ``METALLIC`` ignore presque complètement ``ALBEDO`` et ressemble à un miroir du ciel. Alors qu'un ``METALLIC`` bas a une représentation plus égale de la couleur du ciel et de la couleur ``ALBEDO``.
ja: ``METALLIC`` は、オブジェクトが金属にどれだけ似ているかを指定します。\ ``0`` または ``1`` の近くに設定することをお勧めします。\ ``METALLIC`` は、反射と ``ALBEDO`` カラーのバランスを変えるものと考えてください。高い ``METALLIC`` は ``ALBEDO`` をほとんど無視し、空を映す鏡のように見えます。低い ``METALLIC`` では、空の色と `` ALBEDO`` の色がより均等に表現されます。
zh_cn: ``METALLIC`` 指定该物体有多像金属, 它最好设置为接近 ``0`` 或 ``1`` . 把 ``METALLIC`` 看作是改变反射和 ``ALBEDO`` 颜色之间的平衡. 高的 ``METALLIC`` 几乎完全忽略了 ``ALBEDO`` , 看起来像天空的镜子. 而低的 ``METALLIC`` 对天空的颜色和 ``ALBEDO`` 的颜色有一个更平实的表现.

source: ``ROUGHNESS`` increases from ``0`` to ``1`` from left to right while ``METALLIC`` increase from ``0`` to ``1`` from top to bottom.
es: ``ROUGHNESS`` aumenta de ``0`` a ``1`` de izquierda a derecha mientras que ``METALLIC`` aumenta de ``0`` a ``1`` de arriba a abajo.
fr: ``ROUGHNESS`` passe de ``0`` à ``1`` de gauche à droite, tandis que la ``METALLIC`` passe de ``0`` à ``1`` de haut en bas.
ja: ``ROUGHNESS`` は左から右に ``0`` から ``1`` に増加し、\ ``METALLIC`` は上から下に ``0`` から ``1`` に増加します。
zh_cn: "粗糙度" 从左到右从0增加到1, 而 "金属度" 从上到下从0增加到1.

source: ``METALLIC`` should be close to ``0`` or ``1`` for proper PBR shading. Only set it between them for blending between materials.
es: ``METALLIC`` debería estar cerca de ``0`` o ``1`` para un buen shader PBR. Sólo lo ponemos entre ellos para mezclar los materiales.
fr: ``METALLIC`` devrait être proche de ``0`` ou ``1`` pour un shading PBR correct. Il ne doit être placé entre eux que pour les mélanges entre matériaux.
ja: 適切なPBRシェーディングを行うには、\ ``METALLIC`` を ``0`` または ``1`` に近づける必要があります。それらの間でのみ設定して、マテリアル間でブレンドします。
zh_cn: 对恰当的PBR阴影,"金属度" 应当接近0或者1. 为了混合不同的材料, 只有将其设置在0和1之间.

source: Water is not a metal, so we will set its ``METALLIC`` property to ``0.0``. Water is also highly reflective, so we will set its ``ROUGHNESS`` property to be quite low as well.
es: El agua no es un metal, así que pondremos su propiedad ``METALLIC`` a ``0.0``. El agua también es altamente reflectante, por lo que estableceremos su propiedad de ``ROUGHNESS`` para que sea bastante baja también.
fr: L'eau n'est pas un métal, nous allons donc fixer sa propriété ``METALLIC`` à ``0.0``. L'eau est également très réfléchissante, aussi nous allons fixer sa propriété de ``ROUGHNESS`` à un niveau assez bas également.
ja: 水は金属ではないため、\ ``METALLIC``プロパティを ``0.0`` に設定します。また、水は反射率が高いため、\ ``ROUGHNESS`` プロパティも非常に低く設定します。
zh_cn: 水不是金属，所以我们将其 ``METALLIC`` 属性设置成 ``0.0``\ 。水的反射性也很高，因此我们将其``ROUGHNESS`` 属性也设置得非常低。

source: Now we have a smooth plastic looking surface. It is time to think about some particular properties of water that we want to emulate. There are two main ones that will take this from a weird plastic surface to nice stylized water. The first is specular reflections. Specular reflections are those bright spots you see from where the sun reflects directly into your eye. The second is fresnel reflectance. Fresnel reflectance is the property of objects to become more reflective at shallow angles. It is the reason why you can see into water below you, but farther away it reflects the sky.
es: Ahora tenemos una superficie lisa de aspecto plástico. Es hora de pensar en algunas propiedades particulares del agua que queremos emular. Hay dos principales que llevarán esto de una superficie plástica extraña a una bonita agua estilizada. La primera son los reflejos especulares. Los reflejos especulares son esos puntos brillantes que ves desde donde el sol se refleja directamente en tu ojo. El segundo es la reflectancia de fresnel. La reflectancia de Fresnel es la propiedad de los objetos de ser más reflectantes en ángulos poco profundos. Es la razón por la que puedes ver en el agua debajo de ti, pero más lejos refleja el cielo.
fr: Nous avons maintenant une surface lisse d'aspect plastique. Il est temps de réfléchir à certaines propriétés particulières de l'eau que nous voulons imiter. Il y en a deux principales qui vont faire passer cette eau d'une étrange surface en plastique à une belle eau stylisée. La première est celle des réflexions spéculaires. Les réflexions spéculaires sont ces points lumineux que vous voyez d'où le soleil se reflète directement dans votre œil. La seconde est la réflectance de Fresnel. La réflectance de Fresnel est la propriété des objets à devenir plus réfléchissants à des angles faibles. C'est la raison pour laquelle vous pouvez voir dans l'eau en dessous de vous, mais plus loin, elle reflète le ciel.
ja: 表面が滑らかなプラスチックになりました。エミュレートしたい水の特定の特性について考える時が来ました。これを奇妙なプラスチックの表面から素敵な定型化された水に変える主なものが2つあります。 1つは鏡面反射です。鏡面反射とは、太陽が目に直接反射する場所から見える明るいスポットです。 2つ目はフレネル反射です。フレネル反射率は、オブジェクトが浅い角度でより反射する特性です。それはあなたがあなたの真下の水を見ることができる理由ですが、それより遠くは空を反映しています。
zh_cn: 现在，我们有了光滑的塑料外观表面。现在该考虑要模拟的水的某些特定属性了。这里有两种主要的方法可以把诡异的塑料表面变成好看的水。首先是镜面反射（Specular）。镜面反射是那些来自太阳直接反射到你眼里的明亮斑点。第二个是菲涅耳反射（Fresnel）。菲涅尔反射是物体在小角度下更具反射性的属性。这就是为什么你可以看见自己身下的水，却在更远处看见天空倒影的原因。

source: In order to increase the specular reflections, we will do two things. First, we will change the render mode for specular to toon because the toon render mode has larger specular highlights.
es: Para aumentar los reflejos especulares, haremos dos cosas. Primero, cambiaremos el modo de representación para especular a toon porque el modo de representación de toon tiene mayores reflejos especulares.
fr: Afin d'augmenter les réflexions spéculaires, nous ferons deux choses. Tout d'abord, nous allons changer le mode de rendu de spéculaire à toon parce que le mode de rendu toon a de plus larges lumières spéculaires.
ja: 鏡面反射を増やすために、2つのことを行います。最初に、トゥーンレンダリングモードの方が鏡面反射ハイライトが大きくなるため、スペキュラーのレンダリングモードをトゥーンに変更します。
zh_cn: 为了增强镜面反射，我们需要做两件事。首先，由于卡通渲染模式具有更高的镜面反射高光，我们将更改镜面反射为卡通渲染模式。

source: Second we will add rim lighting. Rim lighting increases the effect of light at glancing angles. Usually it is used to emulate the way light passes through fabric on the edges of an object, but we will use it here to help achieve a nice watery effect.
es: En segundo lugar, añadiremos iluminación de borde. La iluminación del borde aumenta el efecto de la luz en los ángulos de visión. Normalmente se usa para emular la forma en que la luz pasa a través de la tela en los bordes de un objeto, pero la usaremos aquí para ayudar a conseguir un bonito efecto acuático.
fr: Ensuite, nous allons ajouter de l'éclairage de bord. Cela va augmenter l'effet de la lumière aux angles rasants. L'éclairage de bord est habituellement utilisé pour imiter le comportement du tissu ou des bords d'un objet vis a vis de la lumière, mais nous allons l'utiliser pour obtenir un sympathique effet d'eau.
ja: 次に、リム照明を追加します。リム照明は、かすかな角度で光の効果を高めます。通常、オブジェクトの端にある布地を光が通過する方法をエミュレートするために使用されますが、ここでは素敵な水のような効果を達成するために使用します。
zh_cn: 其次, 我们将添加边缘照明. 边缘照明增加了掠射角度的光线效果. 通常, 它用于模拟光线穿过对象边缘上的织物的路径, 但是我们将在此处使用它来帮助实现良好的水润效果.

source: And now, with only 5 lines of code, you can have complex looking water. Now that we have lighting, this water is looking too bright. Let's darken it. This is done easily by decreasing the values of the ``vec3`` we pass into ``ALBEDO``. Let's set them to ``vec3(0.01, 0.03, 0.05)``.
es: Y ahora, con sólo 5 líneas de código, puedes tener agua de aspecto complejo. Ahora que tenemos iluminación, esta agua se ve demasiado brillante. Vamos a oscurecerla. Esto se hace fácilmente disminuyendo los valores del "Vec3" que pasamos a ``ALBEDO``. Pongámoslos en ``Vec3 (0.01, 0.03, 0.05)``.
fr: Et maintenant, avec seulement 5 lignes de code, vous pouvez avoir une eau d'apparence complexe. Maintenant que nous avons de la lumière, cette eau semble trop claire. Assombrissons la. Cela se fait facilement en diminuant les valeurs du ``vec3`` que l'on passe dans ``ALBEDO``. Réglons-les sur ``vec3(0.01, 0.03, 0.05)``.
ja: そして今、わずか5行のコードで、複雑な外観の水を使用できます。照明ができたので、この水は明るすぎます。暗くしましょう。これは、\ ``ALBEDO`` に渡す ``vec3`` の値を減らすことで簡単に行えます。それらを ``vec3(0.01, 0.03, 0.05)``に設定しましょう。
zh_cn: 而现在, 只需要5行代码, 你就可以拥有看起来很复杂的水. 现在, 我们有了照明, 这个水看起来太亮了. 让我们把它变暗. 这可以通过减少我们传入 ``ALBEDO`` 的 ``vec3`` 的值来轻松实现. 让我们把它们设置为 ``vec3(0.01, 0.03, 0.05)`` .

source: Animating with ``TIME``
es: Animando con ``TIME``
fr: Animation avec ``TIME``
ja: ``TIME`` でアニメートする
zh_cn: 用 ``TIME`` 做动画

source: Going back to the vertex function, we can animate the waves using the built-in variable ``TIME``.
es: Volviendo a la función de vértice, podemos animar las ondas usando la variable incorporada ``TIME``.
fr: Pour en revenir à la fonction vertex, nous pouvons animer les vagues en utilisant la variable intégrée ``TIME``.
zh_cn: 回到顶点功能，我们可以使用内置变量 ``TIME`` 对波浪进行动画处理。

source: ``TIME`` is a built-in variable that is accessible from the vertex and fragment functions.
es: ``TIME`` es una variable incorporada que es accesible desde las funciones de vértice y fragmento.
fr: ``TIME`` est une variable intégrée qui est accessible à partir des fonctions vertex et fragment.
ja: ``TIME`` は、頂点関数とフラグメント関数からアクセス可能なビルトイン変数です。
zh_cn: ``TIME`` 是一个内置变量，可从顶点和片段函数访问。

source: In the last tutorial we calculated height by reading from a heightmap. For this tutorial, we will do the same. Put the heightmap code in a function called ``height()``.
es: En el último tutorial calculamos la altura leyendo un mapa de altura. Para este tutorial, haremos lo mismo. Poner el código del heightmap en una función llamada ``height()``.
fr: Dans le dernier tutoriel, nous avons calculé la hauteur en lisant une heightmap. Pour ce tutoriel, nous ferons de même. Mettez le code de la heightmap dans une fonction appelée ``height()``.
ja: 最後のチュートリアルでは、高さマップから読み取ることで高さを計算しました。このチュートリアルでは、同じことを行います。ハイトマップコードを ``height()`` という関数に入れます。
zh_cn: 在上一个教程中，我们通过从高度图读取来计算高度。对于本教程，我们将做同样的事情。将高度图代码放在一个名为 ``height()`` 的函数中。

source: In order to use ``TIME`` in the ``height()`` function, we need to pass it in.
es: Para usar ``TIME`` en la función ``height()``, necesitamos pasarla.
fr: Pour pouvoir utiliser ``TIME`` dans la fonction ``height()``, nous devons le passer dedans.
zh_cn: 为了在 ``height()`` 函数中使用 ``TIME``\ ，我们需要将其传递进去。

source: And make sure to correctly pass it in inside the vertex function.
es: Y asegúrese de pasarlo correctamente dentro de la función de vértice.
fr: Et assurez-vous de le faire passer correctement à l'intérieur de la fonction vertex.
ja: そして、頂点関数内でそれを正しく渡すようにしてください。
zh_cn: 确保其正确传递到顶点函数中.

source: Instead of using a normalmap to calculate normals. We are going to compute them manually in the ``vertex()`` function. To do so use the following line of code.
es: En lugar de usar un mapa de normales para calcular las normales. Vamos a calcularlos manualmente en la función ``vertex()``. Para hacerlo, usa la siguiente línea de código.
fr: Au lieu d'utiliser une normalmap pour calculer les normales. Nous allons les calculer manuellement dans la fonction ``vertex()``. Pour ce faire, utilisez la ligne de code suivante.
ja: 法線を計算するために法線マップを使用する代わりに。 ``vertex()`` 関数でそれらを手動で計算します。そのためには、次のコード行を使用します。
zh_cn: 而不是使用法线贴图来计算法线。我们将在 ``vertex()`` 函数中手动计算它们。为此，请使用以下代码行。

source: We need to compute ``NORMAL`` manually because in the next section we will be using math to create complex-looking waves.
es: Necesitamos calcular "NORMAL" manualmente porque en la próxima sección usaremos las matemáticas para crear ondas de aspecto complejo.
fr: Nous devons calculer ``NORMAL`` manuellement car dans la prochaine section, nous utiliserons les mathématiques pour créer des vagues d'apparence complexe.
ja: 次のセクションでは数学を使用して複雑に見える波を作成するため、手動で ``NORMAL`` を計算する必要があります。
zh_cn: 我们需要手动计算 ``NORMAL``\ ，因为在下一节中，我们将使用数学来创建外观复杂的波形。

source: Now, we are going to make the ``height()`` function a little more complicated by offsetting ``position`` by the cosine of ``TIME``.
es: Ahora, vamos a hacer la función de ``height()`` un poco más complicada desplazando la ``position`` por el coseno del ``TIME``.
fr: Maintenant, nous allons rendre la fonction ``height()`` un peu plus compliquée en compensant la ``position`` par le cosinus de ``TIME``.
ja: ここで、 ``TIME`` のコサインで ``position`` をオフセットすることにより、\ ``height()`` 関数をもう少し複雑にします。
zh_cn: 现在，我们要通过使 ``positon`` 偏移 ``TIME`` 的余弦来使 ``height()`` 函数更加复杂。
