Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/your_first_shader/your_second_3d_shader.po
Languages: es, fr, ja, zh_cn

source: This results in waves that move slowly, but not in a very natural way. The next section will dig deeper into using shaders to create more complex effects, in this case realistic waves, by adding a few more mathematical functions.
es: Esto resulta en ondas que se mueven lentamente, pero no de una manera muy natural. La siguiente sección profundizará en el uso de los shaders para crear efectos más complejos, en este caso ondas realistas, añadiendo algunas funciones matemáticas más.
fr: Il en résulte des vagues qui se déplacent lentement, mais pas de manière très naturelle. La section suivante approfondit l'utilisation des shaders pour créer des effets plus complexes, dans ce cas des vagues réalistes, en ajoutant quelques fonctions mathématiques supplémentaires.
ja: これにより、波はゆっくりと移動しますが、自然な方法ではありません。次のセクションでは、さらにいくつかの数学関数を追加して、シェーダーを使用してより複雑な効果(この場合は現実的な波)を作成する方法について詳しく説明します。
zh_cn: 这会实现缓慢移动的波纹效果, 但显得有点不自然. 下一节将深入探讨, 通过加入更多的数学函数, 来用着色器实现更复杂的效果, 比如更加真实的波纹.

source: Advanced effects: waves
es: Efectos avanzados: olas
fr: Effets avancés : les vagues
ja: 高度な効果: 波
zh_cn: 进阶效果：水波

source: What makes shaders so powerful is that you can achieve complex effects by using math. To illustrate this, we are going to take our waves to the next level by modifying the ``height()`` function and by introducing a new function called ``wave()``.
es: Lo que hace que los shaders sean tan poderosos es que se pueden lograr efectos complejos usando las matemáticas. Para ilustrar esto, vamos a llevar nuestras ondas al siguiente nivel modificando la función ``height()`` e introduciendo una nueva función llamada ``wave()``.
fr: Ce qui rend les shaders si puissants, c'est que vous pouvez obtenir des effets complexes en utilisant les mathématiques. Pour illustrer cela, nous allons faire passer nos vagues au niveau supérieur en modifiant la fonction ``height()`` et en introduisant une nouvelle fonction appelée ``wave()``.
ja: シェーダーが非常に強力なのは、数学を使用して複雑な効果を実現できることです。これを説明するために、 ``height()`` 関数を修正し、\ ``wave()`` と呼ばれる新しい関数を導入することで、波を次のレベルに引き上げます。
zh_cn: 利用数学, 着色器可以实现复杂的效果, 这是着色器的强大之处. 为阐述这一点, 我们将修改 ``height()`` 函数和引入新函数 ``wave()`` , 来让波纹效果更进一层.

source: ``wave()`` has one parameter, ``position``, which is the same as it is in ``height()``.
es: ``wave()`` tiene un parámetro, ``position``, que es el mismo que está en ``height()``.
fr: ``wave()`` a un paramètre, ``position``, qui est le même que dans ``height()``.
ja: ``wave()`` にはパラメーター ``position`` があり、これは ``height()`` と同じです。
zh_cn: ``wave()`` 有一个参数, ``position``, 和在 ``height()`` 中一样.

source: We are going to call ``wave()`` multiple times in ``height()`` in order to fake the way waves look.
es: Vamos a llamar a ``wave()`` varias veces en ``height`` para fingir el aspecto de las ondas.
fr: Nous allons appeler ``wave()`` plusieurs fois dans ``height()`` afin de simuler l'aspect des vagues.
ja: 波の見かけを模倣するために、\ ``height()`` で ``wave()`` を複数回呼び出します。
zh_cn: 我们将在 ``height()`` 函数中多次调用 ``wave()`` 函数, 来改变波纹的样子.

source: At first this looks complicated. So let's go through it line-by-line.
es: Al principio esto parece complicado. Así que vamos a ir línea por línea.
fr: Au début, cela semble compliqué. Voyons donc cela ligne par ligne.
ja: 最初はこれは複雑に見えます。それでは、行ごとに見ていきましょう。
zh_cn: 这在一开始会让人觉得很复杂, 所以我们一行一行地来实现.

source: Offset the position by the ``noise`` texture. This will make the waves curve, so they won't be straight lines completely aligned with the grid.
es: Desfase la posición por la textura del ``noise``. Esto hará que las ondas se curven, por lo que no serán líneas rectas completamente alineadas con la rejilla.
fr: Décalez la position par la texture ``noise``. Cela courbera les vagues, de sorte qu'elles ne soient pas des lignes droites complètement alignées sur la grille.
zh_cn: 通过 ``noise`` 纹理来偏移位置. 这将会使波浪成为曲线, 所以它们将不会是与网格所对齐的直线.

source: Define a wave-like function using ``sin()`` and ``position``. Normally ``sin()`` waves are very round. We use ``abs()`` to absolute to give them a sharp ridge and constrain them to the 0-1 range. And then we subtract it from ``1.0`` to put the peak on top.
es: Define una función de onda usando "sin()" y ``position``. Normalmente las ondas ``sin()`` son muy redondas. Usamos ``abs()`` absoluto para darles una cresta afilada y restringirlas al rango 0-1. Y luego lo restamos de ``1.0`` para poner el pico en la parte superior.
fr: Définir une fonction de type vague en utilisant ``sin()`` et ``position``. Normalement, les vagues ``sin()`` sont très rondes. Nous utilisons ``abs()`` pour leur donner une crête nette et les contraindre à la plage 0-1. Et puis nous soustrayons ``1.0`` pour mettre le pic au-dessus.
ja: ``sin()`` と ``position`` を使用して波のような関数を定義します。通常、\ ``sin()`` 波は非常に丸いです。絶対値にするために ``abs()`` を使用して、鋭い隆起を与え、0-1の範囲に制限します。そして、\ ``1.0`` からそれを差し引いて、ピークを一番上に置きます。
zh_cn: 用 ``sin()`` 和 ``position`` 定义一个类似波浪的函数. 通常 ``sin()`` 波是很圆的. 我们使用 ``abs()`` 去将其绝对化, 让它有一个尖锐波峰, 并将其约束于0-1的范围内. 然后我们再从 ``1.0`` 中减去, 将峰值放在上方.

source: Multiply the x-directional wave by the y-directional wave and raise it to a power to sharpen the peaks. Then subtract that from ``1.0`` so that the ridges become peaks and raise that to a power to sharpen the ridges.
es: Multiplica la onda direccional x por la onda direccional y levántala a una potencia que agudice los picos. Luego reste eso de ``1.0`` para que las crestas se conviertan en picos y aumente la potencia para afinar las crestas.
fr: Multipliez la vague directionnelle x par la vague directionnelle y et augmentez-la à une puissance pour affiner les pics. Ensuite, soustrayez cela de ``1.0`` pour que les crêtes deviennent des pics et augmentez cela à une puissance pour aiguiser les crêtes.
ja: x方向の波にy方向の波を掛け、それを累乗してピークをシャープにします。次に、\ ``1.0`` からそれを差し引くと、尾根がピークになり、それを累乗して尾根をシャープにします。
zh_cn: 将x方向的波乘以y方向的波, 并将其提高到使峰值变得尖锐的幂. 然后从 ``1.0`` 中减去它, 使山脊成为山峰, 并提高山脊锐化的能力.

source: We can now replace the contents of our ``height()`` function with ``wave()``.
es: Ahora podemos reemplazar el contenido de nuestra función de ``height()`` con ``wave()``.
fr: Nous pouvons maintenant remplacer le contenu de notre fonction ``height()`` avec ``wave()``.
ja: ``height()`` 関数の内容を ``wave()`` に置き換えることができます。
zh_cn: 现在我们可以用 ``wave()`` 代替 ``height()`` 函数的内容.

source: Using this, you get:
es: Usando esto, obtendrás:
fr: En utilisant ceci, vous obtenez :
zh_cn: 这样一来, 你会得到:

source: The shape of the sin wave is too obvious. So let's spread the waves out a bit. We do this by scaling ``position``.
es: La forma de la onda de pecado es demasiado obvia. Así que vamos a extender las ondas un poco. Lo hacemos escalando la ``position``.
fr: La forme de la vague de sin est trop évidente. Écartons donc un peu les vagues. Nous le faisons en modifiant l'échelle de ``position``.
ja: 正弦波の形状があまりにも明白です。それでは、波を少し広げてみましょう。これを行うには、\ ``position`` をスケーリングします。
zh_cn: 正弦曲线的形状太明显了. 所以让我们把波型分散一下. 我们通过缩放 ``位置`` 来实现.

source: Now it looks much better.
es: Ahora se ve mucho mejor.
fr: Maintenant, ça a l'air beaucoup mieux.
ja: 今ではずっと良く見えます。
zh_cn: 现在它看起来好多了.

source: We can do even better if we layer multiple waves on top of each other at varying frequencies and amplitudes. What this means is that we are going to scale position for each one to make the waves thinner or wider (frequency). And we are going to multiply the output of the wave to make them shorter or taller (amplitude).
es: Podemos hacerlo aún mejor si ponemos varias ondas encima de cada una a diferentes frecuencias y amplitudes. Lo que esto significa es que vamos a escalar la posición de cada una para hacer las ondas más delgadas o más anchas (frecuencia). Y vamos a multiplicar la salida de la onda para hacerlas más cortas o más altas (amplitud).
fr: Nous pouvons faire encore mieux si nous superposons plusieurs vagues à des fréquences et des amplitudes variables. Cela signifie que nous allons mettre à l'échelle la position de chacune pour rendre les vagues plus fines ou plus larges (fréquence). Et nous allons multiplier la sortie de la vague pour les rendre plus courtes ou plus hautes (amplitude).
ja: さまざまな周波数と振幅で複数の波を重ねると、さらに改善できます。これが意味することは、それぞれの位置をスケーリングして、波を細くしたり広くしたりすることです(周波数)。そして、波の出力を乗算して、それらをより短くまたはより高く(振幅)します。
zh_cn: 如果我们将多个波以不同的频率和幅度彼此叠加, 则可以做得更好. 这意味着我们将按比例缩放每个位置, 以使波形更细或更宽(频率). 我们将乘以波的输出, 以使它们变低或变高(振幅).

source: Here is an example for how you could layer the four waves to achieve nicer looking waves.
es: Aquí hay un ejemplo de cómo se pueden formar capas de las cuatro ondas para conseguir unas ondas de mejor aspecto.
fr: Voici un exemple de la façon dont vous pourriez superposer les quatre vagues pour obtenir de plus belles vagues.
ja: 見栄えの良い波を実現するために4つの波を重ねる方法の例を次に示します。
zh_cn: 下面以四种波形为例, 说明如何将四种波形分层, 以达到更漂亮的波形效果.

source: Note that we add time to two and subtract it from the other two. This makes the waves move in different directions creating a complex effect. Also note that the amplitudes (the number the result is multiplied by) all add up to ``1.0``. This keeps the wave in the 0-1 range.
es: Note que sumamos el tiempo a dos y lo restamos de los otros dos. Esto hace que las ondas se muevan en diferentes direcciones creando un efecto complejo. Observa también que las amplitudes (el número por el que se multiplica el resultado) suman todas ``1.0``. Esto mantiene la onda en el rango de 0-1.
fr: Notez que nous ajoutons le temps à deux et le soustrayons aux deux autres. Cela fait que les vagues se déplacent dans différentes directions, créant un effet complexe. Notez également que les amplitudes (le nombre par lequel le résultat est multiplié) s'additionnent toutes à ``1.0``. Cela permet de maintenir la vague dans la fourchette 0-1.
ja: 2に時間を追加し、他の2つからそれを減算することに注意してください。これにより、波がさまざまな方向に移動し、複雑な効果が生まれます。また、振幅(結果に乗算される数)がすべて ``1.0`` になることにも注意してください。これにより、波は0〜1の範囲に維持されます。
zh_cn: 请注意, 我们把时间加到两个上, 再从另外两个上减去. 这使得波在不同的方向上移动, 产生了复杂的效果. 还要注意, 振幅(结果乘以的数字)全部加起来是 ``1.0``. 这使波浪保持在0-1的范围内.

source: With this code you should end up with more complex looking waves and all you had to do was add a bit of math!
es: ¡Con este código deberías terminar con ondas de aspecto más complejo y todo lo que tenías que hacer era añadir un poco de matemáticas!
fr: Avec ce code vous devriez vous retrouver avec des vagues d'apparence plus complexe et tout ce que vous aviez à faire était d'ajouter un peu de mathématiques !
zh_cn: 有了这段代码, 你应该可以得到更复杂的波形, 而你所要做的只是增加一点数学运算！

source: For more information about Spatial shaders read the :ref:`Shading Language <doc_shading_language>` doc and the :ref:`Spatial Shaders <doc_spatial_shader>` doc. Also look at more advanced tutorials in the :ref:`Shading section <toc-learn-features-shading>` and the :ref:`3D <toc-learn-features-3d>` sections.
es: Para más información sobre los Spatial shaders lea el :ref:`Shading Language <doc_shading_language>` doc y el :ref:`Spatial Shaders <doc_spatial_shader>` doc. También puedes ver tutoriales más avanzados en la sección :ref:`Shading section <toc-learn-features-shading>` y la sección :ref:`3D <toc-learn-features-3d>`.
fr: Pour plus d'informations sur les Spatial shaders, consultez le document :ref:`Langue des shaders <doc_langue des shaders>` doc et le document :ref:`Spatial Shaders <doc_spatial_shader>` doc. Regardez aussi les tutoriels plus avancés dans les sections :ref:`Shading section <toc-learn-features-shading>` et :ref:`3D <toc-learn-features-3d>`.
ja: Spatialシェーダーの詳細については、\ :ref:`Shading Language <doc_shading_language>` のドキュメントと :ref:`Spatial Shaders <doc_spatial_shader>` のドキュメントを参照してください。\ :ref:`Shading section <toc-learn-features-shading>` および :ref:`3D <toc-learn-features-3d>` セクションのより高度なチュートリアルも参照してください。
zh_cn: 有关空间着色器的更多信息, 请阅读 :ref:`Shading Language <doc_shading_language>` 文档和 :ref:`Spatial Shaders <doc_spatial_shader>` 文档. 也可以看看 :ref:`Shading 部分 <toc-learn-features-shading>` 和 :ref:`3D <toc-learn-features-3d>` 部分的高级教程.

source: Translation status
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
zh_cn: 翻译状态
