Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/arraymesh.po
Languages: ru, zh_cn

source: Using the ArrayMesh
ru: Использование ArrayMesh
zh_cn: 使用 ArrayMesh

source: This tutorial will present the basics of using an :ref:`ArrayMesh <class_arraymesh>`.
ru: В этом уроке будут представлены основы использования :ref:`ArrayMesh <class_arraymesh>`.
zh_cn: 本教程将介绍使用 :ref:`ArrayMesh <class_arraymesh>` 的基础知识。

source: To do so, we will use the function :ref:`add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`, which takes up to four parameters. The first two are required, while the second two are optional.
ru: Для этого мы будем использовать функцию :ref:`add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`, которая принимает до четырех параметров. Первые два являются обязательными, а вторые два - необязательными.

source: The first parameter is the ``PrimitiveType``, an OpenGL concept that instructs the GPU how to arrange the primitive based on the vertices given, i.e. whether they represent triangles, lines, points, etc. See :ref:`Mesh.PrimitiveType <enum_Mesh_PrimitiveType>` for the options available.
ru: Первым параметром является ``PrimitiveType``, концепция OpenGL, которая указывает GPU, как расположить примитив на основе заданных вершин, т.е. представляют ли они треугольники, линии, точки и т.д. Доступные варианты см. в :ref:`Mesh.PrimitiveType <enum_Mesh_PrimitiveType>`.
zh_cn: 第一个参数是 ``PrimitiveType``\ （图元类型），这是 OpenGL 中的概念，用于指示 GPU 如何根据给定的顶点来安排图元，即它们表示的是三角形、线、还是点等等。可选项见 :ref:`Mesh.PrimitiveType <enum_Mesh_PrimitiveType>`。

source: The second parameter, ``arrays``, is the actual Array that stores the mesh information. The array is a normal Godot array that is constructed with empty brackets ``[]``. It stores a ``Pool**Array`` (e.g. PoolVector3Array, PoolIntArray, etc.) for each type of information that will be used to build the surface.
ru: Второй параметр, ``arrays``, является фактическим массивом, который хранит информацию о сетке. Массив представляет собой обычный массив Godot, построенный с помощью пустых скобок ``[]``. Он хранит ``Pool**Array`` (например, PoolVector3Array, PoolIntArray и т.д.) для каждого типа информации, которая будет использоваться для построения поверхности.

source: The possible elements of ``arrays`` are listed below, together with the position they must have within ``arrays``. See also :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.
ru: Возможные элементы ``arrays`` перечислены ниже, вместе с позицией, которую они должны иметь в пределах ``arrays``. См. также :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`.

source: Index
ru: Индекс
zh_cn: 索引

source: Mesh.ArrayType Enum
ru: Mesh.ArrayType - перечисление
zh_cn: Mesh.ArrayType 枚举

source: Array type
ru: Тип массива
zh_cn: 数组类型

source: :ref:`PoolVector3Array <class_PoolVector3Array>` or :ref:`PoolVector2Array <class_PoolVector2Array>`
ru: :ref:`PoolVector3Array <class_PoolVector3Array>` или :ref:`PoolVector2Array <class_PoolVector2Array>`

source: :ref:`PoolRealArray <class_PoolRealArray>` of groups of 4 floats. First 3 floats determine the tangent, and the last the binormal direction as -1 or 1.
ru: :ref:`PoolRealArray <class_PoolRealArray>` группа из 4 вещественных чисел. Первые 3 числа определяют тангенс, а последний - бинормальное направление как -1 или 1.

source: :ref:`PoolVector2Array <class_PoolVector2Array>` or :ref:`PoolVector3Array <class_PoolVector3Array>`
ru: :ref:`PoolVector2Array <class_PoolVector2Array>` или :ref:`PoolVector3Array <class_PoolVector3Array>`

source: :ref:`PoolRealArray <class_PoolRealArray>` of groups of 4 floats or :ref:`PoolIntArray <class_PoolIntArray>` of groups of 4 ints. Each group lists indexes of 4 bones that affects a given vertex.
ru: :ref:`PoolRealArray <class_PoolRealArray>` группа из 4 вещественных чисел или :ref:`PoolIntArray <class_PoolIntArray>` групп из 4 целых чисел. Каждая группа перечисляет индексы 4 костей, которые влияют на данную вершину.

source: :ref:`PoolRealArray <class_PoolRealArray>` of groups of 4 floats. Each float lists the amount of weight an determined bone on ``ARRAY_BONES`` has on a given vertex.
ru: :ref:`PoolRealArray <class_PoolRealArray>` группа из 4 вещественных числе. Каждое число перечисляет количество веса, которое определенная кость на ``ARRAY_BONES`` имеет на данную вершину.

source: The array of vertices (at index 0) is always required. The index array is optional and will only be used if included. We won't use it in this tutorial.
ru: Массив вершин (с индексом 0) всегда обязателен. Массив индексов является необязательным и будет использоваться только в том случае, если он включен. Мы не будем использовать его в этом уроке.

source: All the other arrays carry information about the vertices. They are also optional and will only be used if included. Some of these arrays (e.g. ``ARRAY_COLOR``) use one entry per vertex to provide extra information about vertices. They must have the same size as the vertex array. Other arrays (e.g. ``ARRAY_TANGENT``) use four entries to describe a single vertex. These must be exactly four times larger than the vertex array.
ru: Все остальные массивы несут информацию о вершинах. Они также являются необязательными и будут использоваться только в том случае, если они включены. Некоторые из этих массивов (например, ``ARRAY_COLOR``) используют по одной записи на вершину, чтобы предоставить дополнительную информацию о вершинах. Они должны иметь тот же размер, что и массив вершин. Другие массивы (например, ``ARRAY_TANGENT``) используют четыре записи для описания одной вершины. Они должны быть ровно в четыре раза больше, чем массив вершин.

source: For normal usage, the last two parameters in :ref:`add_surface_from_arrays() <class_arraymesh_method_add_surface_from_arrays>` are typically left empty.
ru: Для обычного использования последние два параметра в :ref:`add_surface_from_arrays() <class_arraymesh_method_add_surface_from_arrays>` обычно оставляют пустыми.

source: ArrayMesh
ru: ArrayMеsh

source: In the editor, create a :ref:`MeshInstance <class_meshinstance>` and add an :ref:`ArrayMesh <class_arraymesh>` to it in the Inspector. Normally, adding an ArrayMesh in the editor is not useful, but in this case it allows us to access the ArrayMesh from code without creating one.
ru: В редакторе создайте :ref:`MeshInstance <class_meshinstance>` и добавьте к нему :ref:`ArrayMesh <class_arraymesh>` в инспекторе. Обычно добавление ArrayMesh в редакторе не является полезным, но в данном случае это позволяет нам получить доступ к ArrayMesh из кода без его создания.

source: Next, add a script to the MeshInstance.
ru: Затем добавьте скрипт в MeshInstance.

source: Under ``_ready()``, create a new Array.
ru: Ниже ``_ready()`` создайте новый массив.
zh_cn: 在 ``_ready()`` 下创建一个新的数组。

source: This will be the array that we keep our surface information in - it will hold all the arrays of data that the surface needs. Godot will expect it to be of size ``Mesh.ARRAY_MAX``, so resize it accordingly.
ru: Это будет массив, в котором мы храним нашу информацию о поверхности, он будет содержать все массивы данных, которые нужны поверхности. Godot ожидает, что он будет иметь размер ``Mesh.ARRAY_MAX``, поэтому измените его размер соответствующим образом.
zh_cn: 这将是保存表面信息的数组——将保存表面需要的所有数据数组。Godot 希望它的大小是 ``Mesh.ARRAY_MAX``\ ，所以要相应地调整。

source: Next create the arrays for each data type you will use.
ru: Затем создайте массивы для каждого типа данных, который вы будете использовать.
zh_cn: 接下来, 为你将使用的每种数据类型创建数组.

source: Once you have filled your data arrays with your geometry you can create a mesh by adding each array to ``surface_array`` and then committing to the mesh.
ru: После того, как вы заполнили свои массивы данных своей геометрией, вы можете создать сетку, добавив каждый массив в `surface_array`, а затем зафиксировав его в сетке.
zh_cn: 一旦你用几何体填充了你的数据数组, 就可以通过将每个数组添加到 ``surface_array`` , 然后提交到网格中来创建网格.

source: In this example, we used ``Mesh.PRIMITIVE_TRIANGLES``, but you can use any primitive type available from mesh.
ru: В этом примере мы использовали `Mesh.PRIMITIVE_TRIANGLES`, но вы можете использовать любой примитивный тип, доступный из сетки.
zh_cn: 在这个例子中，使用了 ``Mesh.PRIMITIVE_TRIANGLES``\ ，但你也可以使用网格所提供的任何图元类型。

source: Put together, the full code looks like:
ru: В совокупности полный код выглядит следующим образом:
zh_cn: 把这些放到一起，完整的代码是这样的：

source: The code that goes in the middle can be whatever you want. Below we will present some example code for generating a sphere.
ru: Код, который находится в середине, может быть любым, каким вы захотите. Ниже мы приведем пример кода для генерации сферы.
zh_cn: 中间可以放你想要的任何代码。下面我们会给出一些示例代码，用于生成球体。

source: Generating geometry
ru: Создаём геометрию
zh_cn: 生成几何体

source: Here is sample code for generating a sphere. Although the code is presented in GDScript, there is nothing Godot specific about the approach to generating it. This implementation has nothing in particular to do with ArrayMeshes and is just a generic approach to generating a sphere. If you are having trouble understanding it or want to learn more about procedural geometry in general, you can use any tutorial that you find online.
ru: Здесь приведен пример кода для генерации сферы. Хотя код представлен на GDScript, в подходе к генерации сферы нет ничего специфичного для Godot. Эта реализация не имеет ничего общего с ArrayMeshes и является просто общим подходом к генерации сферы. Если у вас возникли трудности с пониманием или вы хотите узнать больше о процедурной геометрии в целом, вы можете воспользоваться любым учебником, который найдете в Интернете.
zh_cn: 这是生成球体的示例代码。尽管代码是用 GDScript 编写的，但是 Godot 并没有指定用特定的方式来实现它。这种实现方式与 ArrayMesh 无关，仅仅是一种通用的生成球体的方式。如果你觉得这比较难以理解，或者想更全面地了解程序式几何体，可以在网上寻找相关的教程进行学习。

source: Saving
ru: Сохранение
zh_cn: 保存

source: Finally, we can use the :ref:`ResourceSaver <class_resourcesaver>` class to save the ArrayMesh. This is useful when you want to generate a mesh and then use it later without having to re-generate it.
ru: Наконец, мы можем использовать класс :ref:`ResourceSaver <class_resourcesaver>` для сохранения ArrayMesh. Это полезно, когда вы хотите сгенерировать сетку, а затем использовать ее позже без необходимости повторной генерации.
zh_cn: 最后，我们可以使用 :ref:`ResourceSaver <class_resourcesaver>` 类来保存该 ArrayMesh。当你想生成一个网格，然后在以后使用它而不需要重新生成时，这个方法很有用。

source: Translation status
ru: Translation status (статус перевода)
zh_cn: 翻译状态

source: To do so, we will use the function :ref:`add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`, which takes up to five parameters. The first two are required, while the last three are optional.
zh_cn: 为此，我们将使用函数 :ref:`add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>` ，它最多需要五个参数。前两个参数是必须的，后三个参数是可选的。

source: The second parameter, ``arrays``, is the actual Array that stores the mesh information. The array is a normal Godot array that is constructed with empty brackets ``[]``. It stores a ``Packed**Array`` (e.g. PackedVector3Array, PackedInt32Array, etc.) for each type of information that will be used to build the surface.
zh_cn: 第二个参数 ``arrays`` 是存储网格信息的实际 Array。该数组是一个普通的 Godot 数组，用空括号 ``[]`` 构造。它为每一种类型的信息存储一个 ``Packed**Array``\ （如 PackedVector3Array、PackedInt32Array等），用于构建表面。

source: Common elements of ``arrays`` are listed below, together with the position they must have within ``arrays``. See :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>` for a full list.
zh_cn: ``arrays`` 可能包含下列元素，另外还必须在 ``arrays`` 中包含位置信息。有关完整列表，另请参阅 :ref:`Mesh.ArrayType <enum_Mesh_ArrayType>`。

source: :ref:`PackedVector3Array <class_PackedVector3Array>` or :ref:`PackedVector2Array <class_PackedVector2Array>`
zh_cn: :ref:`PackedVector3Array <class_PackedVector3Array>` 或 :ref:`PackedVector2Array <class_PackedVector2Array>`

source: :ref:`PackedFloat32Array <class_PackedFloat32Array>` or :ref:`PackedFloat64Array <class_PackedFloat64Array>` of groups of 4 floats. The first 3 floats determine the tangent, and the last float the binormal direction as -1 or 1.
zh_cn: :ref:`PackedFloat32Array <class_PackedFloat32Array>` 或 :ref:`PackedFloat64Array <class_PackedFloat64Array>` 4 个浮点数组。 前 3 个浮点数确定切线，最后一个浮点数确定副法线方向，即 -1 或 1。

source: :ref:`PackedVector2Array <class_PackedVector2Array>` or :ref:`PackedVector3Array <class_PackedVector3Array>`
zh_cn: :ref:`PackedVector2Array <class_PackedVector2Array>` 或 :ref:`PackedVector3Array <class_PackedVector3Array>`

source: :ref:`PackedFloat32Array <class_PackedFloat32Array>` of groups of 4 floats or :ref:`PackedInt32Array <class_PackedInt32Array>` of groups of 4 ints. Each group lists indexes of 4 bones that affects a given vertex.
zh_cn: 4 个 float 一组的 :ref:`PackedFloat32Array <class_PackedFloat32Array>` 或 4 个 int 一组的 :ref:`PackedInt32Array <class_PackedInt32Array>`。每一组都列出了影响某个特定顶点的 4 根骨骼。

source: :ref:`PackedFloat32Array <class_PackedFloat32Array>` or :ref:`PackedFloat64Array <class_PackedFloat64Array>` of groups of 4 floats. Each float lists the amount of weight the corresponding bone in ``ARRAY_BONES`` has on a given vertex.
zh_cn: 4 个 float 一组的 :ref:`PackedFloat32Array <class_PackedFloat32Array>` 或 :ref:`PackedFloat64Array <class_PackedFloat64Array>`。每个 float 都列出了给定顶点对 ``ARRAY_BONES`` 中特定骨骼的权重。

source: In most cases when creating a mesh, we define it by its vertex positions. So usually, the array of vertices (at index 0) is required, while the index array (at index 12) is optional and will only be used if included. It is also possible to create a mesh with only the index array and no vertex array, but that's beyond the scope of this tutorial. In fact, we won't use the index array at all.
zh_cn: 在大多数情况下，创建网格时，我们通过顶点位置来定义网格。因此，顶点数组（位于索引 0 处）通常是必需的，而索引数组（位于索引 12 处）是可选的，只有在它被包含时才会使用。也可以只创建索引数组而不创建顶点数组，但这超出了本教程的范围。事实上，我们根本不会使用索引数组。

source: All the other arrays carry information about the vertices. They are optional and will only be used if included. Some of these arrays (e.g. ``ARRAY_COLOR``) use one entry per vertex to provide extra information about vertices. They must have the same size as the vertex array. Other arrays (e.g. ``ARRAY_TANGENT``) use four entries to describe a single vertex. These must be exactly four times larger than the vertex array.
zh_cn: 其他所有数组包含的都是关于顶点的信息。它们也是可选的，只有在包含时才会用到。有些数组（例如 `ARRAY_COLOR``\ ）用每个顶点一个元素的形式来提供额外的顶点信息。它们的大小必须与顶点数组一致。另一些数组（例如 ``ARRAY_TANGENT``\ ）用四个元素来描述一个顶点。它们必须正好是顶点数组的四倍。

source: For normal usage, the last three parameters in :ref:`add_surface_from_arrays() <class_arraymesh_method_add_surface_from_arrays>` are typically left empty.
zh_cn: 正常的使用场景下，\ :ref:`add_surface_from_arrays() <class_arraymesh_method_add_surface_from_arrays>` 的最后三个参数通常都是留空的。

source: Setting up the ArrayMesh
zh_cn: 设置 ArrayMesh

source: In the editor, create a :ref:`MeshInstance3D <class_meshinstance3d>` and add an :ref:`ArrayMesh <class_arraymesh>` to it in the Inspector. Normally, adding an ArrayMesh in the editor is not useful, but in this case it allows us to access the ArrayMesh from code without creating one.
zh_cn: 在编辑器中，创建一个 :ref:`MeshInstance3D <class_meshinstance3d>` ，并在检查器中为其添加一个 :ref:`ArrayMesh <class_arraymesh>`\ 。通常，在编辑器里添加 ArrayMesh 没什么用，但这里可以让我们免去用代码创建的麻烦，直接使用这个 ArrayMesh。

source: Next, add a script to the MeshInstance3D.
zh_cn: 接下来，在 MeshInstance3D 上添加一个脚本。
