Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/procedural_geometry/immediategeometry.po
Languages: es, ru, uk, zh_cn

source: Using ImmediateGeometry
es: Usando ImmediateGeometry
ru: Использование ImmediateGeometry
uk: Використання ImmediateGeometry
zh_cn: 使用 ImmediateGeometry

source: Unlike the SurfaceTool or ArrayMesh, :ref:`ImmediateGeometry <class_ImmediateGeometry>` is an actual node. Being a node makes it quick to add to a scene and get visual output. It uses an OpenGL 1.x-style API like SurfaceTool, but it's actually designed to create meshes on the fly.
es: A diferencia de SurfaceTool o ArrayMesh, :ref:`ImmediateGeometry <class_ImmediateGeometry>` es un nodo real. Al ser un nodo, es rápido agregarlo a una escena y obtener una salida visual. Utiliza una API de estilo OpenGL 1.x como SurfaceTool, pero está diseñado para crear mallas sobre la marcha.
ru: В отличие от SurfaceTool или ArrayMesh, :ref:`ImmediateGeometry <class_ImmediateGeometry>` является фактическим узлом. Наличие узла позволяет быстро добавлять элементы в сцену и получать визуальный результат. Он использует API в стиле OpenGL 1.x, такой как SurfaceTool, но на самом деле он предназначен для создания сеток на лету.
uk: На відміну від SurfaceTool або ArrayMesh, :ref:`ImmediateGeometry <class_ImmediateGeometry>` є вузлом. Будучи вузлом, він швидко додається до сцени та надає візуальний результат. Він використовує API в стилі OpenGL 1.x, такий як SurfaceTool, але насправді він призначений для створення мешів на льоту.
zh_cn: 与SurfaceTool或ArrayMesh不同, :ref:`ImmediateGeometry <class_ImmediateGeometry>` 是一个实际的节点. 作为一个节点, 它可以快速添加到场景中, 并获得可视化输出. 它使用像SurfaceTool一样的OpenGL 1.x风格的API, 但它实际上是为了在动态创建网格而设计的.

source: Generating complex geometry (several thousand vertices) with this node is inefficient, even if it's done only once. Instead, it is designed to generate simple geometry that changes every frame.
es: Generar geometría compleja (varios miles de vértices) con este nodo es ineficiente, incluso si se hace solo una vez. En cambio, está diseñado para generar geometría simple que cambia en cada cuadro (frame).
ru: Генерация сложной геометрии (несколько тысяч вершин) с помощью этого узла неэффективна, даже если это делается только один раз. Вместо этого он предназначен для создания простой геометрии, которая меняется в каждом кадре.
uk: Генерування складної геометрії (на кілька тисяч вершин) з цим вузлом неефективне, навіть якщо це робиться лише один раз. Натомість він призначений для створення простої геометрії, яка змінюється кожен кадр.
zh_cn: 用这个节点生成复杂的几何体(几千个顶点), 即使只做一次, 效率也很低. 相反, 它的设计是为了生成每一帧变化的简单几何体.

source: Before starting, you should clear the geometry by calling ``clear()``. This ensures that you are not building upon the geometry from the previous frame. If you want to keep geometry between frames, do not call ``clear()``.
es: Antes de comenzar, debes borrar la geometría llamando a ``clear()``. Esto asegura que no estés construyendo sobre la geometría del cuadro anterior. Si deseas mantener la geometría entre cuadros, no llames a ``clear()``.
ru: Перед началом работы вы должны очистить геометрию, вызвав ``clear()``. Это гарантирует, что вы не опираетесь на геометрию предыдущего кадра. Если вы хотите сохранить геометрию между кадрами, не вызывайте ``clear()``.
uk: Перед початком слід очистити геометрію, зателефонувавши ``clear()``. Це гарантує, що ви не будете опиратися на геометрію з попереднього кадру. Якщо ви хочете зберегти геометрію між кадрами, не викликайте ``clear()``.
zh_cn: 在开始之前, 你应该通过调用 ``clear()`` 来清除几何体. 这可以确保你没有在前一帧的几何体上进行构建. 如果你想在帧之间保留几何体, 不要调用 ``clear()`` .

source: To begin generating geometry you must call ``begin()``. ``begin()`` takes a ``PrimitiveType`` as an argument. ``PrimitiveType`` is an OpenGL concept that instructs the GPU how to arrange the primitive based on the vertices given whether it is triangles, lines, points, etc. A complete list can be found under the :ref:`Mesh <class_mesh>` class reference page.
es: Para comenzar a generar geometría, debes llamar a ``begin()``. ``begin()`` toma un argumento de tipo ``PrimitiveType``. ``PrimitiveType`` es un concepto de OpenGL que indica a la GPU cómo organizar el primitivo en base a los vértices proporcionados, ya sea triángulos, líneas, puntos, etc. Puedes encontrar una lista completa en la página de :ref:`Mesh <class_mesh>`.
ru: Чтобы начать генерировать геометрию, вы должны вызвать ``begin()``. ``begin()`` принимает ``PrimitiveType`` в качестве аргумента. ``PrimitiveType`` - это концепция OpenGL, которая инструктирует графический процессор, как расположить примитив на основе заданных вершин, будь то треугольники, линии, точки и т.д. Полный список можно найти на странице ссылок на классы :ref:`Mesh <class_mesh>`.
uk: Щоб почати генерувати геометрію, необхідно викликати ``begin()``. ``begin()`` приймає ``PrimitiveType`` як аргумент. ``PrimitiveType`` - це концепція OpenGL, яка інструктує графічний процесор, як розташувати примітив на основі вершин, враховуючи, чи є це трикутники, лінії, точки тощо. Повний список можна знайти на сторінці посилання на клас :ref:`Mesh <class_mesh>`.
zh_cn: 必须调用 ``begin()`` 才能开始生成几何体 。\ ``begin()`` 将一个 ``PrimitiveType`` 作为参数。\ ``PrimitiveType``\ （图元类型）是 OpenGL 的概念，用于指示 GPU 如何根据给定的顶点来安排图元，可以是三角形、线、点等。完整的列表可以在 :ref:`Mesh <class_mesh>` 的类参考页面中找到。

source: Once you have called ``begin()`` you are ready to start adding vertices. You add vertices one at a time. First you add vertex specific attributes such as normals or UVs using ``set_****()`` (e.g. ``set_normal()``). Then you call ``add_vertex()`` to add a vertex with those attributes. For example:
es: Una vez que hayas llamado a ``begin()``, estarás listo para comenzar a agregar vértices. Agregas vértices uno por uno. Primero agregas atributos específicos del vértice, como normales o coordenadas UV, usando ``set_****()`` (por ejemplo, ``set_normal()``). Luego llamas a ``add_vertex()`` para agregar un vértice con esos atributos. Por ejemplo:
ru: После того, как вы вызвали ``begin()``, вы готовы начать добавлять вершины. Вы добавляете вершины по одной за раз. Сначала вы добавляете атрибуты, специфичные для вершин, такие как нормали или UVS, используя ``set_****()`` (например, ``set_normal()``). Затем вы вызываете ``add_vertex()``, чтобы добавить вершину с этими атрибутами. Например:
uk: Після виклику ``begin()`` ви будете готові почати додавати вершини. Ви додаєте вершини по одній. Спочатку специфічні атрибути вершини, такі як нормалі, або текстурні координати, за допомогою ``set_****()`` (наприклад ``set_normal()``). Потім викликаєте ``add_vertex()``, щоб додати вершину з цими атрибутами. Наприклад:
zh_cn: 一旦你调用了 ``begin()`` , 就可以开始添加顶点了. 每次添加一个顶点, 首先使用 ``set_ **** ()`` 添加顶点的特定属性, 如法线或UV(例如 ``set_normal()`` ). 然后调用 ``add_vertex()`` 来添加一个带有这些属性的顶点. 例如 "add_vertex()" :

source: Only attributes added before the call to ``add_vertex()`` will be included in that vertex.
es: Solo los atributos agregados antes de llamar a ``add_vertex()`` se incluirán en ese vértice.
ru: В эту вершину будут включены только атрибуты, добавленные до вызова ``add_vertex()``.
uk: До цієї вершини будуть включені лише атрибути, додані до виклику ``add_vertex()``.
zh_cn: 只有在调用 ``add_vertex()`` 之前添加的属性才会被包含在该顶点中.

source: Finally, once you have added all your vertices call ``end()`` to signal that you have finished generating the mesh.
es: Finalmente, una vez que hayas agregado todos tus vértices, llama a ``end()`` para indicar que has terminado de generar la malla.
ru: Наконец, как только вы добавили все свои вершины, вызовите ``end()``, чтобы сигнализировать о том, что вы закончили генерировать сетку.
uk: Нарешті, після того, як ви додали всі ваші вершини викликайте ``end()``, це буде сигналізувати про те, що ви закінчили генерувати меш.
zh_cn: 最后, 当添加了所有的顶点后, 调用 ``end()`` 来表示已经完成了网格的生成.

source: The example code below draws a single triangle.
es: El ejemplo de código siguiente dibuja un triángulo simple.
ru: Приведенный ниже пример кода рисует один треугольник.
uk: Приклад коду нижче малює один трикутник.
zh_cn: 下面的示例代码绘制了一个三角形.

source: Translation status
es: Estado de traducción
ru: Translation status (статус перевода)
uk: Стан перекладу
zh_cn: 翻译状态
