Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/development/file_formats/tscn.po
Languages: de, es, fi, fr, ja, pt_br, zh_tw

source: ``primitive`` is an enumerate variable, ``primitive=4`` which is ``PRIMITIVE_TRIANGLES`` is frequently used.
de: ``primitive`` ist eine Aufzählungsvariable, `primitive=4`` (die ``PRIMITIVE_TRIANGLES`` ist) wird häufig verwendet.
es: ``primitive`` es una variable enumerada, ``primitive=4`` que es ``PRIMITIVE_TRIANGLES`` y se usa con frecuencia.
fi: ``primitive`` on enumeroitu muuttuja; ``primitive=4`` joka on PRIMITIVE_TRIANGLES on usein käytetty.
fr: ``primitive`` est une variable de type énumération, ``primitive=4`` qui est ``PRIMITIVE_TRIANGLES`` est fréquemment utilisée.
ja: ``primitive`` は列挙型変数で、\ ``primitive =4`` である ``PRIMITIVE_TRIANGLES`` がよく使用されます。
pt_br: ``primitive`` é uma variável enumerada, ``primitive=4`` que é ``PRIMITIVE_TRIANGLES`` é freqüentemente usado.
zh_tw: ``primitive`` 為列舉類型變數，常用代表 ``PRIMITIVE_TRIANGLES`` 的 ``primitive=4`` 。

source: ``arrays`` is a two-dimensional array, it contains:
de: ``arrays`` ist ein zweidimensionales Array, es enthält:
es: arrays es una matriz bidimensional que contiene:
fi: ``arrays`` on kaksiulotteinen taulukko, joka sisältää:
fr: ``Arrays`` est une liste à deux dimensions, qui contient :
ja: ``arrays`` は2次元配列であり、次のものが含まれます:
pt_br: ``arrays`` é uma matriz bidimensional que contém:
zh_tw: ``array`` 為 2D 陣列，包含：

source: Vertex positions array
de: Scheitelpunktpositionen Array
es: Array de posiciones de vértices
fi: Taulukko kärkipisteiden sijainteja
fr: Tableau des positions de vertex
ja: 頂点位置配列
pt_br: Array de posições de vértice
zh_tw: 頂點位置陣列

source: Normals array
es: Arrays de normales
pt_br: Matriz de normais

source: Tangents array
de: Tangenten-Array
es: Array de tangentes
fi: Taulukko tangentteja
fr: Tableau de tangentes
ja: 接線配列
pt_br: Matriz de tangentes
zh_tw: 切線陣列

source: Vertex colors array
de: Scheitelpunktfarben-Array
es: Array de colores de vértices
fi: Taulukko kärkipisteiden värejä
fr: Tableau de couleurs de vertex
ja: 頂点カラー配列
pt_br: Matriz de cores de vértice
zh_tw: 頂點色彩陣列

source: Bone indexes array
de: Knochenindex-Array
es: Array de índices de huesos
fi: Taulukko luuindeksejä
fr: Tableau d'indices d'os
ja: ボーンインデックス配列
zh_tw: 骨頭索引陣列

source: Bone weights array
de: Knochengewichts-Array
es: Array de peso de los huesos
fi: Taulukko luiden painoja
fr: Tableau de poids d'os
ja: ボーンウェイト配列
pt_br: Matriz de pesos ósseos
zh_tw: 骨頭權重陣列

source: Vertex indexes array
de: Vertex-Indizes-Array
es: Array de índices de vértices
fi: Taulukko kärkipisteiden indeksejä
fr: Tableau des index de sommets
ja: 頂点インデックス配列
pt_br: Matriz de índices de vértice
zh_tw: 頂點索引陣列

source: ``morph_arrays`` is an array of morphs. Each morph is exactly an ``arrays`` without the vertex indexes array.
de: ``morph_arrays`` ist ein Array von Morphs. Jeder Morph ist genau ein ``arrays`` ohne das Array der Vertex-Indizes.
es: ``morph_arrays`` es un array de morphs. Cada morph es exactamente un ``arrays``, pero sin el array de índices de vértices.
fi: ``morph_arrays`` on taulukko morpheja. Kukin morph on tarkalleen ``arrays`` ilman kärkipisteiden indeksitaulukkoa.
fr: ``morph_arrays`` est un tableau de morphs. Chaque morph est exactement un ``arrays`` sans le tableau des index des sommets.
ja: ``morph_arrays`` はモーフの配列です。各モーフは、頂点インデックス配列を持たないまさに ``配列`` です。
pt_br: ``morph_arrays`` é um array de morfos. Cada morph é exatamente um ``arrays`` sem o array de índices de vértices.
zh_tw: ``morph_arrays`` 為 Morph 陣列。各個 Morph 都恰好為沒有頂點索引陣列的 ``arrays`` 。

source: An example of ArrayMesh:
de: Beispiel eines ArrayMesh:
es: Un ejemplo de ArrayMesh:
fi: Esimerkki ArrayMeshistä:
fr: Un exemple d'ArrayMesh :
ja: ArrayMeshの例:
pt_br: Um exemplo de ArrayMesh:
zh_tw: 下列為一 ArrayMesh 範例：

source: Animation
es: Animación
fi: Animaatio
ja: アニメーション
pt_br: Animação
zh_tw: 動畫

source: An animation resource consists of tracks. Besides, it has ``length``, ``loop`` and ``step`` applied to all the tracks.
de: Eine Animationsressource besteht aus Spuren. Außerdem hat sie ``length``, ``loop`` und ``step``, die auf alle Spuren angewendet werden.
es: Un recurso de animación consiste en pistas (tracks). Además, tiene las propiedades ``length``, ``loop`` y ``step``, que se aplican a todas las pistas.
fi: Animaatioresurssi koostuu raidoista. Lisäksi kullakin raidalla on pituus (``length``), kierto (``loop``) ja askellus (``step``).
fr: Une ressource d'animation est constituée de pistes. De plus, elle a une ``length``, un ``loop`` et des ``step`` appliqués à toutes les pistes.
ja: アニメーションリソースはトラックで構成されます。また、すべてのトラックに適用される ``length``\ 、\ ``loop`` そして ``step`` があります。
pt_br: Um recurso de animação consiste em faixas. Além disso, possui ``length``, ``loop`` e ``step`` aplicados a todas as faixas.
zh_tw: 動畫資源是由許多軌道組成的。另外，動畫資源的所有軌道都還有 ``length``, ``loop`` 與 ``step`` 。

source: ``length`` and ``step`` are both durations in seconds.
de: ``length`` und ``step`` sind beides Zeitdauern in Sekunden.
es: ``length`` y ``step`` son duraciones expresadas en segundos.
fi: Sekä ``length`` että ``step`` ilmaisevat aikaa sekunteina.
fr: ``length`` et ``step`` sont des durées en secondes.
ja: ``length`` と ``step`` はどちらも秒単位の期間です。
pt_br: ``length`` e ``step`` são durações em segundos.
zh_tw: ``length`` 與 ``step`` 都是以秒為單位的時間長度。

source: Each track is described by a list of key-value pairs in the format ``tracks/Id/Attribute``. Each track includes:
de: Jede Spur wird durch eine Liste von Schlüssel-Werte-Paaren im Format ``Spuren/Id/Attribut`` beschrieben. Jeder Track enthält:
es: Cada pista está descrita por una lista de pares clave-valor en el formato ``tracks/Id/Attribute``. Cada pista incluye:
fi: Kukin raita on kuvattu listana avain-arvo pareja ``tracks/Id/Attribute``. Kukin raita sisältää:
fr: Chaque piste est décrite par une liste de paires clé-valeur au format ``tracks/Id/Attribute``. Chaque piste comprend :
ja: 各トラックは、\ ``tracks/Id/Attribute`` 形式のキーと値のペアのリストによって記述されます。各トラックには以下が含まれます:
pt_br: Cada faixa é descrita por uma lista de pares chave-valor no formato ``tracks/Id/Attribute``. Cada faixa inclui:
zh_tw: 每個軌道都是由一組索引鍵／值配對所組成的，其格式為 ``tracks/Id/Attribute`` 。每個軌道都包含了：

source: The ``type`` must be the first attribute of each track. The value of ``type`` can be:
de: Der ``type`` muss das erste Attribut jeder Spur sein. Der Wert von ``type`` kann sein:
es: El atributo ``type`` debe ser el primero de cada pista. El valor de ``type`` puede ser:
fi: Kunkin raidan ensimmäisen attribuutin on oltava ``type``. ``type`` arvo voi olla:
fr: Le ``type`` doit être le premier attribut de chaque piste. La valeur de ``type`` peut être :
ja: ``type`` は各トラックの最初の属性でなければなりません。\ ``type``の値は次のとおりです:
pt_br: O ``type`` deve ser o primeiro atributo de cada faixa. O valor de ``type`` pode ser:
zh_tw: ``type`` 必須為各個軌道的第一個屬性。``type`` 的值可以為下列其一：

source: The ``path`` has the format ``NodePath(Path/To/Node:attribute)``. It's the path to the animated node or attribute, relative to the root node defined in the AnimationPlayer.
de: Der ``path`` hat das Format ``NodePath(Path/To/Node:attribute)``. Es ist der Pfad zu dem animierten Node oder Attribut, relativ zu dem im AnimationPlayer definierten Wurzelnode.
es: El atributo ``path`` tiene el formato ``NodePath(Path/To/Node:atributo)``. Es la ruta hacia el nodo o atributo animado, relativo al nodo raíz definido en el AnimationPlayer.
fi: ``path`` muoto on ``NodePath(Path/To/Node:Attribute)``. Se on polku AnimationPlayer solmussa määritellystä juurisolmusta animoituun solmuun tai attribuuttiin.
fr: Le ``path`` a le format ``NodePath(Path/To/Node:attribute)``. Il s'agit du chemin d'accès au nœud ou attribut animé, par rapport au nœud racine défini dans AnimationPlayer.
ja: ``path`` の形式は ``NodePath(Path/To/Node:attribute)`` です。これは、AnimationPlayerで定義されたルートノードを基準とした、アニメーション化されたノードまたは属性へのパスです。
pt_br: O ``path`` tem o formato ``NodePath(Path/To/Node:attribute)``. É o caminho para o nó ou atributo animado, relativo ao nó raiz definido no AnimationPlayer.
zh_tw: ``path`` 的格式為 ``NodePath(Path/To/Node:attribute)`` 。``path`` 為動畫化節點或屬性的路徑，相對於 AnimationPlayer 中定義的根節點。

source: The ``interp`` is the method to interpolate frames from the keyframes. It is an enum variable with one of the following values:
de: Das ``interp`` ist die Methode, um Frames aus den Keyframes zu interpolieren. Es ist eine Enum-Variable mit einem der folgenden Werte:
es: El atributo ``interp`` es el método para interpolar los fotogramas de las keyframes. Es una variable enumerada con uno de los siguientes valores:
fr: L'``interp``est la méthode pour interpoler des images à partir des clés d'animation. Il s'agit d'une variable enum avec l'une des valeurs suivantes :
pt_br: O ``interp`` é o método para interpolar quadros dos quadros-chave. É uma variável enum com um dos seguintes valores:
zh_tw: ``interp`` 為從關鍵影格中進行插值影格的方法。``interp`` 為一列舉類型的變數，其值為下列其一：

source: ``0`` (constant)
de: ``0`` (konstant)
es: ``0`` (constante)
pt_br: ``0`` (constante)
zh_tw: ``0`` (常數)

source: The ``keys`` correspond to the keyframes. It appears as a ``PoolRealArray()``, but may have a different structure for tracks with different types.
de: Die ``keys`` entsprechen den Keyframes. Es erscheint als ``PoolRealArray()``, kann aber für Spuren mit unterschiedlichen Typen eine andere Struktur haben.
es: Las ``keys`` corresponden a las keyframes. Se presenta como una ``PoolRealArray()``, pero puede tener una estructura diferente para pistas con diferentes tipos.
fr: Les ``keys`` correspondent aux clés d'animation. Elles apparaissent comme un ``PoolRealArray()``, mais peuvent avoir une structure différente pour les pistes de types différents.
ja: ``keys`` はキーフレームに対応しています。\ ``PoolRealArray()`` として表示されますが、異なるタイプのトラックに対して異なる構造を持つ場合があります。
zh_tw: ``keys`` 則對應關鍵影格。以 ``PoolRealArray()`` 來表示，但對於不同型別的軌道，可能會有不同的架構。

source: A Transform track uses every 12 real numbers in the ``keys`` to describe a keyframe. The first number is the timestamp. The second number is the transition followed by a 3-number translation vector, followed by a 4-number rotation quaternion (X, Y, Z, W) and finally a 3-number scale vector. The default transition in a Transform track is 1.0.
de: Eine Transform-Spur verwendet alle 12 reellen Zahlen in den ``keys``, um einen Keyframe zu beschreiben. Die erste Zahl ist der Zeitstempel. Die zweite Zahl ist der Übergang, gefolgt von einem 3-stelligen Translationsvektor, gefolgt von einer 4-stelligen Rotationsquaternion (X, Y, Z, W) und schließlich einem 3-stelligen Skalierungsvektor. Der Standardübergang in einer Transform-Spur ist 1,0.
es: Una pista de transformación utiliza cada 12 números reales en las ``keys`` para describir una keyframe. El primer número es la marca de tiempo. El segundo número es la transición seguida de un vector de traslación de 3 números, luego un cuaternión de rotación de 4 números (X, Y, Z, W) y finalmente un vector de escala de 3 números. La transición predeterminada en una pista de transformación es 1.0.
fr: Une piste de transformation utilises chacun des 12 nombres réels dans les "clés" pour décrire une clé d'animation. Le premier nombre est le ???timestamp???. Le deuxième est la transition suivi par un vecteur de translation à 3 nombres, suivi d'un quaternion de rotation (X, Y, Z, W) à quatre nombres puis finalement un vecteur d'agrandissement à 3 nombres. La transition défaut est une piste de transformation 1.0.
ja: Transformトラックは、キーフレームを記述するために ``keys`` の中の12個の実数を使用します。最初の数値はタイムスタンプです。 2番目の数値はトランジション、それに続く3個の数値は平行移動ベクトル、次の4個の数値は回転四元数(X、Y、Z、W)、最後は3個の数値のスケールベクトルです。 Transformトラックのデフォルトのトランジションは1.0です。
zh_tw: Transform 軌道在 ``keys`` 中使用整整 12 個實數來表示關鍵影格。第一個數字為時戳。第二個數字為變換，再接上 3 個數字的變換向量，然後是 4 個數字的旋轉四元數 (X, Y, Z, W)，最後則是 3 個數字的縮放向量。在 Transform 軌道中預設的變換為 1.0。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fi: Käännöksen tila
ja: 翻訳ステータス
pt_br: Progresso da Tradução
zh_tw: 翻譯狀態

source: UV array 1
fi: UV-taulukko 1
ja: UV配列1
zh_tw: UV 陣列 1

source: UV array 2
fi: UV-taulukko 2
ja: UV配列2
zh_tw: UV 陣列 2

source: ``1`` (linear)
fr: ``1`` (linéaire)
zh_tw: ``1`` (線性)

source: ``2`` (cubic)
de: ``2`` (kubisch)
fr: ``2`` (cubique)
zh_tw: ``2`` (三次方)

source: The TSCN (text scene) file format represents a single scene tree inside Godot. TSCN files have the advantage of being mostly human-readable and easy for version control systems to manage. During import, TSCN files are compiled into binary ``.scn`` files stored inside the .import folder. This reduces the data size and speeds up loading.
fr: Le format de fichier TSCN (text scene) représente un arbre de scènes unique dans Godot. Les fichiers TSCN ont l'avantage d'être pour la plupart lisibles par l'homme et faciles à gérer par les systèmes de contrôle de version. Pendant l'importation, les fichiers TSCN sont compilés dans des fichiers binaires ``.scn`` stockés dans le dossier .import. Cela réduit la taille des données et accélère le chargement.

source: The ESCN (exported scene) file format is identical to the TSCN file format, but is used to indicate to Godot that the file has been exported from another program and should not be edited by the user from within Godot.
fr: Le format de fichier ESCN (scène exportée) est identique au format de fichier TSCN, mais est utilisé pour indiquer à Godot que le fichier a été exporté depuis un autre programme et ne doit pas être modifié par l'utilisateur depuis Godot.

source: The file descriptor looks like ``[gd_scene load_steps=1 format=2]`` and should be the first entry in the file. The ``load_steps`` parameter should (in theory) be the number of resources within the file. However, in practice, its value seems not to matter.
fr: Le descripteur de fichier ressemble à ``[gd_scene load_steps=1 format=2]`` et devrait être la première entrée dans le fichier. Le paramètre ``load_steps`` devrait (en théorie) être le nombre de ressources dans le fichier. Cependant, en pratique, sa valeur ne semble avoir aucune importance.

source: ``index`` (if two nodes have the same name)
fr: ``index`` (si deux nœuds ont le même nom)

source: ``sub_resource``
fi: ``sub_resource`` (aliresurssi)

source: ``node``
fi: ``node`` (solmu)

source: ``connection``
fi: ``connection`` (yhteys)

source: ``instance``
fi: ``instance`` (ilmentymä)

source: ``instance_placeholder``
fi: ``instance_placeholder`` (ilmentymän paikanpitäjä)

source: AnimationPlayer
fi: Animaatiotoistin (AnimationPlayer)

source: ``type``
fi: ``type`` (tyyppi)

source: ``path``
fi: ``path`` (polku)

source: ``interp``
fi: ``interp`` (interpolaatio)

source: ``keys``
fi: ``keys`` (avainruudut)

source: ``loop_wrap``
fi: ``loop_wrap`` (kierron tyyppi)

source: ``imported``
fi: ``imported`` (tuotu)

source: ``transform``
fi: ``transform`` (muunnos)

source: ``value``
fi: ``value`` (arvo)

source: ``method``
fi: ``method`` (metodi)
