Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/development/file_formats/tscn.po
Languages: de, es, fi, fr, ja, pt_br, zh_tw

source: ``parent`` is the index of parent bone in the bone list, with parent index, the bone list is built to a bone tree.
de: ``parent`` ist der Index des übergeordneten Knochens in der Knochen-Liste, mit dem übergeordneten Index wird die Knochen-Liste zu einem Knochen-Baum erstellt.
es: ``parent`` es el índice del hueso padre en la lista de huesos, con este índice se construye un árbol de huesos.
fi: ``parent`` on indeksi ylempään luuhun luulistassa. Sen avulla luulistasta muodostuu puu.
fr: ``parent`` est l'index de l'os parent dans la liste d'os, avec l'index parent, la liste d'os est construite sur un arbre d'os.
ja: ``parent`` は、ボーンリスト内の親ボーンのインデックスです。親インデックスを使用してボーン リストはボーン ツリーに構築されます。
pt_br: ``parent`` é o índice do osso pai na lista de ossos, com índice pai, a lista de ossos é construída em uma árvore de ossos.
zh_tw: ``parent`` 為骨頭列表中母級骨頭的索引。有了母級骨頭的索引，就能將骨頭列表建立成骨頭樹。

source: ``rest`` is the transform matrix of bone in its "resting" position.
de: ``rest`` ist die Transformationsmatrix des Knochens in seiner "Ruhe" -Position.
es: ``rest`` es la matriz de transformación del hueso en su posición "de reposo" o "inicial".
fi: ``rest`` on luun muunnosmatriisi lepoasennossa.
fr: ``rest`` est la matrice de transformation de l'os dans sa position de "repos".
ja: ``rest`` は、その「休息」位置にある骨の変換行列です。
pt_br: ``rest`` é a matriz de transformação do osso em sua posição de "repouso".
zh_tw: ``rest`` 為將骨骼轉換為「靜止」(Resting) 姿勢用的變換矩陣。

source: ``pose`` is the pose matrix; use ``rest`` as the basis.
de: ``pose`` ist die Posenmatrix; Verwenden Sie ``rest`` als Basis.
es: ``pose`` es la matriz de pose; se usa como base la matriz ``rest``.
fi: ``pose`` on asentomatriisi; käytä ``rest`` perustana.
fr: ``pose`` est la matrice de pose ; utilisez ``rest`` comme base.
ja: ``pose`` はポーズ行列です。基準として ``rest`` を使用します。
pt_br: ``pose`` é a matriz de pose; use ``rest`` como base.
zh_tw: ``pose`` 為姿勢矩陣，以 ``rest`` 作為基礎。

source: ``bound_children`` is a list of ``NodePath()`` which point to BoneAttachments belonging to this bone.
de: ``bound_children`` ist eine Liste von ``NodePath()``, die auf zu diesem Knochen gehörende BoneAttachments zeigen.
es: ``bound_children`` es una lista de ``NodePath()`` que apuntan a BoneAttachments pertenecientes a este hueso.
fi: ``bound_children`` on lista ``NodePath()`` rakenteita, jotka viittaavat tälle luulle kuuluviin BoneAttachment-solmuihin.
fr: ``bound_children`` est une liste de ``NodePath()`` qui pointe vers les BoneAttachments appartenant à cet os.
ja: ``bound_children`` は、このボーンに属するBoneAttachmentsを指す ``NodePath()`` のリストです。
pt_br: ``bound_children`` é uma lista de ``NodePath()`` que aponta para BoneAttachments pertencentes a este osso.
zh_tw: ``bound_children`` 為一組由 ``NodePath()`` 組成的列表，用來指向該骨骼的 BoneAttachment。

source: Here's an example of a skeleton node with two bones:
de: Hier ist ein Beispiel für einen Skelett-Node mit zwei Knochen:
es: Aquí hay un ejemplo de un nodo esqueleto con dos huesos:
fi: Tässä esimerkki skeleton-solmusta kahdella luulla:
fr: Voici un exemple d'un nœud squelettique avec deux os :
ja: 2つのボーンを持つスケルトンノードの例を次に示します:
pt_br: Eis um exemplo de um nó esqueleto com dois ossos:
zh_tw: 下列為有兩個骨頭的骨骼節點範例：

source: BoneAttachment node is an intermediate node to describe some node being parented to a single bone in a Skeleton node. The BoneAttachment has a ``bone_name=NameOfBone`` attribute, and the corresponding bone being the parent has the BoneAttachment node in its ``bound_children`` list.
de: BoneAttachment-Node ist ein Zwischen-Node zur Beschreibung eines Nodes, der mit einem einzelnen Knochen in einem Skelett-Node verbunden ist. Das BoneAttachment hat ein ``bone_name=NameOfBone`` Attribut und das entsprechende übergeordnete Knochenelement hat den BoneAttachment-Node in seiner ``bound_children`` Liste.
es: El nodo BoneAttachment es un nodo intermedio que describe algún nodo que está siendo padre de un solo hueso en un nodo Skeleton. El BoneAttachment tiene un atributo ``bone_name=NombreDelHueso``, y el hueso correspondiente que es el padre tiene el nodo BoneAttachment en su lista ``bound_children``.
fr: Le nœud BoneAttachment est un nœud intermédiaire pour décrire un autre nœud parenté à un seul os dans un nœud Skeleton. Le BoneAttachment à un attribut ``bone_name=NameOfBone``, et l'os correspondant est le parent du nœud BoneAttachment dans sa liste ``bound_children``.
ja: BoneAttachmentノードは、スケルトンノードの単一のボーンにペアレント化されているノードを記述する中間ノードです。 BoneAttachmentには ``bone_name = NameOfBone`` 属性があり、親である対応するボーンの ``bound_children`` リストにはBoneAttachmentノードがあります。
pt_br: O nó BoneAttachment é um nó intermediário para descrever algum nó sendo pai de um único osso em um nó Skeleton. O BoneAttachment tem um atributo ``bone_name=NameOfBone``, e o osso correspondente sendo o pai tem o nó BoneAttachment em sua lista ``bound_children``.
zh_tw: BoneAttachment 節點為用來描述某個節點屬於某 Skeleton 節點的單一骨頭之子節點。BoneAttachment 有一個 ``bone_name=NameOfBone`` 屬性，而對應為母節點的骨頭之 ``bound_children`` 列表中則有 BoneAttachment 節點。

source: An example of one MeshInstance parented to a bone in Skeleton:
de: Ein Beispiel für eine MeshInstance, die einem Knochen im Skelett übergeordnet ist:
es: Un ejemplo de un MeshInstance anidado a un hueso en un Skeleton:
fi: Esimerkki yhdestä MeshInstance-solmusta, joka toimii Skeletonin luun isäntänä:
fr: Un exemple d'une MeshInstance parenté à un os dans Skeleton :
ja: スケルトンのボーンを親とする1つのMeshInstanceの例:
pt_br: Um exemplo de uma MeshInstance ligada a um osso no Skeleton:
zh_tw: 下列為 Skeleton 中有骨頭母節點的 MeshInstance 範例：

source: AnimationPlayer works as an animation library. It stores animations listed in the format ``anim/Name=SubResource(ResourceId)``; each line refers to an Animation resource. All the animation resources use the root node of AnimationPlayer. The root node is stored as ``root_node=NodePath(Path/To/Node)``.
de: AnimationPlayer funktioniert als eine Animationsbibliothek. Es speichert Animationen, die im Format ``Anim/Name=SubResource(ResourceId)`` aufgelistet sind; jede Zeile verweist auf eine Animationsressource. Alle Animationsressourcen verwenden das Wurzelnode des AnimationPlayers. Das Wurzelnode wird als ``root_node=NodePath(Path/To/Node)`` gespeichert.
es: El AnimationPlayer funciona como una biblioteca de animaciones. Almacena las animaciones listadas en el formato ``anim/Nombre=SubResource(ResourceId)``; cada línea se refiere a un recurso de animación. Todos los recursos de animación utilizan el nodo raíz del AnimationPlayer. El nodo raíz se almacena como ``root_node=NodePath(Path/To/Node)``.
fr: AnimationPlayer fonctionne comme une bibliothèque d'animation. Il stocke les animations listées dans le format ``anim/Name=SubResource(ResourceId)`` ; chaque ligne fait référence à une ressources Animation. Toutes les ressources animation utilisent le nœud racine AnimationPlayer. Le nœud racine est stocké dans ``root_node=NodePath(Path/To/Node)``.
ja: AnimationPlayerは、アニメーションライブラリとして機能します。\ ``anim/Name=SubResource(ResourceId)`` の形式でリストされたアニメーションを保存します; 各行は、アニメーションリソースを参照します。すべてのアニメーションリソースは、AnimationPlayerのルートノードを使用します。ルートノードは ``root_node=NodePath(Path/To/Node)`` として保存されます。
pt_br: AnimationPlayer funciona como uma biblioteca de animações. Ele armazena animações listadas no formato ``anim/Name=SubResource(ResourceId)``; cada linha se refere a um recurso Animation. Todos os recursos de animação usam o nó raiz do AnimationPlayer. O nó raíz é armazenado como ``root_node=NodePath(Path/To/Node)``.
zh_tw: AnimationPlayer 提供動畫函式庫的功能。AnimationPlayer 將各個動畫以 ``anim/Name=SubResource(ResourceId)`` 這樣的格式來儲存一組動畫列表。其中，每一行都代表一個 Animation 資源。所有的動畫都使用 AnimationPlayer 的根節點。根節點儲存為 ``root_node=NodePath(Path/To/Node)`` 。

source: Resources
de: Ressourcen
es: Recursos
fi: Resurssit
fr: Ressources
ja: リソース
pt_br: Recursos
zh_tw: 資源

source: Resources are components that make up the nodes. For example, a MeshInstance node will have an accompanying ArrayMesh resource. The ArrayMesh resource may be either internal or external to the TSCN file.
de: Ressourcen sind Komponenten, aus denen die Nodes bestehen. Zum Beispiel hat ein MeshInstance-Node eine zugehörige ArrayMesh-Ressource. Die ArrayMesh-Ressource kann entweder intern oder extern in der TSCN-Datei sein.
es: Los recursos son componentes que conforman los nodos. Por ejemplo, un nodo MeshInstance tendrá un recurso ArrayMesh asociado. El recurso ArrayMesh puede ser interno o externo al archivo TSCN.
fi: Resurssit ovat komponentteja, joista solmut muodostuvat. Esimerkiksi MeshInstance-solmulla on ArrayMesh-resurssi. ArrayMesh-resurssi voi olla joko TSCN-tiedoston sisäinen tai sen ulkopuolinen.
fr: Les ressources sont les éléments qui composent les nœuds. Pour exemple, un nœud MeshInstance aura une ressource ArrayMesh associée. La ressource ArrayMesh peut être interne ou externe au fichier TSCN.
ja: リソースは、ノードを構成するコンポーネントです。たとえば、MeshInstanceノードには、付随するArrayMeshリソースがあります。ArrayMeshリソースは、TSCNファイルの内部または外部のいずれかである場合があります。
pt_br: Recursos são componentes que compõem os nós. Por exemplo, um nó MeshInstance terá um recurso ArrayMesh associado. O recurso ArrayMesh pode ser interno ou externo ao arquivo TSCN.
zh_tw: 資源是組成各個節點的元件。舉例來說，MeshInstance 節點中會有附帶的 ArrayMesh 資源。該 ArrayMesh 資源可以在 TSCN 檔的內部或外部。

source: References to the resources are handled by ``id`` numbers in the resource's heading. External resources and internal resources are referred to with ``ExtResource(id)`` and ``SubResource(id)``, respectively. Because there have different methods to refer to internal and external resources, you can have the same ID for both an internal and external resource.
de: Verweise auf die Ressourcen werden durch ``id``-Nummern in der Überschrift der Ressource behandelt. Auf externe Ressourcen und interne Ressourcen wird mit ``ExtResource(id)`` bzw. ``SubResource(id)`` verwiesen. Da es unterschiedliche Methoden gibt, um auf interne und externe Ressourcen zu verweisen, können Sie die gleiche ID für eine interne und externe Ressource haben.
es: Las referencias a los recursos se manejan mediante números ``id`` en el encabezado del recurso. Los recursos externos e internos se refieren con ``ExtResource(id)`` y ``SubResource(id)``, respectivamente. Debido a que tienen métodos diferentes para referirse a recursos internos y externos, es posible que un mismo ID se utilice para un recurso interno y externo.
fr: Les références aux ressources sont gérées par des numéros ``id`` dans l'en-tête de la ressource. Les ressources externes et les ressources internes sont respectivement référés à ``ExtResource(id)`` et ``SubResource(id)``. Comme il existe différentes méthodes pour référer aux ressources internes et externes, vous pouvez avoir le même ID pour une ressource interne et externe.
ja: リソースへの参照は、リソースの見出しの ``id`` 番号によって処理されます。外部リソースと内部リソースは、それぞれ ``ExtResource(id)`` と ``SubResource(id)`` で参照されます。内部リソースと外部リソースを参照する方法は異なるため、内部リソースと外部リソースの両方に同じIDを使用できます。
pt_br: Referências aos recursos são tratadas por números ``id`` no cabeçalho do recurso. Recursos externos e internos são referidos com ``ExtResource(id)`` e ``SubResource(id)``, respectivamente. Como há métodos diferentes para se referir a recursos internos e externos, você pode ter o mesmo ID para recursos internos e externos.
zh_tw: 資源的參照是以資源標題中的 ``id`` 數字來參照的。外部資源與內部資源分別使用 ``ExtResource(id)`` 與 ``SubResource(id)`` 來參照。由於用來參照內部與外部資源有不同的方法，因此同一個 ID 可能參照到不同的內部或外部資源。

source: For example, to refer to the resource ``[ext_resource id=3 type="PackedScene" path=....]``, you would use ``ExtResource(3)``.
de: Um zum Beispiel auf die Ressource ``[ext_resource id=3 type="PackedScene" path=....]`` zu verweisen, würden Sie ``ExtResource(3)`` verwenden.
es: Por ejemplo, para referirse al recurso "[ext_resource id=3 type="PackedScene" path=....]", se usaría "ExtResource(3)".
fi: Esimerkiksi resurssiin ``[ext_resource id=3 type="PackedScene" path=....]`` voidaan viitata näin: ``ExtResource(3)``.
fr: Pour exemple, pour se référer à la ressource ``[ext_resource id=3 type="PackedScene" path=....]``, vous utiliserez ``ExtResource(3)``.
ja: たとえば、リソース ``[ext_resource id=3 type="PackedScene" path=....]`` を参照するには、\ ``ExtResource(3)`` を使用します。
pt_br: Por exemplo, para se referir ao recurso ``[ext_resource id=3 type="PackedScene" path=....]``, você usaria ``ExtResource(3)``.
zh_tw: 舉例來說，若要參照到資源 ``[ext_resource id=3 type="PackedScene" path=....]`` ，則可使用 ``ExtResource(3)`` 。

source: External resources are links to resources not contained within the TSCN file itself. An external resource consists of a path, a type and an ID.
de: Externe Ressourcen sind Links zu Ressourcen, die nicht in der TSCN-Datei selbst enthalten sind. Eine externe Ressource besteht aus einem Pfad, einem Typ und einer ID.
es: Los recursos externos son enlaces a recursos que no están contenidos dentro del archivo TSCN en sí mismo. Un recurso externo consta de una ruta, un tipo y un ID.
fi: Ulkoiset resurssit ovat linkkejä resursseihin, jotka eivät sisälly TSCN-tiedostoon itsessään. Ulkoinen resurssi koostuu polusta, tyypistä ja ID:stä.
fr: Les ressources externes sont liés à des ressources non contenues dans le fichier TSCN lui-même. Une ressource externe consiste en un chemin, un type et un ID.
ja: 外部リソースは、TSCNファイル自体に含まれていないリソースへのリンクです。外部リソースは、パス、タイプ、およびIDで構成されます。
pt_br: Recursos externos são links para recursos não contidos no próprio arquivo TSCN. Um recurso externo consiste em um caminho, um tipo e um ID.
zh_tw: 外部資源會連結不包含 TSCN 檔自身的資源。外部資源由路徑、型別與 ID 組成。

source: Godot always generates absolute paths relative to the resource directory and thus prefixed with ``res://``, but paths relative to the TSCN file's location are also valid.
de: Godot erzeugt immer absolute Pfade ausgehend vom Quellverzeichnis und zeigt dieses an als ``res://``, aber Pfade relativ zu TSCN Datei-Verzeichnisssen sind ebenso möglich.
es: Godot siempre genera rutas absolutas relativas al directorio de recursos y, por lo tanto, se les agrega el prefijo ``res://``, pero las rutas relativas a la ubicación del archivo TSCN también son válidas.
fr: Godot génère toujours des chemins absolus par rapport au répertoire des ressources relatifs et ainsi préfixé avec ``res://``, mais les chemins relatifs à l'emplacement du fichier TSCN sont également valides.
ja: Godotは常にリソースディレクトリを基準とした絶対パスを生成し、\ ``res://`` というプレフィックスを付けますが、TSCNファイルの場所を基準としたパスも有効です。
pt_br: Godot sempre gera caminhos absolutos relativos ao diretório de recursos e, portanto, prefixados com ``res://``, mas caminhos relativos à localização do arquivo TSCN também são válidos.
zh_tw: Godot 會產生相對於資源目錄的絕對路徑，並以 ``res://`` 開頭。但也可以使用相對於 TSCN 檔位置的相對路徑。

source: Some example external resources are:
de: Einige Beispiele externer Quellen sind:
es: Algunos ejemplos de recursos externos son:
fi: Joitakin esimerkkejä ulkoisista resursseista:
fr: Quelques exemples de ressources externes sont :
ja: 外部リソースの例を次に示します:
pt_br: Alguns exemplos de recursos externos são:
zh_tw: 一些外部資源的範例：

source: Like TSCN files, a TRES file may contain single-line comments starting with a semicolon (``;``). However, comments will be discarded when saving the resource using the Godot editor.
de: Wie TSCN-Dateien kann auch eine TRES-Datei einzeilige Kommentare enthalten, die mit einem Semikolon (``;``) beginnen. Die Kommentare werden jedoch beim Speichern der Ressource mit dem Godot-Editor verworfen.
es: Como los archivos TSCN, un archivo TRES puede contener comentarios de una sola línea que comienzan con un punto y coma (``;``). Sin embargo, los comentarios serán descartados al guardar el recurso utilizando el editor de Godot.
fr: Comme les fichiers TSCN, un fichier TRES peut contenir des commentaires d'une seule ligne commençant par un point-virgule (``;``). Cependant, les commentaires seront supprimés lors de la sauvegarde de la ressource à l'aide de l'éditeur Godot.
ja: TSCNファイルと同様に、TRESファイルにはセミコロン(``;``)で始まる単一行のコメントが含まれる場合があります。ただし、Godotエディタを使用してリソースを保存すると、コメントは破棄されます。
pt_br: Como os arquivos TSCN, um arquivo TRES pode conter comentários de uma única linha começando com um ponto e vírgula (``;``). No entanto, os comentários serão descartados ao salvar o recurso usando o editor Godot.
zh_tw: 與 TSCN 檔類似，TRES 檔可以包含使用分號 (``;``) 開頭的單行註解。但，在使用 Godot 編輯器保存資源時，註解會被移除。

source: A TSCN file can contain meshes, materials and other data. These are contained in the *internal resources* section of the file. The heading for an internal resource looks similar to those of external resources, except that it doesn't have a path. Internal resources also have ``key=value`` pairs under each heading. For example, a capsule collision shape looks like:
de: Eine TSCN-Datei kann Meshes, Materialien und andere Daten enthalten. Diese sind im Abschnitt *interne Ressourcen* der Datei enthalten. Die Überschrift für eine interne Ressource sieht ähnlich aus wie die von externen Ressourcen, mit dem Unterschied, dass sie keinen Pfad hat. Interne Ressourcen haben auch ``Schlüssel=Wert``-Paare unter jeder Überschrift. Eine Kapselkollisionsform sieht zum Beispiel so aus:
es: Un archivo TSCN puede contener mallas, materiales y otros datos. Estos se encuentran en la sección de *recursos internos* del archivo. La cabecera de un recurso interno se parece a la de los recursos externos, excepto que no tiene una ruta. Los recursos internos también tienen pares de ``clave=valor`` bajo cada cabecera. Por ejemplo, una forma de colisión de cápsula se vería así:
fr: Un fichier TSCN peut contenir des meshes, des matériaux et d'autres données. Ceux-ci sont contenus dans la section *ressources internes* du fichier. Le titre d'une ressource interne ressemble à celui des ressources externes, sauf qu'il n'a pas de chemin d'accès. Les ressources internes ont également des paires ``clé=valeur`` sous chaque rubrique. Par exemple, la forme de collision d'une capsule ressemble à :
ja: TSCNファイルには、メッシュ、マテリアル、その他のデータを含めることができます。これらは、ファイルの *internal resources* セクションに含まれています。内部リソースの見出しは、パスがないことを除いて、外部リソースの見出しと似ています。内部リソースには、各見出しの下に ``key = value`` のペアもあります。たとえば、カプセルのコリジョン形状は次のようになります:
pt_br: Um arquivo TSCN pode conter malhas, materiais e outros dados. Eles estão contidos na seção *internal resources* do arquivo. O título de um recurso interno é semelhante ao de recursos externos, exceto pelo fato de não ter um caminho. Os recursos internos também têm pares ``key = value`` em cada título. Por exemplo, uma forma de colisão de cápsula se parece com:
zh_tw: 一個 TSCN 檔可以包含網格、材質與其他資料。這些資料都放在 TSCN 檔中的 **內部資源** 區塊中。內部資源區塊的標題看起來與外部資源的標題類似，但內部資源的標題不含路徑。內部資源中的各個標題中也有 ``key=value`` 索引鍵／值組。舉例來說，膠囊型碰撞區域會像這樣：

source: Some internal resources contain links to other internal resources (such as a mesh having a material). In this case, the referring resource must appear *before* the reference to it. This means that order matters in the file's internal resources section.
de: Einige interne Ressourcen enthalten Verweise auf andere interne Ressourcen (z. B. ein Mesh, das ein Material hat). In diesem Fall muss die verweisende Ressource *vor* dem Verweis auf sie erscheinen. Das bedeutet, dass die Reihenfolge im Abschnitt "Interne Ressourcen" der Datei wichtig ist.
es: Algunos recursos internos contienen enlaces a otros recursos internos (por ejemplo, una malla que tiene un material). En este caso, el recurso referente debe aparecer *antes* de la referencia a él. Esto significa que el orden es importante en la sección de recursos internos del archivo.
fr: Certaines ressources internes contiennent des liens vers d'autres ressources internes (comme une mesh ayant un matériau). Dans ce cas, la ressource de référence doit apparaître *avant* la référence à celle-ci. Cela signifie que l'ordre à de l'importance dans la section des ressources internes du dossier.
ja: 一部の内部リソースには、他の内部リソース(マテリアルを持つメッシュなど)へのリンクが含まれています。この場合、参照元のリソースは、参照される\ *前に*\ 出現する必要があります。これは、ファイルの内部リソースセクションで順序が重要であることを意味します。
pt_br: Alguns recursos internos contêm links para outros recursos internos (como uma malha com um material). Nesse caso, o recurso de referência deve aparecer *antes* da referência a ele. Isso significa que a ordem é importante na seção de recursos internos do arquivo.
zh_tw: 有的內部資源會包含指向另一個內部資源的連結 (如網格會具有材質)。這種情況下，被參照的資源的資源必須要放在參照 **之前** 。這表示，在 TSCN 檔中，要注意檔案內部資源區塊的順序。

source: Unfortunately, documentation on the formats for these subresources isn't complete. Some examples can be found by inspecting saved resource files, but others can only be found by looking through Godot's source.
de: Leider ist die Dokumentation zu den Formaten für diese Subressourcen nicht vollständig. Einige Beispiele können durch die Inspektion gespeicherter Ressourcendateien gefunden werden, aber andere können nur durch einen Blick in den Quelltext von Godot gefunden werden.
es: Lamentablemente, la documentación sobre los formatos de estos subrecursos no está completa. Algunos ejemplos se pueden encontrar inspeccionando archivos de recursos guardados, pero otros solo se pueden encontrar revisando el código fuente de Godot.
fr: Malheureusement, la documentation sur les formats de ces sous-ressources n'est pas complète. Certains exemples peuvent être trouvés en inspectant les fichiers de ressources sauvegardés, mais d'autres ne peuvent être trouvés qu'en consultant le code source de Godot.
ja: 残念ながら、これらのサブリソースの形式に関するドキュメントは完全ではありません。いくつかの例は保存されたリソースファイルを調べることで見つけることができますが、他の例はGodotのソースを調べることでのみ見つけることができます。
pt_br: Infelizmente, a documentação sobre os formatos desses sub-recursos está incompleta. Alguns exemplos podem ser encontrados inspecionando arquivos de recursos salvos, mas outros só podem ser encontrados examinando o código-fonte do Godot.
zh_tw: 不幸的是，有關這些子資源格式的說明文件還不完整。雖然可以通過檢視保存後的資源檔案來找到範例，但有的子資源格式只能在 Godot 原始碼中看到。

source: ArrayMesh consists of several surfaces, each in the format ``surface\Index={}``. Each surface is a set of vertices and a material.
de: ArrayMesh besteht aus mehreren Flächen, jeweils im Format ``surface\Index={}``. Jede Fläche ist ein Array von Vertexpunkten und ein Material.
es: ArrayMesh consiste de varias superficies, cada una en el formato ``surface\Index={}``. Cada superficie es un conjunto de vértices y un material.
fi: ArrayMesh koostuu useista pinnoista, jotka kukin ovat muotoa ``surface\Index={}``. Kullakin pinnalla on joukko kärkipisteitä ja materiaali.
fr: ArrayMesh est constitué de plusieurs surfaces, chacune au format ``surface\Index={}``. Chaque surface est un ensemble de sommets et un matériau.
ja: ArrayMeshは、それぞれが ``surface\Index={}`` という形式のいくつかのサーフェスで構成されています。各サーフェスは、頂点とマテリアルのセットです。
pt_br: ArrayMesh consiste em várias superfícies, cada uma no formato ``surface\Index={}``. Cada superfície é um conjunto de vértices e um material.
zh_tw: ArrayMesh 是由數個表面組成的，各個表面的格式都為 ``surface\Index={}`` 。每個表面都是一組頂點與材質的組合。

source: TSCN files support two surface formats:
de: TSCN-Dateien unterstützen zwei Oberflächenformate:
es: Los archivos TSCN admiten dos formatos de superficie:
fi: TSCN-tiedostot tukevat kahta erilaista pinnan formaattia:
fr: Les fichiers TSCN supportent deux formats de surface :
ja: TSCNファイルは、次の2つのサーフェス形式をサポートします:
pt_br: Arquivos TSCN suportam dois formatos de superfície:
zh_tw: TSCN 檔支援兩種表面格式：

source: For the old format, each surface has three essential keys:
de: Für das alte Format hat jede Oberfläche drei wesentliche Schlüssel:
es: Para el formato antiguo, cada superficie tiene tres claves esenciales:
fi: Vanhassa formaatissa kullakin pinnalla on kolme olennaista avainta:
fr: Pour l'ancien format, chaque surface a trois clés essentielles :
ja: 古い形式では、各サーフェスには3つの重要なキーがあります:
pt_br: No formato antigo, cada superfície tem três chaves essenciais:
zh_tw: 對於舊版格式，各個表面都有三種主要的索引鍵：
