Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/development/file_formats/tscn.po
Languages: de, es, fi, fr, ja, pt_br, zh_tw

source: TSCN file format
de: TSCN Dateiformat
es: Formato de archivo TSCN
fi: TSCN-tiedostomuoto
fr: Le Format de Fichier TSCN
ja: TSCNファイル形式
pt_br: Formato de arquivo TSCN
zh_tw: TSCN 檔案格式

source: The TSCN (text scene) file format represents a single scene tree inside Godot. Unlike binary SCN files, TSCN files have the advantage of being mostly human-readable and easy for version control systems to manage.
es: El formato de archivo TSCN (escena de texto) representa un solo árbol de escena dentro de Godot. A diferencia de los archivos binarios SCN, los archivos TSCN tienen la ventaja de ser principalmente legibles por humanos y fáciles de gestionar en sistemas de control de versiones.

source: The ESCN (exported scene) file format is identical to the TSCN file format, but is used to indicate to Godot that the file has been exported from another program and should not be edited by the user from within Godot. Unlike SCN and TSCN files, during import, ESCN files are compiled to binary SCN files stored inside the ``.import/`` folder. This reduces the data size and speeds up loading, as binary formats are faster to load compared to text-based formats.
es: El formato de archivo ESCN (escena exportada) es idéntico al formato de archivo TSCN, pero se utiliza para indicar a Godot que el archivo ha sido exportado desde otro programa y no debe ser editado por el usuario desde dentro de Godot. A diferencia de los archivos SCN y TSCN, durante la importación, los archivos ESCN se compilan a archivos SCN binarios que se almacenan dentro de la carpeta ``.import/``. Esto reduce el tamaño de los datos y acelera la carga, ya que los formatos binarios se cargan más rápido en comparación con los formatos basados en texto.
pt_br: O formato de arquivo ESCN (cena exportada) é idêntico ao formato de arquivo TSCN, mas é usado para indicar ao Godot que o arquivo foi exportado de outro programa e não deve ser editado pelo usuário de dentro do Godot. Ao contrário dos arquivos SCN e TSCN, durante a importação, os arquivos ESCN são compilados em arquivos SCN binários armazenados dentro da pasta ``.import/``. Isso reduz o tamanho dos dados e acelera o carregamento, pois os formatos binários são mais rápidos de carregar em comparação com os formatos baseados em texto.

source: For those looking for a complete description, the parsing is handled in the file `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ in the ``ResourceFormatLoaderText`` class.
de: Für diejenigen, die eine vollständige Beschreibung suchen, wird das Parsen in der Datei `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ in der Klasse ``ResourceFormatLoaderText`` behandelt.
es: Para los que buscan una descripción completa, el análisis sintáctico se maneja en el archivo `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ en la clase ``ResourceFormatLoaderText``.
fi: Jos etsit täydellistä kuvausta, jäsennys on käsitelty tiedostossa `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_, luokassa ``ResourceFormatLoaderText``.
fr: Pour ceux qui recherchent une description complète, l'analyse est gérée dans le fichier `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ dans la classe ``ResourceFormatLoaderText``.
ja: 完全な説明をお探しの場合、解析は `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ ファイルの ``ResourceFormatLoaderText`` クラスで処理されるので、そちらを確認してみてください。
pt_br: Para quem procura uma descrição completa, a análise é tratada no arquivo `resource_format_text.cpp<https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ na classe ``ResourceFormatLoaderText``.
zh_tw: 若需要完整的說明，請參考 ``ResourceFormatLoaderText`` 中負責剖析該格式的 `resource_format_text.cpp <https://github.com/godotengine/godot/blob/master/scene/resources/resource_format_text.cpp>`_ 檔案。

source: File structure
de: Dateistruktur
es: Estructura de los archivos
fi: Tiedoston rakenne
fr: Structure de fichier
ja: ファイル構造
pt_br: Estrutura do arquivo
zh_tw: 檔案結構

source: There are five main sections inside the TSCN file:
de: Es gibt 5 Hauptblöcke innerhalb der TSCN Datei:
es: Hay cinco secciones principales dentro de los archivos TSCN:
fi: TSCN-tiedosto sisältää viisi pääosiota:
fr: Il y a cinq sections principales dans le fichier TSCN :
ja: TSCNファイルには、次の5つの主要なセクションがあります:
pt_br: Existem cinco seções principais dentro do arquivo TSCN:
zh_tw: 在 TSCN 檔中主要有五個區塊：

source: File Descriptor
de: Datei Beschreiber
es: Descriptor de Archivos
fi: Tiedoston kuvaus
fr: Descripteur de fichier
ja: ファイル記述子
pt_br: Descritor de Arquivo
zh_tw: 檔案描述元

source: External resources
de: Externe Quellen
es: Recursos externos
fi: Ulkoiset resurssit
fr: Ressources externes
ja: 外部リソース
pt_br: Recursos externos
zh_tw: 外部資源

source: Internal resources
de: Interne Quellen
es: Recursos internos
fi: Sisäiset resurssit
fr: Ressources internes
ja: 内部リソース
pt_br: Recursos internos
zh_tw: 內部資源

source: Nodes
es: Nodos
fi: Solmut
fr: Les nœuds
ja: ノード
pt_br: Nós
zh_tw: 節點

source: Connections
de: Verbindungen
es: Conexiones
fr: Connexions
ja: 接続
pt_br: Conexões
zh_tw: 連接

source: The file descriptor looks like ``[gd_scene load_steps=3 format=2]`` and should be the first entry in the file. The ``load_steps`` parameter is equal to the total amount of resources (internal and external) plus one (for the file itself). If the file has no resources, ``load_steps`` is omitted. The engine will still load the file correctly if ``load_steps`` is incorrect, but this will affect loading bars and any other piece of code relying on that value.
de: Der Dateideskriptor sieht aus wie ``[gd_scene load_steps=3 format=2]`` und sollte der erste Eintrag in der Datei sein. Der Parameter ``load_steps`` ist gleich der Gesamtmenge der Ressourcen (intern und extern) plus eins (für die Datei selbst). Wenn die Datei keine Ressourcen hat, wird ``load_steps`` weggelassen. Die Engine wird die Datei immer noch korrekt laden, wenn ``load_steps`` nicht korrekt ist, aber das wirkt sich auf Ladebalken und jedes andere Stück Code aus, das sich auf diesen Wert verlässt.
es: La descripción del archivo tiene el siguiente aspecto: ``[gd_scene load_steps=3 format=2]`` y debe ser la primera entrada en el archivo. El parámetro ``load_steps`` es igual al número total de recursos (internos y externos) más uno (por el propio archivo). Si el archivo no tiene recursos, se omite el parámetro ``load_steps``. El motor seguirá cargando el archivo correctamente incluso si ``load_steps`` es incorrecto, pero esto afectará a las barras de carga y cualquier otro código que dependa de ese valor.

source: These sections should appear in order, but it can be hard to distinguish them. The only difference between them is the first element in the heading for all of the items in the section. For example, the heading of all external resources should start with ``[ext_resource .....]``.
de: Diese Abschnitte sollten in der Reihenfolge erscheinen, aber es kann schwierig sein, sie zu unterscheiden. Der einzige Unterschied zwischen ihnen ist das erste Element in der Überschrift für alle Elemente des Abschnitts. Zum Beispiel sollte die Überschrift aller externen Ressourcen mit ``[ext_resource .....]`` beginnen.
es: Estas secciones deben aparecer en orden, pero puede ser difícil distinguirlas. La única diferencia entre ellas es el primer elemento en el encabezado de todos los elementos de la sección. Por ejemplo, el encabezado de todos los recursos externos debe comenzar con ``[ext_resource .....]``.
fi: Näiden osioiden tulisi esiintyä järjestyksessä, mutta niiden erottelu voi olla hankalaa. Ainoa ero niiden välillä on otsikon ensimmäinen elementti, joka on yhdistävä tekijä kaikille osion muille kohdille. Esimerkiksi kaikkien ulkoisten resurssien otsikoiden pitäisi alkaa ``[ext_resource .....]``.
fr: Ces sections doivent apparaître dans l'ordre, mais il peut être difficile de les distinguer. La seule différence entre elles est le premier élément de l'en-tête de tous les éléments de la section. Par exemple, l'intitulé de toutes les ressources externes doit commencer par ``[ext_resource .....]``.
ja: これらのセクションは順番に表示されますが、区別するのは難しい場合があります。それらの唯一の違いは、セクション内のすべての項目の見出しの最初の要素です。たとえば、すべての外部リソースの見出しは ``[ext_resource .....]`` で始まる必要があります。
pt_br: Estas seções devem aparecer em ordem, mas pode ser difícil distingui-las. A única diferença entre elas é o primeiro elemento no título de todos os itens da seção. Por exemplo, o cabeçalho de todos os recursos externos deve começar com ``[ext_resource .....]``.
zh_tw: 這些區塊應照會順序排列，但要區分出各個段落可能有點困難。在這些區塊間的主要差異就是各個段落中所有項目標題的第一項元素。舉例來說，所有外部資源的標題都應以 ``[ext_resource ......]`` 開頭。

source: A TSCN file may contain single-line comments starting with a semicolon (``;``). However, comments will be discarded when saving the file using the Godot editor.
de: Eine TSCN-Datei kann einzeilige Kommentare enthalten, die mit einem Semikolon (``;``) beginnen. Die Kommentare werden jedoch beim Speichern der Datei mit dem Godot-Editor verworfen.
es: Los archivos TSCN pueden contener comentarios de una sola línea que empiezan con un punto y coma (``;``). Sin embargo, los comentarios serán descartados cuando se guarde el archivo usando el editor de Godot.
fr: Un fichier TSCN peut contenir des commentaires sur une seule ligne avec un point-virgule (``;``). Toutefois, les commentaires seront ignorés lors de l'enregistrement du fichier en utilisant l'éditeur Godot.
ja: TSCNファイルには、セミコロン(``;``)で始まる単一行のコメントが含まれる場合があります。ただし、Godotエディタを使用してファイルを保存すると、コメントは破棄されます。
pt_br: Um arquivo TSCN pode conter comentários de uma única linha começando com um ponto e vírgula (``;``). No entanto, os comentários serão descartados ao salvar o arquivo usando o editor do Godot.
zh_tw: TSCN 檔案可以包含以分號 (``;``) 開頭的單行註解。但，以 Godot 編輯器保存時會移除註解。

source: Entries inside the file
de: Einträge innerhalb der Datei
es: Entradas dentro de los archivos
fi: Tiedoston kohdat
fr: Entrées dans le fichier
ja: ファイル内のエントリ
pt_br: Entradas dentro do arquivo
zh_tw: 檔案內的項目

source: A heading looks like ``[<resource_type> key=value key=value key=value ...]`` where resource_type is one of:
de: Eine Überschrift sieht so aus ``[<resource_type> key=value key=value key=value ...]``, wobei resource_type einer der folgenden ist:
es: Un encabezado se parece a ``[<resource_type> key=value key=value key=value ...]`` donde resource_type es uno de:
fr: Un en-tête ressemble à ``[<resource_type> key=value key=value key=value ...]`` où resource_type est l'un de :
ja: 見出しは ``[<resource_type> key=value key=value key=value ...]`` のようになります。ここで、resource_typeは次のいずれかです:
pt_br: Um título se parece com ``[<resource_type> key=value key=value key=value ...]`` onde resource_type é um dos seguintes:
zh_tw: 當 resource_type 為下列其一時，標題看起來會像 ``[<resource_type> key=value key=value key=value ...]`` ：

source: Below every heading comes zero or more ``key = value`` pairs. The values can be complex datatypes such as Arrays, Transforms, Colors, and so on. For example, a spatial node looks like:
de: Unter jeder Überschrift stehen null oder mehr ``Schlüssel = Wert``-Paare. Die Werte können komplexe Datentypen wie Arrays, Transformationen, Farben und so weiter sein. Ein räumliches Node sieht zum Beispiel so aus:
es: Debajo de cada encabezado viene cero o más pares de ``clave = valor``. Los valores pueden ser tipos de datos complejos como Arrays, Transforms, Colors, etc. Por ejemplo, un nodo spatial se ve como:
fr: En-dessous de chaque en-tête vient zéro ou d'autres paires ``key = value``. Les valeurs peuvent être des types de données complexes tels que des Arrays, Transforms, Colors, etc.... Par exemple, un nœud spatial ressemble à :
ja: すべての見出しの下には、0個以上の ``key = value`` ペアがあります。値は、配列、幾何学変換、色などの複雑なデータ型にすることができます。たとえば、spatialノードは次のようになります:
pt_br: Abaixo de cada título, vem zero ou mais pares ``key = value``. Os valores podem ser tipos de dados complexos, como Matrizes, Transformações, Cores e assim por diante. Por exemplo, um nó espacial se parece com:
zh_tw: 在每個標題後都會有 0 或多個 ``key = value`` 索引鍵／值組。數值可以是複雜的資料型別，如 Array, Transform, Color …等。舉例來說，Spatial 節點可能會類似：

source: The scene tree
de: Der Szenenbaum
es: El árbol de escenas
fi: Skenepuu
fr: L'arbre de scène
ja: シーンツリー
pt_br: A árvore da cena
zh_tw: 場景樹

source: The scene tree is made up of… nodes! The heading of each node consists of its name, parent and (most of the time) a type. For example ``[node type="Camera" name="PlayerCamera" parent="Player/Head"]``
de: Der Szenenbaum besteht aus... Nodes! Der Kopf jedes Nodes besteht aus seinem Namen, Eltern und (meistens) einem Typ. Zum Beispiel ``[node type="Camera" name="PlayerCamera" parent="Player/Head"]``
es: ¡El árbol de escena está formado por... nodos! El encabezado de cada nodo consiste en su nombre, padre (y en la mayoría de los casos) un tipo. Por ejemplo, ``[node type="Camera" name="PlayerCamera" parent="Player/Head"]``
fr: L'arbre de la scène est fait de… nœuds ! L'en-tête de chaque nœud consiste en son nom, parent et (la plupart du temps) un type. Par exemple ``[node type="Camera" name="PlayerCamera" parent="Player/Head"]``
ja: シーンツリーは…ノードで構成されています！各ノードの見出しは、その名前、親、および(ほとんどの場合)タイプで構成されます。たとえば、\ ``[node type="Camera" name="PlayerCamera" parent="Player/Head"]``
pt_br: A árvore da cena é composta de... nós! O título de cada nó consiste em seu nome, pai e (na maioria das vezes) um tipo. Por exemplo ``[node type="Camera" name="PlayerCamera" parent="Player/Head"]``
zh_tw: 場景樹是由……節點構成的！各個節點的標題都是由名稱、母節點與 (大多數時候還會有) 型別所組成的。如， ``[node type="Camera" name="PlayerCamera" parent="Player/Head"]``

source: Other valid keywords include:
de: Andere gültige Schlüsselwörter beinhalten:
es: Otros palabras clave válidas incluyen:
fi: Muita avainsanoja ovat:
fr: Autres mots clés valides inclus :
ja: その他の有効なキーワードは次のとおりです:
pt_br: Outras palavras-chave válidas incluem:
zh_tw: 其他有效的關鍵字包含：

source: ``index`` (sets the order of appearance in the tree. If absent, inherited nodes will take precedence over plain ones)
es: ``index`` (establece el orden de aparición en el árbol. Si está ausente, los nodos heredados tendrán prioridad sobre los nodos regulares)
pt_br: ``index`` (define a ordem de aparição na árvore. Se ausente, os nós herdados terão precedência sobre os simples)

source: The first node in the file, which is also the scene root, must not have a ``parent=Path/To/Node`` entry in its heading. All scene files should have exactly *one* scene root. If it doesn't, Godot will fail to import the file. The parent path of other nodes should be absolute, but shouldn't contain the scene root's name. If the node is a direct child of the scene root, the path should be ``"."``. Here is an example scene tree (but without any node content):
de: Das erste Node in der Datei, dsa auch die Szenenwurzel ist, darf in der Überschrift keinen Eintrag ``parent=Path/To/Node`` haben. Alle Szenendateien sollten genau *eine* Szenenwurzel haben. Wenn das nicht der Fall ist, wird Godot die Datei nicht importieren können. Der übergeordnete Pfad der anderen Nodes sollte absolut sein, aber nicht den Namen der Szenenwurzel enthalten. Wenn das Node ein direktes Kind der Szenenwurzel ist, sollte der Pfad ``"."`` lauten. Hier ist ein Beispiel-Szenenbaum (allerdings ohne Nodeinhalt):
es: El primer nodo en el archivo, que también es la raíz de la escena, no debe tener una entrada ``parent=Path/To/Node`` en su encabezado. Todos los archivos de escena deben tener exactamente *una* raíz de escena. Si no la tiene, Godot no podrá importar el archivo. La ruta del padre de otros nodos debe ser absoluta, pero no debe contener el nombre de la raíz de la escena. Si el nodo es un hijo directo de la raíz de la escena, la ruta debe ser ``"."``. Aquí tienes un ejemplo del árbol de escena (pero sin contenido de nodos):
fi: Tiedoston ensimmäisessä solmussa, joka on myös skenen juurisolmu, ei tule olla ``parent=Path/To/Node`` merkintää otsikossa. Kaikissa skenetiedostoissa tulee olla tasan *yksi* juurisolmu. Jos näin ei ole, Godot ei pysty tuomaan tiedostoa. Muiden solmujen yläsolmujen polkujen tulee olla absoluuttisia, eikä niiden tule sisältää skenen juuren nimeä. Jos solmut sijaitsevat suoraan skenen juuren alla, niiden polkujen tulee olla ``"."``. Tässä on esimerkki skenepuusta (ilman solmusisältöä):
fr: Le premier nœud dans le fichier, qui est également la racine de la scène, ne doit pas avoir d'entrée ``parent=Path/To/Node`` dans son en-tête. Tous les fichiers de scène doivent avoir exactement *une* racine de scène. Sinon, Godot échoue à importer le fichier. Le chemin du parent des autres nœuds doit être absolu, mais ne doit pas contenir le nom de la racine de la scène. Si le nœud est un enfant direct de la racine de la scène, le chemin doit être ``"."``. Voici un exemple d'arbre de scène (mais sans aucun contenu de nœud) :
ja: シーンのルートでもあるファイルの最初のノードには、見出しに ``parent=Path/To/Node`` エントリがあってはなりません。すべてのシーンファイルには、正確に\ *1つ*\ のシーンルートが必要です。そうでない場合、Godotはファイルのインポートに失敗します。その他のノードの親パスは絶対パスである必要がありますが、シーンルートの名前を含めるべきではありません。ノードがシーンルートの直接の子である場合、パスは ``"."``(相対パス)である必要があります。シーンツリーの例を次に示します(ただし、ノードの内容は含んでいません):
pt_br: O primeiro nó no arquivo, que também é a raiz da cena, não deve ter uma entrada ``parent=Caminho/Para/Nó`` em seu cabeçalho. Todos os arquivos de cena devem ter exatamente *uma* raiz de cena. Caso contrário, o Godot não conseguirá importar o arquivo. O caminho pai de outros nós deve ser absoluto, mas não deve conter o nome da raiz da cena. Se o nó for filho direto da raiz da cena, o caminho deve ser ``"."``. Aqui está um exemplo de árvore de cena (mas sem qualquer conteúdo de nó):
zh_tw: 檔案中的第一個節點同時也是根節點，該節點的標題不得包含 ``parent=Path/To/Node`` 項目。所有的場景檔案都必須只有 **一個** 根節點，否則 Godot 將無法匯入該檔案。其他結點的母級節點必須使用絕對路徑，但不得包含場景的根名稱。若某個節點為場景根節點的直接子節點，則路徑為 `「 . 」``。下列為範例場景樹 (但無任何節點內容)：

source: Similar to the internal resource, the document for each node is currently incomplete. Fortunately, it is easy to find out because you can simply save a file with that node in it. Some example nodes are:
de: Ähnlich wie bei der internen Ressource ist das Dokument für jedes Node derzeit unvollständig. Glücklicherweise ist es leicht herauszufinden, da Sie einfach eine Datei mit diesem Node darin speichern können. Einige Beispielnodes sind:
es: Similar al recurso interno, el documento para cada nodo está actualmente incompleto. Afortunadamente, es fácil de averiguar porque simplemente puedes guardar un archivo con ese nodo en él. Algunos ejemplos de nodos son:
fr: Comme pour la ressource interne, le document de chaque nœud est actuellement incomplet. Heureusement, il est facile de le savoir car il suffit d'enregistrer un fichier contenant ce nœud. Voici quelques exemples de nœuds :
ja: 内部リソースと同様に、各ノードに関するドキュメントは現時点では不完全です。ですが幸いにも、そのノードを含むファイルを保存するだけで簡単に見つけられます。ノードの例を次に示します:
pt_br: Semelhante ao recurso interno, o documento para cada nó está incompleto no momento. Felizmente, é fácil descobrir porque você pode simplesmente salvar um arquivo com esse nó nele. Alguns exemplos de nós são:
zh_tw: 跟內部資源一樣，有關各個節點的說明文件還不完整。但幸運的是，我們只要將節點保存到檔案後就能看到各個節點。下列為一些範例節點：

source: NodePath
es: Ruta del nodo

source: A tree structure is not enough to represent the whole scene. Godot uses a ``NodePath(Path/To/Node)`` structure to refer to another node or attribute of the node anywhere in the scene tree. For instance, MeshInstance uses ``NodePath()`` to point to its skeleton. Likewise, Animation tracks use ``NodePath()`` to point to node properties to animate.
de: Eine Baumstruktur reicht nicht aus, um die gesamte Szene darzustellen. Godot verwendet eine ``NodePath(Path/To/Node)`` Struktur, um auf ein anderes Node oder ein Attribut des Nodes irgendwo im Szenenbaum zu verweisen. Zum Beispiel benutzt MeshInstance ``NodePath()``, um auf sein Skelett zu verweisen. Ebenso verwenden Animationsspuren ``NodePath()``, um auf Nodeeigenschaften zu zeigen, die animiert werden sollen.
es: Una estructura de árbol no es suficiente para representar toda la escena. Godot utiliza una estructura de ``NodePath(Path/To/Node)`` para hacer referencia a otro nodo o atributo del nodo en cualquier lugar del árbol de la escena. Por ejemplo, MeshInstance utiliza ``NodePath()`` para apuntar a su esqueleto. Del mismo modo, las pistas de animación utilizan ``NodePath()`` para apuntar a propiedades del nodo a animar.
fr: Une structure en arbre ne suffit pas pour représenter l'ensemble de la scène. Godot utilise une structure ``NodePath(Chemin/Vers/Le/Nœud )`` pour se référer à un autre nœud ou attribut de nœud n'importe où dans l'arbre de la scène. Par exemple, MeshInstance utilise ``NodePath()`` pour pointer vers son squelette. De même, les pistes d'animation utilisent ``NodePath()`` pour pointer vers les propriétés du nœud à animer.
ja: ツリー構造は、シーン全体を表すのに十分ではありません。 Godotは ``NodePath(Path/To/Node)`` 構造を使用して、シーンツリー内の任意の場所にある別のノードまたはノードの属性を参照します。たとえば、MeshInstanceは ``NodePath()`` を使用してそのスケルトンを指します。同様に、アニメーショントラックは ``NodePath()`` を使用して、アニメーション化するノードプロパティを指し示します。
pt_br: Uma estrutura em árvore não é suficiente para representar toda a cena. Godot usa uma estrutura ``NodePath(Caminho/Para/Nó)`` para se referir a outro nó ou atributo do nó em qualquer lugar na árvore de cena. Por exemplo, MeshInstance usa ``NodePath()`` para apontar para seu esqueleto. Da mesma forma, as trilhas de animação usam ``NodePath()`` para apontar para as propriedades do nó a serem animadas.
zh_tw: 使用樹狀結構並無法代表完整的場景。Godot 使用 ``NodePath(Path/To/Node)`` 結構來參照場景樹中的某個節點或節點的屬性。舉例來說，MeshInstance 使用 ``NodePoint()`` 來指向其骨架。同樣地，動畫軌使用 ``NodePath()`` 來指向動畫的節點屬性。

source: Skeleton
de: Skelett
es: Esqueleto
fi: Luuranko
fr: Squelette
ja: スケルトン
pt_br: Esqueleto
zh_tw: 骨架

source: The Skeleton node inherits the Spatial node, but also may have a list of bones described in key-value pairs in the format ``bones/Id/Attribute=Value``. The bone attributes consist of:
de: Der Skelett-Node erbt den Spatial-Node, kann aber auch eine Liste von Knochen haben, die in Schlüssel-Wert-Paaren im Format ``bones/Id/Attribute=Value`` beschrieben sind. Die Knochenattribute bestehen aus:
es: El nodo Skeleton hereda del nodo Spatial, pero también puede tener una lista de huesos descritos en pares de clave-valor en el formato ``bones/Id/Attribute=Value``. Los atributos de los huesos consisten en:
fi: Skeleton solmu periytyy Spatial solmusta, mutta sen lisäksi sillä voi olla lista luita avain-arvo pareina muodossa ``bones/Id/Attribute=Value``. Luiden attribuutit ovat:
fr: Le nœud Skeleton hérite du nœud Spatial, mais peut aussi avoir une liste d'os décrits dans des paires clé-valeur au format ``bones/Id/Attribute=Value``. Les attributs des os sont constitués de :
ja: SkeletonノードはSpatialノードを継承しますが、\ ``bones/Id/Attribute=Value`` の形式でキーと値のペアで記述されたボーンのリストも持つ場合があります。ボーンの属性は次のもので構成されます:
pt_br: O nó Skeleton herda o nó Spatial, mas também pode ter uma lista de ossos descritos em pares de valores-chave no formato ``bones/Id/Attribute=Value``. Os atributos ósseos consistem em:
zh_tw: Skeleton 節點繼承自 Spatial 節點，但同時 Skeleton 也以 ``bones/Id/Attribute=Value`` 這樣的格式來儲存一組索引鍵／值格式的骨頭列表。骨頭屬性由下列這幾個屬性構成：

source: ``name``
es: nombre

source: ``name`` must be the first attribute of each bone.
de: ``name`` muss das erste Attribut eines jeden Knochens sein.
es: ``name`` debe ser el primer atributo de cada hueso.
fi: ``name`` täytyy olla jokaisen luun ensimmäinen attribuutti.
fr: ``name`` doit être le premier attribut de chaque os.
ja: ``name`` は各ボーンの最初の属性でなければなりません。
pt_br: ``nome`` deve ser o primeiro atributo de cada osso.
zh_tw: ``name`` 必須為各個骨頭的第一個屬性。
