Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: pt_br

source: It is a common mistake to enable this effect, turn on a light, and not be able to appreciate it. This is because SSAO only acts on *ambient* light, not direct light.
pt_br: É um erro comum habilitar este efeito, ligar uma luz e não ser capaz apreciá-lo. Isso é porquê SSAO age apenas sobre luz *ambiente*,não luz direta.

source: This is why, in the image above, the effect is less noticeable under the direct light (on the left). If you want to force SSAO to work with direct light too, use the **Light Affect** parameter (even though this is not correct, some artists like how it looks).
pt_br: É por isso que, na imagem acima, o efeito é menos notável sob a luz direta (na esquerda). Se você quer forçar o SSAO a funcionar na luz direta também, use o parâmetro de **Light Affect** (mesmo que não seja o certo, alguns artistas gostam de como fica).

source: SSAO looks best when combined with a real source of indirect light, like GIProbe:
pt_br: SSAO fica melhor quando combinado com uma fonte real de luz indireta, como um GIProbe:

source: Tweaking SSAO is possible with several parameters:
pt_br: Ajustar SSAO é possível com alguns parâmetros:

source: **Radius/Intensity:** To control the radius or intensity of the occlusion, these two parameters are available. Radius is in world (Metric) units.
pt_br: **Raio/Intensidade:** Para controlar o raio ou a intensidade da oclusão, esses dois parâmetros estão disponíveis. Raio é em unidades do mundo real (Métrico).

source: **Radius2/Intensity2:** A Secondary radius/intensity can be used. Combining a large and a small radius AO generally works well.
pt_br: **Raio/Intensidade2:** Um raio/intensidade secundário pode ser usado. Combinando um raio pequeno e um grande a OA geralmente funciona bem.

source: **Bias:** This can be tweaked to solve self occlusion, though the default generally works well enough.
pt_br: **Bias:** Isso pode ser ajustado para resolver auto oclusão, apesar do padrão num geral funcionar suficientemente bem.

source: **Light Affect:** SSAO only affects ambient light, but increasing this slider can make it also affect direct light. Some artists prefer this effect.
pt_br: **Light Affect:** SSAO afeta apenas a luz ambiente, mas aumentar esse valor pode fazer com que ele também afete a luz direta. Alguns artistas preferem este efeito.

source: **Ao Channel Affect:** If a value of zero is used, only the material's AO texture will be used for ambient occlusion; SSAO will not be applied. Values greater than 0 multiply the AO texture by the SSAO effect to varying degrees. This does not affect materials without an AO texture.
pt_br: **AO Channel Affect:** Se o valor zero for usado, apenas a textura de AO do material será usada para a oclusão ambiente; SSAO não será aplicado. Valores maiores que 0 irão multiplicar a textura de AO pelo efeito de SSAO em vários níveis. Isso não afeta materiais sem uma textura de AO.

source: **Quality:** Depending on quality, SSAO will take more samples over a sphere for every pixel. High quality only works well on modern GPUs.
pt_br: **Qualidade:** Dependendo da qualidade , o SSAO necessitará de mais amostras sobre uma esfera para cada pixel. A qualidade alta só funciona em GPUs modernas.

source: **Blur:** Type of blur kernel used. The 1x1 kernel is a simple blur that preserves local detail better, but is not as efficient (generally works better with the high quality setting above), while 3x3 will soften the image better (with a bit of dithering-like effect), but does not preserve local detail as well.
pt_br: **Desfoque:** Tipo de matriz de desfoque utilizada. A matriz 1x1 é um desfoque simples que preserva melhor os detalhes locais, mas não é eficiente (geralmente funciona melhor com a configuração de qualidade alta acima), enquanto 3x3 irá suavizar melhor a imagem (com um pouco de efeito similar a matização), mas não preserva os detalhes locais tão bem.

source: **Edge Sharpness**: This can be used to preserve the sharpness of edges (avoids areas without AO on creases).
pt_br: **Edge Sharpness**: Isto é usado para preservar a nitidez das bordas (evita áreas sem AO em vincos).

source: Depth of Field / Far Blur
pt_br: Profundidade de Campo / Desfoque distante

source: This effect simulates focal distance on high end cameras. It blurs objects behind a given range. It has an initial **Distance** with a **Transition** region (in world units):
pt_br: Este efeito simula a distância focal em câmeras de alta qualidade. Ele desfoca objetos atrás de um determinado intervalo. Possui uma **Distância** inicial com uma região de **Transição** (em unidades mundiais):

source: The **Amount** parameter controls the amount of blur. For larger blurs, tweaking the **Quality** may be needed in order to avoid artifacts.
pt_br: O parâmetro **Amount** controla a quantidade de desfoque. Para desfoques maiores, pode ser necessário ajustar a qualidade para evitar artefatos.

source: Depth of Field / Near Blur
pt_br: Profundidade de campo / Próximo de desfoque

source: This effect simulates focal distance on high end cameras. It blurs objects close to the camera (acts in the opposite direction as far blur). It has an initial **Distance** with a **Transition** region (in world units):
pt_br: Este efeito simula a distância focal em câmeras de alta qualidade. Ele desfoca objetos próximos à câmera (atua na direção oposta como desfoque distante). Possui uma **Distância** inicial com uma região de **Transição** (em unidades mundiais):

source: It is common to use both blurs together to focus the viewer's attention on a given object:
pt_br: É comum usar os dois desfoques juntos para focar a atenção do espectador em um determinado objeto:

source: Glow
pt_br: Brilho

source: In photography and film, when light amount exceeds the maximum supported by the media (be it analog or digital), it generally bleeds outwards to darker regions of the image. This is simulated in Godot with the **Glow** effect.
pt_br: Na fotografia e no filme, quando a quantidade de luz excede o máximo suportado pela mídia (seja ela analógica ou digital), ela geralmente vaza para as regiões mais escuras da imagem. Isso é simulado em Godot com o efeito **Glow**.

source: By default, even if the effect is enabled, it will be weak or invisible. One of two conditions need to happen for it to actually show:
pt_br: Por padrão, mesmo que o efeito esteja ativado, ele será fraco ou invisível. Uma das duas condições precisa ocorrer para que ele seja de fato exibido:

source: The light in a pixel surpasses the **HDR Threshold** (where 0 is all light surpasses it, and 1.0 is light over the tonemapper **White** value). Normally, this value is expected to be at 1.0, but it can be lowered to allow more light to bleed. There is also an extra parameter, **HDR Scale**, that allows scaling (making brighter or darker) the light surpassing the threshold.
pt_br: A luz em um pixel ultrapassa o **Limite do HDR** (Aonde 0 é toda luz que o ultrapassa, e 1.0 são luzes além do valor **Branco** tonemapper). Normalmente, se espera que esse valor seja 1.0, mas ele pode ser reduzido para permitir que mais luz vaze. Há também um parâmetro extra, **Escala do HDR**, que permite escalonar (tornando mais clara ou escura) a luz que ultrapassar o limite.

source: The Bloom effect has a value set greater than 0. As it increases, it sends the whole screen to the glow processor at higher amounts.
pt_br: O efeito de Bloom aceita valor acima de 0. Conforme ele aumenta, ele envia toda a tela para o processador de brilho em maiores quantidades.

source: Both will cause the light to start bleeding out of the brighter areas.
pt_br: Ambos farão a luz começar vazar para fora das áreas mais claras.

source: Once glow is visible, it can be controlled with a few extra parameters:
pt_br: Assim que o Glow estar visível, ele pode ser controlado com alguns parâmetros extras:

source: **Intensity** is an overall scale for the effect, it can be made stronger or weaker (0.0 removes it).
pt_br: **Intensidade** é uma escala geral para o efeito, ele pode ser mais forte ou mais fraco (0.0 anula o efeito).

source: **Strength** is how strong the gaussian filter kernel is processed. Greater values make the filter saturate and expand outwards. In general, changing this is not needed, as the size can be more efficiently adjusted with the **Levels**.
pt_br: **Força** é como o núcleo do filtro gaussiano é processado. Valores maiores fazem o filtro saturar mais e expandir para fora. Num geral, mudar isso não é necessário, já que esse valor pode ser melhor ajustado com os **Níveis**.

source: The **Blend Mode** of the effect can also be changed:
pt_br: O **Modo de Mistura** do efeito também pode ser alterado:

source: **Additive** is the strongest one, as it only adds the glow effect over the image with no blending involved. In general, it's too strong to be used, but can look good with low intensity Bloom (produces a dream-like effect).
pt_br: O **Aditivo** é o mais forte, pois apenas adiciona o efeito de brilho sobre a imagem sem mistura envolvida. Em geral, é muito forte para ser usado, mas pode ficar bem com Bloom de baixa intensidade (produz um efeito de sonho).

source: **Screen** ensures glow never brightens more than itself and it works great as an all around.
pt_br: **Tela** garante que o brilho nunca ilumine mais do que ele mesmo e funciona muito bem como um todo.

source: **Softlight** is the default and weakest one, producing only a subtle color disturbance around the objects. This mode works best on dark scenes.
pt_br: **Luz suave** é o padrão e o mais fraco, produzindo apenas uma leve mudança de cor em torno dos objetos. Esse modo funciona melhor em cenas escuras.

source: **Replace** can be used to blur the whole screen or debug the effect. It only shows the glow effect without the image below.
pt_br: **Substituir** pode ser usado para desfocar toda a cena ou depurar o efeito. Isso mostra apenas o efeito de brilho sem a imagem por baixo.

source: To change the glow effect size and shape, Godot provides **Levels**. Smaller levels are strong glows that appear around objects, while large levels are hazy glows covering the whole screen:
pt_br: Para mudar o tamanho e forma do efeito de brilho, a Godot possibilita usar **Níveis**. Níveis menores tem um brilho mais forte entorno do objeto, e níveis mais altos são brilhos mais nebulosos na tela inteira:

source: The real strength of this system, though, is to combine levels to create more interesting glow patterns:
pt_br: A real força desse sistema, no entanto, é combinar níveis para criar padrões mais interessantes de brilho:

source: Finally, as the highest layers are created by stretching small blurred images, it is possible that some blockiness may be visible. Enabling **Bicubic Upscaling** gets rids of it, at a minimal performance cost. *Note that this is effective only when using the GLES3 backend.*
pt_br: Finalmente, como as camadas superiores são criadas ao ampliar imagens pequenas borradas, é possível que algum nível de pixelização seja visível. Habilitar o **Upscaling Bicúbico** resolve esse problema, com um custo mínimo de desempenho. *Note que essa melhoria só será efetiva quando o módulo GLES3 estiver em uso.*

source: Adjustments
pt_br: Ajustes

source: At the end of processing, Godot offers the possibility to do some standard image adjustments.
pt_br: Ao fim do processamento, A Godot oferece a possibilidade de fazer alguns ajustes padrão de imagem.

source: The first one is being able to change the typical Brightness, Contrast, and Saturation:
pt_br: O primeiro ajuste serve para alterar os valores padrão para Brilho, Contraste e Saturação da imagem:

source: The second is by supplying a color correction gradient. A regular black to white gradient like the following one will produce no effect:
pt_br: O segundo ajuste funciona usando um gradiente de correção de cor. Um gradiente preto para branco comum como o da imagem a seguir não irá mudar nada:

source: But creating custom ones will allow to map each channel to a different color:
pt_br: Mas criar gradientes específicos permite mudar cada canal de cor para uma cor diferente:

source: Translation status
pt_br: Progresso da Tradução
