Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/environment_and_post_processing.po
Languages: pt_br

source: Environment and post-processing
pt_br: Ambiente e pós-processamento

source: Godot 3 provides a redesigned Environment resource, as well as a new post-processing system with many available effects right out of the box.
pt_br: Godot 3 fornece um recurso de ambiente redesenhado, bem como um novo sistema de pós-processamento com muitos efeitos disponíveis imediatamente.

source: Environment
pt_br: Ambiente

source: The Environment resource stores all the information required for controlling rendering environment. This includes sky, ambient lighting, tone mapping, effects, and adjustments. By itself it does nothing, but it becomes enabled once used in one of the following locations in order of priority:
pt_br: O recurso Ambiente armazena todas as informações necessárias para controlar o ambiente de renderização. Isso inclui céu, iluminação ambiente, mapeamento de tom, efeitos e ajustes. Por si só não faz nada, mas fica habilitado uma vez usado em um dos seguintes locais em ordem de prioridade:

source: Camera node
pt_br: Nó de câmera

source: An Environment can be set to a camera. It will have priority over any other setting.
pt_br: Um ambiente pode ser definido para uma câmera. Ele terá prioridade sobre qualquer outra configuração.

source: This is mostly useful when wanting to override an existing environment, but in general it's a better idea to use the option below.
pt_br: Isso é útil principalmente quando se deseja substituir um ambiente existente, mas, em geral, é uma ideia melhor usar a opção abaixo.

source: WorldEnvironment node
pt_br: Nó WorldEnvironment

source: The WorldEnvironment node can be added to any scene, but only one can exist per active scene tree. Adding more than one will result in a warning.
pt_br: O nó WorldEnvironment pode ser adicionado a qualquer cena, mas apenas um pode existir por árvore de cena ativa. Adicionar mais de um resultará em um alerta.

source: Any Environment added has higher priority than the default Environment (explained below). This means it can be overridden on a per-scene basis, which makes it quite useful.
pt_br: Qualquer ambiente adicionado tem prioridade mais alta que o ambiente padrão (explicado abaixo). Isso significa que pode ser substituído por cena, o que o torna bastante útil.

source: Default environment
pt_br: Ambiente padrão

source: A default environment can be set, which acts as a fallback when no Environment was set to a Camera or WorldEnvironment. Just head to Project Settings -> Rendering -> Environment:
pt_br: Um ambiente padrão pode ser definido, que atua como um padrão quando nenhum ambiente for definido na Camera ou no WorldEnvironment. Basta ir para Configurações do projeto -> Renderização -> Ambiente:

source: New projects created from the Project Manager come with a default environment (``default_env.tres``). If one needs to be created, save it to disk before referencing it here.
pt_br: Novos projetos criados a partir do Gerenciador de Projetos vêm com um ambiente padrão (``default_env.tres``). Se for necessário criar um, salve-o no disco antes de referenciá-lo aqui.

source: Environment options
pt_br: Opções de ambiente

source: Following is a detailed description of all environment options and how they are intended to be used.
pt_br: A seguir está uma descrição detalhada de todas as opções de ambiente e como elas devem ser usadas.

source: Background
pt_br: Plano de Fundo

source: The Background section contains settings on how to fill the background (parts of the screen where objects were not drawn). In Godot 3.0, the background not only serves the purpose of displaying an image or color, it can also change how objects are affected by ambient and reflected light.
pt_br: A seção Plano de fundo contém configurações de como preencher o plano de fundo (partes da tela onde os objetos não foram desenhados). No Godot 3.0, o plano de fundo não serve apenas para exibir uma imagem ou cor, mas também pode alterar como os objetos são afetados pela luz ambiente e refletida.

source: There are many ways to set the background:
pt_br: Há muitas maneiras de definir o fundo:

source: **Clear Color** uses the default clear color defined by the project. The background will be a constant color.
pt_br: **Clear Color** usa a cor padrão definida pelo projeto. O fundo será uma cor constante.

source: **Custom Color** is like Clear Color, but with a custom color value.
pt_br: **Custom Color** é como o Clear Color, mas com um valor de cor personalizado.

source: **Sky** lets you define a panorama sky (a 360 degree sphere texture) or a procedural sky (a simple sky featuring a gradient and an optional sun). Objects will reflect it and absorb ambient light from it.
pt_br: **Céu** permite definir um céu panorama (uma textura de esfera em 360 graus) ou um céu procedural (um céu simples com um gradiente e um sol opcional). Os objetos refletirão e absorverão a luz ambiente dele.

source: **Color+Sky** lets you define a sky (as above), but uses a constant color value for drawing the background. The sky will only be used for reflection and ambient light.
pt_br: **Color+Céu** permite definir um céu (como acima), mas usa um valor de color constante para desenhar o plano de fundo. O céu será usado apenas para reflexão e luz ambiente.

source: Ambient Light
pt_br: Luz ambiente

source: Ambient (as defined here) is a type of light that affects every piece of geometry with the same intensity. It is global and independent of lights that might be added to the scene.
pt_br: Ambiente (conforme definido aqui) é um tipo de luz que afeta todas as partes da geometria com a mesma intensidade. É global e independente de luzes que possam ser adicionadas à cena.

source: There are two types of ambient light: the *Ambient Color* (which is a constant color multiplied by the material albedo) and then one obtained from the *Sky* (as described before, but a sky needs to be set as background for this to be enabled).
pt_br: Há dois tipos de luz ambiente: A *Cor Ambiente* (que é uma cor constante multiplicada pelo albedo do material) e a obtida através do *Céu* (como dito antes, porém um céu precisa ser definido como plano de fundo para que isso possa ser habilitado).

source: When a *Sky* is set as background, it's possible to blend between ambient color and sky using the **Sky Contribution** setting (this value is 1.0 by default for convenience, so only the sky affects objects).
pt_br: Quando um *Sky* é definido como plano de fundo, é possível mesclar entre a cor ambiente e o céu usando a configuração **Sky Contribution** (o valor é 1.0 por padrão por conveniência, logo apenas o céu afeta os objetos).

source: Here is a comparison of how different ambient light affects a scene:
pt_br: Aqui está uma comparação de como a luz ambiente diferente afeta uma cena:

source: Finally, there is an **Energy** setting, which is a multiplier. It's useful when working with HDR.
pt_br: Finalmente, há uma configuração de **Energia**, sendo um multiplicador. É útil ao trabalhar com HDR.

source: In general, ambient light should only be used for simple scenes, large exteriors, or for performance reasons (ambient light is cheap), as it does not provide the best lighting quality. It's better to generate ambient light from ReflectionProbe or GIProbe, which will more faithfully simulate how indirect light propagates. Below is a comparison, in terms of quality, between using a flat ambient color and a GIProbe:
pt_br: No geral, luz ambiente só deve ser usada para cenas simples, exteriores grandes ou em razão de performance (luz ambiente é leve), já que ela não entrega a melhor qualidade de iluminação. É melhor gerar a luz ambiente de um ReflectionProbe ou GIProbe, que vão simular fielmente a forma com que a luz indireta se propaga. Abaixo há uma comparação, em termos de qualidade, entre usar uma cor ambiente única e um GIProbe:

source: Using one of the methods described above, objects get constant ambient lighting replaced by ambient light from the probes.
pt_br: Usando um dos métodos descritos acima, os objetos obtêm iluminação ambiente constante substituída pela luz ambiente das sondas.

source: Fog
pt_br: Névoa

source: Fog, as in real life, makes distant objects fade away into an uniform color. The physical effect is actually pretty complex, but Godot provides a good approximation. There are two kinds of fog in Godot:
pt_br: A névoa, como na vida real, faz com que objetos distantes desapareçam em uma cor uniforme. O efeito físico é bastante complexo, mas Godot fornece uma boa aproximação. Existem dois tipos de névoa em Godot:

source: **Depth Fog:** This one is applied based on the distance from the camera.
pt_br: **Depth Fog:** Este é aplicado com base na distância da câmera.

source: **Height Fog:** This one is applied to any objects below (or above) a certain height, regardless of the distance from the camera.
pt_br: **Height Fog:** Este é aplicado a qualquer objeto abaixo (ou acima) de uma certa altura, independentemente da distância da câmera.

source: Both of these fog types can have their curve tweaked, making their transition more or less sharp.
pt_br: Ambos os tipos de névoa podem ter sua curva ajustada, tornando sua transição mais ou menos nítida.

source: Two properties can be tweaked to make the fog effect more interesting:
pt_br: Duas propriedades podem ser ajustadas para tornar o efeito de névoa mais interessante:

source: The first is **Sun Amount**, which makes use of the Sun Color property of the fog. When looking towards a directional light (usually a sun), the color of the fog will be changed, simulating the sunlight passing through the fog.
pt_br: A primeira é **Sun Amount**, que faz uso da propriedade de Cor do Sol na névoa. Quando olhando em direção a uma luz direcional (geralmente um sol), a cor da névoa mudará, simulando a luz do sol passando pela névoa.

source: The second is **Transmit Enabled** which simulates more realistic light transmittance. In practice, it makes light stand out more across the fog.
pt_br: O segundo é **Transmit Enabled**, que simula uma transmitância de luz mais realista. Na prática, faz com que a luz se destaque mais no nevoeiro.

source: Tonemap
pt_br: Mapa de Tons

source: *This feature is only available when using the GLES3 backend.*
pt_br: *Esta característica só está disponível quando se utiliza o backend GLES3.*

source: Selects the tonemapping curve that will be applied to the scene, from a list of standard curves used in the film and game industry. Tonemapping operators other than Linear are used to make light and dark areas more homogeneous, while also avoiding clipping of bright highlights.
pt_br: Seleciona a curva de tonalidade que será aplicada a cena, de uma lista de curvas padrão de indústria usadas em filmes e jogos. Mapas de tonalidade fora do linear são usados para tornar as áreas claras e escura mais homogêneas, além de também evitar estourar a luz em áreas de destaque.

source: The tone mapping options are:
pt_br: As opções de mapeamento de tom são:

source: **Mode:** The tone mapping mode to use.
pt_br: **Mode:** O modo de mapeamento de tom a ser usado.

source: **Linear:** The default tonemapping mode. This is the fastest and simplest tonemapping operator, but it causes bright lighting to look blown out, with noticeable clipping in the output colors.
pt_br: **Linear:** É o método padrão de mapeamento do tom. É o mais rápido e mais simples operador de mapeamento de tom, mas isto faz com que cores brilhantes fiquem estouradas, com recorte perceptível nas cores de saída.

source: **Reinhardt:** Performs a variation on rendered pixels' colors by this formula: ``color = color / (1 + color)``. This avoids clipping bright highlights, but the resulting image can look a bit dull.
pt_br: **Reinhardt:** Executa uma variação nas cores dos pixels renderizados através desta fórmula: ``color = color / (1 + color)``. Isso evita cortes com realces brilhantes, mas a imagem resultante pode parecer um pouco sem brilho.

source: **Filmic:** This avoids clipping bright highlights, with a resulting image that usually looks more vivid than Reinhardt.
pt_br: **Filmic:** Este evita estourar os destaques muito claros, resultando numa imagem que geralmente parece mais vívida do que o Reinhardt.

source: **ACES Fitted:** Academy Color Encoding System tonemapper. ACES Fitted is slightly more expensive than other options, but it handles bright lighting in a more realistic fashion by desaturating it as it becomes brighter. ACES typically has a more contrasted output compared to Reinhardt and Filmic. ACES is the recommended option when aiming for photorealistic visuals.
pt_br: **ACES Fitted:** Mapa de tonalidade Academy Color Encoding System. ACES Fitted é levemente mais pesado que as outras opções, mas lida com a iluminação clara de uma forma mais realista ao dessaturar a medida que ela fica mais clara. ACES normalmente gera uma imagem mais contrastada se comparada ao Reinhardt e Filmic. ACES é a opção recomendada quando se esta buscando um visual fotorrealista.

source: **ACES:** *Deprecated (will be removed in Godot 4.0).* Behaves like ACES, but doesn't desaturate lighting as it becomes brighter (which is less realistic). It's recommended to use ACES Fitted instead of ACES.
pt_br: **ACES:** *Descontinuado (Será removido no Godot 4.0).* Se comporta como ACES, mas não dessatura a luz a medida que ela fica mais clara (o que é menos realista). É recomendado usar o ACES Fitted ao invés do ACES.

source: **Exposure:** Tone mapping exposure which simulates amount of light received over time (default: ``1.0``). Higher values result in an overall brighter appearance. If the scene appears too dark as a result of a tonemapping operator or whitepoint change, try increasing this value slightly.
pt_br: **Exposição:** Exposição do mapa de tonalidade que simula a quantidade de luz recebida ao longo do tempo (padrão ``1.0``). Valores mais altos resultam em uma aparência mais clara num geral. Caso a cena aparente muito escura por conta do mapa de tonalidade ou da mudança do ponto branco, tente aumentar levemente este valor.

source: **White:** Tone mapping whitepoint, which simulates where in the scale white is located (default: ``1.0``). For photorealistic lighting, recommended values are between ``6.0`` and ``8.0``. Higher values result in less blown out highlights, but make the scene appear slightly darker as a whole.
pt_br: **Branco:** Ponto branco do mapa de tonalidade, que simula aonde o branco está na escala (padrão:``1.0``). Para uma iluminação fotorrealista, é recomendado usar valores entre ``6.0`` e ``8.0``. Valores mais altos resultam em luzes de destaque menos estouradas, mas faz com que a cena aparente ligeiramente mais escura como um todo.

source: Auto Exposure (HDR)
pt_br: Exposição automática (HDR)

source: Even though, in most cases, lighting and texturing are heavily artist controlled, Godot supports a simple high dynamic range implementation with the auto exposure mechanism. This is generally used for the sake of realism when combining interior areas with low light and outdoors. Auto exposure simulates the camera (or eye) in an effort to adapt between light and dark locations and their different amounts of light.
pt_br: Mesmo que, na maioria dos casos, iluminação e texturização são fortemente controladas pelos artistas, a Godot suporta uma implementação simples do HDR com um mecanismo de auto exposição. Isso geralmente é usado em favor do realismo quando combinamos áreas internas com baixa iluminação e exteriores. Auto exposição simula uma câmera (ou olho) na tentativa de se adaptar entre locais claros e escuros e suas diferentes intensidades de luz.

source: The simplest way to use auto exposure is to make sure outdoor lights (or other strong lights) have energy beyond 1.0. This is done by tweaking their **Energy** multiplier (on the Light itself). To make it consistent, the **Sky** usually needs to use the energy multiplier too, to match with the directional light. Normally, values between 3.0 and 6.0 are enough to simulate indoor-outdoor conditions.
pt_br: A forma mais fácil de usar a auto exposição é tendo certeza de que as luzes do exterior (ou outra luz forte) tenha uma energia maior que 1.0. Isso é feito ao ajustar seu multiplicador de **Energia** (na própria Luz). Para tornar isso consistente, o **Céu** geralmente precisa usar o multiplicador de energia também, para se alinhar a luz direcional. Normalmente, valores entre 3.0 e 6.0 são o suficiente para simular as condições de interior-exterior.

source: By combining Auto Exposure with *Glow* post processing (more on that below), pixels that go over the tonemap **White** will bleed to the glow buffer, creating the typical bloom effect in photography.
pt_br: Ao combinar a Auto Exposição com o efeito de *Glow* (mais sobre isso a seguir), pixels que vão além do branco do tonemap irão transbordar para o buffer de glow, criando um efeito tipico de irradiação na fotografia.

source: The user-controllable values in the Auto Exposure section come with sensible defaults, but you can still tweak them:
pt_br: Os valores controláveis pelo usuário na seção Exposição Automática por padrão vêm valores sensatos, mas você ainda pode ajustá-los:

source: **Scale:** Value to scale the lighting. Brighter values produce brighter images, smaller ones produce darker ones.
pt_br: **Escala:** Valor para dimensionar a iluminação. Valores mais brilhantes produzem imagens mais brilhantes, menores produzem imagens mais escuras.

source: **Min Luma:** Minimum luminance that auto exposure will aim to adjust for. Luminance is the average of the light in all the pixels of the screen.
pt_br: **Min Luma:** Luminância mínima que a exposição automática terá como objetivo ajustar. Luminância é a média da luz em todos os pixels da tela.

source: **Max Luma:** Maximum luminance that auto exposure will aim to adjust for.
pt_br: **Max Luma:** Luminância máxima que a exposição automática terá como objetivo ajustar.

source: **Speed:** Speed at which luminance corrects itself. The higher the value, the faster correction happens.
pt_br: **Velocidade:** Velocidade na qual a luminância se corrige. Quanto maior o valor, mais rápida acontece a correção.

source: Mid- and post-processing effects
pt_br: Efeitos de médio e pós processamento

source: A large amount of widely-used mid- and post-processing effects are supported in the Environment.
pt_br: Uma grande quandidade de efeitos de médio e pós-processamento bastante utilizados são suportados no ambiente.

source: Screen-Space Reflections (SSR)
pt_br: Reflexos em Espaço de Tela (SSR)

source: While Godot supports three sources of reflection data (Sky, ReflectionProbe, and GIProbe), they may not provide enough detail for all situations. Scenarios where Screen Space Reflections make the most sense are when objects are in contact with each other (object over floor, over a table, floating on water, etc).
pt_br: Apesar da Godot suportar três fontes de dados de reflexos (Céu, ReflectionProbe e GIProbe), eles podem não oferecer dados suficientes para todas as situações. Cenários onde os Reflexos em Espaço de Tela fazem mais sentido são quando objetos estão em contato entre si (Objetos sobre o chão, sobre uma mesa, flutuando na água, etc...).

source: The other advantage (even if only enabled to a minimum), is that it works in real-time (while the other types of reflections are pre-computed). This can be used to make characters, cars, etc. reflect on surrounding surfaces when moving around.
pt_br: A outra vantagem (mesmo que ativada no mínimo) é que funciona em tempo real (enquanto os outros tipos de reflexos são pré-computados). Isso pode ser usado para criar personagens, carros, etc... Reflete em superfícies adjacentes ao se mover.

source: A few user-controlled parameters are available to better tweak the technique:
pt_br: Alguns parâmetros controlados pelo usuário estão disponíveis para melhor ajustar a técnica:

source: **Max Steps** determines the length of the reflection. The bigger this number, the more costly it is to compute.
pt_br: **Max Steps** determinam a distância do reflexo. Quanto maior este número, mais custoso é para se computar.

source: **Fade In** allows adjusting the fade-in curve, which is useful to make the contact area softer.
pt_br: **Fade In** permite ajustar a curva de aparecimento suave, que é útil para tornar a área de contato mais suave.

source: **Fade Out** allows adjusting the fade-out curve, so the step limit fades out softly.
pt_br: **Fade Out** permite ajustar a curva de desaparecimento gradual, para que o limite de passos desapareça suavemente.

source: **Depth Tolerance** can be used for screen-space-ray hit tolerance to gaps. The bigger the value, the more gaps will be ignored.
pt_br: **Tolerância de profundidade** pode ser usado para tolerância de batidas de raios-espaço de tela a lacunas. Quanto maior o valor, mais lacunas serão ignoradas.

source: **Roughness** will apply a screen-space blur to approximate roughness in objects with this material characteristic.
pt_br: **Rugosidade** aplicará um desfoque em espaço de tela para aproximar a rugosidade em objetos das características deste material.

source: Keep in mind that screen-space-reflections only work for reflecting opaque geometry. Transparent materials won't be reflected, as they don't write to the depth buffer. This also applies to shaders that use ``SCREEN_TEXTURE`` or ``DEPTH_TEXTURE``.
pt_br: Tenha em mente que reflexos em espaço de tela funciona apenas para reflexos de geometrias opacas. Materiais transparentes não serão refletidos, já que eles não escrevem sobre o buffer de profundidade. Isso também se aplica a shaders que usam ``SCREEN_TEXTURE`` ou ``DEPTH_TEXTURE``.

source: Screen-Space Ambient Occlusion (SSAO)
pt_br: Oclusão Ambiente em Espaço de Tela (SSAO)

source: As mentioned in the **Ambient** section, areas where light from light nodes does not reach (either because it's outside the radius or shadowed) are lit with ambient light. Godot can simulate this using GIProbe, ReflectionProbe, the Sky, or a constant ambient color. The problem, however, is that all the methods proposed previously act more on a larger scale (large regions) than at the smaller geometry level.
pt_br: Como mencionado na seção de **Ambiente**, áreas onde a luz de nós de luz não alcançam (seja porquê estão fora do raio de alcance ou sombreadas), são iluminadas pela luz ambiente. A Godot pode simular isso usando um ProbeGI, ReflectionProbe, o Céu ou uma cor constante de ambiente. O problem, no entanto, é que todos os métodos citados anteriormente agem melhor em larga escala (regiões grandes) do que em uma escala menor de geometria.

source: Constant ambient color and Sky are the same everywhere, while GI and Reflection probes have more local detail, but not enough to simulate situations where light is not able to fill inside hollow or concave features.
pt_br: Cor constante de ambiente e céu são as mesmas em todo lugar, porém GI e Reflection Probes são detalhes mais localizados, mas não o suficiente para simular situações onde a luz não é capaz de preencher espaços côncavos ou ocos.

source: This can be simulated with Screen Space Ambient Occlusion. As you can see in the image below, its purpose is to make sure concave areas are darker, simulating a narrower path for the light to enter:
pt_br: Isso pode ser simulado com Oclusão Ambiente em Espaço de Tela. Como podemos ver na imagem abaixo, seu propósito é deixar as áreas concavas mais escuras, simulando um caminho mais estreito para a luz entrar:
