Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/gi_probes.po
Languages: ja, pt_br, ru, uk, zh_cn

source: Using GIProbe
pt_br: Usando o GIProbe
ru: Использование GIProbe (карты тайтлов)
uk: Користування Зонду Глобального Освітлення
zh_cn: 使用 GIProbe

source: Introduction
ja: はじめに
pt_br: Introdução
ru: Введение
uk: Вступ
zh_cn: 前言

source: This feature is only available when using the GLES3 backend. :ref:`doc_baked_lightmaps` can be used as an alternative when using the GLES2 renderer.
ja: この機能は、GLES3バックエンドを使用している場合にのみ使用できます。\ :ref:`doc_baked_lightmaps` は、GLES2レンダラーを使用する際の代替手段として使用できます。
pt_br: Este recurso está disponível apenas ao usar o back-end GLES3. :ref:`doc_baked_lightmaps` pode ser usado como alternativa ao usar o renderizador GLES2.
ru: Эта функция доступна только при использовании бэкенда GLES3. :ref:`doc_baked_lightmaps` можно использовать в качестве альтернативы при использовании рендера GLES2.
uk: Ця функція доступна лише при використанні GLES3. Для рендера GLES2, як альтернативу, можна використовувати :ref:`doc_baked_lightmaps.
zh_cn: 此功能仅在使用 GLES3 后端时可用。\ :ref:`doc_baked_lightmaps` 可用作使用 GLES2 渲染器时的替代方法。

source: Just like with :ref:`doc_reflection_probes`, and as stated in the :ref:`doc_spatial_material`, objects can show reflected or diffuse light. GI Probes are similar to Reflection Probes, but they use a different and more complex technique to produce indirect light and reflections.
ja: :ref:`doc_reflection_probes` と同様に、\ :ref:`doc_spatial_material` で述べたように、オブジェクトは反射光または拡散光を表示できます。 GIプローブは反射プローブに似ていますが、間接光と反射を生成するために異なる複雑な手法を使用します。
pt_br: Assim como com :ref:`doc_reflection_probes`, e conforme declarado em :ref:`doc_spatial_material`, objetos podem mostrar luz refletida ou difusa. As GI Probes são semelhantes às sondas de reflexão, mas usam uma técnica diferente e mais complexa para produzir luz indireta e reflexos.
ru: Как и в случае с :ref:`doc_reflection_probes`, и как указано в :ref:`doc_spatial_material`, объекты могут показывать отражённый или рассеянный свет. GI Probes похожи на Reflection Probes, но они используют другую и более сложную технику для создания непрямого света и отражений.
uk: Так само, як і :ref:`doc_reflection_probes`, і як зазначено в :ref:`doc_spatial_material`, об'єкти можуть показувати відбите, або розсіяне, світло. Gi Probes (Глобальні зонди) схожі на Reflection Probes (Зонди відображення), але вони використовують іншу і складнішу техніку для отримання непрямого світла і відображення.
zh_cn: 就像 :ref:`doc_reflection_probes`, 并且如 :ref:`doc_spatial_material` 中所述, 对象可以显示反射光或漫反射光. GI探针类似于反射探针, 但它们使用不同且更复杂的技术来产生间接光和反射.

source: The strength of GI Probes is real-time, high quality, indirect light. While the scene needs a quick pre-bake for the static objects that will be used, lights can be added, changed or removed, and this will be updated in real-time. Dynamic objects that move within one of these probes will also receive indirect lighting from the scene automatically.
ja: GIプローブの強みは、リアルタイム、高品質、間接光です。使用する静的オブジェクトのシーンをすばやくプリベークする必要がありますが、ライトを追加、変更、または削除することができ、これはリアルタイムで更新されます。これらのプローブのいずれか内部を移動する動的オブジェクトは、シーンからの間接照明も自動的に受け取ります。
pt_br: A força das GI Probes é a luz indireta em tempo real e de alta qualidade. Enquanto a cena precisa de um pré-cálculo rápido para os objetos estáticos que serão usados, as luzes podem ser adicionadas, alteradas ou removidas, e isso será atualizado em tempo real. Objetos dinâmicos que se movem dentro de uma dessas sondas também receberão iluminação indireta da cena automaticamente.
ru: Сильной стороной GI Probes является высококачественный непрямой свет в реальном времени. В то время как сцена нуждается в быстром предварительном запекании для статичных объектов, которые будут использоваться, освещение может быть добавлено, изменено или удалено, и оно будет обновляться в режиме реального времени. Динамические объекты, которые перемещаются в пределах одного из этих зондов, также будут получать непрямое освещение от сцены автоматически.
uk: Сила глобальних зондів в режимі реального часу, високій якості, непрямому світло. Тоді, коли сцена потребує швидкого попереднього запікання для статичних об'єктів, які будуть використовуватися, світло можна додати, змінити, або видалити, і це буде оновлюватися в режимі реального часу. Динамічні об'єкти, які рухаються в межах одного з цих зондів, також автоматично отримують непряме освітлення зі сцени.
zh_cn: GI探针的强度是实时, 高质量, 间接光. 虽然场景需要对将要使用的静态对象进行快速预烘焙, 但可以添加, 更改或删除灯光, 并且这将实时更新. 在其中一个探针内移动的动态对象也将自动从场景接收间接光照.

source: Just like with ``ReflectionProbe``, ``GIProbe`` can be blended (in a bit more limited way), so it is possible to provide full real-time lighting for a stage without having to resort to lightmaps.
ja: ``ReflectionProbe``と同様に、\ ``GIProbe`` を(もう少し限定的な方法で)ブレンドできるため、ライトマップに頼らずにステージに完全なリアルタイム照明を提供できます。
pt_br: Assim como com ``ReflectionProbe``, ``GIProbe`` pode ser misturado (de uma forma um pouco mais limitada), então é possível fornecer iluminação em tempo real para um cenário sem ter que recorrer a mapas de luz.
ru: Как и в случае с ``ReflectionProbe``, ``GIProbe`` могут быть смешаны (в несколько более ограниченном виде), так что можно обеспечить полное освещение сцены в реальном времени, не прибегая к световым картам (lightmaps).
uk: Як і зонди відображення, глобальні зонди також можна змішувати (трохи більш обмеженим способом), тому можна забезпечити повне освітлення в режимі реального часу для сцени без необхідності вдаватися до карт освітлення.
zh_cn: 就像反射探针 ``ReflectionProbe`` 一样，GI 探针 ``GIProbe`` 也可以进行混合（但方式比较有限），可以为舞台提供完整的实时照明，不必依赖于光照贴图。

source: The main downsides of ``GIProbe`` are:
ja: ``GIProbe`` の主な欠点は次のとおりです:
pt_br: As principais desvantagens do ''GIProbe'' são:
ru: Основными недостатками ``GIProbe`` являются:
uk: Основними недоліками ``GIProbe`` є:
zh_cn: ``GIProbe`` 的主要缺点是：

source: A small amount of light leaking can occur if the level is not carefully designed. This must be artist-tweaked.
ja: レベルを慎重に設計しないと、少量の光漏れが発生する可能性があります。これはアーティストが調整する必要があります。
pt_br: Uma pequena quantidade de vazamento de luz pode ocorrer se o nível não for cuidadosamente projetado. Isso deve ser ajustado pelo artista.
ru: Небольшая утечка света может произойти, если уровень не будет тщательно спроектирован. Это должно быть настроено художником.
uk: Невелика кількість протікання світла може статися, якщо рівень розроблений не ретельно. Це має бути підправлено художником.
zh_cn: 如果没有仔细设计水平, 可能会发生少量漏光. 这必须是艺术家调整的.

source: Performance requirements are higher than for lightmaps, so it may not run properly in low-end integrated GPUs (may need to reduce resolution).
ja: パフォーマンス要件はライトマップよりも高いため、ローエンドの統合GPUで適切に動作しない場合があります(解像度を下げる必要がある場合があります)。
pt_br: Os requisitos de desempenho são maiores do que para mapas de luz, portanto, pode não funcionar corretamente em GPUs integradas de baixo desempenho (pode ser necessário reduzir a resolução).
ru: Требования к производительности выше, чем для карт освещения, поэтому он может работать некорректно на интегрированных GPU низкого класса (возможно, придётся уменьшить разрешение).
uk: Вимоги до продуктивності вищі, ніж для карт освітлення, тому вони можуть не працювати належним чином у низько-класних інтегрованих графічних процесорах (можливо, знадобиться зменшити роздільну здатність).
zh_cn: 性能要求高于光照贴图, 因此在低端集成GPU中可能无法正常运行(可能需要降低分辨率).

source: Reflections are voxelized, so they don't look as sharp as with ``ReflectionProbe``. However, in exchange they are volumetric, so any room size or shape works for them. Mixing them with Screen Space Reflection also works well.
ja: 反射はボクセル化されているため、\ ``ReflectionProbe`` のようにシャープに見えません。ただし、それらはボリューメトリックであるため、部屋の大きさや形はそれらに適しています。それらをScreen Space Reflectionと混合することもうまくいきます。
pt_br: Os reflexos são voxelizados, então eles não parecem tão nítidos quanto com ``ReflectionProbe``. No entanto, eles são volumétricos, portanto, qualquer tamanho ou formato de ambiente funciona para eles. Misturá-los com Screen Space Reflection também funciona bem.
ru: Отражения вокселизированы, поэтому они выглядят не так чётко, как при использовании ``ReflectionProbe``. Однако взамен они являются объемными, поэтому для них подходит любой размер или форма комнаты. Смешивание их с Screen Space Reflection также хорошо работает.
uk: Відображення вокселізовані, тому вони не виглядають такими гострими, як у випадку з Зондом Відображення. Зате вони об'ємні, тому для них підходить будь-який розмір, або форма, кімнати. Змішування їх з Відображенням Простору Екрана також добре працює.
zh_cn: 反射是体素化的，所以它们看起来不像 ``ReflectionProbe`` 那样清晰。然而，作为交换，它们经过体积化，所以任何房间的大小或形状都可以适用。将它们与屏幕空间反射混合使用时也很有效。

source: They consume considerably more video memory than Reflection Probes, so they must be used with care in the right subdivision sizes.
ja: これらはReflection Probesよりもかなり多くのビデオメモリを消費するため、適切なサブディビジョンサイズで注意して使用する必要があります。
pt_br: Eles consomem consideravelmente mais memória de vídeo do que Reflection Probes, por isso devem ser usados com cuidado nos tamanhos de subdivisão certos.
ru: Они потребляют значительно больше видеопамяти, чем Reflection Probes, поэтому их следует использовать с осторожностью при правильных размерах подразделений.
uk: Вони споживають значно більше відео-пам'яті, ніж Зонди Відображення, тому їх потрібно обережно використовувати в правильних розмірах підрозділів.
zh_cn: 它们比反射探头消耗的视频内存大得多, 所以在使用时必须注意正确的细分尺寸.

source: Setting up
ja: セットアップ
pt_br: Configurando
ru: Настройка
uk: Налаштування
zh_cn: 设置

source: Just like a ``ReflectionProbe``, simply set up the ``GIProbe`` by wrapping it around the geometry that will be affected.
ja: ``ReflectionProbe`` のように、影響を受けるジオメトリの周りにラップして ``GIProbe`` を設定するだけです。
pt_br: Assim como um ``ReflectionProbe``, basta configurar o ``GIProbe`` envolvendo-o em torno da geometria que será afetada.
ru: Подобно ``ReflectionProbe``, просто установите ``GIProbe``, обернув его вокруг геометрии, которая будет затронута.
uk: Так само, як і Зонд Відображення, просто додайте ``GIProbe`` і налаштуйте загорнувши в нього геометрію, яку треба опрацювати.
zh_cn: 就像反射探针 ``ReflectionProbe`` 一样，只需将 GI 探针 ``GIProbe`` 包裹在受影响的几何体周围即可。

source: Afterwards, make sure to enable the **Use In Baked Light** property on the geometry instances in the inspector. This is required for ``GIProbe`` to recognize objects, otherwise they will be ignored:
pt_br: Em seguida, certifique-se de habilitar a propriedade **Use In Baked Light** nas instâncias de geometria no inspetor. Isso é necessário para o ``GIProbe`` reconhecer objetos, caso contrário eles serão ignorados:
ru: После этого обязательно включите свойство **Use In Baked Light** для экземпляров геометрии в инспекторе. Это необходимо для того, чтобы ``GIProbe`` распознавал объекты, иначе они будут проигнорированы:
uk: Після цього переконайтеся, що на екземплярах геометрії в інспекторі увімкнена властивість **Use In Baked Light** *(Використовувати у запеченому світлі)*. Це потрібно для розпізнавання об'єктів, інакше вони будуть проігноровані:
zh_cn: 在此之后，请在检查器中确认这些几何体实例都启用了 **Use In Baked Light** 属性。进行这样的操作后，对象才会被 ``GIProbe`` 识别，否则会被忽略：

source: Once the geometry is set up, push the Bake button that appears on the 3D editor toolbar to begin the pre-baking process:
ja: ジオメトリを設定したら、3Dエディタのツールバーに表示される[GIプローブの焼き込み]ボタンを押して、プリベイクプロセスを開始します:
pt_br: Depois que a geometria estiver configurada, pressione o botão Bake que aparece na barra de ferramentas do editor 3D para iniciar o processo de pré-cálculo:
ru: Когда геометрия настроена, нажмите кнопку Bake, которая появится на панели инструментов 3D-редактора, чтобы начать процесс предварительного запекания:
uk: Після настроювання геометрії натисніть кнопку Bake, яка з'явиться на панелі інструментів 3D редактора, щоб розпочати процес попереднього запікання:
zh_cn: 设置好几何体后, 按下3D编辑器工具栏上出现的 "烘焙" 按钮, 开始预烘焙过程:

source: Meshes should have sufficiently thick walls to avoid light leaks (avoid one-sided walls). For interior levels, enclose your level geometry in a sufficiently large box and bridge the loops to close the mesh.
pt_br: As malhas devem ter paredes suficientemente grossas para evitar vazamentos de luz (evitar paredes unilaterais). Para níveis internos, coloque sua geometria de nível em uma caixa suficientemente grande e una os laços para fechar a malha.
ru: Сетки должны иметь достаточно толстые стенки, чтобы избежать утечки света (избегайте односторонних стенок). Для внутренних уровней заключите геометрию уровня в достаточно большую коробку и соедините контуры, чтобы закрыть сетку.
uk: Меші повинні мати досить товсті стіни, щоб уникнути витоків світла (уникайте односторонніх стін). Для внутрішніх рівнів укладіть геометрію вашого рівня в досить велику коробку і перемістіть петлі, щоб закрити меш.
zh_cn: 网格应该有足够厚的壁, 以避免漏光(避免单面壁). 对于室内关卡, 将你的关卡几何体围在一个足够大的盒子里, 并桥接环路来封闭网格.

source: Adding lights
ja: ライトの追加
pt_br: Adicionando luzes
ru: Добавление освещения
uk: Додавання світла
zh_cn: 添加灯光

source: Unless there are materials with emission, ``GIProbe`` does nothing by default. Lights need to be added to the scene to have an effect.
ja: 光を放出のあるマテリアルがない限り、\ ``GIProbe`` はデフォルトでは何もしません。効果を得るには、シーンにライトを追加する必要があります。
pt_br: A menos que existam materiais com emissão, o ``GIProbe`` não faz nada por padrão. As luzes precisam ser adicionadas à cena para ter um efeito.
ru: Если нет материалов со свечением, ``GIProbe`` по умолчанию ничего не делает. Для получения эффекта необходимо добавить освещение в сцену.
uk: Якщо немає матеріалів з випроміненням, Глобальний Зонд нічого не робить за замовчуванням. Щоб мати ефект, на сцену потрібно додати світло.
zh_cn: 除非有发光的材质，否则 ``GIProbe`` 默认什么都不做。灯光需要添加到场景中才有效果。

source: The effect of indirect light can be viewed quickly (it is recommended you turn off all ambient/sky lighting to tweak this, though, as shown below):
ja: 間接光の効果はすばやく表示できます(ただし、以下に示すように、すべての環境/空の照明をオフにしてこれを調整することをお勧めします):
pt_br: O efeito da luz indireta pode ser visualizado rapidamente (recomenda-se que você desligue toda a iluminação do ambiente/céu para ajustar isso, conforme mostrado abaixo):
ru: Эффект непрямого света можно быстро просмотреть (рекомендуется отключить всё окружающее/небесное освещение, чтобы настроить его, как показано ниже):
uk: Ефект непрямого світла можна побачити швидко (рекомендується вимкнути все навколишнє/небесне освітлення, щоб налаштувати його, хоча б, як показано нижче):
zh_cn: 可以快速查看间接光的效果(建议您关闭所有环境/天空照明以调整它, 但如下所示):

source: In some situations, though, indirect light may be too weak. Lights have an indirect multiplier to tweak this:
ja: ただし、状況によっては、間接光が弱すぎる場合があります。ライトには、これを調整するための間接光の乗数があります:
pt_br: Em algumas situações, porém, a luz indireta pode ser muito fraca. As luzes têm um multiplicador indireto para ajustar isso:
ru: Однако в некоторых ситуациях непрямой свет может быть слишком слабым. В источниках освещения есть множитель непрямого света, позволяющий регулировать этот параметр:
uk: Однак у деяких ситуаціях непряме світло може бути занадто слабким. Світло має непрямий множник для регулювання цього:
zh_cn: 但在某些情况下, 间接光线可能太弱. 灯具有间接乘数来调整:

source: And, as ``GIProbe`` lighting updates in real-time, this effect is immediate:
ja: そして、\ ``GIProbe`` 照明はリアルタイムで更新されるため、この効果はすぐに現れます:
pt_br: E, como a iluminação ``GIProbe`` é atualizada em tempo real, esse efeito é imediato:
ru: А поскольку освещение ``GIProbe`` обновляется в режиме реального времени, этот эффект проявляется незамедлительно:
uk: І, як і оновлення освітлення глобального зонда в режимі реального часу, цей ефект є негайним:
zh_cn: 而且，由于 ``GIProbe`` 灯光是实时更新的，所以效果立竿见影：

source: Reflections
ja: 反射
pt_br: Reflexões
ru: Отражения
uk: Відбиття
zh_cn: 反射

source: For very metallic materials with low roughness, it's possible to appreciate voxel reflections. Keep in mind that these have far less detail than Reflection Probes or Screen Space Reflections, but fully reflect volumetrically.
ja: 粗さが小さい非常に金属的なマテリアルの場合、ボクセルの反射を評価することができます。これらは、リフレクションプローブまたはスクリーンスペースリフレクションよりもはるかに詳細度が低いものですが、体積的に完全に反映されます。
pt_br: Para materiais muito metálicos com baixa rugosidade, é possível apreciar reflexos de voxels. Lembre-se de que eles têm muito menos detalhes do que os Reflection Probes ou Screen Space Reflections, mas refletem totalmente volumetricamente.
ru: Для очень металлических материалов с низкой шероховатостью можно оценить отражения вокселя. Имейте в виду, что они имеют гораздо меньшую детализацию, чем Reflection Probes или Screen Space Reflections, но полностью отражают объемно.
uk: Для дуже металевих матеріалів з низькою шорсткістю можна спробувати воксельне відображення. Майте на увазі, що вони мають набагато менше деталей, ніж зонди відображення, чи відображення простору екрану, але повністю відображають об'ємність.
zh_cn: 对于粗糙度很低的金属材质, 可以观察到体素反射. 请注意, 这些细节远不如反射探针或屏幕空间反射, 但却能充分反映体积.

source: ``GIProbe``\ s can be easily mixed with Reflection Probes and Screen Space Reflections, as a full 3-stage fallback-chain. This allows to have precise reflections where needed:
ja: ``GIProbe`` は、完全な3段階のフォールバックチェーンとして、反射プローブおよびスクリーンスペース反射と簡単に混合できます。これにより、必要に応じて正確な反射が可能になります:
pt_br: Os ``GIProbe`` podem ser facilmente misturados com Reflection Probes e Screen Space Reflections, como uma cadeia de retorno completa de 3 estágios. Isso permite ter reflexões precisas onde necessário:
ru: ``GIProbe`` можно легко смешивать с Reflection Probes и Screen Space Reflections в качестве полной трехэтапной резервной цепочки. Это позволяет получить точные отражения там, где это необходимо:
uk: Глобальні зонди можна легко змішувати з зондами відображення та відображеннями простору екрана, як повний 3-ступінчастий запасний ланцюжок. Це дозволяє мати точні відображення там, де необхідно:
zh_cn: ``GIProbe`` 可以很容易地与反射探针和屏幕空间反射混合使用，成为一个完整的三阶段回调链。这样就可以在需要的地方进行精确的反射：

source: Interior vs exterior
ja: インテリア対エクステリア
ru: Интерьер против экстерьера
uk: Інтер'єр та екстер'єр
zh_cn: 内部与外部

source: GI Probes normally allow mixing with lighting from the sky. This can be disabled when turning on the *Interior* setting.
ja: GIプローブは通常、空からの照明と混合できます。\ *Interior* 設定をオンにすると、これを無効にできます。
pt_br: As GI Probes normalmente permitem a mistura com a iluminação do céu. Isso pode ser desativado ao ativar a configuração *Interior*.
ru: GI Probes обычно позволяют смешивать с освещением неба. Это можно отключить, включив настройку *Interior*.
uk: Глобальні зонди зазвичай дозволяють змішування зі світлом з неба. Це можна вимкнути під час ввімкнення параметра *Interior*.
zh_cn: GI 探针通常允许与来自天空的照明混合。打开 *Interior* 设置时可以禁用此功能。

source: The difference becomes clear in the image below, where light from the sky goes from spreading inside to being ignored.
ja: 下の画像では、空からの光が内部に拡散してる状態と、無視された状態の違いがはっきりとわかります。
pt_br: A diferença fica clara na imagem abaixo, onde a luz do céu deixa de se espalhar por dentro para ser ignorada.
ru: Разница становится очевидной на изображении ниже, где свет с неба переходит от распространения внутрь к игнорированию.
uk: Різниця стає очевидною на зображенні нижче, де світло від неба переходить від поширення всередині до ігнорування.
zh_cn: 在下面的图像中, 差异变得清晰, 来自天空的光从内部传播到被忽略.

source: As complex buildings may mix interiors with exteriors, combining GIProbes for both parts works well.
ja: 複雑な建物ではインテリアとエクステリアが混在する可能性があるため、両方のパーツにGIProbeを組み合わせると効果的です。
pt_br: Como edifícios complexos podem misturar interiores com exteriores, a combinação de GIProbes para ambas as partes funciona bem.
ru: Поскольку в сложных зданиях могут смешиваться интерьеры и экстерьеры, хорошо работает сочетание GIProbes для обеих частей.
uk: Оскільки складні будівлі можуть змішувати інтер'єри з екстер'єрами, добре працює поєднання двох глобальних зондів для обох деталей.
zh_cn: 由于复杂的建筑物可能将室内和室外混合在一起, 因此将两个部件的GIProbes结合起来非常有效.

source: Tweaking
ja: 微調整
pt_br: Ajustando
ru: Тонкая настройка
uk: Ретельне налаштування
zh_cn: 扭捏

source: GI Probes support a few parameters for tweaking:
ja: GIプローブは、微調整用のいくつかのパラメーターをサポートしています:
pt_br: GI Probes suportam alguns parâmetros para ajustes:
ru: GI Probes поддерживают несколько параметров для настройки:
uk: Глобальні зонди Gi Probes підтримують кілька параметрів для налаштування:
zh_cn: GI探针支持一些调整参数:

source: **Subdiv** Subdivision used for the probe. The default (128) is generally good for small- to medium-sized areas. Bigger subdivisions use more memory.
ja: **Subdiv** プローブに使用されるサブディビジョン。通常、デフォルト(128)は中小規模の領域に適しています。サブディビジョンが大きいほど、より多くのメモリが使用されます。
pt_br: **Subdiv** Subdivisão utilizada para a sonda. O padrão (128) é geralmente bom para áreas pequenas a médias. As subdivisões maiores usam mais memória.
ru: **Subdiv** подразделение, используемое для зондирования. Значение по умолчанию (128) обычно подходит для областей малого и среднего размера. Более крупные значения используют больше памяти.
uk: **Subdiv** Розширення, який використовується для зонда. За замовчуванням (128) в цілому добре для малих і середніх областей. Великі розширення використовують більше пам'яті.
zh_cn: **Subdiv** 探针使用的细分. 默认值(128)通常适用于中小型区域, 更大的细分将占用更多内存.

source: **Extents** Size of the probe. Can be tweaked from the gizmo.
ja: **Extents** プローブのサイズ。ギズモから調整できます。
pt_br: **Extents** Tamanho da sonda. Pode ser ajustado pelo gizmo.
ru: **Extents** Размер зонда. Может быть настроен из гизмо.
uk: **Extents** Розмір зонда. Можна налаштувати з gizmo.
zh_cn: **Extents（范围）**\ 探针的大小。可以通过小工具调整。

source: **Dynamic Range** Maximum light energy the probe can absorb. Higher values allow brighter light, but with less color detail.
ja: **Dynamic Range** プローブが吸収できる最大の光エネルギー。値を大きくすると明るい光が得られますが、色のディテールは少なくなります。
pt_br: **Dynamic Range** Máxima energia de luz que a sonda pode absorver. Os valores mais elevados permitem a luz mais brilhante, mas com menos detalhes de cor.
ru: **Dynamic Range** Максимальная световая энергия, которую может поглотить датчик. Более высокие значения позволяют получить более яркий свет, но с меньшей детализацией цвета.
uk: **Dynamic Range** Максимальна енергія світла, яку може поглинати зонд. Вищі значення дозволяють яскравіше світло, але з меншою кількістю відтінків кольору.
zh_cn: **动态范围** 探头可以吸收的最大光能. 值越高, 光线越亮, 但颜色细节越少.

source: **Energy** Multiplier for all the probe. Can be used to make the indirect light brighter (although it's better to tweak this from the light itself).
ja: **Energy** すべてのプローブの乗数。間接光をより明るくするために使用できます(ただし、ライト自体からこれを微調整する方が良いです)。
pt_br: **Energy** Multiplicador para toda a sonda. Pode ser usado para tornar a luz indireta mais brilhante (embora seja melhor ajustar isso a partir da própria luz).
ru: **Energy** Множитель для всех зондов. Может использоваться для того, чтобы сделать непрямой свет ярче (хотя лучше настраивать его из самого источника освещения).
uk: **Energy** Множник для всього зонда. Може бути використаний, щоб зробити непряме світло яскравішим (хоча краще налаштувати саме світло).
zh_cn: **能量** 所有探头的倍增器. 可用于使间接光更亮(尽管最好从灯本身调整它).

source: **Propagation** How much light propagates through the probe internally.
ja: **Propagation** プローブ内部を通って伝播する光の量。
pt_br: **Propagation** Quanta luz se propaga através da sonda internamente.
ru: **Propagation** Сколько света распространяется через зонд внутри.
uk: **Propagation** Скільки світла проникає через зонд всередину.
zh_cn: **传播** 内部有多少光通过探头传播.

source: **Bias** Value used to avoid self-occlusion when doing voxel cone tracing, should generally be above 1.0 (1==voxel size).
ja: **Bias** ボクセルコーントレースを行うときに自己閉塞を回避するために使用される値は、通常1.0(1 ==ボクセルサイズ)を超える必要があります。
pt_br: **Bias** O valor usado para evitar a auto-oclusão ao fazer o traçado do cone do voxel, geralmente deve ser superior a 1.0 (1==tamanho do voxel).
ru: **Bias** Значение, используемое для предотвращения самозамыкания при выполнении конусной трассировки вокселей, обычно должно быть больше 1.0 (1==размер вокселя).
uk: **Bias** Значення, яке використовується для уникнення само-затінювання під час відстеження конуса вокселя, як правило, має бути вище 1,0 (1==розмір вокселя).
zh_cn: **偏置**\ 用于避免在进行体素锥体追踪时自我遮挡的值，通常应高于 1.0（1 == 体素大小）。
