Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/gi_probes.po
Languages: ja, pt_br, ru, uk, zh_cn

source: **Normal Bias** Alternative type of bias useful for some scenes. Experiment with this one if regular bias does not work.
ja: **Normal Bias** 一部のシーンに役立つ代替タイプのバイアス。通常のバイアスが機能しない場合は、これを試してください。
pt_br: **Normal Bias** Tipo alternativo de bias útil para algumas cenas. Experimente este caso se o bias regular não funcionar.
ru: **Normal Bias** Альтернативный тип смещения, полезный для некоторых сцен. Поэкспериментируйте с ним, если обычное смещение не работает.
uk: **Normal Bias** Альтернативний тип зміщення корисний для деяких сцен. Експериментуйте з цим, якщо регулярне зміщення Bias не працює.
zh_cn: **法线偏置**\ 对某些场景有用的替代偏置类型。如果常规偏置不起作用，请尝试使用此方法。

source: **Interior** Allows mixing with lighting from the sky.
ja: **Interior** 空からの照明と混合できます。
pt_br: **Interior** Permite a mistura com a iluminação do céu.
ru: **Интерьер** Допускается смешивание с освещением с неба.
uk: **Interior** Дозволяє змішування з освітленням з неба.
zh_cn: **内部** 允许与天空的灯光混合.

source: **Compress** Currently broken. Do not use.
ja: **Compress** 現在は壊れています。使ってはいけません。
pt_br: **Compress** Atualmente quebrado. Não use.
ru: **Сжать** В настоящее время не работает. Не используйте.
uk: **Compress** В даний час зламаний. Не використовуйте.
zh_cn: **压缩** 目前已损坏. 请勿使用.

source: **Data** Contains the light baked data after baking. If you are saving the data it should be saved as a .res file.
ja: **Data** 焼き込み後の軽いベイクデータが含まれます。データを保存する場合は、.resファイルとして保存する必要があります。
pt_br: **Data** Contém os dados da luz baked após o pré-calculo. Se você estiver salvando os dados, eles devem ser salvos como um arquivo .res.
ru: **Data** Содержит данные светлой выпечки после запекания. Если вы сохраняете данные, они должны быть сохранены как файл .res.
uk: **Data**Містить легкі запечені дані після запікання. Якщо ви зберігаєте дані, їх слід зберегти як файл ``.res``.
zh_cn: **数据** 包含烘焙后的光照数据. 如果您要存储, 应将其保存为.res文件.

source: Quality
pt_br: Qualidade
ru: Качество
uk: Якість
zh_cn: 质量

source: ``GIProbe``\ s are quite demanding. It is possible to use lower quality voxel cone tracing in exchange for more performance.
ja: ``GIProbe`` は非常に要求が厳しいです。パフォーマンスを向上させる代わりに、低品質のボクセルコーントレースを使用することもできます。
pt_br: ``GIProbe`` são bastante exigentes. É possível usar rastreamento de cone de voxel de qualidade inferior em troca de mais desempenho.
ru: ``GIProbe`` довольно требовательны. Можно использовать трассировку конусов вокселей более низкого качества в обмен на более высокую производительность.
uk: Глобальний зонд є досить вимогливими. Можна використовувати нижчу якість трасування воксельного конуса в обмін на вищу продуктивність.
zh_cn: ``GIProbe``\ s 的要求相当高. 可以使用较低质量的体素锥体追踪来换取更高的性能.

source: Translation status
pt_br: Progresso da Tradução
ru: Translation status (статус перевода)
uk: Стан перекладу
zh_cn: 翻译状态

source: GI Probes
ja: GIプローブ

source: Afterwards, make sure to enable the geometry will be baked. This is important in order for ``GIProbe`` to recognize objects, otherwise they will be ignored:
ja: その後、ジオメトリがベイク処理されるようにします。これは ``GIProbe`` がオブジェクトを認識するために重要です。そうでなければ、それらは無視されます:
