Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/introduction_to_3d.po
Languages: fr, ja, pt_br, ru, uk, zh_cn

source: Introduction to 3D
fr: Introduction à la 3D
ja: 3Dの概要
pt_br: Introdução ao 3D
ru: Введение в 3D
uk: Введення в 3D
zh_cn: 3D 简介

source: Creating a 3D game can be challenging. That extra Z coordinate makes many of the common techniques that helped to make 2D games simple no longer work. To aid in this transition, it is worth mentioning that Godot uses similar APIs for 2D and 3D. Most nodes are the same and are present in both 2D and 3D versions. In fact, it is worth checking the 3D platformer tutorial, or the 3D kinematic character tutorials, which are almost identical to their 2D counterparts.
fr: La création d'un jeu en 3D peut s'avérer difficile. Cette coordonnée Z supplémentaire fait que beaucoup des techniques courantes qui ont contribué à rendre les jeux 2D simples ne fonctionnent plus. Pour faciliter cette transition, il convient de mentionner que Godot utilise des API similaires pour la 2D et la 3D. La plupart des nœuds sont les mêmes et sont présents dans les versions 2D et 3D. En fait, cela vaut la peine de consulter le tutoriel sur le plateformer 3D, ou les tutoriels sur les personnages cinématiques 3D , qui sont presque identiques à leurs équivalents 2D.
ja: 3Dゲームの作成は難しい場合があります。 その余分なZ座標により、2Dゲームをシンプルにするのに役立った多くの一般的な手法が機能しなくなります。 この移行を支援するために、Godotは2Dおよび3Dに同様のAPIを使用していることに言及する価値があります。 ほとんどのノードは同じであり、2Dバージョンと3Dバージョンの両方に存在します。 実際、3Dプラットフォーマーチュートリアル、または3Dキネマティックキャラクターチュートリアルを確認する価値があります。
pt_br: Criar um jogo 3D pode ser desafiador. Essa coordenada extra o Z pode fazer com que muitas técnicas comuns que ajudaram a fazer jogos 2D simplesmente não funcionem mais. Para ajudar nesta transição, vale a pena mencionar que Godot usa APIs similares para 2D e 3D. A maioria dos nós são o mesmo e estão presentes tanto nas versões 2D e 3D. De fato, vale a pena conferir o 3D tutorial de jogo de plataformas ou o 3D tutoriais de 3D kinematic character, que são quase que idênticos aos equivalentes 2D.
uk: Створення 3D-гри може бути складним завданням. Ця додаткова координата Z робить багато звичайних технік для 2D-ігор недієздатними. Тим не менше, варто пам'ятати, що Godot використовує подібні API для 2D і 3D. Більшість вузлів однакові і присутні як в 2D, так і в 3D версіях. Насправді, варто переглянути уроки з 3D-платформера, або 3D кінематичних персонажів, які майже ідентичні їх 2D-аналогам.
zh_cn: 创造一个3D游戏很有挑战性. 那个多出来的的Z轴使许多有助于使2D游戏变得简单的常用技术不再起作用. 为了帮助习惯这种转变, 值得一提的是,Godot在2D和3D上使用了类似的API. 大多数节点是相同的, 并且以2D和3D版本存在. 事实上, 可以看看3D平台游戏教程或3D运动学角色教程, 这些教程大部分与2D游戏相同.

source: In 3D, math is a little more complex than in 2D, so also checking the :ref:`doc_vector_math` entry in the wiki (which was especially created for game developers, not mathematicians or engineers) will help pave the way for you to develop 3D games efficiently.
fr: En 3D, les mathématiques sont un peu plus complexes qu'en 2D, consulter l'entrée :ref:`doc_vector_math` dans le wiki (qui a été spécialement créé pour les développeurs de jeux, pas pour les mathématiciens ou les ingénieurs) vous aidera à développer des jeux 3D efficacement.
ja: 3Dでは、数学は2Dよりもやや複雑です。したがって、wikiの :ref:`doc_vector_math` エントリ(数学者やエンジニアではなく、ゲーム開発者向けに特別に作成されたもの)をチェックすることで、3Dゲームを効率的に開発する道を開くのに役立ちます。
pt_br: No 3D, a matemática é um pouco mais complexa que no 2D, então verifique a entrada :ref:`doc_vector_math`no wiki(que foi criada especialmente para desenvolvedores de jogos, não para matemáticos ou engenheiros) isto ajudará a preparar o caminho para você desenvolver jogos 3D com eficiência.
ru: В 3D, математика немного более сложная чем в 2D, так что мы рекомендуем посмотреть статью :ref:`doc_vector_math` (которая была создана для разработчиков игр, а не математиков или инженеров) которая поможет вам создавать 3D игры эффективно.
uk: У 3D математика трохи складніша, ніж у 2D, тому варто переглянути статтю :ref:`doc_vector_math` у вікі (яка була спеціально створена для розробників ігор, а не математиків, чи інженерів), яка допоможе вам ефективно розробляти 3D-ігри.
zh_cn: 在3D中, 数学比2D更复杂一些, 所以看看Wiki里的 :ref:`doc_vector_math` 将有助于为有效开发3D游戏铺平道路(它是为游戏开发者, 而不是数学家或工程师, 特别创建的).

source: Spatial node
fr: Nœud spatial
ja: Spatialノード
pt_br: Nó Spatial
uk: Просторовий вузол (Spatial)
zh_cn: Spatial 节点

source: :ref:`Node2D <class_Node2D>` is the base node for 2D. :ref:`Control <class_Control>` is the base node for everything GUI. Following this reasoning, the 3D engine uses the :ref:`Spatial <class_Spatial>` node for everything 3D.
fr: :ref:`Node2D <class_Node2D>` est le nœud de base pour la 2D. :ref:`Control <class_Control>` est le nœud de base pour tout ce qui est GUI. Suivant ce raisonnement, le moteur 3D utilise le nœud :ref:`Spatial <class_Spatial>` pour tout ce qui est 3D.
ja: :ref:`Node2D <class_Node2D>` は2Dのベースノードです。\ :ref:`Control <class_Control>` は、すべてのGUIのベースノードです。 この推論に従って、3Dエンジンはすべての3Dに対して :ref:`Spatial <class_Spatial>` ノードを使用します。
pt_br: :ref:`Node2D <class_Node2D>` é o nó base para 2D. :ref:`Control <class_Control>` é o nó base para GUI. Seguindo esse raciocínio, o motor 3D utiliza :ref:`Spatial <class_Spatial>` para tudo que é 3D.
uk: :ref:`Node2D <class_Node2D>` є основою для всіх 2D вузлів. :ref:`Control <class_Control>` є основою для всіх вузлів інтерфейса. Відповідно вузол :ref:`Spatial <class_Spatial>` є основою для всіх вузлів 3D.
zh_cn: :ref:`Node2D <class_Node2D>` 是 2D 的基础节点。\ :ref:`Control <class_Control>` 是所有 GUI 的基础节点。同理，3D 引擎中的所有 3D 物体都使用 :ref:`Spatial <class_Spatial>`\ （空间）节点。

source: Spatial nodes have a local transform, which is relative to the parent node (as long as the parent node is also of **or inherits from** the type Spatial). This transform can be accessed as a 4×3 :ref:`Transform <class_Transform>`, or as 3 :ref:`Vector3 <class_Vector3>` members representing location, Euler rotation (X, Y and Z angles) and scale.
fr: Les nœuds Spatial ont une transformation locale, qui est relative au nœud parent (tant que le nœud parent est également du **ou hérite du** type Spatial). Cette transformation est accessible sous la forme d'une transformation 4×3 :ref:`Transform <class_Transform>`, ou 3 :ref:`Vector3 <class_Vector3>` membres représentant la position, la rotation d'Euler (angles x,y et z) et l'échelle.
pt_br: Os nós espaciais têm uma transformação local, que é relativa ao nó pai (desde que o nó pai também seja **ou herde** do tipo Espacial). Esta transformação pode ser acessada como um 4×3 :ref:`Transform <class_Transform>`, ou como 3 membros :ref:`Vector3 <class_Vector3>` representando localização, rotação de Euler (ângulos X, Y e Z) e escala.
uk: Просторові вузли мають локальне перетворення відносно батьківського вузла (до тих пір, поки батьківський вузол також ** успадковує** від типу Просторовий). До цього перетворення можна отримати доступ як до перетворення 4×3 :ref:`Transform <class_Transform>`, або 3 :ref:`Vector3 <class_Vector3>` члени, що представляють розташування, обертання Ейлера (кути X, Y та Z) та масштаб.
zh_cn: Spatial 节点有一个局部变换，它是相对于父节点而言的（只要父节点也是\ **或者继承自**\ Spatial 类型）。这个变换可以以 4×3 的 :ref:`Transform <class_Transform>` 形式访问，也可以以 3 个 :ref:`Vector3 <class_Vector3>` 成员的形式访问，分别代表位置、欧拉旋转（X、Y、Z 角度）和缩放。

source: 3D content
fr: Contenu 3D
ja: 3Dコンテンツ
pt_br: Conteúdo 3D
ru: 3D контент
uk: 3D-вміст
zh_cn: 3D 内容

source: Unlike 2D, where loading image content and drawing is straightforward, 3D is a little more difficult. The content needs to be created with special 3D tools (usually referred to as Digital Content Creation tools, or DCCs) and exported to an exchange file format to be imported in Godot. This is required since 3D formats are not as standardized as images.
fr: Contrairement à la 2D où le chargement et l'affichage d'une image et le dessin se fait sans complications, la 3D est un peu plus complexe. Le contenu doit être créé avec des outils 3D spéciaux (généralement appelés DCC pour Digital Content Creation) et exporté vers un format de fichier d'échange afin d'être importé dans Godot (les formats 3D ne sont pas aussi standardisés que les images).
pt_br: Ao contrário do 2D, onde o carregamento do conteúdo da imagem e do desenho é simples, o 3D é um pouco mais difícil. O conteúdo precisa ser criado com ferramentas 3D especiais (geralmente chamadas de ferramentas de criação de conteúdo digital, ou DCCs) e exportado para um formato de arquivo de troca a ser importado no Godot. Isso é necessário, pois os formatos 3D não são tão padronizados quanto as imagens.
uk: На відміну від 2D, де завантаження вмісту зображення та малювання просте, 3D трохи складніше. Вміст потрібно створити за допомогою спеціальних 3D-інструментів (зазвичай їх називають інструментами створення цифрового вмісту, або DCC) і експортувати у формат файлу обміну, щоб імпортувати в Godot. Це необхідно, бо 3D-формати не так стандартизовані, як зображення.
zh_cn: 2D 中加载图像内容和绘图都非常直观，3D 就有所不同，会稍微难一些。3D 内容需要使用特殊的 3D 工具（通常称为数字内容创建工具，Digital Content Creation 工具，简称 DCC）来创建，然后导出到某种交换文件格式，才能被 Godot 导入。这是因为 3D 格式的标准化不及图像。

source: DCC-created models
fr: Modèles créés par DCC
ja: DCCで作成されたモデル
pt_br: Modelos criados com DCC
uk: Моделі, створені DCC
zh_cn: DCC创建的模型

source: There are two pipelines to import 3D models in Godot. The first and most common one is by :ref:`doc_importing_3d_scenes`, which allows you to import entire scenes (just as they look in the DCC), including animation, skeletal rigs, blend shapes, etc.
fr: Il y a deux façons pour importer des modèles 3D dans Godot. La première et la plus courante est par :ref:`doc_importing_3d_scenes`, qui vous permet d'importer des scènes entières (telles qu'elles apparaissent dans le DCC), y compris des animations, des squelettages, des formes de mélange, etc.
ja: Godotに3Dモデルをインポートするには、2つのパイプラインがあります。最初の最も一般的な方法は、\ :ref:`doc_importing_3d_scenes` によるもので、アニメーション、スケルタルリグ、ブレンドシェイプなどを含むシーン全体を(DCCで見たとおりに)インポートできます。
pt_br: Existem duas formas de importar modelos 3D no Godot. A primeira e a mais comum é :ref:`doc_importing_3d_scenes`, que permite que você importe cenas inteiras(justamente como a vê no DCC), incluindo animação, rigging, blend shapes, etc.
uk: Є два шляхи імпорту 3D-моделей в Godot. Перший і найпоширеніший з них - :ref:`doc_importing_3d_scenes`, який дозволяє імпортувати цілі сцени (так, як вони виглядають в DCC), включаючи анімацію, скелетні конструкції тощо.
zh_cn: 有两条线路可以导入3D模型到Godot中. 第一个也是最常见的一个, 是通过 :ref:`doc_importing_3d_scenes` , 它允许导入整个场景(就像它们在DCC中看起来的那样), 包括动画, 骨架绑定, 混合形状等.

source: The second pipeline is by importing simple .OBJ files as mesh resources, which can be then put inside a :ref:`MeshInstance <class_MeshInstance>` node for display.
fr: La seconde façon est l'importation de fichiers.OBJ simples comme ressources de maillage, qui peuvent ensuite être placés dans un nœud :ref:`MeshInstance <class_MeshInstance>` pour affichage.
ja: 2番目のパイプラインは、単純な.OBJファイルをメッシュリソースとしてインポートし、表示用に :ref:`MeshInstance <class_MeshInstance>` ノード内に配置できます。
pt_br: O segundo pipeline é importando arquivos .OBJ simples como recursos de malha, que podem ser colocados dentro de um nó :ref:`MeshInstance <class_MeshInstance>` para exibição.
uk: Другий шлях - це імпорт простих файлів . OBJ в якості полігональних сіток моделей, які потім можуть бути поміщені всередину вузла :ref:`MeshInstance <class_MeshInstance>` для відображення.
zh_cn: 第二条路线是通过导入简单的 .OBJ 文件作为网格资源，然后将其放入 :ref:`MeshInstance <class_MeshInstance>` 节点中显示。

source: Generated geometry
fr: Géométrie générée
ja: 生成されたジオメトリ
pt_br: Geometria gerada
ru: Генерация геометрии
uk: Згенерована геометрія
zh_cn: 生成的几何体

source: It is possible to create custom geometry by using the :ref:`ArrayMesh <class_ArrayMesh>` resource directly. Simply create your arrays and use the :ref:`ArrayMesh.add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>` function. A helper class is also available, :ref:`SurfaceTool <class_SurfaceTool>`, which provides a more straightforward API and helpers for indexing, generating normals, tangents, etc.
fr: Il est possible de créer une géométrie personnalisée en utilisant directement la ressource :ref:`ArrayMesh <class_ArrayMesh>`. Créez simplement vos tableaux et utilisez la fonction :ref:`ArrayMesh.add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`. Une classe d'aide est également disponible, :ref:`SurfaceTool <class_SurfaceTool>`, qui fournit une API et des aides plus simples pour indexer, générer des normales, des tangentes, etc.
ja: :ref:`ArrayMesh <class_ArrayMesh>` リソースを直接使用して、カスタムジオメトリを作成することができます。単純に配列を作成し、\ :ref:`ArrayMesh.add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>` 関数を使用します。\ :ref:`SurfaceTool <class_SurfaceTool>` というヘルパークラスも利用できます。これは、インデックス作成、法線、接線などの生成のためのより単純なAPIとヘルパーを提供します。
pt_br: É possível criar geometria personalizada usando o recurso :ref:`ArrayMesh <class_ArrayMesh>` diretamente. Simplesmente crie seus arrays e use a função :ref:`ArrayMesh.add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`. Uma classe auxiliar também está disponível, :ref:`SurfaceTool <class_SurfaceTool>`, que fornece uma API mais simples e auxiliares para indexação, geração de normais, tangentes, etc.
ru: Возможно создание пользовательской геометрии используя ресурс :ref:`ArrayMesh <class_ArrayMesh>` напрямую. Просто создавайте ваши массивы и используйте функцию :ref:`ArrayMesh.add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`. Существует вспомогательный класс :ref:`SurfaceTool <class_SurfaceTool>`, который предоставляет более простой API и вспомогательные функции для индексации, генерации нормалей, тангенсов, итд.
uk: Створити власну геометрію можна за допомогою безпосереднього ресурсу :ref:`ArrayMesh <class_ArrayMesh>`. Просто створіть свої масиви та використовуйте функцію :ref:`ArrayMesh.add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>`. Також доступний допоміжний клас :ref:`SurfaceTool <class_SurfaceTool>`, який надає простіший API та помічників для індексації, генерування норм, дотичних тощо.
zh_cn: 通过直接使用 :ref:`Mesh <class_Mesh>` 资源可以创建自定义几何体。只需创建数组并使用 :ref:`ArrayMesh.add_surface_from_arrays() <class_ArrayMesh_method_add_surface_from_arrays>` 函数即可。也可以使用辅助类 :ref:`SurfaceTool <class_SurfaceTool>`，它提供了一个更直接的 API 和帮助工具，用于索引、生成法线、切线等。

source: In any case, this method is meant for generating static geometry (models that will not be updated often), as creating vertex arrays and submitting them to the 3D API has a significant performance cost.
fr: Dans tous les cas, cette méthode est destinée à générer de la géométrie statique (modèles qui ne seront pas souvent mis à jour), car la création de tableaux de sommets et leur soumission à l'API 3D a un coût de performance significatif.
ja: いずれの場合でも、頂点配列を作成して3D APIに送信するとパフォーマンスが大幅に低下するため、このメソッドは静的なジオメトリ(頻繁に更新されないモデル)を生成するためのものです。
pt_br: De qualquer forma, este método é destinado a gerar geometria estática (modelos que não serão atualizados com frequência), pois criar arrays de vértices e enviá-los à API 3D tem um custo significativo de desempenho.
ru: В любом случае, этот метод предназначен для генерации статичной геометрии (модели которая не будет обновляться часто), так как создание массивов вершин и передача их в 3D API несет существенные затраты в производительности.
uk: У будь-якому випадку цей метод призначений для генерації статичної геометрії (моделі, які не будуть оновлюватися часто), так як створення вершинних масивів і перенесення їх в 3D API створює значні навантаження на продуктивність.
zh_cn: 在任何情况下, 这种方法都是为了用于生成静态几何体(不会经常更新的模型), 因为创建顶点数组并将它们提交给3D API具有显著的性能开销.

source: Immediate geometry
fr: Géométrie immédiate
ja: 即時ジオメトリ
pt_br: Geometria imediata
ru: Непосредственная геометрия
uk: Безпосередня геометрія
zh_cn: 即时几何体

source: If, instead, there is a requirement to generate simple geometry that will be updated often, Godot provides a special node, :ref:`ImmediateGeometry <class_ImmediateGeometry>`, which provides an OpenGL 1.x style immediate-mode API to create points, lines, triangles, etc.
fr: Si, à la place, il est nécessaire de générer une géométrie simple qui sera souvent mise à jour, Godot fournit un nœud spécial, :ref:`ImmediateGeometry <class_ImmediateGeometry>`, qui fournit une API de style OpenGL 1.x en mode immédiat pour créer des points, lignes, triangles, etc.
ja: 代わりに、頻繁に更新される単純なジオメトリを生成する必要がある場合、Godotは、ポイントを作成するためのOpenGL 1.xスタイルの即時モードAPIを提供する特別なノード :ref:`ImmediateGeometry <class_ImmediateGeometry>` を提供して点、線、三角形などを作成します。
pt_br: Se, em vez disso, houver um requisito para gerar geometria simples que será atualizada com frequência, Godot fornece um nó especial, :ref:`ImmediateGeometry <class_ImmediateGeometry>`, que fornece uma API de modo imediato estilo OpenGL 1.x para criar pontos, linhas, triângulos, etc.
uk: Якщо є необхідність генерувати просту геометрію, яка буде часто оновлюватися, Godot надає спеціальний вузол :ref:`ImmediateGeometry <class_ImmediateGeometry>`, який надає API негайного режиму в стилі OpenGL 1.x для створення точок, ліній, трикутників тощо.
zh_cn: 相反, 如果需要生成会经常更新的简单几何体,Godot会提供一个特殊节点 :ref:`ImmediateGeometry <class_ImmediateGeometry>` , 它会提供OpenGL 1.x风格的即时模式API来创建点, 线, 三角形等.

source: 2D in 3D
fr: 2D en 3D
ja: 3Dでの2D
pt_br: 2D em 3D
ru: 2D в 3D
uk: 2D в 3D
zh_cn: 3D 中的 2D

source: While Godot packs a powerful 2D engine, many types of games use 2D in a 3D environment. By using a fixed camera (either orthogonal or perspective) that does not rotate, nodes such as :ref:`Sprite3D <class_Sprite3D>` and :ref:`AnimatedSprite3D <class_AnimatedSprite3D>` can be used to create 2D games that take advantage of mixing with 3D backgrounds, more realistic parallax, lighting/shadow effects, etc.
fr: Alors que Godot dispose d'un puissant moteur 2D, de nombreux types de jeux utilisent la 2D dans un environnement 3D. En utilisant une caméra fixe (orthogonale ou en perspective) qui ne tourne pas, des nœuds tels que :ref:`Sprite3D <class_Sprite3D>` et :ref:`AnimatedSprite3D <class_AnimatedSprite3D3D>` peuvent être utilisés pour créer des jeux 2D qui tirent avantage du mélange avec des fonds 3D, d'une parallaxe plus réaliste, des effets de lumière / d'ombre, etc.
ja: Godotは強力な2Dエンジンを搭載していますが、多くのタイプのゲームは3D環境で2Dを使用しています。回転しない固定カメラ(直交または遠近法)を使用することで、\ :ref:`Sprite3D <class_Sprite3D>` や :ref:`AnimatedSprite3D <class_AnimatedSprite3D>` などのノードを使用して、3D 背景、よりリアルな視差、照明/影の効果などのミキシングを利用した2Dゲームを作成できます。
pt_br: Embora Godot tenha um poderoso engine 2D, muitos tipos de jogos usam 2D em um ambiente 3D. Usando uma câmera fixa (ortogonal ou perspectiva) que não gira, nós como :ref:`Sprite3D <class_Sprite3D>` e :ref:`AnimatedSprite3D <class_AnimatedSprite3D>` podem ser usados para criar jogos 2D que aproveitam a mistura com fundos 3D, paralaxe mais realista, efeitos de iluminação/sombra, etc.
ru: Хотя Godot обладает мощным 2D-движком, во многих играх 2D используется в 3D-среде. Используя фиксированную камеру (ортогональную или перспективную), которая не вращается, такие узлы как :ref:`Sprite3D <class_Sprite3D>` и :ref:`AnimatedSprite3D <class_AnimatedSprite3D>`, могут использоваться для создания 2D-игр, в которых плоские фигуры сочетаются с 3D-фоном, более реалистичным параллаксом, эффектами освещения / тенями и т. д.
uk: Godot містить потужний 2D-рушій, однак багато типів ігор використовують 2D в 3D-середовищі. Використовуючи фіксовану камеру (або ортогональну, або перспективну), яка не обертається, такі вузли, як :ref:`Sprite3D <class_Sprite3D>` та :ref:`AnimatedSprite3D <class_AnimatedSprite3D>`, можуть бути використані для створення 2D-ігор, які використовують переваги змішування з 3D-фонами, реалістичнішими паралаксами, світловими/тіньовими ефектами тощо.
zh_cn: 虽然Godot包装了强大的2D引擎, 但许多类型的游戏会使用在3D环境中的2D效果. 通过使用不旋转的固定相机(正交或透视), 可以使用诸如 :ref:`Sprite3D <class_Sprite3D>` 和 :ref:`AnimatedSprite3D <class_AnimatedSprite3D>` 等节点来创建混合了具有3D背景, 更逼真的视差, 灯光/阴影效果等的2D游戏.

source: The disadvantage is, of course, that added complexity and reduced performance in comparison to plain 2D, as well as the lack of reference of working in pixels.
fr: L'inconvénient est, bien sûr, la complexité et les performances réduites par rapport à la 2D simple, ainsi que le manque de référence de travail en pixels.
ja: 欠点は、もちろん、プレーンな2Dと比較して複雑さが増し、パフォーマンスが低下することと、ピクセル単位で作業ができないことです。
pt_br: A desvantagem é, claro, que aumentou a complexidade e reduziu o desempenho em comparação com o 2D simples, bem como a falta de referência de trabalho em pixels.
ru: Недостатком, конечно же, является увеличение сложности и снижение производительности по сравнению с обычным 2D, а также отсутствие привязки к работе в пикселях.
uk: Недоліком, звичайно ж, є те, що зростає складність і падає продуктивність в порівнянні з простим 2D, а також відсутність прив'язки до роботи з пікселями.
zh_cn: 当然, 缺点在于与普通2D相比增加了复杂性并降低了与普通2D 相比的性能, 以及缺乏进行像素工作时的参考.

source: Environment
fr: Environnement
ja: 環境
pt_br: Ambiente
ru: Окружение
uk: Середовище
zh_cn: 环境

source: Besides editing a scene, it is often common to edit the environment. Godot provides a :ref:`WorldEnvironment <class_WorldEnvironment>` node that allows changing the background color, mode (as in, put a skybox), and applying several types of built-in post-processing effects. Environments can also be overridden in the Camera.
fr: Outre l'édition d'une scène, il est souvent fréquent d'éditer l'environnement. Godot fournit un nœud :ref:`WorldEnvironment <class_WorldEnvironment>` qui permet de changer la couleur de fond, le mode (comme dans, mettre une skybox), et appliquer plusieurs types d'effets post-traitement intégrés. Les environnements peuvent également être remplacées dans la caméra.
ja: シーンの編集に加えて、環境を編集することもよくあります。 Godotは :ref:`WorldEnvironment <class_WorldEnvironment>` ノードを提供します。これにより、背景色、モード(スカイボックスを置くなど)を変更し、いくつかのタイプの組み込みのポストプロセッシングエフェクトを適用できます。環境はカメラでも上書きできます。
pt_br: Além de editar uma cena, muitas vezes é comum editar o ambiente. Godot fornece um nó :ref:`WorldEnvironment <class_WorldEnvironment>` que permite alterar a cor de fundo, o modo (como em, colocar um skybox) e aplicar vários tipos de efeitos de pós-processamento integrados. Os ambientes também podem ser substituídos na câmera.
ru: Помимо редактирования сцены, частенько требуется редактировать окружение. Godot предоставляет узел :ref:`WorldEnvironment <class_WorldEnvironment>`, который позволяет изменять цвет фона, режим (например, можно установить скайбокс) и применять несколько типов встроенных эффектов постобработки. Окружения также можно переопределить в камере.
uk: Крім редагування сцени, часто треба редагувати навколишнє середовище. Godot надає вузол :ref:`WorldEnvironment <class_WorldEnvironment>`, який дозволяє змінювати колір фону, режим (наприклад відображення коробки неба) і застосовувати кілька типів вбудованих ефектів після обробки. Середовища також можуть бути перевизначені в вузлі Камери.
zh_cn: 除了编辑场景之外, 编辑环境通常也很常见. Godot提供了一个 :ref:`WorldEnvironment <class_WorldEnvironment>` 节点, 该节点允许更改背景颜色, 模式(就像放一个天空盒时那样)以及应用多种内置处理后效果. 环境可以在Camera中被覆写.

source: 3D viewport
fr: Fenêtre d'affichage 3D
ja: 3Dビューポート
pt_br: Viewport 3D
ru: Окно просмотра 3D
uk: 3D вікно перегляду
zh_cn: 3D 视口

source: Editing 3D scenes is done in the 3D tab. This tab can be selected manually, but it will be automatically enabled when a Spatial node is selected.
fr: L'édition des scènes 3D se fait dans l'onglet 3D. Cet onglet peut être sélectionné manuellement, mais il sera automatiquement activé lorsqu'un nœud spatial est sélectionné.
ja: 3Dシーンの編集は、3Dタブで行います。このタブは手動で選択できますが、Spatialノードを選択すると自動的に有効になります。
pt_br: A edição de cenas 3D são feitas na aba 3D. Esta aba pode ser selecionada manualmente, mas ela é automaticamente ativada quando um nó Spatial (espacial) é selecionado.
uk: Редагування 3D-сцен здійснюється на вкладці 3D. Цю вкладку можна вибрати вручну, але вона буде автоматично включена, при обиранні просторового вузла.
zh_cn: 编辑3D场景可以在3D选项卡中完成. 该选项卡可以手动选择, 但在选择Spatial节点时将自动启用.
