Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/introduction_to_3d.po
Languages: fr, ja, pt_br, ru, uk, zh_cn

source: Default 3D scene navigation controls are similar to Blender (aiming to have some sort of consistency in the free software pipeline..), but options are included to customize mouse buttons and behavior to be similar to other tools in the Editor Settings:
fr: Les contrôles de navigation de scène 3D par défaut sont similaires à ceux de Blender (visant à avoir une certaine cohérence dans le pipeline du logiciel libre...), mais des options sont incluses pour personnaliser les boutons de la souris et le comportement pour être similaire aux autres outils dans les paramètres de l'éditeur :
ja: デフォルトの3Dシーン ナビゲーション コントロールは Blender(フリーソフトウェアのパイプラインに何らかの一貫性を持たせることを目指しています)に似ていますが、マウス ボタンと動作を [エディタ設定] の他のツールと同様にカスタマイズするためのオプションが含まれています。
pt_br: Os controles de navegação de cena 3D padrão são semelhantes aos do Blender (com o objetivo de ter algum tipo de consistência no pipeline de software livre...), mas são incluídas opções para personalizar os botões e o comportamento do mouse para serem semelhantes a outras ferramentas nas Configurações do Editor:
ru: Элементы управления навигацией по трехмерной сцене по умолчанию аналогичны Blender (стремясь обеспечить некоторую согласованность в конвейере бесплатного программного обеспечения...), но включены параметры для настройки кнопок и поведения мыши, чтобы они были похожи на другие инструменты в настройках редактора:
uk: Елементи керування навігацією 3D-сцени за замовчуванням схожі на Blender (з метою мати якусь узгодженість у вільному програмному конвеєрі..), але в параметрах редактора можна налаштувати власні параметри для налаштування кнопок мишки та поведінки і отримати схожість з іншими програмами:
zh_cn: 默认的3D场景导航控制类似于Blender(旨在在自由软件工作流程中具有某种一致性), 但在编辑器设置中也包含了自定义鼠标按钮和行为使其看上去像其他工具的选项:

source: Coordinate system
fr: Système de coordonnées
ja: 座標系
pt_br: Sistema de coordenadas
ru: Система координат
uk: Система координат
zh_cn: 坐标系

source: Godot uses the `metric <https://en.wikipedia.org/wiki/Metric_system>`__ system for everything in 3D, with 1 unit being equal to 1 meter. Physics and other areas are tuned for this scale. Therefore, attempting to use a different scale is usually a bad idea (unless you know what you are doing).
fr: Godot utilise le système `métrique <https://en.wikipedia.org/wiki/Metric_system>`__ pour tout ce qui est en 3D, 1 unité étant égale à 1 mètre. La physique et d'autres domaines sont accordés pour cette échelle. Par conséquent, tenter d'utiliser une échelle différente est généralement une mauvaise idée (sauf si vous savez ce que vous faites).
pt_br: O Godot usa o sistema `métrico <https://pt.wikipedia.org/wiki/Sistema_m%C3%A9trico>`__ para tudo. A física 3D e outras áreas são ajustadas para isso, então tentar usar uma escala diferente é geralmente uma má ideia (a menos que você saiba o que está fazendo).
ru: Godot использует `метрическую <https://en.wikipedia.org/wiki/Metric_system>`__ систему для всего. 3D-физика и прочие области настроены на неё, так что попытка использовать другую размерность обычно плохая идея (если вы точно не уверены что делаете).
uk: Godot використовує `метричну <https://en.wikipedia.org/wiki/Metric_system>`__ систему для всього в 3D, причому 1 одиниця дорівнює 1 метру. Фізика та все інше пристосовані до цієї шкали. Тому спроба використовувати іншу шкалу, як правило, погана ідея (якщо ви не знаєте, що ви робите).
zh_cn: Godot 在 3D 中使用的都是\ `公制 <https://zh.wikipedia.org/zh-cn/%E7%B1%B3%E5%88%B6>`__\ ，1 个单位等于 1 米。物理和其他区域都为此而调整过。因此，试图使用不同的比例通常是一个坏主意（除非你知道你在做什么）。

source: When working with 3D assets, it's always best to work in the correct scale (set your DCC to metric). Godot allows scaling post-import and, while this works in most cases, in rare situations it may introduce floating-point precision issues (and thus, glitches or artifacts) in delicate areas such as rendering or physics. Make sure your artists always work in the right scale!
fr: Lorsque vous travaillez avec des assets 3D, il est toujours préférable de travailler à la bonne échelle (réglez votre DCC sur métrique). Godot permet la mise à l'échelle post-importation et, bien que cela fonctionne dans la plupart des cas, dans de rares cas, il peut introduire des problèmes de précision en virgule flottante (et donc, des défauts ou artefacts) dans des domaines délicats, comme le rendu ou la physique. Assurez-vous que vos artistes travaillent toujours dans la bonne échelle !
pt_br: Ao trabalhar com recursos 3D, é sempre melhor trabalhar na escala correta (defina seu DCC como métrico). Godot permite o dimensionamento pós-importação e, embora funcione na maioria dos casos, em raras situações pode introduzir problemas de precisão de ponto flutuante (e, portanto, falhas ou artefatos) em áreas delicadas, como renderização ou física. Certifique-se de que seus artistas sempre trabalhem na escala certa!
uk: При роботі з 3D-активами завжди краще працювати в правильному масштабі (встановіть DCC на метрику). Godot дозволяє масштабувати після імпорту, і, хоча в більшості випадків це працює, в рідкісних ситуаціях виникають проблеми точності з десятковою комою (і, як наслідок, глюки, або артефакти) в делікатних областях, таких як рендеринг, або фізика. Переконайтеся, що ваші художники завжди працюють у правильному масштабі!
zh_cn: 使用 3D 资产时，最好使用正确的比例（将 DCC 设置为公制）。Godot 允许在导入后缩放，尽管在大多数时都没问题，但在极少数情况下，会在渲染或物理等敏感区域带来浮点精度问题（带来毛刺或失真）。所以，请确保你的渲染总是在正确的比例下工作！

source: The Y coordinate is used for "up", though for most objects that need alignment (like lights, cameras, capsule collider, vehicle, etc.), the Z axis is used as a "pointing towards" direction. This convention roughly means that:
fr: La coordonnée Y est utilisée pour "haut", bien que pour la plupart des objets qui ont besoin d'être alignés (comme les lumières, les caméras, le collisionneur de capsules, les véhicules, etc.), l'axe Z est utilisé comme une direction "pointant vers". Cette convention signifie en gros :
ja: Y軸は「上方向」に使用され、位置合わせが必要なほとんどのオブジェクト (ライト、カメラ、CapsuleCollider、Vehicleなど) では、Z軸は「向いている方向」として使用されます。この規則は、おおよそ次のことを意味します:
pt_br: A coordenada Y é usada para "cima", embora para a maioria dos objetos que precisam de alinhamento (como luzes, câmeras, colisor de cápsula, veículo etc.), o eixo Z é usado como uma direção "apontando para". Esta convenção significa aproximadamente que:
uk: Координата Y використовується "вгору", хоча для більшості об'єктів, які потребують вирівнювання (наприклад, світла, камер, капсули зіткнень тощо), вісь Z використовується для напрямків "вперед/назад". Ця конвенція приблизно означає, що:
zh_cn: Y坐标用于 "向上 ", 但对于大多数需要对齐的物体(如灯光, 摄像机, 胶囊碰撞体, 载具等),Z轴用作" 指向"方向. 这个约定大致意味着:

source: **X** is sides
fr: **X** est les côtés
ja: X軸は左右
pt_br: **X** são lados
ru: **X** это влево/вправо
uk: **X** це сторони
zh_cn: **X** 是两边

source: **Y** is up/down
fr: **Y** est haut/bas
ja: Y軸は上下
pt_br: **Y** é para cima/para baixo
ru: **Y** это вверх/вниз
uk: **Y** це верх і низ
zh_cn: **Y** 是上/下

source: **Z** is front/back
fr: **Z** est avant/arrière
ja: Z軸は前後
pt_br: **Z** é frente/trás
ru: **Z** это вперед/назад
uk: **Z** це перед і зад
zh_cn: **Z** 是前/后

source: Space and manipulation gizmos
fr: Espace et gadgets de manipulation
ja: 空間と操作のギズモ
pt_br: Espaço e manipulação gizmos
ru: Пространство и гизмо манипуляции
uk: Простір і маніпуляція gizmos
zh_cn: 空间与操纵小工具

source: Moving objects in the 3D view is done through the manipulator gizmos. Each axis is represented by a color: Red, Green, Blue represent X, Y, Z respectively. This convention applies to the grid and other gizmos too (and also to the shader language, ordering of components for Vector3, Color, etc.).
fr: Le déplacement des objets dans la vue 3D se fait à l'aide des gadgets de manipulation. Chaque axe est représenté par une couleur : Rouge, Vert, Bleu représentent X,Y,Z respectivement. Cette convention s'applique également à la grille et aux autres gadgets (ainsi qu'au langage shader, à l'ordre des composants pour Vector3, Color, etc.).
pt_br: A movimentação de objetos na visualização 3D é feita por meio de gizmos manipuladores. Cada eixo é representado por uma cor: Vermelho, Verde, Azul representam X, Y, Z respectivamente. Essa convenção também se aplica à grade e a outros dispositivos (e também à linguagem de shader, ordenação de componentes para Vector3, Color, etc.).
ru: Перемещение объектов в 3D-виде осуществляется с помощью манипуляторов гизмо. Каждая ось представлена цветом: красный, зеленый, синий представляют X, Y, Z соответственно. Это соглашение применяется также к сетке и другим гизмо (а также к языку шейдеров, порядку компонентов для Vector3, Color и т.д.).
uk: Переміщення об'єктів в 3D здійснюється через маніпулятор гізмо. Кожна вісь представлена кольором: Червоний, Зелений, Синій позначають X, Y, Z відповідно. Ця конвенція відноситься і до сітки та інших гізмо (а також до мови шейдера, порядку компонентів для Vector3, Color і т. д.).
zh_cn: 在 3D 视图中移动物体是通过操纵器小工具完成的。每个轴用一种颜色表示：红、绿、蓝分别代表 X、Y、Z。这种惯例也适用于网格和其他小工具（也适用于着色器语言、Vector3、Color 等组件的顺序）。

source: Some useful keybindings:
fr: Quelques raccourcis clavier utiles :
ja: いくつかの便利なキーバインド:
pt_br: Algumas combinações de teclas úteis:
ru: Некоторые полезные сочетания клавиш:
uk: Деякі корисні прив'язки клавіш:
zh_cn: 一些有用的键盘绑定:

source: To snap placement or rotation, press :kbd:`Ctrl` while moving, scaling or rotating.
fr: Pour aligner le placement ou la rotation, appuyez sur la touche :kbd:`Ctrl` tout en vous déplaçant, en redimensionnant ou en tournant.
ja: 配置または回転をスナップするには、移動、スケーリング、または回転中に :kbd:`Ctrl` を押します。
pt_br: Para posicionamento ou rotação encaixada, pressione :kbd:`Ctrl` enquanto move, dimensiona ou gira.
ru: Чтобы привязать расположение или поворот, нажмите :kbd:`Ctrl` при перемещении, масштабировании или повороте.
uk: Щоб прив'язати розміщення, або обертання, натисніть :kbd:`Ctrl` під час переміщення, масштабування, або обертання.
zh_cn: 在移动, 缩放或旋转时, 按 :kbd:`Ctrl` 键, 可进行吸附放置或旋转.

source: To center the view on the selected object, press :kbd:`F`.
fr: Pour centrer la vue sur l'objet sélectionné, appuyez sur la touche :kbd:`F`.
ja: ビューを選択したオブジェクトの中央に配置するには、\ :kbd:`F` を押します。
pt_br: Para centralizar a visualização no objeto selecionado, pressione :kbd:`F`.
ru: Чтобы центрировать вид на выбранном объекте, нажмите :kbd:`F`.
uk: Щоб центрувати вид на виділеному об'єкті, натисніть клавішу :kbd:`F`.
zh_cn: 要将视图集中在所选对象上, 按 :kbd:`F`.

source: View menu
fr: Menu affichage
ja: ビューメニュー
pt_br: Menu "Exibir"
ru: Меню "Обзор"
uk: Меню «Перегляд»
zh_cn: 视图菜单

source: The view options are controlled by the "View" menu in the viewport's toolbar.
fr: Les options d'affichage sont contrôlées par le menu "Affichage" dans la barre d'outils de la fenêtre d'affichage.
ja: 表示オプションは、ビューポートのツールバーの[ビュー]メニューで制御されます。
pt_br: As opções de exibição são controladas pelo menu "Exibir" na barra de ferramentas da janela de exibição.
ru: Параметры просмотра контролируются меню "Обзор" на панели инструментов области просмотра.
uk: Параметри перегляду керуються меню "Перегляд" на панелі інструментів вікна перегляду.
zh_cn: 视图选项由视口工具栏中的“视图”菜单控制。

source: You can hide the gizmos in the 3D view of the editor through this menu:
fr: Vous pouvez masquer les gadgets dans la vue 3D de l'éditeur via ce menu :
ja: このメニューを使用して、エディタの3Dビューでギズモを非表示にできます:
pt_br: Você pode ocultar os gizmos na visualização 3D do editor através deste menu:
ru: Вы можете скрыть гизмо в 3D-виде редактора через это меню:
uk: Ви можете приховати gizmos в 3D-перегляді редактора через це меню:
zh_cn: 你可以通过这个菜单在编辑器的 3D 视图中隐藏小工具：

source: To hide a specific type of gizmos, you can toggle them off in the "View" menu.
fr: Pour masquer un type spécifique de gadgets, vous pouvez les désactiver dans le menu "Affichage".
ja: 特定の種類のギズモを非表示にするには、[ビュー]メニューでオフに切り替えます。
pt_br: Para ocultar um tipo específico de gizmos, você pode desativá-los no menu "Exibir".
ru: Чтобы скрыть определенные типы гизмо, отключите их в меню "Обзор".
uk: Щоб приховати певний тип gizmos, ви можете вимкнути їх в меню "Перегляд > Гаджети".
zh_cn: 要隐藏特定类型的小工具，你可以在“视图”菜单中把它们切换掉。

source: Default environment
fr: Environnement par défaut
ja: デフォルトの環境
pt_br: Ambiente padrão
ru: Окружение по умолчанию
uk: Середовище за замовчуванням
zh_cn: 默认环境

source: When created from the Project Manager, the 3D environment has a default sky.
fr: Lorsqu'il est créé à partir du gestionnaire de projet, l'environnement 3D possède un ciel par défaut.
ja: プロジェクトマネージャーから作成した場合、3D環境にはデフォルトの空があります。
pt_br: Quando criado a partir do Gerente de Projeto, o ambiente 3D tem um céu padrão.
ru: При создании из Менеджера проектов в 3D окружении по умолчанию установлено небо.
uk: Під час створення з Керівника проектів 3D-середовище за замовчуванням має небо.
zh_cn: 从项目管理器中创建时,3D环境具有默认的天空.

source: Given how physically based rendering works, it is advised to always try to work with a default environment in order to provide indirect and reflected light to your objects.
fr: Étant donné le fonctionnement du rendu physique, il est conseillé de toujours essayer de travailler avec un environnement par défaut afin de fournir une lumière indirecte et réfléchie à vos objets.
ja: 物理に基づいたレンダリングがどのように機能するかを考えると、オブジェクトに間接光と反射光を提供するために、常にデフォルト環境で作業することをお勧めします。
pt_br: Dado o funcionamento da renderização com base física, é recomendável sempre tentar trabalhar com um ambiente padrão para fornecer luz indireta e refletida aos seus objetos.
uk: З огляду на те, як працює фізичний рендеринг, рекомендується завжди намагатися працювати з середовищем за замовчуванням, щоб забезпечити непряме і відбите світло для ваших об'єктів.
zh_cn: 鉴于基于物理的渲染工作方式, 建议总是使用一个默认环境, 以便为对象提供间接和反射光.

source: Cameras
fr: Caméras
ja: カメラ
pt_br: Câmeras
ru: Камеры
uk: Фотоапарати
zh_cn: 相机

source: No matter how many objects are placed in the 3D space, nothing will be displayed unless a :ref:`Camera <class_Camera>` is also added to the scene. Cameras can work in either orthogonal or perspective projections:
fr: Quel que soit le nombre d'objets placés dans l'espace 3D, rien ne sera affiché à moins qu'une :ref:`Camera <class_Camera>` ne soit également ajoutée à la scène. Les caméras peuvent fonctionner dans des projections orthogonales ou perspective :
ja: 3Dスペースにいくつのオブジェクトを配置しても、シーンに :ref:`Camera <class_Camera>` が追加されない限り、何も表示されません。カメラは、正投影または透視投影のいずれかで動作できます:
pt_br: Não importa quantos objetos são colocados no espaço 3D, nada será exibido a menos que uma :ref:`Camera <class_Camera>` também seja adicionada à cena. As câmeras podem funcionar em projeções ortogonais ou em perspectiva:
uk: Незалежно від того, скільки об'єктів розміщено в 3D-просторі, нічого не буде відображатися, якщо на сцені нема жодної :ref:`камери<class_Camera>`. Камери можуть працювати як в ортогональних, так і в перспективних проекціях:
zh_cn: 无论在 3D 空间中放置多少物体，除非在场景中添加了 :ref:`Camera <class_Camera>`\ ，否则不会显示任何内容。相机可以在正交或透视投影中工作：

source: Cameras are associated with (and only display to) a parent or grandparent viewport. Since the root of the scene tree is a viewport, cameras will display on it by default, but if sub-viewports (either as render target or picture-in-picture) are desired, they need their own children cameras to display.
fr: Les caméras sont associées à une vue parent ou grand-parent (et ne s'affichent que dans cette vue). Comme la racine de l'arborescence de la scène est une fenêtre d'affichage, les caméras s'y affichent par défaut, mais si des fenêtres secondaires (en tant que cible de rendu ou image dans l'image) sont souhaitées, elles ont besoin de leurs propres caméras enfants pour les afficher.
ja: カメラは、親または祖父母のビューポートに関連付けられています(表示のみ)。シーンツリーのルートはビューポートであるため、カメラはデフォルトでその上に表示されますが、サブビューポート(レンダーターゲットまたはピクチャーインピクチャーとして)が必要な場合は、その表示用に子カメラが必要です。
pt_br: As câmeras são associadas a (e exibidas apenas para) uma janela de exibição pai ou avô. Como a raiz da árvore de cena é uma janela de exibição, as câmeras serão exibidas nela por padrão, mas se sub-janelas de exibição (como destino de renderização ou picture-in-picture) forem desejadas, elas precisarão de suas próprias câmeras filhas para exibição.
ru: Камеры связаны с родительским окном просмотра и отображают только его. Поскольку корнем дерева сцены является область просмотра, камеры будут отображаться на ней по умолчанию, но если требуются дополнительные области просмотра (либо в качестве цели рендеринга, либо в качестве изображения в картинке), для отображения им нужны их собственные дочерние камеры.
uk: Камери пов'язані (і відображаються тільки для нього) з вікном перегляду батька, або прабатька. Оскільки корінь дерева сцени є вікном перегляду, камери будуть відображатися на ньому за замовчуванням, але якщо потрібні субпозиції (або як візуалізація цілі, або зображення на малюнку), їм потрібні власні дитячі камери для відображення.
zh_cn: 摄像机与父视口或其祖先视口相关联, 且仅显示到他们上面. 由于场景树的根是一个视口, 默认情况下会在其上显示摄像机, 但如果需要子视口(作为渲染目标或画中画), 则需要自己的子摄像头才能显示.

source: When dealing with multiple cameras, the following rules are enforced for each viewport:
fr: Lorsque vous avez affaire à plusieurs caméras, les règles suivantes s'appliquent à chaque fenêtre d'affichage :
ja: 複数のカメラを扱う場合、各ビューポートに次のルールが適用されます:
pt_br: Ao lidar com várias câmeras, as seguintes regras são aplicadas para cada janela de exibição:
ru: При работе с несколькими камерами для каждого окна просмотра применяются следующие правила:
uk: Під час роботи з кількома камерами для кожного вікна перегляду застосовуються такі правила:
zh_cn: 处理多台摄像机时, 每个视口都遵循以下规则:

source: If no cameras are present in the scene tree, the first one that enters it will become the active camera. Further cameras entering the scene will be ignored (unless they are set as *current*).
fr: Si aucune caméra n'est présente dans l'arbre de scène, la première qui y entre deviendra la caméra active. Les autres caméras entrant dans la scène seront ignorées (à moins qu'elles ne soient réglées sur *current*).
ja: シーン ツリーにカメラが存在しない場合、最初に入力したカメラがアクティブなカメラになります。その後でシーンに入ってくるカメラは無視されます(*current* に設定されていないかぎり)。
pt_br: Se nenhuma câmera estiver presente na árvore de cenas, a primeira que entrar nela se tornará a câmera ativa. Outras câmeras entrando na cena serão ignoradas (a menos que sejam definidas como *atual*).
ru: Если в дереве сцены нет камер, то первая, которая войдет в него, станет активной камерой. Дальнейшие камеры, входящие в сцену, будут игнорироваться (если они не установлены как *текущие*).
uk: Якщо в дереві сцени немає камер, то перша ж додана камера, стане активною камерою. Подальші додані до сцени камери, будуть проігноровані (якщо вони не встановлені як *поточні*).
zh_cn: 如果场景树中没有摄像机，则第一个进入的摄像机将成为活跃摄像机。进入场景的其他摄像机将被忽略（除非它们被设置为 *current*\ ）。

source: If a camera has the "*current*" property set, it will be used regardless of any other camera in the scene. If the property is set, it will become active, replacing the previous camera.
fr: Si une caméra possède la propriété "*current*", elle sera utilisée indépendamment de toute autre caméra de la scène. Si la propriété est définie, elle devient active et remplace la caméra précédente.
ja: カメラに"*current*"プロパティが設定されている場合、シーン内の他のカメラに関係なくそれが使用されます。このプロパティが設定されている場合は、それまでのカメラを置き換えて、アクティブになります。
pt_br: Se uma câmera tiver a propriedade "*atual*" definida, ela será usada independentemente de qualquer outra câmera na cena. Se a propriedade estiver definida, ela ficará ativa, substituindo a câmera anterior.
ru: Если для камеры установлено свойство "*текущая*", она будет использоваться независимо от любой другой камеры в сцене. Если свойство установлено, камера станет активной, заменив предыдущую камеру.
uk: Якщо камера має задану властивість "*поточна*", вона буде використовуватися незалежно від будь-якої іншої камери в сцені. Якщо властивість встановлено, вона стане активною, замінивши попередню камеру.
zh_cn: 如果相机设置了“\ *current*\ ”属性，则无论场景中是否有其他相机，都会使用它。如果该属性已设置，它将变为活动状态，取代之前的摄像机。

source: If an active camera leaves the scene tree, the first camera in tree-order will take its place.
fr: Si une caméra active quitte l'arbre de scène, la première caméra en ordre arborescent prendra sa place.
ja: アクティブなカメラがシーンツリーを離れると、ツリー順の最初のカメラが代わりになります。
pt_br: Se uma câmera ativa deixar a árvore de cena, a primeira câmera na ordem da árvore ocupará seu lugar.
ru: Если активная камера покидает дерево сцены, её место займет первая камера в древовидной структуре.
uk: Якщо активна камера покине дерево сцени, її місце займе перша камера в порядку дерева.
zh_cn: 如果活动摄像机离开了场景树，则按树形顺序排列的第一台摄像机将取代它。

source: Lights
fr: Lumières
ja: ライト
pt_br: Luzes
ru: Света
uk: Освітлення
zh_cn: 灯光

source: Godot has a limit of up to 8 lights per mesh. Aside from that, there is no limitation on the number of lights, nor of types of lights, in Godot. As many as desired can be added, as long as performance allows, and no more than 8 lights shine on a single mesh.
fr: Godot a une limite de 8 lumières par maille. En dehors de cela, il n'y a pas de limite sur le nombre de lumières, ni sur les types de lumières, dans Godot. On peut en ajouter autant que l'on veut, tant que les performances le permettent, et pas plus de 8 lumières sur un seul maillage.
pt_br: Godot tem um limite de até 8 luzes por malha. Apesar disso, não há limitação de número de luzes, nem de tipos de luzes, na Godot. Podem ser adicionados tantos quantos desejar, desde que o desempenho permita, e não mais do que 8 luzes brilham em uma única malha.
uk: Godot має обмеження до 8 ламп на меш. Крім цього, немає обмежень ні на кількість ламп, ні на їх типи, в Godot. Можна додати стільки, скільки захочеться, до тих пір, поки дозволяє продуктивність, але одну модель має освітлювати не більше 8 ламп.
zh_cn: Godot的每个网格最多限制8个灯. 除此之外, 在Godot中, 对灯的数量和灯的类型都没有限制. 在性能允许的情况下, 可以根据需要, 添加任意数量的灯, 而单个网格上照射的灯不超过8盏.

source: Translation status
fr: État de la traduction
ja: 翻訳ステータス
pt_br: Progresso da Tradução
ru: Translation status (статус перевода)
uk: Стан перекладу
zh_cn: 翻译状态
