Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/spatial_material.po
Languages: de, es

source: Enables billboard mode for drawing materials. This controls how the object faces the camera:
de: Aktiviert den Billboard-Modus für Zeichnungsmaterialien. Damit wird gesteuert, wie das Objekt der Kamera zugewandt ist:
es: Activa billboard mode para materiales de dibujo. Esto controla la forma en que el objeto mira hacia la cámara:

source: **Disabled:** Billboard mode is disabled.
de: **Disabled:** Der Billboard-Modus ist deaktiviert.
es: **Disabled**: Billboard mode está desactivado.

source: **Enabled:** Billboard mode is enabled, the object's -Z axis will always face the camera.
de: **Aktiviert:** Ist der Billboard-Modus aktiviert, zeigt die -Z-Achse des Objekts immer in Richtung der Kamera.
es: **Enabled**: Billboard mode está activado, el eje -Z del objeto siempre estará mirando a la cámara.

source: **Y-Billboard:** The object's X axis will always be aligned with the camera.
de: **Y-Billboard:** Die X-Achse des Objekts wird immer auf die Kamera ausgerichtet.
es: **Y-Billboard**: el eje X del objeto siempre estará alineado con la cámara.

source: **Particles:** Most suited for particle systems, because it allows specifying animation options.
de: **Partikel:** Am besten geeignet für Partikelsysteme, da hier Animationsoptionen festgelegt werden können.
es: **Particles**: Usado en sistemas de partículas, porque permite especificar opciones de animación.

source: The above options are only enabled for Particle Billboard.
de: Die oben genannten Optionen sind nur für Partikel Billboards aktiviert.
es: Las opciones anteriores sólo están habilitadas para Particle Billboard.

source: Enables scaling a mesh in billboard mode.
de: Ermöglicht die Skalierung eines Mesh im Billboard-Modus.
es: Permite escalar una malla en modo cartelera.

source: Grows the object vertices in the direction pointed by their normals:
de: Die Objektvertices wachsen in der Richtung, in die ihre Normalen zeigen:
es: Hace que los vértices del objeto crezcan en la dirección señalada por sus normales:

source: This is commonly used to create cheap outlines. Add a second material pass, make it black and unshaded, reverse culling (Cull Front), and add some grow:
es: Esto se utiliza comúnmente para crear contornos de bajo costo. Añade una segunda pasada al material, hazlo negro y sin sombrear, invierte el desechado de caras (Cull Front), y añade algo de tamaño:

source: Use Alpha Scissor
de: Alphaschere verwenden
es: Usar Alpha Scissor

source: When transparency other than ``0`` or ``1`` is not needed, it's possible to set a threshold to prevent the object from rendering semi-transparent pixels.
es: Cuando no se necesita una transparencia distinta de 0 o 1, es posible establecer un umbral para evitar que el objeto muestre píxeles semi transparentes.

source: This renders the object via the opaque pipeline, which is faster and allows it to use mid- and post-process effects such as SSAO, SSR, etc.
es: Esto renderiza el objeto a través del pipeline opaco que es más rápido y permite realizar efectos de medio y post proceso como SSAO, SSR, etc.

source: Material colors, maps and channels
de: Materialfarben, Karten und Kanäle
es: Color de materiales, mapas y canales

source: Besides the parameters, what defines materials themselves are the colors, textures, and channels. Godot supports an extensive list of them. They are described in detail below:
de: Neben den Parametern definieren die Materialien selbst die Farben, Texturen und Kanäle. Godot unterstützt eine umfangreiche Liste von ihnen. Sie werden nachstehend ausführlich beschrieben:
es: Además de los parámetros, lo que define a los materiales mismos son los colores, texturas y canales. Godot soporta una extensa lista de ellos. A continuación se describen con más detalle:

source: *Albedo* is the base color for the material, on which all the other settings operate. When set to *Unshaded*, this is the only color that is visible. In previous versions of Godot, this channel was named *Diffuse*. The change of name mainly happened because, in PBR (Physically Based Rendering), this color affects many more calculations than just the diffuse lighting path.
de: *Albedo* ist die Grundfarbe für das Material, auf das alle anderen Einstellungen angewendet werden. Bei der Einstellung *Unschattiert* ist dies die einzige sichtbare Farbe. In früheren Versionen von Godot wurde dieser Kanal *Diffuse* genannt. Die Namensänderung erfolgte hauptsächlich, weil diese Farbe in PBR (Physically Based Rendering) viel mehr Berechnungen beeinflusst als nur den diffusen Beleuchtungspfad.
es: *Albedo* es el color base del material, sobre lo que trabaja todo lo demás. Cuando se establece en *Unshaded*, este es el único color que es visible. En versiones anteriores de Godot, este canal se llamaba *Diffuse*. El cambio de nombre se produjo principalmente porque, en PBR (Physically Based Rendering), este color afecta a muchos más cálculos que sólo la ruta de iluminación difusa.

source: Albedo color and texture can be used together as they are multiplied.
de: Albedofarbe und -textur können zusammen verwendet werden, da sie multipliziert werden.
es: El color y la textura del albedo se pueden utilizar juntos a medida que se multiplican.

source: *Alpha channel* in albedo color and texture is also used for the object transparency. If you use a color or texture with *alpha channel*, make sure to either enable transparency or *alpha scissoring* for it to work.
de: *Alpha-Kanal* in Albedofarbe und -textur wird auch für die Objekttransparenz verwendet. Wenn Sie eine Farbe oder Textur mit *Alpha-Kanal* verwenden, stellen Sie sicher, dass entweder Transparenz oder *Alpha-Schere* aktiviert ist, damit dies funktioniert.
es: El *Alpha channel* en el color y la textura del albedo también se utiliza para la transparencia del objeto. Si se utiliza un color o una textura con *alpha channel*, asegúrate de habilitar la transparencia o *alpha scissoring* para que funcione.

source: Godot uses a metallic model over competing models due to its simplicity. This parameter defines how reflective the material is. The more reflective, the less diffuse/ambient light affects the material and the more light is reflected. This model is called "energy-conserving".
de: Godot verwendet aufgrund seiner Einfachheit ein Metallmodell gegenüber Konkurrenzmodellen. Dieser Parameter definiert, wie reflektierend das Material ist. Je reflektierender, desto weniger diffuses/Umgebungslicht beeinflusst das Material und desto mehr Licht wird reflektiert. Dieses Modell wird als "energiesparend" bezeichnet.
es: Godot utiliza un modelo metálico en lugar de otros conocidos, por su simplicidad. Este parámetro define qué tan reflectantes son los materiales. Cuanto más reflectante es, menos es afectado por la luz difusa/ambiental y mayor es el reflejo. Este modelo se llama "energy-conserving" (conservador de energía).

source: The *Specular* parameter is a general amount for the reflectivity (unlike *Metallic*, this is not energy-conserving, so leave it at ``0.5`` and don't touch it unless you need to).
de: Der Parameter *Spiegelnd* ist ein allgemeiner Wert für das Reflexionsvermögen (im Gegensatz zu *Metallisch* ist dies nicht energiesparend. Belassen Sie ihn daher bei ``0.5`` und verändern Sie ihn nur, wenn Sie dies benötigen).
es: El parámetro *Specular* es sólo una cantidad general para la reflectividad (a diferencia de *Metallic*, éste no ahorra energía, así que simplemente déjalo en ``0.5`` y no lo toques a menos que lo necesites).

source: The minimum internal reflectivity is ``0.04``, so it's impossible to make a material completely unreflective, just like in real life.
de: Das minimale interne Reflexionsvermögen beträgt ``0.04``, daher ist es unmöglich ein Material wie im wirklichen Leben vollkommen ohne Reflexion zu erstellen.
es: El mínimo de reflectividad interna es de ``0.04``, por lo que (al igual que en la vida real) es imposible hacer un material completamente antirreflectante.

source: *Roughness* affects the way reflection happens. A value of ``0`` makes it a perfect mirror while a value of ``1`` completely blurs the reflection (simulating natural microsurfacing). Most common types of materials can be achieved with the right combination of *Metallic* and *Roughness*.
de: *Unebenheit* beeinflusst die Art und Weise, wie Reflexion stattfindet. Ein Wert von ``0`` macht es zu einem perfekten Spiegel, während ein Wert von ``1`` die Reflexion vollständig verwischt (Simulation einer natürlichen Mikrooberfläche). Die meisten gängigen Materialtypen können mit der richtigen Kombination von *Metallisch* und *Unebenheit* erzielt werden.
es: *Roughness* (rugosidad) afecta principalmente a la forma en que se produce el reflejo. Un valor de 0 lo convierte en un espejo perfecto, mientras que un valor de 1 difumina completamente el reflejo (simulando una microsuperficie natural). Los tipos más comunes de materiales se pueden lograr con la combinación correcta de *Metallic* y *Roughness*.

source: *Emission* specifies how much light is emitted by the material (keep in mind this does not include light surrounding geometry unless :ref:`doc_gi_probes` are used). This value is added to the resulting final image and is not affected by other lighting in the scene.
de: *Ausstrahlung* gibt an, wie viel Licht vom Material emittiert wird (beachten Sie, dass dies kein Licht um die Geometrie einschließt, es sei denn :ref:`doc_gi_probes` wird verwendet). Dieser Wert wird zum resultierenden endgültigen Bild hinzugefügt und nicht durch andere Beleuchtung in der Szene beeinflusst.
es: *Emission* especifica cuánta luz es emitida por el material (Ten en cuenta que esto no incluye la luz que rodea a la geometría a menos que se utilice :ref:`doc_gi_probes`). Este valor se añade a la imagen final resultante y no se ve afectado por otra iluminación en la escena.

source: Normal mapping allows you to set a texture that represents finer shape detail. This does not modify geometry, only the incident angle for light. In Godot, only the red and green channels of normal maps are used for better compression and wider compatibility.
de: Mit der normalen Zuordnung können Sie eine Textur festlegen, die feinere Formdetails darstellt. Dadurch wird die Geometrie nicht geändert, sondern nur der Einfallswinkel für Licht. In Godot werden nur die roten und grünen Kanäle normaler Karten verwendet, um eine bessere Komprimierung und eine bessere Kompatibilität zu erzielen.
es: El mapeo de normales (normal mapping) permite establecer una textura que representa detalles de forma más precisos. Esto no modifica la geometría, sólo el ángulo de incidencia de la luz. En Godot, sólo los canales rojo (red) y verde (green) se utilizan para mapas normales, con el fin de lograr una mayor compatibilidad.

source: Godot requires the normal map to use the X+, Y- and Z+ coordinates. In other words, if you've imported a material made to be used with another engine, you may have to convert the normal map so its Y axis is flipped. Otherwise, the normal map direction may appear to be inverted on the Y axis.
es: Godot requiere que el mapa de normales use coordenadas X+, Y- y Z+. En otras palabras, si has importado un material hecho para ser usado en otro motor, tal vez debas convertir el mapa de normales así el eje Y queda invertido. De otro modo la dirección del mapa de normales aparecerá invertido en el eje Y.

source: More information about normal maps (including a coordinate order table for popular engines) can be found `here <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
de: Weitere Informationen über Normal Maps (einschließlich einer Koordinatenordnungstabelle für populäre Engines) finden Sie `hier <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
es: Más información sobre mapa de normales (incluyendo la tabla de orden de coordenadas para motores populares) se puede encontrar `aquí <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.

source: Some fabrics have small micro-fur that causes light to scatter around it. Godot emulates this with the *Rim* parameter. Unlike other rim lighting implementations, which just use the emission channel, this one actually takes light into account (no light means no rim). This makes the effect considerably more believable.
de: Einige Gewebe haben einen sehr feinen Flaum, durch den Licht gestreut wird. Godot emuliert dies mit dem Parameter *Rim (Randbereich)*. Im Gegensatz zu anderen Randbeleuchtungsimplementierungen, die nur den Strahlungskanal verwenden, berücksichtigt diese tatsächlich Licht (kein Licht bedeutet kein Randbereich). Dies macht den Effekt wesentlich glaubwürdiger.
es: Algunos tejidos tienen micropelículas que hacen que la luz se disperse a su alrededor. Godot emula esto con el parámetro *Rim*. A diferencia de otras implementaciones de iluminación de bordes que sólo utilizan el canal de emisión, éste en realidad tiene en cuenta la luz (si no hay luz, no hay borde). Esto hace que el efecto sea mucho más creíble.

source: Rim size depends on roughness, and there is a special parameter to specify how it must be colored. If *Tint* is ``0``, the color of the light is used for the rim. If *Tint* is ``1``, then the albedo of the material is used. Using intermediate values generally works best.
de: Der Außenrandbereich hängt von der Rauheit ab, und es gibt einen speziellen Parameter der angibt, wie er gefärbt werden muss. Wenn *Tint* ``0`` ist, wird die Farbe des Lichts für den Rand verwendet. Wenn *Tint* ``1`` ist, wird die Albedo des Materials verwendet. Die Verwendung von Zwischenwerten funktioniert im Allgemeinen am besten.
es: El tamaño del Rim depende de Roughness, y hay un parámetro especial para especificar cómo debe ser coloreado. Si *Tint* es ``0``, el color de la luz se utiliza para el Rim. Si *tint* es 1, entonces se utiliza el albedo del material. El uso de valores intermedios generalmente funciona mejor.

source: *This feature is only available when using the GLES3 backend.*
de: *Diese Features ist nur bei Verwendung des GLES3-Backends verfügbar.*
es: *Esta característica sólo está disponible cuando se utiliza el backend GLES3.*

source: The *Clearcoat* parameter is used to add a secondary pass of transparent coat to the material. This is common in car paint and toys. In practice, it's a smaller specular blob added on top of the existing material.
de: Der Parameter *Klarlack* wird verwendet, um dem Material einen zweiten Durchgang transparenter Beschichtung hinzuzufügen. Dies ist bei Autolacken und Spielzeugen üblich. In der Praxis ist es ein kleinerer Spiegelklecks, der über dem vorhandenen Material hinzugefügt wird.
es: El parámetro *Clearcoat* se utiliza principalmente para añadir una pasada *secundaria* de recubrimiento transparente al material. Esto es común en la pintura de automóviles y juguetes. En la práctica, es un specular blob más pequeño añadido sobre el material existente.

source: This changes the shape of the specular blob and aligns it to tangent space. Anisotropy is commonly used with hair, or to make materials such as brushed aluminum more realistic. It works especially well when combined with flowmaps.
es: Esto cambia la forma del specular blob y lo alinea con el espacio tangencial. Anisotropy se utiliza comúnmente con cabello, o para hacer que materiales como el aluminio pulido sean más realistas. Funciona especialmente bien cuando se combina con flowmaps.

source: It is possible to specify a baked ambient occlusion map. This map affects how much ambient light reaches each surface of the object (it does not affect direct light by default). While it is possible to use Screen-Space Ambient Occlusion (SSAO) to generate ambient occlusion, nothing beats the quality of a well-baked AO map. It is recommended to bake ambient occlusion whenever possible.
es: Es posible especificar un mapa de oclusión ambiental bakeado. Este mapa afecta la cantidad de luz ambiental que llega a cada superficie del objeto (no afecta la luz directa por defecto). Si bien es posible utilizar la oclusión ambiental en el espacio de la pantalla (SSAO) para generar Ambient Occlusion, nada superará la calidad de un mapa de AO bien bakeado. Se recomienda prebakear Ambient Occlusion siempre que sea posible.

source: Depth
de: Tiefe
es: Profundidad

source: Setting a depth map on a material produces a ray-marched search to emulate the proper displacement of cavities along the view direction. This is not real added geometry, but an illusion of depth. It may not work for complex objects, but it produces a realistic depth effect for textures. For best results, *Depth* should be used together with normal mapping.
es: Establecer un mapa de profundidad a un material genera una búsqueda ray-marched para emular el desplazamiento adecuado de las cavidades a lo largo de la dirección de la vista. Esto no es una verdadera geometría añadida, sino una ilusión de profundidad. Puede que no funcione para objetos complejos pero produce un efecto de profundidad realista para texturas. Para obtener mejores resultados, se debe utilizar *Depth* junto con normal mapping.

source: This effect emulates light that penetrates an object's surface, is scattered, and then comes out. It is useful to create realistic skin, marble, colored liquids, etc.
de: Dieser Effekt emuliert Licht das die Oberfläche eines Objekts durchdringt, gestreut wird und dann austritt. Es ist nützlich um realistische Haut, Marmor, farbige Flüssigkeiten usw. zu erstellen.
es: Este efecto emula la luz que penetra la superficie de un objeto, se dispersa y luego sale. Es útil para hacer pieles realistas, mármol, líquidos de colores, etc.

source: This controls how much light from the lit side (visible to light) is transferred to the dark side (opposite from the light). This works well for thin objects such as plant leaves, grass, human ears, etc.
de: Hiermit wird gesteuert wie viel Licht von der beleuchteten Seite (sichtbar für Licht) auf die dunkle Seite (gegenüber dem Licht) übertragen wird. Dies funktioniert gut für dünne Objekte wie Pflanzenblätter, Gras, menschliche Ohren usw.
es: Controla cuánta luz del lado iluminado (visible a la luz) se transfiere al lado oscuro (lado opuesto a la luz). Esto funciona bien para objetos delgados como hojas de árboles/plantas, césped, orejas humanas, etc.

source: When refraction is enabled, it supersedes alpha blending, and Godot attempts to fetch information from behind the object being rendered instead. This allows distorting the transparency in a way similar to refraction in real life.
de: Wenn die Brechung aktiviert ist, ersetzt sie die Alpha-Überblendung und Godot versucht stattdessen Informationen hinter dem gerenderten Objekt abzurufen. Dies ermöglicht eine Verzerrung der Transparenz auf ähnliche Weise wie die Brechung im wirklichen Leben.
es: Cuando refraction está habilitada, reemplaza alpha blending, y Godot intenta obtener información desde detrás del objeto que se está renderizando en su lugar. Esto permite distorsionar la transparencia de manera similar a la refracción en la vida real.

source: Godot allows using secondary albedo and normal maps to generate a detail texture, which can be blended in many ways. By combining this with secondary UV or triplanar modes, many interesting textures can be achieved.
de: Godot ermöglicht die Verwendung von sekundärer Albedo und normalen Karten, um eine Detailtextur zu erzeugen, die auf viele Arten gemischt werden kann. Durch die Kombination mit sekundären UV- oder triplanaren Modi können viele interessante Texturen erzielt werden.
es: Godot permite usar un albedo y normal map secundarios para generar texturas detalladas, las cuales pueden ser mezcladas de muchas maneras. Combinado con UV secundario o modo triplanar, se pueden lograr muchas texturas interesantes.

source: There are several settings that control how detail is used.
de: Es gibt verschiedene Einstellungen die steuern, wie Details verwendet werden.
es: Hay varios ajustes que controlan el uso de los detalles.

source: Mask: The detail mask is a black and white image used to control where the blending takes place on a texture. White is for the detail textures, Black is for the regular material textures, different shades of gray are for partial blending of the material textures and detail textures.
de: Maske: Die Detailmaske ist ein Schwarzweißbild mit dem gesteuert wird, wo das Mischen auf einer Textur stattfindet. Weiß steht für die Detailtexturen, Schwarz für die normalen Materialtexturen, verschiedene Graustufen für die teilweise Überblendung der Materialtexturen und Detailtexturen.
es: Máscara: La máscara de detalle es una imagen en blanco y negro que se utiliza para controlar dónde tiene lugar la mezcla en una textura. El blanco es para las texturas de detalle, el negro es para las texturas materiales regulares, los diferentes tonos de gris son para la mezcla parcial de las texturas materiales y las texturas de detalle.

source: Blend Mode: These four modes control how the textures are blended together.
de: Übergangsmodus: Diese vier Modi steuern, wie die Texturen ineinander überblenden..
es: Modo de fusión: Estos cuatro modos controlan cómo se mezclan las texturas.

source: Mix: Combines pixel values of both textures. At black, only show the material texture, at white, only show the detail texture. Values of gray create a smooth blend between the two.
es: Mezclar: Combina los valores de los píxeles de ambas texturas. En negro, sólo muestra la textura del material, en blanco, sólo muestra la textura del detalle. Los valores de gris crean una mezcla suave entre los dos.

source: Add: Adds pixel values of one Texture with the other. Unlike mix mode both textures are completely mixed at white parts of a mask and not at gray parts. The original texture is mostly unchanged at black
es: Add: Añade los valores de los píxeles de una textura con la otra. A diferencia del modo mix, ambas texturas se mezclan completamente en las partes blancas de una máscara y no en las partes grises. La textura original es mayormente sin cambios en el negro

source: Sub: Subtracts pixel values of one texture with the other. The second texture is completely subtracted at white parts of a mask with only a little subtraction in black parts, gray parts being different levels of subtraction based on the exact texture.
es: Sustracción: resta los valores de los píxeles de una textura con la otra. La segunda textura se sustrae completamente en las partes blancas de una máscara con sólo una pequeña sustracción en las partes negras, siendo las partes grises diferentes niveles de sustracción basados en la textura exacta.

source: Mul: Multiplies the RGB channel numbers for each pixel from the top texture with the values for the corresponding pixel from the bottom texture.
es: Mul: Multiplica los números de canal RGB de cada píxel de la textura superior por los valores del píxel correspondiente de la textura inferior.

source: Albedo: This is where you put an albedo texture you want to blend. If nothing is in this slot it will be interpreted as white by default.
es: Albedo: Aquí es donde pones una textura de albedo que quieres mezclar. Si no hay nada en esta ranura se interpretará como blanco por defecto.

source: Normal: This is where you put a normal texture you want to blend. If nothing is in this slot it will be interpreted as a flat normal map. This can still be used even if the material does not have normal map enabled.
es: Normal: Aquí es donde pones una textura normal que quieres mezclar. Si no hay nada en esta ranura se interpretará como un mapa plano normal. Esto puede ser usado incluso si el material no tiene el mapa normal habilitado.

source: UV1 and UV2
de: UV1 und UV2
es: UV1 y UV2
