Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/spatial_material.po
Languages: de, es

source: Godot supports two UV channels per material. Secondary UV is often useful for ambient occlusion or emission (baked light). UVs can be scaled and offset, which is useful when using repeating textures.
es: Godot soporta dos canales UV por material. Los UV secundarios son a menudo útiles para ambient occlusion o emission (baked light). Los UVs pueden ser escalados y desplazados, lo que es útil en texturas con repetición.

source: Triplanar Mapping
de: Triplanare Mapping
es: Mapeado Triplanar

source: Triplanar mapping is supported for both UV1 and UV2. This is an alternative way to obtain texture coordinates, sometimes called "Autotexture". Textures are sampled in X, Y and Z and blended by the normal. Triplanar mapping can be performed in either world space or object space.
es: El mapeo triplanar es compatible tanto para UV1 como para UV2. Esta es una forma alternativa de obtener coordenadas de textura, a menudo llamada "Autotexture". Las texturas son muestreadas en X, Y y Z y mezcladas por la normal. El mapeo triplanar puede ser espacio de mundo o espacio de objeto.

source: In the image below, you can see how all primitives share the same material with world triplanar, so the brick texture continues smoothly between them.
es: En la imagen de abajo, puedes ver cómo todos los primitivos comparten el mismo material con el triplanar del mundo, para que los la textura pueda continuar con suavidad entre las partes.

source: Proximity and distance fade
de: Nähe und Entfernung verblassen
es: Desvanecimiento de proximidad y distancia

source: Godot allows materials to fade by proximity to each other as well as depending on the distance from the viewer. Proximity fade is useful for effects such as soft particles or a mass of water with a smooth blending to the shores. Distance fade is useful for light shafts or indicators that are only present after a given distance.
es: Godot permite que los materiales se desvanezcan por proximidad entre ellos, además de hacerlo por la distancia con el observador. El desvanecimiento por proximidad es útil para efectos como partículas suaves o masas de agua que se mezclen de forma suave con la orilla. El desvanecimiento por distancia es útil para entradas de luz o indicadores que solo están presentes a cierta distancia.

source: Keep in mind enabling these enables alpha blending, so abusing them for an entire scene is usually not a good idea.
es: Hay que tener en cuenta que habilitarlos también activa alpha blending, por lo que abusar de ellos durante toda una escena no suele ser una buena idea.

source: Render priority
de: Render Reihenfolge
es: Prioridad de Renderización

source: The rendering order of objects can be changed, although this is mostly useful for transparent objects (or opaque objects that perform depth draw but no color draw, such as cracks on the floor).
es: El orden de renderizado de los objetos se puede cambiar, esto es útil sobre todo para los objetos transparentes (u objetos opacos que dibujan en profundidad pero no en color, como grietas en el suelo).

source: Disable Ambient Light
de: Umgebungslicht deaktivieren

source: Is sRGB
de: Ist sRGB

source: Blend Mode
de: Mischmodus

source: Cull Mode
de: Aushöhlungsmodus

source: Depth Draw Mode
de: Tiefenzeichenmodus

source: Billboard Mode
de: Plakatwandmodus

source: Billboard Keep Scale
de: Plakatwand Verhältnis beibehalten

source: Grow
de: Wachstum

source: Metallic
de: Metallisch

source: Roughness
de: Rauheit

source: Normal map
de: Normale Zuordnung/Abbildung

source: Rim
de: Umrandung

source: Clearcoat
de: Klarlack

source: Anisotropy
de: Anisotropie

source: Ambient Occlusion
de: Umgebungsverdeckung

source: Subsurface Scattering
de: Subsurface-Streuung

source: Transmission
de: Übertragung

source: Refraction
de: Brechung

source: Detail
de: Details

source: Translation status
de: Übersetzungsstatus
