Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/spatial_material.po
Languages: de, es

source: Spatial Material
de: 3D Materialien (Spatial)
es: Material Spatial

source: Introduction
de: Einführung
es: Introducción

source: ``SpatialMaterial`` is a default 3D material that aims to provide most of the features artists look for in a material, without the need for writing shader code. However, it can be converted to shader code if additional functionality is needed.
de: ``SpatialMaterial`` ist ein Standard-3D-Material, das die von Künstlern meistgesuchten Funktionen bereitstellen soll, ohne dass Shader-Code geschrieben werden muss. Falls zusätzliche Funktionen benötigt werden, kann es jedoch in Shader-Code konvertiert werden.
es: ``SpatialMaterial`` es un material 3D y su objetivo es que los artistas busquen la mayoría de las características en un material. Además, puede convertirse a código de shader y modificarse si se necesita agregar funcionalidades adicionales.

source: This tutorial explains most parameters present in ``SpatialMaterial``.
de: In dieser Anleitung werden die meisten in ``SpatialMaterial`` vorhandenen Parameter erläutert.
es: Este tutorial intentará cubrir la mayoría de los parámetros presentes en ``SpatialMaterial``.

source: There are three ways to add a ``SpatialMaterial`` to an object. It can be added in the *Material* property of the mesh. It can be added in the *Material* property of the node using the mesh (such as a MeshInstance node), or in the *Material Override* property of the node using the mesh.
es: Hay tres maneras de añadir un "SpatialMaterial" a un objeto. Se puede añadir en la propiedad *Material* de la malla. Se puede añadir en la propiedad *Material* del nodo que utiliza la malla (como un nodo MeshInstance), o en la propiedad *Material Override* del nodo que utiliza la malla.

source: If you add a material to the mesh itself, every time that mesh is used it will have that material. If you add a material to the node using the mesh, the material will only be used by that node, it will also override the material property of the mesh. If a material is added in the *Material Override* property of the node, it will only be used by that node. It will also override the regular material property of the node and the material property of the mesh.
de: Wenn Sie dem Mesh selbst ein Material hinzufügen, erhält das Meshes bei jeder Verwendung dieses Material. Wenn Sie dem Node mithilfe des Meshes ein Material hinzufügen, wird das Material nur von diesem Node verwendet und überschreibt auch die Materialeigenschaft des Meshes. Wenn ein Material in der Eigenschaft *Material überschreiben * des Nodes hinzugefügt wird, wird es nur von diesem Node verwendet. Außerdem werden die reguläre Materialeigenschaft des Nodes und die Materialeigenschaft des Meshes überschrieben.
es: Si se añade un material a la propia malla, cada vez que se utilice esa malla tendrá ese material. Si añade un material al nodo usando la malla, el material sólo será usado por ese nodo, también anulará la propiedad de material de la malla. Si se añade un material en la propiedad *Material Override* del nodo, sólo será usado por ese nodo. También anulará la propiedad material regular del nodo y la propiedad material de la malla.

source: Flags
de: Kennzeichnungen
es: Indicadores

source: Spatial materials have many flags determining the general usage of a material.
de: Räumliche Materialien haben viele Flags, die die allgemeine Verwendung eines Materials bestimmen.
es: Los materiales spatial tienen muchos indicadores que determinan la utilización general de un material.

source: Transparent
es: Transparente

source: In Godot, materials are not transparent unless specifically configured to be. The main reason behind this is that transparent materials are rendered using a different technique (sorted from back to front and rendered in order).
de: In Godot sind Materialien nur dann transparent, wenn sie speziell konfiguriert sind. Der Hauptgrund dafür ist, dass transparente Materialien mit einer anderen Technik gerendert werden (von hinten nach vorne sortiert und in der richtigen Reihenfolge gerendert).
es: En Godot, los materiales no son transparentes a menos que se configuren específicamente de esta forma. La razón principal es que los materiales transparentes son renderizados usando una técnica diferente (ordenados de atrás hacia adelante y renderizados en orden).

source: This technique is less efficient (many state changes happen) and makes the materials unusable with many mid- and post-processing effects (such as SSAO, SSR, etc.) that require perfectly opaque geometry.
de: Diese Technik ist weniger effizient (viele Zustandsänderungen treten auf) und macht die Materialien mit vielen Mittel- und Nachbearbeitungseffekten (wie SSAO, SSR usw.) unbrauchbar, die eine perfekt lichtundurchlässige Geometrie erfordern.
es: Esta técnica es menos eficiente (ocurren muchos cambios de estado) y hace que los materiales sean inutilizables con muchos efectos intermedios y posteriores (como SSAO, SSR, etc.) que requieren una geometría perfectamente opaca.

source: For this reason, materials in Godot are assumed opaque unless specified otherwise. The main settings that enable transparency are:
de: Aus diesem Grund werden Materialien in Godot als undurchsichtig angenommen, sofern nicht anders angegeben. Die wichtigsten Einstellungen, die Transparenz ermöglichen, sind:
es: Por esta razón, los materiales en Godot se muestran opacos a menos que se especifique lo contrario. Los principales ajustes que permiten la transparencia son:

source: Transparent flag (this one)
de: Transparentes Flag (dieses hier)
es: Opción Transparent (esta)

source: Blend mode set to other than "Mix"
de: Übergangsmodus auf etwas anderes als "Mix" eingestellt
es: Modo de mezcla (blend mode) configurado en otro que no sea "Mix"

source: Enabling distance or proximity fade
de: Aktiviert das Verblassen bei Nähe oder Entfernung
es: Activar el desvanecimiento de la distancia o la proximidad

source: Use Shadow to Opacity
de: Schatten zur Deckkraft verwenden
es: Usar la sombra para la opacidad

source: Lighting modifies the alpha so shadowed areas are opaque and non-shadowed areas are transparent. Useful for overlaying shadows onto a camera feed in AR.
de: Durch die Beleuchtung wird das Alpha so geändert, dass schattierte Bereiche undurchsichtig und nicht schattierte Bereiche transparent sind. Nützlich zum Überlagern von Schatten auf einen Kamera-Feed in AR.
es: La iluminación modifica el alfa para que las áreas sombreadas sean opacas y las no sombreadas sean transparentes. Útil para superponer sombras a una cámara en AR.

source: Unshaded
de: Unschattiert
es: Unshaded (Sin sombra)

source: In most cases it is common for materials to be affected by lighting (shaded).
de: In den meisten Fällen ist es üblich, dass Materialien durch Beleuchtung beeinträchtigt werden (schattiert).
es: En la mayoría de los casos, es común que los materiales se vean afectados por la iluminación (shaded).

source: However, in some cases you might want to show just the albedo (color) and ignore the rest. Toggling this flag on will remove all shading and display pure, unlit color.
de: In einigen Fällen möchten Sie jedoch möglicherweise nur die Albedo (Farbe) anzeigen und den Rest ignorieren. Wenn Sie dieses Flag aktivieren, werden alle Schattierungen entfernt und reine, unbeleuchtete Farben angezeigt.
es: Algunas veces, uno puede querer mostrar sólo el albedo (color) e ignorar el resto. Al activar esta opción, se eliminarán todo el shading y se mostrará el color puro, sin iluminación.

source: Vertex Lighting
de: Vertex-Beleuchtung
es: Vertex Lighting (Iluminación de vértices)

source: Godot has a more or less uniform cost per pixel thanks to depth pre-pass. All lighting calculations are made by running the lighting shader on every pixel.
de: Godot hat dank des Tiefenvorlaufs mehr oder weniger einheitliche Kosten pro Pixel. Alle Beleuchtungsberechnungen werden durchgeführt, indem der Beleuchtungs-Shader für jedes Pixel ausgeführt wird.
es: Godot tiene un coste por píxel más o menos constante (gracias al paso previo de profundidad o depth pre-pass). Todos los cálculos de iluminación se realizan ejecutando el shader de iluminación en cada píxel.

source: As these calculations are costly, performance can be brought down considerably in some corner cases such as drawing several layers of transparency (which is common in particle systems). Switching to per-vertex lighting may help in these cases.
de: Da diese Berechnungen kostspielig sind, kann die Leistung in einigen Fällen erheblich beeinträchtigt werden, z.B. beim Zeichnen mehrerer Transparenzschichten (was in Partikelsystemen üblich ist). In diesen Fällen kann die Umstellung auf Vertex-Beleuchtung hilfreich sein.
es: Dado que estos cálculos son costosos, el rendimiento puede reducirse considerablemente en algunos casos particulares, como el dibujo de varias capas de transparencia (común en los sistemas de partículas). Cambiar a iluminación por vértice (per-vertex) puede ayudar en estos casos.

source: Additionally, on low-end or mobile devices, switching to vertex lighting can considerably increase rendering performance.
de: Darüber hinaus kann die Umstellung auf Vertex-Beleuchtung auf Low-End- oder Mobilgeräten die Renderleistung erheblich verbessern.
es: Además, en dispositivos móviles o de gama baja, el cambio a vertex lighting puede aumentar considerablemente el rendimiento del renderizado.

source: Keep in mind that when vertex lighting is enabled, only directional lighting can produce shadows (for performance reasons).
de: Beachten Sie, dass bei aktivierter Vertex-Beleuchtung nur gerichtete Beleuchtung Schatten erzeugen kann (aus Leistungsgründen).
es: Hay que tener en cuenta que cuando la vertex lighting está activado, sólo directional lighting (iluminación direccional) puede producir sombras (por razones de rendimiento).

source: No Depth Test
de: Kein Tiefentest
es: Sin prueba de profundidad

source: In order for close objects to appear over far away objects, depth testing is performed. Disabling it has the result of objects appearing over (or under) everything else.
de: Damit nahe Objekte über weit entfernten Objekten erscheinen, werden Tiefenprüfungen durchgeführt. Das Deaktivieren hat zur Folge, dass Objekte über (oder unter) allem anderen angezeigt werden.
es: Para que los objetos cercanos aparezcan sobre objetos lejanos, se realiza una prueba de profundidad. Deshabilitarlo tiene como resultado que los objetos aparezcan por encima (o por debajo) de todo lo demás.

source: Disabling this makes the most sense for drawing indicators in world space, and works very well with the *Render Priority* property of Material (see the bottom of this page).
de: Das Deaktivieren dieser Option ist am sinnvollsten, um Anzeigegeräte im Raum zu zeichnen und funktioniert sehr gut mit der Eigenschaft *Renderpriorität* von Material (siehe unten auf dieser Seite).
es: Desactivar esto tiene más sentido para dibujar indicadores en el espacio del mundo (world space), y funciona muy bien con la propiedad "Render Priority" de Material (ver abajo).

source: Use Point Size
de: Punktgröße verwenden
es: Usar Point Size (Tamaño de punto)

source: This option is only effective when the geometry rendered is made of points (generally it's made of triangles when imported from 3D DCCs). If so, then those points can be resized (see below).
de: Diese Option ist nur wirksam, wenn die gerenderte Geometrie aus Punkten besteht (im Allgemeinen besteht sie aus Dreiecken, wenn sie aus 3D-DCCs importiert wird). In diesem Fall kann die Größe dieser Punkte geändert werden (siehe unten).
es: Esta opción sólo es efectiva cuando la geometría representada está hecha de puntos (generalmente sólo está hecha de triángulos cuando se importa desde DCCs 3D). Si es así, entonces los puntos pueden ser dimensionados (ver abajo).

source: World Triplanar
de: Welt triplanar
es: World Triplanar (Mundo Triplanar)

source: When using triplanar mapping (see below, in the UV1 and UV2 settings), triplanar is computed in object local space. This option makes triplanar work in world space.
de: Bei Verwendung der dreiflächigen (Triplanar) Zuordnung (siehe unten in den Einstellungen für UV1 und UV2) wird im lokalen Objektraum triplanar berechnet. Mit dieser Option funktioniert Triplanar im Raum.
es: Cuando se utiliza el mapeo triplanar (ver abajo, en los ajustes UV1 y UV2), el triplanar se calcula en el espacio local del objeto (local space). Esta opción hace que los triplanares trabajen en el espacio del mundo.

source: Fixed Size
de: Feste Größe
es: Fixed Size (Tamaño fijo)

source: This causes the object to be rendered at the same size no matter the distance. This is useful mostly for indicators (no depth test and high render priority) and some types of billboards.
de: Dadurch wird das Objekt unabhängig von der Entfernung mit derselben Größe gerendert. Dies ist vor allem für Anzeigegeräte (kein Tiefentest und hohe Renderpriorität) und einige Arten von Werbetafeln nützlich.
es: Esto hace que el objeto renderizado tenga el mismo tamaño sin importar la distancia. Es especialmente útil para indicadores (sin prueba de profundidad y alta prioridad de renderizado) y algunos tipos de billboards.

source: Do Not Receive Shadows
de: Empfange keine Schatten
es: Do Not Receive Shadows (No recibir sombras)

source: Makes the object not receive any kind of shadow that would otherwise be cast onto it.
de: Lässt das Objekt keinen Schatten empfangen, der sonst darauf geworfen würde.
es: Hace que el objeto no reciba ningún tipo de sombra que de otro modo sería proyectada sobre él.

source: Makes the object not receive any kind of ambient lighting that would otherwise light it.
de: Lässt das Objekt keine Umgebungsbeleuchtung erhalten, die es sonst beleuchten würde.
es: Hace que el objeto no reciba ningún tipo de luz ambiental que de otro modo sería lo iluminaría.

source: Ensure Correct Normals
de: Korrekte Normalen sicherstellen
es: Asegura Normales Correctas

source: Fixes normals when non-uniform scaling is used.
de: Gleicht Normals an, wenn eine ungleichmäßige Skalierung verwendet wird.
es: Fija las normales cuando se utiliza una escala no uniforme.

source: Vertex Color
de: Vertex-Farbe
es: Vertex Color (Color de vértice)

source: This setting allows choosing what is done by default to vertex colors that come from your 3D modelling application. By default, they are ignored.
de: Mit dieser Einstellung können Sie auswählen, was standardmäßig für Vertex-Farben verwendet werden soll, die aus Ihrer 3D-Modellierungsanwendung stammen. Standardmäßig werden sie ignoriert.
es: Esta opción permite elegir lo que se hace por defecto en los colores de los vértices que provienen de su aplicación de modelado 3D. Por defecto, se ignoran.

source: Use as Albedo
de: Als Albedo verwenden
es: Use as Albedo (Usar como Albedo)

source: Choosing this option means vertex color is used as albedo color.
de: Wenn Sie diese Option auswählen, wird die Vertex-Farbe als Albedo-Farbe verwendet.
es: Esta opción hace que el color del vértice se utiliza como color del albedo.

source: Most 3D DCCs will likely export vertex colors as sRGB, so toggling this option on will help them look correct.
de: Die meisten 3D-DCCs exportieren Vertex-Farben wahrscheinlich als sRGB. Wenn Sie diese Option aktivieren, sehen sie korrekt aus.
es: La mayoría de los DCCs 3D probablemente exportarán los colores de los vértices como sRGB, por lo que activar esta opción ayudará a que se vean correctamente.

source: Parameters
de: Parameter
es: Parámetros

source: ``SpatialMaterial`` also has several configurable parameters to tweak many aspects of the rendering:
de: ``SpatialMaterial`` verfügt auch über mehrere konfigurierbare Parameter, um viele Aspekte des Renderns zu optimieren:
es: ``SpatialMaterial`` también tiene varios parámetros que pueden configurarse para ajustar muchos aspectos del renderizado:

source: Diffuse Mode
de: Diffusmodus
es: Diffuse Mode (Modo difuso)

source: Specifies the algorithm used by diffuse scattering of light when hitting the object. The default is *Burley*. Other modes are also available:
es: Especifica el algoritmo utilizado por la dispersión difusa de la luz al golpear el objeto. El predeterminado es *Burley*. También hay otros modos disponibles:

source: **Burley:** Default mode, the original Disney Principled PBS diffuse algorithm.
de: **Burley:** Standardmodus, der ursprüngliche diffuse Algorithmus von Disney Principled PBS.
es: **Burley:** Modo predeterminado, el algoritmo difuso original de Disney Principled PBS.

source: **Lambert:** Is not affected by roughness.
de: **Lambert:** Wird nicht von Rauheit beeinflusst.
es: **Lambert:** No se ve afectado por la rugosidad.

source: **Lambert Wrap:** Extends Lambert to cover more than 90 degrees when roughness increases. Works great for hair and simulating cheap subsurface scattering. This implementation is energy conserving.
de: **Lambert-Wrap:** Erweitert Lambert, um mehr als 90 Grad abzudecken, wenn die Rauheit zunimmt. Eignet sich hervorragend für Haare und die Simulation billiger unterirdischer Streuung. Diese Implementierung ist energiesparend.
es: **Lambert Wrap:** Extiende Lambert para cubrir más de 90 grados cuando la rugosidad es mayor. Funciona muy bien para el cabello y simula la dispersión a bajo costo de la superficie. Esta implementación es para conservar energía.

source: **Oren Nayar:** This implementation aims to take microsurfacing into account (via roughness). Works well for clay-like materials and some types of cloth.
es: **Oren Nayar:** El objetivo de esta implementación es tener en cuenta el microsurfacing (a través de la rugosidad). Funciona bien con materiales similares a la arcilla y algunos tipos de tela.

source: **Toon:** Provides a hard cut for lighting, with smoothing affected by roughness. It is recommended you disable sky contribution from your environment's ambient light settings or disable ambient light in the spatial material to achieve a better effect.
es: **Toon:** Proporciona un acabado duro para la iluminación, con alisado afectado por la rugosidad. Se recomienda desactivar la influencia del cielo en la configuración de la luz ambiental del entorno o desactivar la luz ambiental en el material spatial para lograr un mejor efecto.

source: Specular Mode
de: Spiegelndmodus
es: Specular Mode (Modo Specular)

source: Specifies how the specular blob will be rendered. The specular blob represents the shape of a light source reflected in the object.
es: Especifica cómo se renderizará el specular blob. El specular blob representa la forma de una fuente de luz reflejada en el objeto.

source: **ShlickGGX:** The most common blob used by PBR 3D engines nowadays.
de: **ShlickGGGX:** Der heutzutage von PBR-3D-Engines am häufigsten verwendete Blob.
es: **ShlickGGX:**El blob más común usado por los motores PBR 3D hoy en día.

source: **Blinn:** Common in previous-generation engines. Not worth using nowadays, but left here for the sake of compatibility.
de: **Blinn:** In früheren Engines üblich. Heutzutage nicht mehr sinnvoll, aber aus Kompatibilitätsgründen belassen.
es: **Blinn:** Común en motores de generaciones anteriores. No vale la pena usarlo hoy en día, pero lo hemos dejado por motivos de compatibilidad.

source: **Phong:** Same as above.
de: **Phong:** Wie oben.
es: **Phong:** Igual que arriba.

source: **Toon:** Creates a toon blob, which changes size depending on roughness.
de: **Toon:** Erstellt einen Toon-Blob, dessen Größe sich je nach Rauheit ändert.
es: **Toon:** Crea un blob toon, que cambia de tamaño dependiendo de la rugosidad.

source: **Disabled:** Sometimes the blob gets in the way. Begone!
de: **Disabled:** Manchmal ist der Blob im Weg. Weg da!
es: **Disabled:** A veces, el reflejo molesta. ¡Desaparece!

source: Controls the blend mode for the material. Keep in mind that any mode other than *Mix* forces the object to go through the transparent pipeline.
es: Controla el modo de mezcla para el material. Hay que tener en cuenta que cualquier otro modo que no sea *Mix* obliga al objeto a pasar por el pipeline transparente.

source: **Mix:** Default blend mode, alpha controls how much the object is visible.
es: **Mix**: Modo de mezcla por defecto, alpha controla cuánto es visible el objeto.

source: **Add:** Object is blended additively, nice for flares or some fire-like effects.
de: **Hinzufügen:** Objekt wird additiv überblendet, schön für Fackeln oder feuerähnliche Effekte.
es: **Add**: El objeto es mezclado de manera aditiva, bueno para efectos de destellos o similares al fuego.

source: **Sub:** Object is subtracted.
de: **Sub:** Objekt wird subtrahiert.
es: **Sub**: El objeto es substraído.

source: **Mul:** Object is multiplied.
de: **Mul:** Objekt wird multipliziert.
es: **Mul**: El objeto es multiplicado.

source: Determines which side of the object is not drawn when backfaces are rendered:
de: Bestimmt, welche Seite des Objekts nicht gezeichnet wird, wenn Rückseiten gerendert werden:
es: Determina qué lado del objeto no se dibuja cuando se procesan las backfaces:

source: **Back:** The back of the object is culled when not visible (default).
de: **Rückseite:** Die Rückseite des Objekts wird ausgesondert, wenn sie nicht sichtbar ist (Standard).
es: **Back**: La parte posterior del objeto no es dibujada cuando no es visible (por defecto).

source: **Front:** The front of the object is culled when not visible.
de: **Vorderseite:** Die Vorderseite des Objekts wird ausgesondert, wenn sie nicht sichtbar ist.
es: **Front**: La parte frontal del objeto no es dibujada cuando no es visible.

source: **Disabled:** Used for objects that are double-sided (no culling is performed).
es: **Disabled**: Utilizado para objetos de doble cara (no se realiza ningún proceso de culling).

source: Specifies when depth rendering must take place.
de: Gibt an, wann das Tiefenrendern stattfinden muss.
es: Especifica cuándo se debe realizar el renderizado de profundidad.

source: **Opaque Only (default):** Depth is only drawn for opaque objects.
de: **Nur undurchsichtig (Standard):** Die Tiefe wird nur für undurchsichtige Objekte gezeichnet.
es: **Opaque Only (predeterminado)**: Sólo se dibuja la profundidad en objetos opacos.

source: **Always:** Depth draw is drawn for both opaque and transparent objects.
de: **Immer:** Tiefenzeichnung wird sowohl für undurchsichtige als auch für transparente Objekte verwendet.
es: **Always**: El dibujo de profundidad se realiza tanto para objetos opacos como transparentes.

source: **Never:** No depth draw takes place (do not confuse this with the No Depth Test option above).
es: **Never**: No se realiza ningún dibujo de profundidad (nota: no confundir con la opción No Depth Test anterior).

source: **Depth Pre-Pass:** For transparent objects, an opaque pass is made first with the opaque parts, then transparency is drawn above. Use this option with transparent grass or tree foliage.
es: **Depth Pre-Pass**: En el caso de los objetos transparentes, primero se hace un pase opaco con las partes opacas y luego se dibuja la transparencia por encima. Esta opción se puede utilizar con césped transparente o follaje de árboles.

source: Line Width
de: Linienbreite
es: Line Width (Ancho de línea)

source: When drawing lines, specify the width of the lines being drawn. This option is not available on most modern hardware.
es: Al dibujar líneas, especifica un ancho de las líneas que se están dibujando. Esta opción no está disponible en la mayoría del hardware moderno.

source: Point Size
de: Punktgröße
es: Point Size (Tamaño de puntos)

source: When drawing points, specify the point size in pixels.
de: Geben Sie beim Zeichnen von Punkten die Punktgröße in Pixel an.
es: Cuando se dibujen puntos, hay que especificar el tamaño del punto en píxeles.
