Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/using_gridmaps.po
Languages: es, fr, ja, ko, zh_cn

source: Using GridMaps
es: Usando GridMaps
fr: Utilisation de GridMaps
zh_cn: 使用 GridMap

source: Introduction
es: Introducción
ja: はじめに
ko: 소개
zh_cn: 前言

source: :ref:`Gridmaps <class_GridMap>` are a tool for creating 3D game levels, similar to the way :ref:`TileMap <doc_using_tilemaps>` works in 2D. You start with a predefined collection of 3D meshes (a :ref:`class_MeshLibrary`) that can be placed on a grid, as if you were building a level with an unlimited amount of Lego blocks.
es: :ref:`Gridmaps <class_GridMap>` son una herramienta para crear niveles de juego en 3D, similar a la forma en que :ref:`TileMap <doc_using_tilemaps>` funciona en 2D. Comienzas con una colección predefinida de mallas 3D (una :ref:`class_MeshLibrary``) que pueden ser colocadas en un gruid, como si estuvieras construyendo un nivel con una cantidad ilimitada de bloques de Lego.
fr: :ref:`Gridmaps <class_GridMap>` sont un outil pour créer des niveaux de jeu 3D, similaire à la manière dont :ref:`TileMap <doc_using_tilemaps>` fonctionne en 2D. Vous commencez avec une collection prédéfinie de maillages 3D (a :ref:`class_MeshLibrary`) qui peuvent être placés sur une grille, comme si vous construisiez un niveau avec un nombre illimité de blocs Lego.
ja: :ref:`Gridmaps <class_GridMap>` は、3Dゲームレベルを作成するためのツールで、\ :ref:`TileMap <doc_using_tilemaps>` が2Dで行う動作と似ています。 3Dメッシュの事前定義されたコレクション(:ref:`class_MeshLibrary`)から開始します。これは、無制限の量のLegoブロックでレベルを構築しているかのように、グリッドに配置できます。
ko: :ref:`GridMap <class_GridMap>`\ 은 2D 게임의 :ref:`TileMap <doc_using_tilemaps>`\ 과 유사한 방식으로 3D 게임 레벨을 만드는 툴입니다. 격자 위에 메시를 배치하려면, 미리 정의해 놓은 3D 메시 모음 (:ref:`class_MeshLibrary`)이 필요합니다. 메시 모음은 마치 무한한 레고 블록처럼 사용됩니다.
zh_cn: :ref:`Gridmaps <class_GridMap>` 是一种用于创建3D游戏关卡的工具, 方式类似于2D中使用 :ref:`TileMap <doc_using_tilemaps>` . 使用一个定义好的可以放在一个网格中的 3D mesh (a :ref:`class_MeshLibrary`) (译注,grid和mesh都译作网格, 这里为了清晰,mesh直接使用英文,grid则译作网格)对象集合搭建关卡, 就像你使用无限多数量的乐高积木搭建世界一样.

source: Collisions and navigation can also be added to the meshes, just like you would do with the tiles of a tilemap.
es: Las colisiones y la navegación también se pueden añadir a las mallas, como se haría con los tiles de un mapa de tiles.
fr: Les collisions et la navigation peuvent également être ajoutées aux maillages, tout comme vous le feriez avec les tuiles d'une carte en mosaïque.
ja: タイルマップのタイルで行うのと同じように、コリジョンとナビゲーションをメッシュに追加できます。
ko: 콜리전과 내비게이션도 메시에 추가될 수 있습니다. TileMap의 타일과 똑같죠.
zh_cn: 就像使用tilemap的tile一样, 碰撞和导航也可以添加到网格中.

source: Example project
es: Proyecto ejemplo
fr: Exemple de projets
ja: サンプル・プロジェクト
ko: 예제 프로젝트
zh_cn: 示例项目

source: To learn how GridMaps work, start by downloading the sample project: `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip>`_.
zh_cn: 要学习 GridMaps 是怎么样工作的，请先下载示例项目：\ `gridmap_starter.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/gridmap_starter.zip>`_\ 。

source: Unzip this project and add it to the Project Manager using the "Import" button.
es: Descomprime este proyecto y agrégalo al Gestor de Proyectos usando el botón "Importar".
fr: Décompressez ce projet et ajoutez-le au gestionnaire de projet en utilisant le bouton "Importer".
ja: このプロジェクトを解凍してから、『インポート』ボタンでプロジェクトマネージャーに追加します。
ko: 프로젝트 압축을 풀고 "가져오기(Import)" 버튼으로 프로젝트 매니저(Project Manager)에 추가하세요.
zh_cn: 解压缩此项目并使用“导入”按钮将其添加到项目管理器。

source: Creating a MeshLibrary
es: Creando una MeshLibrary
fr: Création d’une MeshLibrary
ja: MeshLibraryの作成
ko: MeshLibrary 만들기
zh_cn: 创建 MeshLibrary

source: To begin, you need a :ref:`class_MeshLibrary`, which is a collection of individual meshes that can be used in the gridmap. Open the "mesh_library_source.tscn" scene to see an example of how to set up the mesh library.
zh_cn: 首先，你需要一个 :ref:`class_MeshLibrary`\ ，它是可以在网格地图中使用的 Mesh 的集合。打开“mesh_library_source.tscn”场景以查看如何设置网格库的示例。

source: As you can see, this scene has a :ref:`class_Node3D` node as its root, and a number of :ref:`class_MeshInstance3D` node children.
zh_cn: 如你所见，该场景有一个 :ref:`class_Node3D` 节点作为其根节点，以及许多 :ref:`class_MeshInstance3D` 节点子节点。

source: If you don't need any physics in your scene, then you're done. However, in most cases you'll want to assign collision bodies to the meshes.
es: Si no necesitas nada de física en tu escena, entonces estás acabado. Sin embargo, en la mayoría de los casos querrás asignar cuerpos de colisión a las mallas.
fr: Si vous n'avez pas besoin de physique dans votre scène, alors c'est fini. Cependant, dans la plupart des cas, vous voudrez assigner des corps de collision aux mailles.
ja: もし、あなたのシーンに物理演算が不要であれば、これで完了です。しかし、ほとんどの場合はメッシュにコリジョンを追加したくなるでしょう。
ko: 씬에서 물리 엔진이 필요 없다면, 이게 끝입니다. 하지만 대부분의 경우, 메시에 콜리전 바디가 필요할 것입니다.
zh_cn: 如果你的场景中不需要任何物理, 那么到这里就完成了. 但是, 在大多数情况下, 你还需要给网格指定碰撞体.

source: Collisions
es: Colisiones
ja: コリジョン
ko: 콜리전(Collision)
zh_cn: 碰撞

source: You can manually assign a :ref:`class_StaticBody3D` and :ref:`class_CollisionShape3D` to each mesh. Alternatively, you can use the "Mesh" menu to automatically create the collision body based on the mesh data.
zh_cn: 你可以手动为每个 Mesh 指定 :ref:`class_StaticBody3D` 和 :ref:`class_CollisionShape3D`\ 。或者，你可以使用“网格”菜单根据 Mesh 数据自动创建碰撞体。

source: Note that a "Convex" collision body will work better for simple meshes. For more complex shapes, select "Create Trimesh Static Body". Once each mesh has a physics body and collision shape assigned, your mesh library is ready to be used.
es: Tengan en cuenta que un cuerpo de colisión "Convexo" funcionará mejor para las mallas simples. Para formas más complejas, seleccione "Crear cuerpo estático Trimalla". Una vez que cada malla tenga asignado un cuerpo físico y una forma de colisión, su biblioteca de mallas estará lista para ser utilizada.
fr: Notez qu'un corps de collision "convexe" fonctionnera mieux pour des mailles simples. Pour des formes plus complexes, sélectionnez "Create Trimesh Static Body". Une fois que chaque maille a un corps physique et une forme de collision assignés, votre bibliothèque de mailles est prête à être utilisée.
ja: シンプルなメッシュには『凸状』コリジョン ボディのほうが合うでしょう。より複雑な形なら『静的三角形メッシュの作成』を選択します。それぞれのメッシュに物理ボディとコリジョン シェイプが割り当てられたら、メッシュ ライブラリは使えるようになります。
ko: "컨벡스" 콜리전 바디는 단순한 메시에 더 잘 작동합니다. 복잡한 모양이라면 "Trimesh Static Body 만들기(Create Trimesh Static Body)"를 선택하세요. 각 메시마다 PhysicsBody와 ColliisionShape를 가졌다면, MeshLibrary를 사용할 준비가 되었습니다.
zh_cn: 请注意，“凸”（Convex）碰撞体对于简单 Mesh 效果更好。对于更复杂的形状，请选择“创建三角网格静态体”。一旦每个网格都分配了物理主体和碰撞形状，就可以使用网格库了。

source: Materials
es: Materiales
fr: Matériaux
ja: マテリアル
ko: 머티리얼
zh_cn: 材质

source: Only the materials from within the meshes are used when generating the mesh library. Materials set on the node will be ignored.
es: Sólo se utilizan los materiales del interior de las mallas para generar la biblioteca de mallas. Los materiales establecidos en el nodo serán ignorados.
fr: Seuls les matériaux provenant des mailles sont utilisés lors de la génération de la bibliothèque de mailles. Les matériaux définis sur le nœud seront ignorés.
ja: メッシュライブラリの生成時には、メッシュ内にあるマテリアルのみが使用され、ノードに設定したマテリアルは無視されます。
ko: MeshLibrary를 생성할 때는 메시 안에 있는 머티리얼만 사용됩니다. 노드에 설정된 머티리얼은 무시됩니다.
zh_cn: 在生成网格库时, 只使用网格内的材质. 节点上设置的材质将被忽略.

source: NavigationMeshes
fr: Maillages de Navigation
zh_cn: NavigationMesh

source: Like all mesh instances, MeshLibrary items can be assigned a :ref:`class_NavigationMesh` resource, which can be created manually, or baked as described below.
es: Al igual que todas las instancias de malla (MeshInstance), los elementos de MeshLibrary pueden asignarse a un recurso :ref:`NavigationMesh <class_NavigationMesh>`, el cual puede crearse manualmente o generarse mediante el proceso de generación de navegación descrito a continuación.
fr: Comme toutes les instances de maillages, une ressource :ref:`class_NavigationMesh` peut être assignée aux objets MeshLibrary ; celle-ci peut être créée manuellement, ou précalculée comme décrit ci-dessous.
zh_cn: 和所有网格实例一样，MeshLibrary 的项目可以用 :ref:`class_NavigationMesh` 赋值，既可以手动创建，也即可按下面的说明进行烘焙。

source: To create the NavigationMesh from a MeshLibrary scene export, place a :ref:`class_NavigationRegion3D` child node below the main MeshInstance3D for the GridMap item. Add a valid NavigationMesh resource to the NavigationRegion3D and some source geometry nodes below and bake the NavigationMesh.
zh_cn: 要从 MeshLibrary 场景导出创建 NavigationMesh，请在 GridMap 项的主 MeshInstance3D 下方放置一个 :ref:`class_NavigationRegion3D` 子节点。为该 NavigationRegion3D 添加有效的 NavigationMesh 资源，然后在下面的一些源几何体节点，再烘焙 NavigationMesh。

source: With small grid cells it is often necessary to reduce the NavigationMesh properties for agent radius and region minimum size.
es: Con celdas de malla pequeñas, a menudo es necesario reducir las propiedades del NavigationMesh para el radio del agente (agent radius) y el tamaño mínimo de la región (region minimum size).
fr: Avec les cellules de petites grilles, il est souvent nécessaire de réduire les propriétés du rayon des agents et la taille minimum de la région de la NavigationMesh.
zh_cn: 如果单元格比较小，一般需要把 NavigationMesh 属性里的代理半径和最小地区大小降低。

source: Nodes below the NavigationRegion3D are ignored for the MeshLibrary scene export, so additional nodes can be added as source geometry just for baking the navmesh.
zh_cn: NavigationRegion3D 下的节点在导出 MeshLibrary 场景时会被忽略，所以可以专门为烘焙导航网格添加额外的节点，作为来源几何体。

source: The baked cell size of the NavigationMesh must match the NavigationServer map cell size to properly merge the navigation meshes of different grid cells.
es: El tamaño de celda (cell size) generado en el proceso de horneado del NavigationMesh debe coincidir con el tamaño de celda del mapa (map cell size) del NavigationServer para fusionar correctamente los navmeshes de diferentes celdas de malla.
zh_cn: 烘焙 NavigationMesh 的单元格大小必须与 NavigationServer 地图的单元格大小一致，才能把不同 Grid 单元格的导航网格合并起来。

source: Exporting the MeshLibrary
es: Exportación de MeshLibrary
fr: Exportation de la MeshLibrary
ja: MeshLibraryのエクスポート
ko: MeshLibrary 내보내기
zh_cn: 导出 MeshLibrary

source: To export the library, click on **Scene > Export As... > MeshLibrary...**, and save it as a resource.
zh_cn: 要导出库，点击 **场景 > 导出为.. > MeshLibrary...** ，并将其保存为资源。

source: You can find an already exported MeshLibrary in the project named "MeshLibrary.tres".
es: Puedes encontrar una MeshLibrary ya exportada en el proyecto llamado "MeshLibrary.tres".
fr: Vous pouvez trouver une MeshLibrary déjà exportée dans le projet nommé "MeshLibrary.tres".
ja: "MeshLibrary.tres" という名前のプロジェクトで、既にエクスポートされたMeshLibraryを見つけることができます。
ko: 프로젝트에서 내보낸 MeshLibrary를 "MeshLibrary.tres"라는 이름으로 볼 수 있습니다.
zh_cn: 可以在项目中找到已导出的名为“MeshLibrary.tres”的 MeshLibrary。

source: Using GridMap
es: Usando GridMap
fr: Utilisation de GridMap
ja: GridMap(グリッドマップ)の使用
ko: GridMap 사용하기
zh_cn: 使用 GridMap

source: Create a new scene and add a GridMap node. Add the mesh library by dragging the resource file from the FileSystem dock and dropping it in the "Theme" property in the Inspector.
es: Crea una nueva escena y añade un nodo GridMap. Añade la librería de mallas arrastrando el archivo de recursos desde el panel del Sistema de Archivos y soltándolo en la propiedad "Theme" en el Inspector.
fr: Créez une nouvelle scène et ajoutez un nœud GridMap. Ajoutez la MeshLibrary en faisant glisser le fichier ressource depuis le dock FileSystem et en le déposant dans la propriété "Theme" de l'Inspecteur.
ja: 新しいシーンを作成し、GridMapノードを追加します。 ファイルシステムドックからリソースファイルをドラッグし、インスペクタの[Theme]プロパティにドロップして、メッシュライブラリを追加します。
ko: 새 씬을 만들고 GridMap 노드를 추가하세요. 파일 시스템(FileSystem) 독에서 리소스 파일을 드래그한 다음, 인스펙터(Inspector)의 "Mesh Library" 속성에 드롭해서 MeshLibrary를 추가하세요.
zh_cn: 创建一个新场景并添加一个 GridMap 节点。通过从文件系统面板拖动资源文件并将其放入检查器中的“Theme”（主题）属性中来添加网格库。

source: The "Cell/Size" property should be set to the size of your meshes. You can leave it at the default value for the demo. Set the "Center Y" property to "Off".
es: La propiedad "Celda/Tamaño" debe ser ajustada al tamaño de sus mallas. Puedes dejarla en el valor por defecto para la demostración. Poner la propiedad "Centrar Y" en "Apagado".
fr: La propriété "Cell/Size" doit être réglée sur la taille de vos mailles. Vous pouvez le laisser à la valeur par défaut de la démo. Réglez la propriété "Center Y" sur "Off".
ja: "Cell/Size"プロパティは、メッシュのサイズに設定する必要があります。 デモのデフォルト値のままにしておくことができます。"Center Y"プロパティを"Off"に設定します。
ko: "Cell/Size" 속성은 메시의 크기를 설정합니다. 데모에서는 기본 값으로 두어도 됩니다. "Center Y" 속성을 끄세요.
zh_cn: “Cell/Size”属性应设置为网格的大小。在本示例中你可以使用默认值。将“Center Y”属性设置为“未启用”。

source: Now you can start designing the level by choosing a tile from the palette and placing it with Left-Click in the editor window. Use Right-click to remove a tile.
zh_cn: 现在，你可以开始设计关卡了，从调色板中选择一个图块，然后在编辑器窗口中用左键单击它。要删除一个图块，使用右键单击。

source: Use the arrows next to the "GridMap" menu to change the floor that you are working on.
zh_cn: 使用“GridMap”菜单旁边的箭头更改你正在处理的层。

source: Click on the "GridMap" menu to see options and shortcuts. For example, pressing :kbd:`S` rotates a tile around the y-axis.
es: Haga clic en el menú "GridMap" para ver las opciones y los atajos. Por ejemplo, presionando :kbd:`S` gira una baldosa alrededor del eje y.
fr: Cliquez sur le menu "GridMap" pour voir les options et les raccourcis. Par exemple, appuyer sur :kbd:`S` fait tourner une tuile autour de l'axe y.
ja: [グリッドマップ]メニューをクリックして、オプションとショートカットを表示します。たとえば、\ :kbd:`S` を押すと、タイルがy軸を中心に回転します。
zh_cn: 单击“GridMap”菜单可以查看选项和快捷键。例如，按下 :kbd:`S` 绕 Y 轴旋转图块。

source: Holding :kbd:`Shift` and dragging with the left mouse button will draw a selection box. You can duplicate or clear the selected area using the respective menu options.
es: Manteniendo pulsado :kbd:`Mayúscula` y arrastrando con el botón izquierdo del ratón se dibujará un cuadro de selección. Puede duplicar o borrar el área seleccionada usando las respectivas opciones de menú.
fr: Maintenez la touche :kbd:`Shift` enfoncée et faites-la glisser avec le bouton gauche de la souris pour dessiner une cadre de sélection. Vous pouvez dupliquer ou effacer la zone sélectionnée à l'aide des rubriques de menu correspondantes.
ja: :kbd:`Shift` を押しながらマウスの左ボタンでドラッグすると、選択ボックスが描画されます。 それぞれのメニューオプションを使用して、選択した領域を複製または消去できます。
zh_cn: 按住 :kbd:`Shift` 并使用鼠标左键拖动将绘制一个选择框. 你可以使用相应的菜单选项复制或清除所选区域.

source: In the menu, you can also change the axis you're drawing on, as well as shift the drawing plane higher or lower on its axis.
es: En el menú, también puede cambiar el eje sobre el que está dibujando, así como desplazar el plano de dibujo más arriba o más abajo en su eje.
fr: Dans le menu, vous pouvez également modifier l'axe sur lequel vous dessinez, ainsi que le changement du plan de dessin supérieur ou inférieur sur son axe.
ja: メニューでは、描画する軸を変更したり、描画面をその軸で上下に移動することもできます。
ko: 메뉴에서 타일이 배치되는 격자의 높이와 축도 바꿀 수 있습니다.
zh_cn: 在菜单中, 你还可以更改正在绘制的轴, 并将绘图平面在其轴上移动得更高或更低.

source: Using GridMap in code
es: Usando Gridmap en código
fr: Utiliser GridMap dans le code
ja: コードでのGridMapの使用
ko: 코드로 GridMap 사용하기
zh_cn: 在代码中使用 GridMap

source: See :ref:`class_GridMap` for details on the node's methods and member variables.
es: Ver :ref:`class_GridMap` para detalles sobre los métodos del nodo y las variables de miembros.
fr: Voir :ref:`class_GridMap` pour plus de détails sur les méthodes du nœud et les variables membres.
ja: ノードのメソッドとメンバー変数の詳細については、\ :ref:`class_GridMap` を参照してください。
ko: 노드의 메서드와 멤버 변수에 대한 자세한 설명은 :ref:`class_GridMap`\ 을 참고하세요.
zh_cn: 有关节点方法和成员变量的详细信息, 请参阅 :ref:`class_GridMap`.

source: Translation status
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
ko: 번역 상태
zh_cn: 翻译状态

source: To learn how GridMaps work, start by downloading the sample project: :download:`gridmap_demo.zip <files/gridmap_demo.zip>`.
ko: 어떻게 GridMap이 작동하는지 배우려면, 샘플 프로젝트를 다운로드하세요: :download:`gridmap_demo.zip <files/gridmap_demo.zip>`.

source: To begin, you need a :ref:`class_MeshLibrary`, which is a collection of individual meshes that can be used in the gridmap. Open the "MeshLibrary_Source.tscn" scene to see an example of how to set up the mesh library.
ko: 시작하려면 :ref:`class_MeshLibrary`\ 가 필요합니다. MeshLibrary는 개별 메시들의 모음으로 그리드맵에 쓸 수 있습니다. "MeshLibrary_Source.tscn" 씬을 열어서 어떻게 MeshLibrary가 설정되어 있는지 확인하세요.

source: As you can see, this scene has a :ref:`class_Spatial` node as its root, and a number of :ref:`class_MeshInstance` node children.
ko: 보다시피, 이 씬은 루트로 :ref:`class_Spatial` 노드를 갖고 있습니다. 그리고 많은 :ref:`class_MeshInstance` 노드 자손을 갖고 있죠.

source: You can manually assign a :ref:`class_StaticBody` and :ref:`class_CollisionShape` to each mesh. Alternatively, you can use the "Mesh" menu to automatically create the collision body based on the mesh data.
ko: 각 메시마다 일일이 :ref:`class_StaticBody`\ 와 :ref:`class_CollisionShape`\ 를 지정할 수 있습니다. 아니면 "메시(Mesh)" 메뉴에서 메시 데이터를 기반으로 한 콜리전 바디를 자동으로 만들 수 있습니다.

source: To export the library, click on Scene -> Convert To.. -> MeshLibrary.., and save it as a resource.
ko: MeshLibrary를 내보내려면, 씬(Scene) -> 다음으로 변환하기...(Convert To...) -> 메시 라이브러리(MeshLibrary)를 클릭하고, 리소스로 저장하세요.
