Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/command_line_tutorial.po
Languages: de, ko, pt_br

source: Creating a project from the command line can be done by navigating the shell to the desired place and making a project.godot file.
de: Ein neues Projekt kann auch über die Kommandozeile erzeugt werden indem in der Shell (Eingabeaufforderung) zum gewünschten Verzeichnis gewechselt und eine Datei project.godot erzeugt wird.
ko: 명령줄에서 프로젝트를 생성하려면 셸을 원하는 위치로 이동하고 project.godot 파일을 만드세요.
pt_br: Criar um projeto a partir da linha de comando pode ser feito navegando no shell até o local desejado e criando um arquivo project.godot.

source: The project can now be opened with Godot.
de: Das Projekt kann nun mit Godot geöffnet werden.
ko: 프로젝트는 이제 Godot로 열 수 있습니다.
pt_br: O projeto agora pode ser aberto com Godot.

source: Running the editor
de: Editor starten
ko: 에디터 실행하기
pt_br: Executando o editor

source: Running the editor is done by executing Godot with the ``-e`` flag. This must be done from within the project directory or a subdirectory, otherwise the command is ignored and the project manager appears.
de: Den Editor startet man durch ausführen von Godot mit dem ``-e`` Flag. Dies muss aus dem Projekt-Verzeichnis oder einem Unterverzeichnis geschehen, ansonsten wird der Befehl ignoriert und der Projekt Manager erscheint.
ko: Godot를 ``-e`` 플래그로 실행하면 에디터가 실행됩니다. 이 작업은 프로젝트 디렉토리 또는 하위 디렉토리에서 수행해야 합니다, 그렇지 않으면 명령이 무시되고 프로젝트 매니저가 나타납니다.
pt_br: Rodar o editor é feito executando Godot com o sinalizador ``-e``. Isso deve ser feito a partir do diretório do projeto ou de um subdiretório, caso contrário, o comando será ignorado e o gerenciador de projetos será exibido.

source: If a scene has been created and saved, it can be edited later by running the same code with that scene as argument.
de: Eine Szene wurde erzeugt und gespeichert, sie kann später editiert werden mit dem gleichen Code und der Szene als Argument.
ko: 씬을 만들고 저장하면 나중에 해당 씬을 인수로 사용해 동일한 코드를 실행해서 편집할 수 있습니다.
pt_br: Se uma cena foi criada e salva, ela pode ser editada posteriormente, executando o mesmo código com aquela cena como argumento.

source: Erasing a scene
de: Szene löschen
ko: 씬 지우기
pt_br: Apagando uma cena

source: Godot is friends with your filesystem and will not create extra metadata files. Use ``rm`` to erase a scene file. Make sure nothing references that scene or else an error will be thrown upon opening.
de: Godot schont Ihr Filesystem und wird keine extra Metadata Dateien erzeugen. Nutzen Sie ``rm`` um eine Szenendatei zu löschen. Stellen Sie sicher, dass nichts auf diese Szene verweist, ansonsten wird beim Öffnen ein Fehler angezeigt.
ko: Godot는 여러분의 파일 시스템에 친화적이고 추가적인 메타데이터 파일을 만들지 않습니다. 씬 파일을 지우려면 ``rm``\ 을 사용하세요. 지울 씬을 참조하는 게 있다면 열 때 오류가 발생할 것입니다.
pt_br: Godot é o amigo do seu sistema de arquivos e não criará arquivos extras de metadados. Use ``rm`` para apagar um arquivo de cena. Certifique-se de que nada faça referência a essa cena, senão um erro será lançado na abertura.

source: Running the game
de: Spiel starten
ko: 게임 실행하기
pt_br: Executando o jogo

source: To run the game, simply execute Godot within the project directory or subdirectory.
de: Um das Spiel zu starten einfach Godot ausführen innerhalb des Projekt Verzeichnisses oder Unterverzeichnisses.
ko: 게임을 실행하려면, 프로젝트 디렉토리나 하위 디렉토리에서 Godot를 실행하면 됩니다.
pt_br: Para rodar o jogo, simplesmente execute Godot dentro do diretório ou subdiretório do projeto.

source: When a specific scene needs to be tested, pass that scene to the command line.
de: Wenn eine spezielle Szene getestet werden muss, füge diese Szene in der Eingabeaufforderung ein.
ko: 특정 씬을 테스트해야 하는 경우 씬을 명령줄로 전달하세요.
pt_br: Quando uma cena específica precisa ser testada, passe essa cena para a linha de comando.

source: Debugging
de: Debuggen
ko: 디버깅
pt_br: Depuração

source: Catching errors in the command line can be a difficult task because they just fly by. For this, a command line debugger is provided by adding ``-d``. It works for running either the game or a simple scene.
de: Auf der Kommandozeile Fehler erkennen ist schwierig, da diese nur so vorbeirauschen. Hierfür gibt es einen Kommandozeilen-Debugger indem ``-d`` angefügt wird. Dies funktioniert sowohl mit Spielen als auch einfachen Szenen.
ko: 명령줄에서는 오류가 기록되지 않기 때문에 오류를 잡는 것이 어려운 작업이 될 수 있습니다. 이를 위해 명령줄은 ``d``\ 옵션을 통해 디버거를 제공합니다. 게임이나 간단한 씬을 디버깅할 수 있습니다.
pt_br: Capturar erros na linha de comando pode ser uma tarefa difícil porque eles simplesmente passam voando. Para isso, um depurador de linha de comando é fornecido adicionando ``-d``. Funciona tanto para rodar o jogo quanto para uma cena simples.

source: Exporting
de: Exportieren
ko: 내보내기(Exporting)
pt_br: Exportando

source: Exporting the project from the command line is also supported. This is especially useful for continuous integration setups. The version of Godot that is headless (server build, no video) is ideal for this.
de: Das Exportieren des Projekts über die Befehlszeile wird ebenfalls unterstützt. Dies ist besonders nützlich für kontinuierliche Integrations-Setups. Die kopflose Version von Godot (Server-Build, kein Video) ist dafür ideal.
ko: 명령줄에서 프로젝트를 내보내는 것도 지원됩니다. 특히 연속적인 통합(CI: Continuous Integration) 설정에 유용합니다. Godot의 헤드리스 버전(서버 빌드, 비디오 없음)은 이런 점에서 이상적입니다.
pt_br: Exportar o projeto da linha de comando também é suportado. Isso é especialmente útil para configurações de integração contínua. A versão do Godot que é sem cabeça (construção de servidor, sem vídeo) é ideal para isso.

source: The preset name must match the name of an export preset defined in the project's ``export_presets.cfg`` file. If the preset name contains spaces or special characters (such as "Windows Desktop"), it must be surrounded with quotes.
de: Der Name der Voreinstellung muss mit dem Namen einer Exportvoreinstellung übereinstimmen, die in der Datei ``export_presets.cfg`` des Projekts definiert ist. Wenn der Voreinstellungsname Leerzeichen oder Sonderzeichen enthält (z. B. "Windows Desktop"), muss er mit Anführungszeichen umgeben werden.
ko: 프리셋 이름은 프로젝트의 ``export_presets.cfg`` 파일에 정의된 내보내기 프리셋의 이름과 일치해야 합니다. 프리셋 이름에 공백이나 특수 문자(예: "Windows 바탕화면")가 포함된 경우 따옴표로 묶어야 합니다.
pt_br: O nome do preset deve corresponder ao nome de um preset de exportação definido no arquivo ``export_presets.cfg`` do projeto. Se o nome da predefinição contiver espaços ou caracteres especiais (como "Windows Desktop"), ele deve ser colocado entre aspas.

source: To export a debug version of the game, use the ``--export-debug`` switch instead of ``--export``. Their parameters and usage are the same.
de: Um eine Debug-Version des Spiels zu exportieren, verwenden Sie den Schalter ``--export-debug`` anstelle von ``--export``. Ihre Parameter und Verwendung sind gleich.
ko: 게임의 디버그 버전을 내보내기 위해, ``--export`` 대신 ``--export-debug`` 스위치를 사용하세요. 매개 변수와 사용법은 동일합니다.
pt_br: Para exportar uma versão de depuração do jogo, use a opção ``--export-debug`` em vez de ``--export``. Seus parâmetros e uso são os mesmos.

source: To export only a PCK file, use the ``--export-pack`` option followed by the preset name and output path, with the file extension, instead of ``--export``. The output path extension determines the package's format, either PCK or ZIP.
de: Um nur eine PCK-Datei zu exportieren, verwenden Sie die Option ``--export-pack`` gefolgt vom voreingestellten Namen und Ausgabepfad mit der Dateierweiterung anstelle von ``--export``. Die Ausgabepfaderweiterung bestimmt das Format des Pakets, entweder PCK oder ZIP.
ko: PCK 파일만 내보내려면 내보내기 경로, 프리셋 이름, 파일 확장자 앞에 ``--export`` 대신 ``--export-pack`` 옵션을 사용하세요. 내보내기 경로 확장자는 패키지의 형식(PCK 또는 ZIP)을 결정합니다.
pt_br: Para exportar apenas um arquivo PCK, use a opção ``--export-pack`` seguida pelo nome da predefinição e pelo caminho de saída, com a extensão do arquivo, ao invés de ``--export``. A extensão do caminho de saída determina o formato do pacote, PCK ou ZIP.

source: When specifying a relative path as the path for `--export`, `--export-debug` or `--export-pack`, the path will be relative to the directory containing the ``project.godot`` file, **not** relative to the current working directory.
de: Wenn ein relativer Pfad als Pfad für `--export`, `--export-debug` oder `--export-pack` angegeben wird, ist der Pfad relativ zu dem Verzeichnis, das die Datei ``project.godot`` enthält, **nicht** relativ zum aktuellen Arbeitsverzeichnis.
ko: `--export`, `--export-debug` 또는 `--export-pack`\ 의 경로로 상대 경로를 지정할 때 경로는 ``project.godot`` 파일이 포함된 디렉토리에 상대적이므로, 현재 작업 디렉토리와 **관련이 없습니다**.
pt_br: Ao especificar um caminho relativo como o caminho para `--export`, `--export-debug` ou `--export-pack`, o caminho será relativo ao diretório que contém o arquivo ``project.godot``, **não** relativo ao diretório de trabalho atual.

source: Running a script
de: ein Skript starten
ko: 스크립트 실행하기
pt_br: Executando um script

source: It is possible to run a simple ``.gd`` script from the command line. This feature is especially useful in large projects, e.g. for batch conversion of assets or custom import/export.
de: Es ist möglich, ein einfaches ``.gd`` -Skript über die Befehlszeile auszuführen. Diese Funktion ist besonders nützlich in großen Projekten, z.B. für die Stapelkonvertierung von Assets oder den benutzerdefinierten Import/Export.
ko: 명령줄에서 .gd 스크립트를 간단하게 실행할 수 있습니다.특히 일괄 변환 또는 커스텀 불러오기/내보내기를 위한, 큰 프로젝트에서 유용합니다.
pt_br: É possível executar um simples script ``.gd`` a partir da linha de comando. Esse recurso é especialmente útil em projetos grandes, por exemplo, para conversão em lote de ativos ou importação/exportação personalizada.

source: The script must inherit from ``SceneTree`` or ``MainLoop``.
de: Das Skript muss von ``SceneTree`` oder ``MainLoop`` erben.
ko: 스크립트는 ``SceneTree`` 또는 ``MainLoop``\ 를 상속받아야 합니다.
pt_br: O script deve herdar de ``SceneTree`` ou ``MainLoop``.

source: Here is a simple ``sayhello.gd`` example of how it works:
de: Hier ein kleines ``sayhello.gd` Beispiel wie es funktioniert:
ko: 다음은 작동 방식에 대한 간단한 ``sayhello.gd`` 예제입니다:
pt_br: Aqui está um exemplo simples ``sayhello.gd`` de como funciona:

source: And how to run it:
de: und so startet man es:
ko: 그리고 어떻게 실행하는 지에 대한 예제입니다:
pt_br: E como executá-lo:

source: If no ``project.godot`` exists at the path, current path is assumed to be the current working directory (unless ``--path`` is specified).
de: Falls im Pfad kein ``project.godot`` existiert wird der aktuelle Pfad als aktuelles Arbeitsverzeichnis angenommen (es sei denn, ``--path`` ist angegeben).
ko: ``project.godot``\ 가 경로에 존재하지 않으면, 현재 경로는 (``-path``\ 가 지정되지 않는 한) 현재 작업 디렉토리로 가정합니다.
pt_br: Se nenhum ``project.godot`` existir no caminho, o caminho atual é assumido como o diretório de trabalho atual (a menos que ``-path`` seja especificado).

source: The first line of ``sayhello.gd`` above is commonly referred to as a *shebang*. If the Godot binary is in your ``PATH`` as ``godot``, it allows you to run the script as follows in modern Linux distributions, as well as macOS:
de: Die erste Zeile von ``sayhello.gd`` oben wird allgemein als *shebang* bezeichnet. Wenn sich die Godot-Binärdatei in Ihrem ``PATH`` als ``godot`` befindet, können Sie das Skript in modernen Linux-Distributionen sowie unter MacOS wie folgt ausführen:
ko: 위 ``sayhello.gd``\ 의 첫 번째 줄은 일반적으로 *shebang*\ 이라고 합니다. Godot 바이너리가 ``PATH``\ 에 ``godot``\ 로 존재한다면, 최신 Linux 배포판과 macOS에서 다음과 같이 스크립트를 실행할 수 있습니다:
pt_br: A primeira linha de ``sayhello.gd`` acima é comumente referida como *shebang*. Se o binário Godot estiver em seu ``PATH`` como ``godot``, ele permite que você execute o script da seguinte forma em distribuições Linux modernas, bem como no macOS:

source: If the above doesn't work in your current version of Linux or macOS, you can always have the shebang run Godot straight from where it is located as follows:
de: Wenn das oben Genannte unter Ihrer aktuellen Linux oder MacOS Version nicht funktioniert, können Sie den "Shebang" immer wie folgt direkt von Godot ausführen lassen:
ko: 위의 내용이 현재 버전의 Linux 또는 macOS에서 작동하지 않으면 다음과 같이 Shebang이 있는 위치에서 바로 Godot를 실행하도록 할 수 있습니다:
pt_br: Se o acima não funcionar em sua versão atual do Linux ou macOS, você sempre pode fazer com que o shebang execute Godot diretamente de onde está localizado da seguinte maneira:

source: Translation status
de: Übersetzungsstatus
ko: 번역 상태

source: Run with invisible window. Useful together with ``--script``.
ko: 창이 보이지 않도록 합니다. ``--script``\ 와 함께 쓰면 유용합니다.
