Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/command_line_tutorial.po
Languages: de, ko, pt_br

source: Command line tutorial
de: Befehlszeilen-Anleitung
ko: 명령줄(Command line) 튜토리얼
pt_br: Tutorial de linha de comando

source: Some developers like using the command line extensively. Godot is designed to be friendly to them, so here are the steps for working entirely from the command line. Given the engine relies on almost no external libraries, initialization times are pretty fast, making it suitable for this workflow.
de: Manche Entwickler lieben es, die Befehlszeile ausgiebig zu nutzen. Godot wurde dazu designt, für diese Nutzer auch nützlich zu sein, d.h. hier die Anleitung um vollumfänglich von der Befehlszeile aus zu arbeiten. Dadurch dass die Engine sich fast ausschließlich nur auf eigenen Code stützt und kaum externe Bibliotheken verwendet gehen die Initialisierungszeiten ziemlich schnell von statten, was sich als praktisch für diese Arbeitsweise herausstellt.
ko: 일부 개발자들은 명령줄을 광범위하게 사용하는 것을 좋아합니다. Godot는 이들에게 친숙하도록 설계되었고, 여기에는 완전히 명령줄으로만 작업하는 단계가 설명되어 있습니다. 엔진은 외부 라이브러리에 거의 의존하지 않으므로 초기화 시간이 매우 빨라서 이 워크플로에 적합합니다.
pt_br: Alguns desenvolvedores gostam de usar a linha de comando extensivamente. Godot é projetado para funcionar com elas, então aqui estão os passos para trabalhar inteiramente a partir da linha de comando. Como a engine depende de quase nenhuma biblioteca externa, os tempos de inicialização são muito rápidos, o que o torna adequado para esse fluxo de trabalho.

source: On Windows and Linux, you can run a Godot binary in a terminal by specifying its relative or absolute path.
de: Unter Windows und Linux können Sie eine Godot-Binärdatei in einem Terminal ausführen, indem Sie den relativen oder absoluten Pfad angeben.
ko: Windows와 Linux의 터미널에서 상대 또는 절대 경로로 Godot 바이너리를 실행할 수 있습니다.
pt_br: No Windows e Linux, você pode rodar um binário do Godot em um terminal especificando o seu caminho absoluto ou relativo.

source: On macOS, the process is different due to Godot being contained within an ``.app`` bundle (which is a *folder*, not a file). To run a Godot binary from a terminal on macOS, you have to ``cd`` to the folder where the Godot application bundle is located, then run ``Godot.app/Contents/MacOS/Godot`` followed by any command line arguments. If you've renamed the application bundle from ``Godot`` to another name, make sure to edit this command line accordingly.
de: Unter macOS ist der Prozess anders, da Godot in einem ``.app``-Bundle enthalten ist (was ein *Ordner* ist, keine Datei). Um eine Godot-Binärdatei von einem Terminal unter macOS aus zu starten, müssen Sie mit ``cd`` in den Ordner wechseln, in dem sich das Godot-Anwendungspaket befindet, und dann ``Godot.app/Contents/MacOS/Godot`` gefolgt von beliebigen Kommandozeilenargumenten ausführen. Wenn Sie das Anwendungspaket ``Godot`` umbenannt haben, stellen Sie sicher, dass Sie diese Befehlszeile entsprechend ändern.
ko: macOS에서는 Godot가 ``.app`` 번들(파일이 아닌 *폴더*)에 포함되어 있기 때문에 프로세스가 다릅니다. macOS의 터미널에서 Godot 바이너리를 실행하려면 Godot 애플리케이션 번들이 있는 폴더로 ``cd``\ 한 다음 ``Godot.app/Contents/MacOS/Godot`` 뒤에 인수를 넣어 명령줄을 실행해야 합니다. 애플리케이션 번들의 이름을 ``Godot``\ 에서 다른 이름으로 변경했다면 이 명령줄을 적절하게 편집해야 합니다.
pt_br: No macOS, o processo é diferente porque a Godot está contida em um pacote ``.app`` (que é uma *pasta*, não um arquivo). Para rodar um executável da Godot de um terminal no macOS, você deve executar um ``cd`` para a pasta onde o pacote do aplicativo Godot está localizado, em seguida, execute ``Godot.app / Contents / MacOS / Godot`` seguido por quaisquer argumentos de linha de comando. Se você renomeou o pacote do aplicativo da ``Godot`` para outro nome, certifique-se de editar a linha de comando de acordo.

source: Command line reference
de: Kommandozeilenparameter
ko: 명령줄 참조
pt_br: Referência para linha de comando

source: **General options**
de: **Allgemeine Eigenschaften**
ko: **일반 옵션**
pt_br: **Opções gerais**

source: Command
de: Befehl
ko: 명령
pt_br: Comando

source: Description
de: Beschreibung
ko: 설명
pt_br: Descrição

source: Display the list of command line options.
de: Zeigt die Liste der Befehlszeilen-Optionen.
ko: 명령줄 옵션 목록을 표시합니다.
pt_br: Exiba a lista de opções para linha de comando.

source: Display the version string.
de: Zeigt die Version.
ko: 버전 문자열을 표시합니다.
pt_br: Exibe a string da versão.

source: Use verbose stdout mode.
de: Benutze den ausführlichen stdout Modus.
ko: Verbose 표준 출력 모드를 사용합니다.
pt_br: Usar modo de saída verbose.

source: Quiet mode, silences stdout messages. Errors are still displayed.
de: Ruhiger Modus, unterdrückt stdout Nachrichten. Fehler werden immer noch angezeigt.
ko: 조용한 모드. 표준 출력으로 메시지를 출력하지 않습니다. 오류는 계속 표시됩니다.
pt_br: Modo silencioso, silencia mensagens stdout. Os erros ainda são exibidos.

source: **Run options**
de: **Ausführen Eigenschaften**
ko: **실행 설정**
pt_br: **Opções de execução**

source: Start the editor instead of running the scene (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Starte den Editor anstelle der laufenden Szene (:ref:`Tools <doc_introduction_to_the_buildsystem_tools>` müssen aktiviert sein).
ko: 씬을 실행하는 대신 에디터를 시작합니다 (:ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Inicia o editor ao invés de rodar a cena (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar ativado).

source: Start the project manager, even if a project is auto-detected (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Starte die Projektverwaltung, selbst wenn ein Projekt automatisch erkannt wird (:ref:`Tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: 프로젝트가 자동으로 감지되어도, 프로젝트 매니저를 먼저 시작합니다. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>`\ 이 켜져 있어야 합니다).
pt_br: Inicia o gerenciador de projetos, mesmo que um projeto seja detectado automaticamente (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar ativado).

source: Quit after the first iteration.
de: Beende nach dem ersten Schleifendurchgang.
ko: 첫 반복 이후에 종료합니다.
pt_br: Sair depois da primeira iteração.

source: ``-l <locale>``, ``--language <locale>``
de: ``-l <local>``, ``--language <local>``
pt_br: ``-l <código de localidade>``, ``--language <código de localidade>``

source: Use a specific locale (<locale> being a two-letter code). See :ref:`doc_locales` for more details.
de: Verwenden Sie ein bestimmtes Gebietsschema (<locale> ist ein aus zwei Buchstaben bestehender Code). Weitere Informationen finden Sie unter :ref:`doc_locales`.
ko: 특정 로케일(두_단어 코드의 <locale>)을 사용합니다. 더 자세한 정보는 :ref:`doc_locales`\ 을 참고하세요.
pt_br: Use um locale específico (<código de localidade> sendo um código de duas letras). Veja :ref:`doc_locales` para mais detalhes.

source: ``--path <directory>``
de: ``--path <Verzeichnis>``
pt_br: ``--path <diretório>``

source: Path to a project (<directory> must contain a 'project.godot' file).
de: Der Pfad zu dem jeweiligen Projekt. (<directory> muss eine 'Projektname.godot' Datei enthalten).
ko: 프로젝트의 경로 (<directory>에는 'project.godot' 파일이 있어야 합니다).
pt_br: Caminho para um projeto (<directory> deve conter um arquivo 'project.godot').

source: Scan folders upwards for 'project.godot' file.
de: Durchsucht Ordner aufwärts nach der 'project.godot' Datei.
ko: 'project.godot' 파일을 찾기 위해 위로 폴더를 스캔합니다.
pt_br: Escanear pastas acima por arquivo 'project.godot'.

source: ``--main-pack <file>``
pt_br: ``--main-pack <arquivo>``

source: Path to a pack (.pck) file to load.
de: Pfad zu einer Paketdatei (.pck) zum laden.
ko: 불러올 팩 (.pck) 파일의 경로.
pt_br: Caminho para um arquivo de pacote (.pck) a ser carregado.

source: ``--render-thread <mode>``
pt_br: ``--render-thread <modo>``

source: Render thread mode ('unsafe', 'safe', 'separate'). See :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` for more details.
de: Render Thread Modus ('unsafe', 'safe', 'separate'). Siehe :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` für weitere Informationen.
ko: 렌더 스레드 모드 ('unsafe', 'safe', 'separate'). 더 자세한 정보는 :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>`\ 를 참고하세요.
pt_br: Modo de thread de renderização ('unsafe', 'safe', 'separate'). Veja :ref:`Modelo de Thread <class_ProjectSettings_property_rendering/threads/thread_model>` para mais detalhes.

source: ``--remote-fs <address>``
pt_br: ``--remote-fs <endereço>``

source: Remote filesystem (``<host/IP>[:<port>]`` address).
de: Remote Dateisystem (``<Host/IP>[:<Port>]`` Addresse).
ko: 원격 파일 시스템 (``<host/IP>[:<port>]`` 주소).
pt_br: Sistema de Arquivos Remoto (endereço ``<host/IP>[:<port>]``).

source: Audio driver. Use ``--help`` first to display the list of available drivers.
de: Audio-Treiber. Nutze ``--help`` für eine Liste der verfügbaren Treiber.
ko: 오디오 드라이버. 사용할 수 있는 드라이버 목록을 표시하려면 먼저 ``--help``\ 를 입력하세요.
pt_br: Driver de áudio. Use ``--help`` primeiro para exibir a lista de drivers disponíveis.

source: Video driver. Use ``--help`` first to display the list of available drivers.
de: Video-Treiber. Nutze ``--help`` für eine Liste der verfügbaren Treiber.
ko: 비디오 드라이버. 사용할 수 있는 드라이버 목록을 표시하려면 먼저 ``--help``\ 를 입력하세요.
pt_br: Driver de vídeo. Use ``--help`` primeiro para exibir a lista de drivers disponíveis.

source: **Display options**
de: **Anzeige Eigenschaften**
ko: **디스플레이 설정**
pt_br: **Opções de exibição**

source: Request fullscreen mode.
de: Vollbildmodus anfordern.
ko: 전체화면 모드를 요청합니다.
pt_br: Solicitar o modo Tela Cheia.

source: Request a maximized window.
de: Maximiertes Fenster anfordern.
ko: 최대화된 창을 요청합니다.
pt_br: Solicitar uma janela maximizada.

source: Request windowed mode.
de: Fenstermodus anfordern.
ko: 창모드를 요청합니다.
pt_br: Solicitar o Modo Janela.

source: Request an always-on-top window.
de: Ein immer-im-Vordergrund Fenster anfordern.
ko: 항상 화면 위에 고정된(always-on-top) 창을 요청합니다.
pt_br: Solicitar uma Janela Sempre Visível.

source: ``--resolution <W>x<H>``
pt_br: ``--resolution <largura>x<altura>``

source: Request window resolution.
de: Die Fenster Auflösung abrufen.
ko: 창 해상도를 요청합니다.
pt_br: Solicitar a Resolução de Janela.

source: Request window position.
de: Die Fenster-Position abfragen.
ko: 창 위치를 요청합니다.
pt_br: Solicitar a Posição da Janela.

source: Force low-DPI mode (macOS and Windows only).
de: niedrigen DPI-Modus erzwingen (nur auf MacOS und Windows).
ko: 낮은 DPI 모드를 강제합니다 (macOS와 Windows만 가능).
pt_br: Forçar Modo de baixo DPI (Apenas para macOS e Windows).

source: **Debug options**
de: **Debug Eigenschaften**
ko: **디버그 설정**
pt_br: **Opções de Depuração**

source: Debug options are only available in the editor and debug export templates (they require ``debug`` or ``release_debug`` build targets, see :ref:`doc_introduction_to_the_buildsystem_target` for more details).
de: Debug-Optionen sind nur im Editor und in Debug-Exportvorlagen verfügbar (sie erfordern ``debug`` oder ``release_debug`` Build-Ziele, siehe :ref:"doc_introduction_to_the_buildsystem_target" für weitere Details).
ko: 디버그 설정은 에디터와 디버그 내보내기 템플릿에서만 사용할 수 있습니다 (``debug`` 또는 ``release_debug`` 빌드 대상이 필요합니다. 더 자세한 정보는 :ref:`doc_introduction_to_the_buildsystem_target`\ 을 참고하세요).
pt_br: As opções de depuração estão disponíveis apenas no editor e nos modelos de exportação de depuração (eles exigem destinos de compilação ``debug`` ou ``release_debug``, consulte :ref:`doc_introduction_to_the_buildsystem_target` para obter mais detalhes).

source: Debug (local stdout debugger).
de: Debug (localer stdout Debugger).
ko: 디버그 (로컬 표준 출력 디버거).
pt_br: Depurar (Depuração stdout local).

source: Breakpoint list as source::line comma-separated pairs, no spaces (use %%20 instead).
de: Breakpoint Liste als Quelle::Zeile Komma getrennte Paare, ohne Leerzeichen (nutzte stattdessen %%20).
ko: 브레이크포인트 목록. 소스::라인 형태로 쉼표로 구분되며, 공백이 없습니다 (공백 대신 %%20을 사용합니다).
pt_br: Lista de pontos de interrupção com pares de fonte::linha separados por vírgulas, sem espaços (use %%20 no lugar).

source: Enable profiling in the script debugger.
de: Schaltet Profiling in Skript-Debugger ein.
ko: 스크립트 디버거에서 프로파일링을 켭니다.
pt_br: Habilita a criação de perfil no depurador de scripts.

source: ``--remote-debug <address>``
pt_br: ``--remote-debug <endereço>``

source: Remote debug (``<host/IP>:<port>`` address).
de: Remote Debug (``<Host/IP>:<Port>`` Addresse).
ko: 원격 디버그 (``<host/IP>:<port>`` 주소).
pt_br: Depuração Remota (endereço ``<host/IP>:<port>`` ).

source: Show collision shapes when running the scene.
de: Zeigt Kollisionsformen während eine Szene läuft.
ko: 씬을 실행할 때 콜리전 모양을 보여줍니다.
pt_br: Mostrar formas de colisão ao executar a cena.

source: Show navigation polygons when running the scene.
de: Zeigt bei Ausführung der Szene Navigationspolygone an.
ko: 씬을 실행할 때 내비게이션 폴리곤을 보여줍니다.
pt_br: Mostrar polígonos de navegação ao executar a cena.

source: Simulate high CPU load (delay each frame by <ms> milliseconds).
de: Simuliert eine hohe CPU Auslastung (verzögert jedes Bild um <ms> Millisekunden).
ko: 높은 CPU 점유율을 시뮬레이션합니다 (각 프레임을 <ms> 밀리초만큼 지연합니다).
pt_br: Simular alta carga de CPU (atrase cada quadro em <ms> milissegundos).

source: ``--time-scale <scale>``
pt_br: ``--time-scale <escala>``

source: Force time scale (higher values are faster, 1.0 is normal speed).
de: Zeitskala erzwingen (höhere Werte sind schneller, 1,0 ist normale Geschwindigkeit).
ko: 실행 시간 규모를 제한합니다 (1.0이 기본 속도이며, 높은 값일 수록 더 빠릅니다).
pt_br: Forçar escala de tempo (valores mais altos são mais rápidos, 1,0 é velocidade normal).

source: Disable render loop so rendering only occurs when called explicitly from script.
de: Deaktiviert die Renderschleife, damit wird nur noch gerendert, wenn es explizit aus dem Skript aufgerufen wird.
ko: 렌더 루프를 끕니다. 따라서 스크립트에서 명시적으로 호출할 때만 렌더링을 합니다.
pt_br: Desabilitar o loop de renderização de modo que a renderização só ocorra quando for explicitamente chamado pelo script.

source: Disable crash handler when supported by the platform code.
de: Deaktiviert den Crash-Handler, falls vom Plattformcode unterstützt.
ko: 플랫폼 코드가 지원하는 경우 충돌 핸들러를 끕니다.
pt_br: Desabilitar o manipulador de falhas quando suportado pelo código da plataforma.

source: Force a fixed number of frames per second. This setting disables real-time synchronization.
de: Erzwingt eine feste Anzahl von Bildern pro Sekunde. Diese Einstellung deaktiviert die Echtzeitsynchronisation.
ko: FPS(초당 프레임)을 고정된 숫자로 제한합니다. 이 설정은 실시간 동기화를 끕니다.
pt_br: Força um número fixo de quadros por segundo. Essa configuração desativa a sincronização em tempo real.

source: Print the frames per second to the stdout.
de: Gibt die FPS (Bilder pro Sekunde) an stdout.
ko: 표준 출력에 FPS(초당 프레임)를 프린트합니다.
pt_br: Imprime os quadros por segundo para o stdout.

source: **Standalone tools**
de: **Eigenständige Werkzeuge**
ko: **독립형 툴**
pt_br: **Ferramentas independentes**

source: Run a script.
de: Ein Skript ausführen.
ko: 스크립트를 실행합니다.
pt_br: Executar um script.

source: Only parse for errors and quit (use with ``--script``).
de: Nur auf Fehler prüfen und beenden (benutzten mit ``--script``).
ko: 오류만 구문 분석하고 종료합니다 (``--script``\ 와 함께 사용합니다).
pt_br: Apenas analisa erros e sai (use com ``--script``).

source: ``--export <target>``
pt_br: ``--export <destino>``

source: Export the project using the given export target. Export only main pack if path ends with .pck or .zip (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Exportiert das Projekt mit dem angegebenen Exportziel. Exportieren Sie nur das Hauptpaket, wenn der Pfad mit .pck oder .zip endet ( :ref:`tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: 주어진 내보내기 대상을 사용해서 프로젝트를 내보냅니다. 경로가 .pck나 .zip으로 확장자 이름으로 끝나는 경우, 메인 팩만 내보냅니다 (:ref:`tools(툴) <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Exporta o projeto usando o destino de exportação especificado. Exporta apenas o pacote principal se o caminho terminar com .pck ou .zip (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar ativado).

source: ``--export-debug <target>``
pt_br: ``--export-debug <destino>``

source: Like ``--export``, but use debug template (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Wie ``--export``, aber Debug-Vorlage wird verwendet (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: ``--export``\ 와 비슷하지만 디버그 템플릿을 사용합니다 (:ref:`tools(툴) <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Como o ``--export``, mas usa o modelo de depuração (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar habilitado).

source: ``--doctool <path>``
pt_br: ``--doctool <caminho>``

source: Dump the engine API reference to the given <path> in XML format, merging if existing files are found (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Speichert den Engine-API-Verweis auf den angegebenen <Pfad> im XML-Format und führen ihn zusammen, wenn vorhandene Dateien gefunden werden (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: 엔진 API 참조를 주어진 <경로>에 XML 형식으로 덤프합니다. 이미 해당 파일이 있다면 병합합니다. (:ref:`tools(툴) <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Despeje a referência da API da engine para o <caminho> dado em formato XML, fundindo se arquivos existentes forem encontrados (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar habilitado).

source: Disallow dumping the base types (used with ``--doctool``, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Verbiete das Ablegen von Basistypen (verwendet mit ``--doctool``, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: 기본 유형을 덤프하는 것을 허가하지 않습니다 (``--doctool``\ 과 함께 쓰며, :ref:`tools(툴) <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Não permitir o despejamento de tipos base (usado com ``--doctool``, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar habilitado).

source: Build the scripting solutions (e.g. for C# projects, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Erstellt die Skriptlösungen (z.B. für C# -Projekte, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: 스크립팅 솔루션을 빌드합니다 (예: C# 프로젝트 용. :ref:`tools(툴) <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Construa as soluções de script (por exemplo, para projetos em C#, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar ativado).

source: Generate JSON dump of the Godot API for GDNative bindings (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Generiert einen JSON-Speicherauszug der Godot-API für GDNative-Bindungen (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: GDNative 바인딩을 위해 Godot API의 JSON 덤프를 만듭니다 (:ref:`tools(툴) <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Gerar despejo JSON da API do Godot para as ligações do GDNative (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar habilitado).

source: ``--test <test>``
pt_br: ``--test <teste>``

source: Run a unit test. Use ``--help`` first to display the list of tests. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Führt einen Komponententest durch. Verwenden Sie zuerst ``--help``, um die Liste der Tests anzuzeigen. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: 단위 테스트를 실행합니다. 테스트 목록을 표시하려면 ``--help``\ 를 먼저 사용하세요. (:ref:`tools(툴) <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Execute um teste unitário. Utilize ``-help'' primeiro para exibir a lista de testes. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar habilitado).

source: ``--export-pack <preset> <path>``
pt_br: ``--export-pack <preset> <caminho>``

source: Like ``--export``, but only export the game pack for the given preset. The <path> extension determines whether it will be in PCK or ZIP format. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
de: Wie ``--export``, aber Debug-Vorlage wird verwendet (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` muss aktiviert sein).
ko: ``--export``\ 와 비슷하지만 주어진 사전 설정에 대한 게임 팩만 내보냅니다. <path> 확장자는 PCK 형식인지 ZIP 형식인지 여부를 결정합니다. (:ref:`tools(툴) <doc_introduction_to_the_buildsystem_tools>`\ 이 활성화되어 있어야 합니다).
pt_br: Como `` --export``, mas apenas exporta o pacote de jogo para o preset fornecido. A extensão <caminho> determina se será no formato PCK ou ZIP. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deve estar habilitado).

source: Path
de: Pfad
ko: 경로
pt_br: Caminho

source: It is recommended that your Godot binary be in your PATH environment variable, so it can be executed easily from any place by typing ``godot``. You can do so on Linux by placing the Godot binary in ``/usr/local/bin`` and making sure it is called ``godot``.
de: Es wird empfohlen das Godot Programm in die PATH Umgebungsvariable aufzunehmen, so daß es von überall einfach durch Eingabe von ``godot``erreicht werden kann. Hierfür muss bei Linux die Datei in ``/usr/local/bin`` stehen und der Name der Datei sollte ``godot``sein.
ko: Godot 바이너리의 경로를 PATH 환경 변수에 넣어서 ``godot``\ 를 입력하면 어느 곳에서든지 쉽게 실행하는 것을 권장합니다. Linux에서는 Godot 바이너리를 ``/usr/local/bin``\ 에 배치해서 ``godot``\ 를 입력하면 실행되게 할 수 있습니다.
pt_br: É recomendado que o seu binário no Godot esteja na sua variável de ambiente PATH, de modo que possa ser executado facilmente de qualquer lugar digitando ``godot``. Você pode fazer isso no Linux colocando o binário do Godot em ``/usr/local/bin`` e certificando-se de que ele se chama ``godot``.

source: Setting the project path
de: Projektpfad setzen
ko: 프로젝트 경로 설정하기
pt_br: Definindo o caminho do projeto

source: Depending on where your Godot binary is located and what your current working directory is, you may need to set the path to your project for any of the following commands to work correctly.
de: Abhängig davon wo sich das Godot Programm befindet und welches das aktuelle Arbeitsverzeichnis ist, sollte man den Pfad zum Projekt setzen, damit die folgenden Befehle korrekt funktionieren.
ko: Godot 바이너리의 위치와 현재 작업 디렉토리의 위치에 따라, 다음 명령이 올바르게 작동하려면 프로젝트의 경로를 설정해야 합니다.
pt_br: Dependendo de onde seu binário Godot está localizado e qual é seu diretório de trabalho atual, talvez seja necessário definir o caminho para o seu projeto para que qualquer um dos comandos a seguir funcione corretamente.

source: This can be done by giving the path to the ``project.godot`` file of your project as either the first argument, like this:
de: Hierzu kann der Pfad in der ``project.godot`` Datei des Projekts entweder wie folgt als erstes Argument eingetragen werden:
ko: 다음과 같이 프로젝트의 ``project.godot`` 파일 경로를 첫 번째 인수로 주면 됩니다:
pt_br: Isto pode ser feito dando o caminho para o arquivo ``project.godot`` do seu projeto como o primeiro argumento, assim:

source: Or by using the ``--path`` argument:
de: oder durch nutzen des ``--path`` Arguments:
ko: 혹은 ``--path`` 인자를 사용합니다:
pt_br: Ou usando o argumento ``--path``:

source: For example, the full command for exporting your game (as explained below) might look like this:
de: Zum Beispiel, der vollständige Befehl zum exportieren Ihres Spiels (wie unten beschrieben) sieht in etwa so aus:
ko: 예를 들어, (아래에서 설명할) 게임을 내보내는 전체 명령은 다음과 같을 것입니다:
pt_br: Por exemplo, o comando completo para exportar seu jogo (conforme explicado abaixo) pode ser assim:

source: Creating a project
de: Projekt erzeugen
ko: 프로젝트 생성하기
pt_br: Criando um projeto
