Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/editor/managing_editor_features.po
Languages: es, fr, pt_br, uk, zh_cn

source: Managing editor features
es: Administrando las caracteristicas del editor
fr: Gérer les fonctionnalités de l'éditeur
pt_br: Gerenciando recursos do editor
uk: Керування функціями редактора
zh_cn: 管理编辑器功能

source: Introduction
es: Introducción
pt_br: Introdução
uk: Вступ
zh_cn: 前言

source: In certain situations, it may be desirable to limit what features can be used in the Godot editor. For example, a UI designer on a team who doesn't need to see 3D features, or an educator slowly introducing features to students. Godot has a built in system called "feature profiles" to do this.
es: En ciertas situaciones, puede ser deseable limitar las características que se pueden utilizar en el editor de Godot. Por ejemplo, un diseñador de interfaces de usuario en un equipo que no necesita ver las características 3D, o un educador que introduce lentamente características a los estudiantes. Godot tiene un sistema integrado llamado "perfiles de características" para hacer esto.
fr: Dans certains cas, il peut être souhaitable de limiter les fonctionnalités disponibles dans l'éditeur de Godot. Par exemple, un concepteur UI dans une équipe n'utilisant pas les fonctionnalités 3D, ou un enseignant présentant les fonctionnalités à ses élèves. Pour celà, Godot a un système interne de "profils de fonctionnalités".
pt_br: Em certas situações, pode ser desejável limitar quais recursos podem ser usados no editor Godot. Por exemplo, um designer de interface do usuário em uma equipe que não precisa ver recursos 3D ou um educador apresentando recursos aos alunos aos poucos. Godot tem um sistema integrado chamado "perfis de funcionalidades" para fazer isso.
uk: У певних ситуаціях може бути бажано обмежити функції, які можна використовувати в редакторі Godot. Наприклад, дизайнер інтерфейсу користувача для команди, якій не потрібно бачити 3D-функції. Godot має вбудовану систему під назвою "профілі функцій", щоб зробити це.
zh_cn: 某些情况下，我们可能会想要限制 Godot 编辑器所能使用的功能。例如，团队中的 UI 设计师无需见到 3D 功能，而老师会想要逐步向学生介绍功能。Godot 内置的“功能配置”系统可以实现这样的需求。

source: With feature profiles, major features and nodes can be hidden from the editor. This only hides parts of the interface and does not actually remove support for these features, so scenes and scripts relying on those features will still work fine. This also means feature profiles are not an optimization technique. For information on how to optimize Godot see :ref:`doc_optimization`.
es: Con los perfiles de características, es posible ocultar características y nodos principales del editor. Esto solo oculta partes de la interfaz y no elimina realmente el soporte para estas características, por lo que las escenas y scripts que dependen de esas características seguirán funcionando correctamente. Esto también significa que los perfiles de características no son una técnica de optimización. Para obtener información sobre cómo optimizar Godot, consulta :ref:`doc_optimization`.
fr: Avec les profils de fonctionnalités, des fonctionnalités et noeuds majeurs peuvent être cachés dans l'éditeur. Celà ne cache que la partie interface et ne retire pas le support de ces fonctionnalités. Les scènes et scripts basés sur ces fonctionnalités fonctionnerons comme avant. Celà veut aussi dire que les profils de fonctionnalités ne sont pas une technique d'optimisation. Pour en savoir plus sur l'optimisation dans Godot, voir :ref:`doc_optimization`.
pt_br: Com perfis de recursos, os principais recursos e nós podem ser ocultados do editor. Isso apenas oculta partes da interface e não remove o suporte para esses recursos, portanto, cenas e scripts que dependem desses recursos ainda funcionarão bem. Isso também significa que os perfis de recursos não são uma técnica de otimização. Para informações sobre como otimizar o Godot veja :ref:`doc_optimization`.
uk: За допомогою профілів функцій основні функції та вузли можуть бути приховані в редакторі. Це лише приховує частини інтерфейсу і фактично не видаляє підтримку цих функцій, тому сцени та скрипти, які покладаються на ці функції, все одно будуть працювати нормально. Це також означає, що профілі функцій не є технікою оптимізації. Для отримання відомостей про те, як оптимізувати Godot дивіться :ref:`doc_optimization`.
zh_cn: 使用功能配置，主要的功能和节点都可以在编辑器中隐藏。只会隐藏部分界面，不会真正移除对这些功能的支持，所以依赖于那些特性的场景和脚本仍然可以正常工作。这同时也意味着，功能配置并不是一种优化技巧。要了解如何对 Godot 进行优化，请参阅 :ref:`doc_optimization`\ 。

source: Creating a profile
es: Creando un perfil
fr: Créer un profil
pt_br: Criando um perfil
uk: Створення профілю
zh_cn: 创建配置

source: To manage editor features go to **Editor > Manage Editor Features**. This will open the **Manage Editor Feature Profiles** window. By default there will be no profile. Click on **Create Profile** and give it a name. You will then see a list of all the features in the Godot editor.
es: Para gestionar las características del editor, ve a **Editor > Manage Editor Features**. Esto abrirá la ventana **Manage Editor Feature Profiles**. Por defecto, no habrá ningún perfil. Haz clic en **Create Profile** y ponle un nombre. Luego verás una lista de todas las características del editor de Godot.
fr: Pour gérer les fonctionnalités de l'éditeur allez dans **Éditeur > Gérer les fonctionnalités de l'éditeur**. Ce qui ouvrira la fenêtre **Gestion des profils de fonctionnalités de l'éditeur**. Par défaut elle ne contiendra aucun profil. Cliquez sur **Créer un profil** et donnez lui un nom. Vous verrez ensuite une liste de toutes les fonctionnalités de l'éditeur Godot.
pt_br: Para gerenciar os recursos do editor, vá para **Editor > Gerenciar funcionalidades do editor**. Isso abrirá a janela **Gerenciar perfis de funcionalidades do editor**. Por padrão, não haverá perfil. Clique em **Criar perfil** e dê um nome a ele. Você verá uma lista de todos os recursos no editor Godot.
uk: Щоб керувати функціями редактора, перейдіть до **Редактор > Керування можливостями редактора**. Відкриється вікно **Керування профілями можливостей редактора**. Клацніть на **створити профіль** і дайте йому ім'я. Потім ви побачите список усіх функцій редактора Godot.
zh_cn: 要管理编辑器功能，请前往\ **编辑器 > 管理编辑器功能**\ 。这样就打开了\ **管理编辑器功能配置**\ 窗口。默认是没有配置的。请点击\ **创建配置文档**\ 并为其命名。然后你就会看到 Godot 编辑器中所有功能的列表了。

source: The first section allows major editor features to be removed, such as the 3D editor or scripting editor. Below the main features is every class and node in Godot, which can be disabled as well. Click on a node and all of its properties and options will be listed in the **Extra Items** box, these can all be individually disabled.
es: La primera sección permite eliminar características principales del editor, como el editor 3D o el editor de scripts. Debajo de las características principales se encuentran todas las clases y nodos de Godot, que también se pueden desactivar. Haz clic en un nodo y todas sus propiedades y opciones se listarán en el cuadro **Extra Items**, donde cada una de ellas se puede desactivar individualmente.
fr: La première section permet de retirer les fonctionnalités principales telles que l'éditeur 3D ou l'éditeur de script. En dessous des fonctionnalités principales se trouvent toutes les classes et noeuds dans Godot qui peuvent également être désactivés. Cliquez sur un noeud pour voir une liste de toutes ses propriétés et options sous **Extras**, chacune peut être désactivée individuellement.
pt_br: A primeira seção permite que as principais funcionalidades do editor sejam removidas, como o editor 3D ou o editor de scripts. Abaixo das funcionalidades principais estão todas as classes e nós do Godot, que também podem ser desabilitados. Clique em um nó e todas as suas propriedades e opções serão listadas na caixa **Extra Items**, podendo ser desabilitadas individualmente.
uk: Перший розділ дозволяє видалити основні функції редактора, такі як редактор 3D, або редактор скриптів. Нижче основних функцій знаходиться кожен клас і вузол Godot, які також можуть бути відключені. Натисніть на вузол, і всі його властивості та параметри будуть перераховані в полі **Додаткові параметри** всі вони можуть бути індивідуально відключені.
zh_cn: 第一个部分可以移除主要的编辑器功能，比如 3D 编辑器或脚本编辑器。主要功能的下方是 Godot 中的所有类，也可以禁用。点击节点后，会在\ **额外项目**\ 中列出其属性和选项，可以单独禁用。

source: Sharing a profile
es: Compartiendo un perfil
fr: Partager un profil
pt_br: Compartilhando um perfil
uk: Спільний доступ до профілю
zh_cn: 分享配置

source: To share profiles between editors click on the **Export** button. Save the custom profile somewhere as a ``.profile`` file. To use this in another editor open that editor's **Manage Editor Feature Profiles** window and click import, then select the ``.profile`` file.
es: Para compartir perfiles entre editores, haz clic en el botón **Exportar**. Guarda el perfil personalizado en algún lugar como un archivo ``.profile``. Para utilizarlo en otro editor, abre la ventana **Manage Editor Feature Profiles** de ese editor y haz clic en importar, luego selecciona el archivo ``.profile``.
fr: Pour partager les profils entre éditeurs, cliquez sur le bouton **Exporter**. Enregistrez le profil personnalisé quelque part en tant que fichier ``.profile``. Pour l'utiliser dans un autre éditeur, ouvrez la fenêtre **Gestion des profils de fonctionnalités de l'éditeur** de cet éditeur et cliquez sur importer, puis sélectionnez le fichier ``.profile``.
pt_br: Para compartilhar perfis entre editores, clique no botão **Exportar**. Salve o perfil personalizado em algum lugar como um arquivo ``.profile``. Para usar isso em outro editor, abra a janela **Gerenciar perfis de funcionalidade do editor** desse editor e clique em importar, então selecione o arquivo ``.profile``.
uk: Щоб поділитися профілями між редакторами, натисніть кнопку **Експортування**. Збережіть власний профіль десь як файл ``.profile``. Щоб скористатися ним у іншому редакторі, відкрийте вікно **Керування профілями можливостей редактора** та натисніть кнопку **Імпорт**, а потім виберіть файл ``.profile``.
zh_cn: 要在编辑器之间分享配置，请点击\ **导出**\ 按钮。请将自定义配置保存为 ``.profile`` 文件。要在其他编辑器中使用，请打开其\ **管理编辑器配置**\ 窗口并点击导入，然后选择该 ``.profile`` 文件。

source: This process is potentially cumbersome however if a large amount of computers need custom profiles. As an alternative, you can enable self-contained mode for Godot, which allows putting all editor configuration in the same folder as the editor binary. See :ref:`doc_data_paths_self_contained_mode` for details.
es: Este proceso puede resultar tedioso si se requieren perfiles personalizados en una gran cantidad de computadoras. Como alternativa, puedes habilitar el modo autosuficiente (self-contained mode) para Godot, lo que permite colocar toda la configuración del editor en la misma carpeta que el archivo binario del editor. Consulta :ref:`doc_data_paths_self_contained_mode` para obtener más detalles al respecto.
fr: Ce processus peut s'avérer peu pratique si un nombre élevé de machines ont besoin de profils personnalisés. Alternativement, vous pouvez activer le mode compact pour Godot, qui permet de mettre toutes les configurations dans le même dossier que le binaire de l'éditeur. Pour plus de détails, voir :ref:`doc_data_paths_self_contained_mode`.
pt_br: Este processo é potencialmente complicado, se uma grande quantidade de computadores precisar de perfis personalizados. Como alternativa, você pode habilitar o modo independente para Godot, que permite colocar toda a configuração do editor na mesma pasta que o binário do editor. Veja :ref:`doc_data_paths_self_contained_mode` para detalhes.
uk: Цей процес є досить громіздким, однак, якщо велика кількість комп'ютерів потребують користувацьких профілів. В якості альтернативи ви можете включити автономний режим для Godot, що дозволяє помістити всю конфігурацію редактора в ту ж папку, що і бінарний файл редактора. Щоб дізнатися більше дивіться :ref:`doc_data_paths_self_contained_mode`.
zh_cn: 如果大量电脑都需要自定义配置，这个过程可能会比较繁琐。另一种办法是启用 Godot 的自包含模式，可以将所有编辑器配置放在与编辑器二进制文件同一文件夹中。详情请参阅 :ref:`doc_data_paths_self_contained_mode`\ 。

source: Translation status
es: Estado de traducción
fr: État de la traduction
pt_br: Progresso da Tradução
uk: Стан перекладу
zh_cn: 翻译状态
