Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/web/customizing_html5_shell.po
Languages: es, fr, zh_cn

source: Custom HTML page for Web export
es: Página HTML personalizada para la exportación web
fr: Page HTML custom pour un export Web
zh_cn: 导出自定义 HTML 页面

source: While Web export templates provide a default HTML page fully capable of launching the project without any further customization, it may be beneficial to create a custom HTML page. While the game itself cannot easily be directly controlled from the outside yet, such page allows to customize the initialization process for the engine.
es: Si bien las plantillas de exportación web proporcionan una página HTML predeterminada totalmente capaz de lanzar el proyecto sin ninguna personalización adicional, puede ser beneficioso crear una página HTML personalizada. Aunque el propio juego no puede ser controlado fácilmente desde el exterior, esta página permite personalizar el proceso de inicialización del motor.
fr: Bien que les modèles d'exportation Web fournissent une page HTML par défaut entièrement capable de lancer le projet sans autre personnalisation, il peut être utile de créer une page HTML personnalisée. Bien que le jeu lui-même ne puisse pas encore être contrôlé directement de l'extérieur, une telle page permet de personnaliser le processus d'initialisation du moteur.
zh_cn: 虽然 Web 导出模板提供了一个默认的 HTML 页面，完全能够在没有任何进一步定制的情况下启动项目，但创建自定义 HTML 页面可能是有益的。虽然游戏本身还不能轻易地从外部直接控制，但这样的页面允许自定义引擎的初始化过程。

source: Some use-cases where customizing the default page is useful include:
es: Algunos casos de uso donde personalizar la página predeterminada es útil incluyen:
fr: Quelques cas pratique où une telle page puisse être utile :
zh_cn: 自定义默认页面在某些情况下非常有用，包括：

source: Loading files from a different directory than the page;
es: Cargar archivos de diferentes directorios;
fr: Chargement de fichiers à partir d'un répertoire différent de la page ;
zh_cn: 读取与该页面不同目录下的文件；

source: Loading a ``.zip`` file instead of a ``.pck`` file as the main pack;
es: Cargar archivos ``.zip`` en lugar de ``.pck`` como paquete principal;
fr: Chargement d'un fichier ``.zip`` au lieu d'un fichier ``.pck`` comme paquet principal ;
zh_cn: 加载 ``.zip`` 文件而不是 ``.pck`` 文件作为主资源包；

source: Loading the engine from a different directory than the main pack file;
es: Cargar archivos del motor desde un directorio distinto al paquete de datos principal;
fr: Chargement du moteur à partir d'un répertoire différent de celui du fichier du pack principal ;
zh_cn: 从主资源包文件以外的目录中加载引擎文件；

source: Adding a click-to-play button so that games can be started in the fullscreen mode;
es: Agregar un botón de "clic para jugar" para que los juegos puedan iniciarse en modo pantalla completa;
fr: Ajout d'un bouton click-to-play pour que les jeux puissent être lancés en mode plein écran ;
zh_cn: 添加“点击开始”按钮，使游戏可以在全屏模式下启动；

source: Loading some extra files before the engine starts, making them available in the project file system as soon as possible;
es: Cargar archivos extra antes de que arranque el motor, así estarán disponibles en el sistema de archivos luego;
fr: Chargement de quelques fichiers supplémentaires avant le démarrage du moteur, en les rendant disponibles dans le système de fichiers du projet dès que possible ;
zh_cn: 在引擎启动之前加载一些额外的文件，以便稍后在文件系统中可用；

source: Passing custom command line arguments, e.g. ``-s`` to start a ``MainLoop`` script.
es: Pasar argumentos personalizados por la línea de comandos, por ejemplo, ``-s`` para iniciar un script ``MainLoop``.
fr: Passer des arguments de ligne de commande personnalisés, par exemple ``-s`` pour démarrer un script ``MainLoop``.
zh_cn: 传递自定义 "命令行" 参数, 例如 ``-s`` 启动 ``MainLoop`` 脚本.

source: The default HTML page is available in the Godot Engine repository at `/misc/dist/html/full-size.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/full-size.html>`__ but the following template can be used as a much simpler example:
es: La página HTML por defecto está disponible en el repositorio de Godot Engine en `/misc/dist/html/full-size.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/full-size.html>`__ pero la siguiente plantilla puede ser usada como un ejemplo mucho mas sencillo:
fr: La page HTML par défaut est disponible dans le dépôt du moteur Godot à `/misc/dist/html/full-size.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/full-size.html>`__ mais le modèle suivant peut être utilisé comme un exemple beaucoup plus simple :
zh_cn: 默认的HTML页面可在Godot引擎仓库 `/misc/dist/html/full-size.html <https://github.com/godotengine/godot/blob/master/misc/dist/html/full-size.html>`__ 中找到, 但以下模板可作为一个更简单的例子:

source: Setup
es: Organización
fr: Configuration
zh_cn: 场景布置

source: As shown by the example above, it is mostly a regular HTML document, with few placeholders which needs to be replaced during export, an html ``<canvas>`` element, and some simple JavaScript code that calls the :js:class:`Engine` class.
es: Como se muestra en el ejemplo anterior, en su mayoría es un documento HTML regular, con algunos marcadores de posición que deben reemplazarse durante la exportación, un elemento HTML ``<canvas>``, y un código JavaScript simple que llama a la clase :js:class:`Engine`.
fr: Comme le montre l'exemple ci-dessus, il s'agit principalement d'un document HTML ordinaire, avec quelques espaces réservés qui doivent être remplacés lors de l'exportation, un élément html ``<canvas>``, et du code JavaScript simple qui appelle la classe :js:class:`Engine`.
zh_cn: 如上面的例子所示，它主要是一个普通的HTML文档，有几个占位符需要在导出时替换，一个html ``<canvas>`` 元素，和一些简单的JavaScript代码，调用 :js:class:`Engine` 类。

source: The only required placeholders are:
es: Los únicos marcadores de posición necesarios son:
fr: Les seuls caractères de remplacement requis sont :
zh_cn: 唯一需要的占位符是:

source: ``$GODOT_URL``: The name of the main JavaScript file, which provides the :js:class:`Engine` class required to start the engine and that must be included in the HTML as a ``<script>``. The name is generated from the *Export Path* during the export process.
es: ``$GODOT_URL``: El nombre del archivo principal de JavaScript, que proporciona la clase :js:class:`Engine` necesaria para iniciar el motor y que debe incluirse en el HTML como un elemento ``<script>``. El nombre se genera a partir de la *Ruta de exportación* durante el proceso de exportación.
fr: ``$GODOT_URL`` : Le nom du fichier JavaScript principal, qui fournit la classe :js:class:`Engine` nécessaire au démarrage du moteur et qui doit être inclus dans le HTML sous la forme d'un ``<script>``. Le nom est généré à partir de l'*Export Path* pendant le processus d'exportation.
zh_cn: ``$GODOT_URL`` : 主JavaScript文件的名称，它提供了启动引擎所需的 :js:class:`Engine` 类，必须作为 ``<script>`` 包含在HTML中。这个名字是在导出过程中从*导出路径Export Path* 生成的。

source: ``$GODOT_CONFIG``: A JavaScript object, containing the export options and can be later overridden. See :js:attr:`EngineConfig` for the full list of overrides.
es: ``$GODOT_CONFIG``: Un objeto JavaScript que contiene las opciones de exportación y que puede ser anulado más adelante. Consulta :js:attr:`EngineConfig` para ver la lista completa de anulaciones.
fr: ``$GODOT_CONFIG`` : Un objet JavaScript, contenant les options d'exportation et pouvant être surchargé par la suite. Voir :js:attr:`EngineConfig` pour la liste complète des surcharges.
zh_cn: ``$GODOT_CONFIG`` : 一个JavaScript对象，包含导出选项，以后可以被重写。参见 :js:attr:`EngineConfig` 获取完整的重写列表。

source: The following optional placeholders will enable some extra features in your custom HTML template.
es: Los siguientes marcadores de posición opcionales permitirán habilitar algunas características adicionales en tu plantilla HTML personalizada.
zh_cn: 以下可选的占位符将在你的自定义 HTML 模板中实现一些额外的功能。

source: ``$GODOT_PROJECT_NAME``: The project name as defined in the Project Settings. It is a good idea to use it as a ``<title>`` in your template.
es: ``$GODOT_PROJECT_NAME``: El nombre del proyecto tal como se define en la Configuración del proyecto. Es una buena idea utilizarlo como título (``<title>``) en tu plantilla.
fr: ``$GODOT_PROJECT_NAME`` : Le nom du projet tel que défini dans les paramètres du projet. C'est une bonne idée de l'utiliser comme ``<title>`` dans votre modèle.
zh_cn: ``$GODOT_PROJECT_NAME``: 在项目设置中定义的项目名称。在你的模板中使用它作为 ``<title>`` 是一个好主意。

source: ``$GODOT_HEAD_INCLUDE``: A custom string to include in the HTML document just before the end of the ``<head>`` tag. It is customized in the export options under the *Html / Head Include* section. While you fully control the HTML page you create, this variable can be useful for configuring parts of the HTML ``head`` element from the Godot Editor, e.g. for different Web export presets.
es: ``$GODOT_HEAD_INCLUDE``: Una cadena personalizada para incluir en el documento HTML justo antes del final de la etiqueta ``<head>``. Se personaliza en las opciones de exportación en la sección *Html / Head Include*. Aunque tienes control total sobre la página HTML que creas, esta variable puede ser útil para configurar partes del elemento ``head`` del HTML desde el Editor de Godot, por ejemplo, para diferentes presets de exportación web.
fr: ``$GODOT_HEAD_INCLUDE`` : Une chaîne de charactère customisée à inclure dans le document HTML, juste avant la fin du tag ``<head>``. Elle est spécifié dans les options d'export dans la section *Html / Head Include* . Même si vous avez le contrôle total de la page HTML que vous créez, cette variable peut être utile pour configurer une partie des éléments tagué ``head`` depuis l'éditeur Godot. Par exemple, pour différents préreglages d'export Web.
zh_cn: ``$GODOT_HEAD_INCLUDE``. 在HTML文件中, 在 ``<head>`` 标签结尾前包含的一个自定义字符串. 它是在*Html / Head Include*部分的导出选项中自定义的. 虽然你可以完全控制你所创建的HTML页面, 但这个变量对于从Godot Editor中配置HTML``head`` 元素的部分内容很有用, 例如, 对于不同的Web导出预设.

source: When the custom page is ready, it can be selected in the export options under the *Html / Custom Html Shell* section.
es: Cuando la página personalizada esté lista, puedes seleccionarla en las opciones de exportación en la sección *Html / Custom Html Shell* (HTML personalizado).
fr: Quand la page custom est prête, elle peut être sélectionné dans les options d'exports dans la section *Html / Custom Html Shell*.
zh_cn: 当自定义页面准备好后, 可以在 *Html / Custom Html Shell* 部分的导出选项中选择.

source: Starting the project
es: Iniciando el proyecto
fr: Démarrage du projet
zh_cn: 启动项目

source: See the :ref:`HTML5 shell class reference <doc_html5_shell_classref>`, for the full list of methods and options available.
es: Consulta la :ref:`referencia de la clase HTML5 shell <doc_html5_shell_classref>` para ver la lista completa de métodos y opciones disponibles.
fr: Voir la :ref:`référence de la classe shell HTML5 <doc_html5_shell_classref>`, pour la liste complète des méthodes et options disponibles.
zh_cn: 参见 :ref:`HTML5 shell 类参考 <doc_html5_shell_classref>`\ ，以获得可用方法和选项的完整列表。

source: First, the engine must be loaded, then it needs to be initialized, and after this the project can finally be started. You can perform every of these steps manually and with great control. However, in the simplest case all you need to do is to create an instance of the :js:class:`Engine` class with the exported configuration, and then call the :js:meth:`engine.startGame <Engine.prototype.startGame>` method optionally overriding any :js:attr:`EngineConfig` parameters.
es: Primero, el motor debe ser cargado, luego necesita ser inicializado, y después de eso, finalmente se puede iniciar el proyecto. Puedes realizar cada uno de estos pasos manualmente y con un gran control. Sin embargo, en el caso más simple, todo lo que necesitas hacer es crear una instancia de la clase :js:class:`Engine` con la configuración exportada, y luego llamar al método :js:meth:`engine.startGame <Engine.prototype.startGame>` anulando opcionalmente cualquier parámetro de :js:attr:`EngineConfig`.
fr: Tout d'abord, le moteur doit être chargé, puis il doit être initialisé, et après cela, le projet peut enfin être lancé. Vous pouvez effectuer chacune de ces étapes manuellement et avec un grand contrôle. Cependant, dans le cas le plus simple, il suffit de créer une instance de la classe :js:class:`Engine` avec la configuration exportée, puis d'appeler la méthode :js:meth:`engine.startGame <Engine.prototype.startGame>` en surchargeant éventuellement les paramètres :js:attr:`EngineConfig`.
zh_cn: 首先，引擎必须被加载，然后需要被初始化，在这之后，项目最终可以被启动。你可以手动执行这些步骤中的每一步，而且控制得很好。然而，在最简单的情况下，你需要做的是用导出的配置创建一个 :js:class:`Engine` 类的实例，然后调用 :js:meth:`engine.startGame <Engine.prototype.startGame>` 方法，可选择重写任何 :js:attr:`EngineConfig` 参数。

source: In case your project needs to have special control over the start arguments and dependency files, the :js:meth:`engine.start <Engine.prototype.start>` method can be used instead. Note, that this method do not automatically preload the ``pck`` file, so you will probably want to manually preload it (and any other extra file) via the :js:meth:`engine.preloadFile <Engine.prototype.preloadFile>` method.
es: En caso de que tu proyecto necesite tener un control especial sobre los argumentos de inicio y los archivos de dependencia, puedes utilizar el método :js:meth:`engine.start <Engine.prototype.start>`. Ten en cuenta que este método no carga automáticamente el archivo ``pck``, por lo que probablemente querrás cargarlo manualmente (y cualquier otro archivo adicional) a través del método :js:meth:`engine.preloadFile <Engine.prototype.preloadFile>`.
fr: Si votre projet doit avoir un contrôle particulier sur les arguments de démarrage et les fichiers de dépendances, la méthode :js:meth:`engine.start <Engine.prototype.start>` peut être utilisée à la place. Notez que cette méthode ne précharge pas automatiquement le fichier ``pck``, vous voudrez donc probablement le précharger manuellement (et tout autre fichier supplémentaire) via la méthode :js:meth:`engine.preloadFile <Engine.prototype.preloadFile>`.
zh_cn: 如果你的项目需要对启动参数和依赖文件进行特别控制，可以使用 :js:meth:`engine.start <Engine.prototype.start>` 方法来代替。注意，这个方法不会自动预加载 ``pck`` 文件，所以你可能要通过 :js:meth:`engine.preloadFile <Engine.prototype.preloadFile>` 方法手动预加载它和任何其他额外的文件。

source: Optionally, you can also manually :js:meth:`engine.init <Engine.prototype.init>` to perform specific actions after the module initialization, but before the engine starts.
es: Opcionalmente, también puedes utilizar :js:meth:`engine.init <Engine.prototype.init>` para realizar acciones específicas después de la inicialización del módulo, pero antes de que el motor se inicie.
fr: En option, vous pouvez également utiliser manuellement :js:meth:`engine.init <Engine.prototype.init>` pour effectuer des actions spécifiques après l'initialisation du module, mais avant le démarrage du moteur.
zh_cn: 另外，你也可以手动 :js:meth:`engine.init <Engine.prototype.init>` 在模块初始化之后，但在引擎启动之前，执行特定的动作。

source: This process is a bit more complex, but gives you full control over the engine startup process.
es: Este proceso es un poco más complejo, pero te brinda un control completo sobre el proceso de inicio del motor.
fr: Ce processus est un peu plus complexe, mais vous permet de contrôler totalement le processus de démarrage du moteur.
zh_cn: 这个过程有点复杂，但可以让你完全控制引擎的启动过程。

source: To load the engine manually the :js:meth:`Engine.load` static method must be called. As this method is static, multiple engine instances can be spawned if the share the same ``wasm``.
es: Para cargar el motor manualmente, debes llamar al método estático :js:meth:`Engine.load`. Como este método es estático, puedes crear múltiples instancias del motor si comparten el mismo archivo ``wasm``.
fr: Pour charger le moteur manuellement, la méthode statique :js:meth:`Engine.load` doit être appelée. Comme cette méthode est statique, plusieurs instances de moteur peuvent être créées si elles partagent le même ``wasm``.
zh_cn: 要手动加载引擎，必须调用 :js:meth:`Engine.load` 静态方法。由于这个方法是静态的，如果多个引擎实例共享相同的 ``wasm`` ，就可以产生多个引擎实例。

source: Multiple instances cannot be spawned by default, as the engine is immediately unloaded after it is initialized. To prevent this from happening see the :js:attr:`unloadAfterInit` override option. It is still possible to unload the engine manually afterwards by calling the :js:meth:`Engine.unload` static method. Unloading the engine frees browser memory by unloading files that are no longer needed once the instance is initialized.
es: Por defecto, no se pueden crear múltiples instancias, ya que el motor se descarga inmediatamente después de inicializarse. Para evitar que esto ocurra, consulta la opción de anulación :js:attr:`unloadAfterInit`. Aún es posible descargar manualmente el motor posteriormente llamando al método estático :js:meth:`Engine.unload`. La descarga del motor libera la memoria del navegador al descargar los archivos que ya no son necesarios una vez que se ha inicializado la instancia.
fr: Des instances multiples ne peuvent pas être créées par défaut, car le moteur est immédiatement déchargé après son initialisation. Pour empêcher cela, utilisez l'option :js:attr:`unloadAfterInit`. Il est toujours possible de décharger le moteur manuellement en appelant la méthode statique :js:meth:`Engine.unload`. Le déchargement du moteur libère la mémoire du navigateur en déchargeant les fichiers qui ne sont plus nécessaires une fois l'instance initialisée.
zh_cn: 默认情况下不能生成多个实例，因为引擎被初始化后会立即卸载。为了防止这种情况发生，请看 :js:attr:`unloadAfterInit` 覆盖选项。之后仍然可以通过调用 :js:meth:`Engine.unload` 静态方法来手动卸载引擎。卸载引擎可以通过卸载实例初始化后不再需要的文件来释放浏览器内存。

source: Customizing the behavior
es: Personalizando el comportamiento
fr: Personnaliser le comportement
zh_cn: 自定义行为

source: In the Web environment several methods can be used to guarantee that the game will work as intended.
es: En el entorno web, se pueden utilizar varios métodos para garantizar que el juego funcione según lo previsto.
fr: Dans l'environnement web, plusieurs méthodes peuvent être utilisés pour garantir que le jeu fonctionne comme prévu.
zh_cn: 在 Web 环境下，可以使用几种方法来保证游戏能够按照预期的方式运行。

source: If you target a specific version of WebGL, or just want to check if WebGL is available at all, you can call the :js:meth:`Engine.isWebGLAvailable` method. It optionally takes an argument that allows to test for a specific major version of WebGL.
es: Si deseas orientar una versión específica de WebGL o simplemente quieres comprobar si WebGL está disponible en general, puedes llamar al método :js:meth:`Engine.isWebGLAvailable`. Opcionalmente, puedes pasar un argumento que permite probar una versión mayor específica de WebGL.
fr: Si vous ciblez une version spécifique de WebGL ou que voulez juste vérifier que WebGL est disponible tout court, vous pouvez appeler la méthode :js:meth:`Engine.isWebGLAvailable`. Elle prends optionnellement un argument qui permet de faire un test pour une version majeur spécifique de WebGL.
zh_cn: 如果你的目标是 WebGL 的特定版本，或者只是想检查 WebGL 是否可用，你可以调用 :js:meth:`Engine.isWebGLAvailable` 方法。它可以选择接受一个参数，允许测试 WebGL 的特定主要版本。

source: As the real executable file does not exist in the Web environment, the engine only stores a virtual filename formed from the base name of loaded engine files. This value affects the output of the :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>` method and defines the name of the automatically started main pack. The :js:attr:`executable` override option can be used to override this value.
es: En el entorno web, como el archivo ejecutable real no existe, el motor solo almacena un nombre de archivo virtual formado a partir del nombre base de los archivos del motor cargados. Este valor afecta la salida del método :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>` y define el nombre del paquete principal que se inicia automáticamente. La opción de anulación :js:attr:`executable` se puede utilizar para cambiar este valor y proporcionar un nombre personalizado para el archivo ejecutable en el entorno web.
fr: Alors que le véritable fichier exécutable n'existe pas dans l'environnement Web, le moteur de jeu stocke seulement un nom de fichier virtuel, formé du nom de base des fichiers chargé du moteur. Cette valeur affecte les données de sorties de la méthode :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>` et défini le nom du paquet principal automatiquement démarré. L'option de substitution :js:attr:`executable` peut être utilisée pour remplacer cette valeur.
zh_cn: 由于真正的可执行文件不存在于 Web 环境中，引擎只存储一个由加载的引擎文件的基本名称形成的虚拟文件名。这个值会影响 :ref:`OS.get_executable_path() <class_OS_method_get_executable_path>` 方法的输出，并定义自动启动的主包的名称。\ :js:attr:`executable` 选项可以用来重写这个值。

source: Customizing the presentation
es: Personalizando la presentación
fr: Personnalisation de la présentation
zh_cn: 自定义展现形式

source: Several configuration options can be used to further customize the look and behavior of the game on your page.
es: Se pueden utilizar varias opciones de configuración para personalizar aún más el aspecto y el comportamiento del juego en tu página.
fr: Plusieurs options de configuration peuvent être utilisées pour personnaliser davantage l'aspect et le comportement du jeu sur votre page.
zh_cn: 有几个配置选项可以用来进一步定制你页面上游戏的外观和行为。

source: By default, the first canvas element on the page is used for rendering. To use a different canvas element the :js:attr:`canvas` override option can be used. It requires a reference to the DOM element itself.
es: Por defecto, se utiliza el primer elemento canvas en la página para el renderizado. Para utilizar un elemento canvas diferente, puedes usar la opción de anulación :js:attr:`canvas`. Esta opción requiere una referencia al propio elemento DOM del canvas que deseas utilizar.
fr: Par défaut, le premier élément du canvas sur la page est utilisé pour le rendu graphique. Pour utiliser un élément canvas différent, la méthode :js:attr:`canvas` peut être utilisée. Elle nécessite une référence à l'élément DOM lui-même.
zh_cn: 默认情况下会使用页面上的第一个 canvas 元素来渲染。要使用其他 canvas 元素，可以使用 :js:attr:`canvas` 选项重写。它需要一个对 DOM 元素本身的引用。

source: The way the engine resize the canvas can be configured via the :js:attr:`canvasResizePolicy` override option.
es: La forma en que el motor redimensiona el canvas se puede configurar a través de la opción de anulación :js:attr:`canvasResizePolicy`.
fr: La façon dont le moteur redimensionne le canevas peut être configurée via l’option de remplacement :js:attr:'canvasResizePolicy'.
zh_cn: 引擎调整画布大小的方式可以通过 :js:attr:`canvasResizePolicy` 覆盖选项进行配置。

source: If your game takes some time to load, it may be useful to display a custom loading UI which tracks the progress. This can be achieved with the :js:attr:`onProgress` callback option, which allows to set up a callback function that will be called regularly as the engine loads new bytes.
es: Si tu juego tarda un tiempo en cargarse, puede ser útil mostrar una interfaz de usuario de carga personalizada que rastree el progreso. Esto se puede lograr con la opción de devolución de llamada :js:attr:`onProgress`, que te permite configurar una función de devolución de llamada que se llamará regularmente a medida que el motor carga nuevos bytes.
fr: Si le chargement de votre jeu prend un certain temps, il peut être utile d'afficher une interface de chargement personnalisée qui suit la progression. Cela peut être réalisé avec la méthode :js:attr:`onProgress` qui permet de mettre en place une fonction de rappel qui sera appelée régulièrement au fur et à mesure que le moteur charge de nouveaux octets.
zh_cn: 如果你的游戏需要一些时间来加载，显示一个跟踪进度的自定义加载UI可能是有用的。这可以通过 :js:attr:`onProgress` 回调选项来实现，它允许设置一个回调函数，当引擎加载新字节时，该函数将被定期调用。

source: Be aware that in some cases ``total`` can be ``0``. This means that it cannot be calculated.
es: Ten en cuenta que, en algunos casos, ``total`` puede ser ``0``. Esto significa que no se puede calcular.
fr: Sachez que dans certains cas, ``total`` peut être ``0``. Cela signifie qu'il ne peut pas être calculé.
zh_cn: 请注意，在某些情况下 ``total`` 可能是 ``0``\ 。这意味着无法计算。
