Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/platform/web/customizing_html5_shell.po
Languages: es, fr, zh_cn

source: If your game supports multiple languages, the :js:attr:`locale` override option can be used to force a specific locale, provided you have a valid language code string. It may be good to use server-side logic to determine which languages a user may prefer. This way the language code can be taken from the ``Accept-Language`` HTTP header, or determined by a GeoIP service.
es: Ten en cuenta que en algunos casos, ``total`` puede ser ``0``. Esto significa que no se puede calcular.
fr: Si votre jeu prend en charge plusieurs langues, l'option de substitution :js:attr:`locale` peut être utilisée pour forcer un paramètre régional spécifique, à condition que vous disposiez d'un string de code de langue valide. Il peut être intéressant d'utiliser une logique côté serveur pour déterminer les langues préférées d'un utilisateur. Ainsi, le code de langue peut être extrait de l'en-tête HTTP ``Accept-Language``, ou déterminé par un service GeoIP.
zh_cn: 如果你的游戏支持多种语言， :js:attr:`locale` 覆盖选项可以用来强制使用一个特定的语言，只要你有一个有效的语言代码字符串。使用服务器端的逻辑来确定用户可能喜欢哪种语言可能较好。这样，语言代码可以从 ``Accept-Language`` HTTP头中获取，或者由GeoIP服务决定。

source: Debugging
es: Depuración
fr: Débogage
zh_cn: 调试

source: To debug exported projects, it may be useful to read the standard output and error streams generated by the engine. This is similar to the output shown in the editor console window. By default, standard ``console.log`` and ``console.warn`` are used for the output and error streams respectively. This behavior can be customized by setting your own functions to handle messages.
es: Para depurar proyectos exportados, puede ser útil leer las secuencias de salida estándar y de error generadas por el motor. Esto es similar a la salida que se muestra en la ventana de la consola del editor. Por defecto, se utilizan los métodos estándar de ``console.log`` y ``console.warn`` para las secuencias de salida y error, respectivamente. Este comportamiento se puede personalizar configurando tus propias funciones para manejar los mensajes.
fr: Pour déboguer les projets exportés, il peut être utile de lire la sortie standard et les flux d'erreurs générés par le moteur. Ceci est similaire à la sortie affichée dans la fenêtre de la console de l'éditeur. Par défaut, les fichiers standard ``console.log`` et ``console.warn`` sont utilisés respectivement pour la sortie et le flux d'erreurs. Ce comportement peut être personnalisé en définissant vos propres fonctions pour traiter les messages.
zh_cn: 要调试导出的项目, 可能需要读取引擎生成的标准输出和错误流. 这与编辑器控制台窗口中显示的输出类似. 默认情况下, 标准的 ``console.log`` 和 ``console.warning`` 分别用于输出和错误流. 这种行为可以通过设置自己的函数来处理消息来定制.

source: Use the :js:attr:`onPrint` override option to set a callback function for the output stream, and the :js:attr:`onPrintError` override option to set a callback function for the error stream.
es: Utiliza la opción de anulación :js:attr:`onPrint` para establecer una función de devolución de llamada para la secuencia de salida (output stream) y la opción de anulación :js:attr:`onPrintError` para establecer una función de devolución de llamada para la secuencia de error.
fr: Utilisez l'option de remplacement :js:attr:`onPrint` pour définir une fonction de rappel pour le flux de sortie, et l'option de remplacement :js:attr:`onPrintError` pour définir une fonction de rappel pour le flux d'erreur.
zh_cn: 使用 :js:attr:`onPrint` 覆盖选项为输出流设置一个回调函数，以及 :js:attr:`onPrintError` 覆盖选项为错误流设置一个回调函数。

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
