Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/bisecting_regressions.po
Languages: de, es, fr, zh_cn, zh_tw

source: Bisecting regressions
de: Halbierender Rückschritt
es: Búsqueda de regresiones mediante bisección
fr: Régressions en bisectation
zh_cn: Regression 的二分查找
zh_tw: Bisect 迴歸

source: Bisecting is a way to find regressions in software. After reporting a bug on the `Godot repository on GitHub <https://github.com/godotengine/godot>`__, you may be asked by a contributor to *bisect* the issue. Bisecting makes it possible for contributors to fix bugs faster, as they can know in advance which commit caused the regression. Your effort will be widely appreciated :)
de: Halbierung ist ein Weg, um Rückschritte in Software zu finden. Nachdem Sie einen Fehler im `Godot repository on GitHub <https://github.com/godotengine/godot>`__ gemeldet haben, werden Sie möglicherweise von einem Mitwirkenden gebeten, das Problem zu *halbieren*. Durch die Halbierung können Mitwirkende Fehler schneller beheben, da sie im Voraus wissen, welches Commit den Rückschritt verursacht hat. Ihre Bemühungen werden allgemein geschätzt :)
es: La bisección es una forma de encontrar regresiones en el software. Después de reportar un error en el `repositorio de Godot en GitHub <https://github.com/godotengine/godot>`__, es posible que un colaborador te pida *biseccionar* el problema. La bisección permite a los colaboradores solucionar los errores más rápido, ya que pueden conocer de antemano qué commit causó la regresión. ¡Tu esfuerzo será muy apreciado! :)
fr: La bisection est un moyen de trouver des régressions dans les logiciels. Après avoir signalé un bogue sur le dépôt `Godot sur GitHub <https://github.com/godotengine/godot>`__, un contributeur peut vous demander de *bisecter* le problème. Le Bisecting permet aux contributeurs de corriger les bugs plus rapidement, car ils peuvent savoir à l'avance quel commit a causé la régression. Votre effort sera largement apprécié :)
zh_cn: 二分查找是在软件中查找回归的一种方法。在 GitHub 上的 `Godot 仓库 <https://github.com/godotengine/godot>`__\ 中报告了一个错误之后，贡献者可能会要求您去做\ *二分查找*\ 。二分查找可以让贡献者更快地修复错误，因为他们可以提前知道是哪个提交导致了回归。您的努力将受到广泛赞赏 :)
zh_tw: Bisect 是一種在軟體中找出迴歸 (Regression) 的方法。當在 `GitHub 上的 Godot 儲存庫 <https://github.com/godotengine/godot>`__ 上回報 Bug 後，可能會有貢獻者要求你 **Bisect** 該問題。通過 Bisect 便能讓貢獻者進一步瞭解是哪個 Commit 造成該問題的，進而更快修正 Bug。大家會很感謝你的努力 :)

source: The guide below explains how to find a regression by bisecting.
de: In der folgenden Anleitung wird erläutert, wie Sie einen Rückschritt durch Halbieren finden.
es: La guía a continuación explica cómo encontrar una regresión mediante la bisección.
fr: Le guide ci-dessous explique comment trouver une régression par bissection.
zh_cn: 以下指南说明了如何通过二等分查找回归.
zh_tw: 本指南解釋如何通過 Bisect 來找出迴歸。

source: What is bisecting?
de: Was ist halbierend?
es: ¿Qué es Visual Scripting?
fr: Qu'est-ce que la bissection ?
zh_cn: 什么是两分法？
zh_tw: 什麼是 Bisect？

source: Godot developers use the `Git <https://git-scm.com/>`__ version control system. In the context of Git, bisecting is the process of performing a manual `binary search <https://en.wikipedia.org/wiki/Binary_search_algorithm>`__ to determine when a regression appeared. While it's typically used for bugs, it can also be used to find other kinds of unexpected changes such as performance regressions.
de: Godot-Entwickler verwenden das Versionskontrollsystem `Git <https://git-scm.com/>`__. Im Kontext von Git ist die Halbierung der Prozess der Durchführung für eine manuelle `binäre Suche <https://en.wikipedia.org/wiki/Binary_search_algorithm>`__ , um festzustellen, wann ein Rückschritt aufgetreten ist. Während es normalerweise für Fehler verwendet wird, können damit auch andere Arten unerwarteter Änderungen gefunden werden, z.B. Leistungsrückschritte.
es: Los desarrolladores de Godot utilizan el sistema de control de versiones `Git <https://git-scm.com/>`__. En el contexto de Git, la bisección es el proceso de realizar una `búsqueda binaria <https://en.wikipedia.org/wiki/Binary_search_algorithm>`__ manual para determinar cuándo apareció una regresión. Aunque normalmente se utiliza para buscar errores, también puede usarse para encontrar otros tipos de cambios inesperados, como regresiones de rendimiento.
fr: Les développeurs de Godot utilisent le système de contrôle de version `Git <https://git-scm.com/>`__. Dans le contexte de Git, la bissection est le processus consistant à effectuer une `recherche binaire <https://en.wikipedia.org/wiki/Binary_search_algorithm>`__ pour déterminer quand une régression est apparue. Bien qu'il soit généralement utilisé pour les bogues, il peut également être utilisé pour trouver d'autres types de changements inattendus tels que les régressions de performance.
zh_cn: Godot开发人员使用 `Git <https://git-scm.com/>`__ 版本控制系统. 在Git的上下文中, 二等分是执行手动 `二进制搜索 <https://en.wikipedia.org/wiki/Binary_search_algorithm>`__ 的过程, 以确定什么时候出现了回归. 尽管它通常用于错误, 但也可以用于查找其他种类的意外更改, 例如性能下降.
zh_tw: Godot 開發人員使用 `Git <https://git-scm.com/>`__ 版本控制系統。在 Git 的脈絡下，Bisect 是一個手動進行 `二分搜尋 <https://zh.wikipedia.org/zh-tw/%E4%BA%8C%E5%88%86%E6%90%9C%E5%B0%8B%E6%BC%94%E7%AE%97%E6%B3%95>`__ 來判斷迴歸是何時產生的一個過程。雖然通常 Bisect 是用來找出 Bug 的，但也可以用來找出如效能迴歸等其他未預期的改動。

source: Using official builds to speed up bisecting
de: Verwenden Sie offizielle Builds, um die Halbierung zu beschleunigen
es: Usando compilaciones oficiales para acelerar la bisección
fr: Utiliser les compilations officielles pour accélérer la bissection
zh_cn: 使用官方版本加快平分
zh_tw: 使用官方建置來加快 Bisect

source: Before using Git's ``bisect`` command, we strongly recommend trying to reproduce the bug with an older (or newer) official release. This greatly reduces the range of commits that potentially need to be built from source and tested. You can find binaries of official releases, as well as alphas, betas, and release candidates `here <https://downloads.tuxfamily.org/godotengine/>`__.
de: Bevor Sie den ``bisect``-Befehl von Git verwenden, empfehlen wir dringend, den Fehler mit einer älteren (oder neueren) offiziellen Version zu reproduzieren. Das reduziert die Bandbreite der Commits, die potentiell aus dem Quellcode gebaut und getestet werden müssen, erheblich. Sie können Binärdateien von offiziellen Versionen, sowie Alphas, Betas und Release Candidates `hier <https://downloads.tuxfamily.org/godotengine/>`__ finden.
es: Antes de usar el comando ``bisect`` de Git, recomendamos encarecidamente intentar reproducir el error con una versión oficial anterior (o más reciente). Esto reduce en gran medida el rango de commits que potencialmente necesitan ser compilados desde el código fuente y probados. Puedes encontrar binarios de versiones oficiales, así como versiones alfa, beta y candidatas a lanzamiento `aquí <https://downloads.tuxfamily.org/godotengine/>`__.
fr: Avant d'utiliser la commande "bisect" de Git, nous vous recommandons fortement d'essayer de reproduire le bug avec une version officielle plus ancienne (ou plus récente). Cela réduit considérablement le nombre de commits qui doivent potentiellement être construits à partir des sources et testés. Vous pouvez trouver les binaires des versions officielles, ainsi que les alphas, les bêtas et les candidats aux versions `ici <https://downloads.tuxfamily.org/godotengine/>`__.
zh_cn: 在使用Git的 ``bisect`` 命令之前, 我们强烈建议尝试使用较旧的(或较新的)正式版本重现该错误. 这大大减少了可能需要从源构建和测试的提交范围. 您可以在 `此处 <https://downloads.tuxfamily.org/godotengine/>`__ 找到官方发行版的二进制文件以及alpha,beta和发行候选文件.
zh_tw: 在使用 Git 的 ``bisect`` 指令前，我們強烈建議試著通過較舊版本 (或較新) 的官方釋出版本來嘗試重現 Bug。這樣一來可以大幅降低可能需要用來從原始碼建置並進行測試的 Commit 範圍。可以在 `此處 <https://downloads.tuxfamily.org/godotengine/>`__ 找到官方釋出版本、Alpha 版、RC 版的二進位檔。

source: For example, if you've reported a bug against Godot 3.2, you should first try to reproduce the bug in Godot 3.1 (not a patch release, see below for the reason). If the bug doesn't occur there, try to reproduce it in Godot 3.2 *beta 1* (which is roughly in the middle of all test builds available). If you can't reproduce the bug with Godot 3.2 beta 1, then try newer betas and RC builds. If you do manage to reproduce the bug with Godot 3.2 beta 1, then try older alpha builds.
de: Wenn Sie z. B. einen Fehler mit Godot 3.2 gemeldet haben, sollten Sie zunächst versuchen, den Fehler in Godot 3.1 zu reproduzieren (keine Patch-Version, siehe unten für den Grund). Wenn der Fehler dort nicht auftritt, versuchen Sie, ihn in Godot 3.2 *beta 1* zu reproduzieren (was ungefähr in der Mitte aller verfügbaren Test-Builds liegt). Wenn Sie den Fehler mit Godot 3.2 beta 1 nicht reproduzieren können, dann versuchen Sie neuere Betas und RC-Builds. Wenn Sie es schaffen, den Fehler mit Godot 3.2 beta 1 zu reproduzieren, dann versuchen Sie ältere Alpha-Builds.
es: Por ejemplo, si has informado de un error en Godot 3.2, debes intentar primero reproducir el error en Godot 3.1 (no una versión de parche, ver más abajo la razón). Si el error no ocurre allí, intenta reproducirlo en Godot 3.2 *beta 1* (que está aproximadamente en el centro de todas las versiones de prueba disponibles). Si no puedes reproducir el error con Godot 3.2 beta 1, entonces prueba con versiones beta más recientes y versiones candidatas a lanzamiento (RC). Si logras reproducir el error con Godot 3.2 beta 1, entonces intenta con versiones alfa más antiguas.
fr: Par exemple, si vous avez signalé un bogue contre Godot 3.2, vous devez d'abord essayer de reproduire le bogue dans Godot 3.1 (pas une version de correction, voir ci-dessous pour la raison). Si le bogue ne s'y produit pas, essayez de le reproduire dans Godot 3.2 *beta 1* (qui se situe à peu près au milieu de toutes les versions de test disponibles). Si vous ne pouvez pas reproduire le bogue avec Godot 3.2 beta 1, essayez des versions bêta et RC plus récentes. Si vous parvenez à reproduire le bogue avec Godot 3.2 beta 1, essayez des versions alpha plus anciennes.
zh_cn: 例如，如果您报告了 Godot 3.2 中的错误，则应首先尝试在 Godot 3.1 中重现该错误（不是补丁版本，原因见下文）。如果那里没有发生该错误，请尝试在 Godot 3.2 *beta 1* 中重现该错误（大约在所有可用测试版本的中间）。如果您无法使用 Godot 3.2 beta 1 重现该错误，请尝试使用较新的 beta 和 RC 版本。如果您用 Godot 3.2 beta 1 重现了该错误，那么就再尝试使用较早的 alpha 版本。
zh_tw: 舉例來說，如果我們要回報 Godot 3.2 的 Bug，則應該先試著在 Godot 3.1 中復現該 Bug (不適用修正版本，原因見後方)。若該 Bug 沒有在 Godot 3.1 中出現，則請試著在 Godot 3.2 **Beta 1** 中 (也就是大約在所有測試版建置的中間) 嘗試復現。若沒辦法在 Godot 3.2 Beta 1 中復現，則請試試較新版本的 Beta 與 RC 建置。如果能成功在 Godot 3.2 Beta 1 中復現 Bug，則請接著試試較舊版本的 Alpha 建置。

source: For bisecting regressions, don't use patch releases such as Godot 3.1.2. Instead, use the minor version's first release like Godot 3.1. This is because patch releases are built from a separate *stable branch*. This kind of branch doesn't follow the rest of Godot's development, which is done in the ``master`` branch.
de: Verwenden Sie für die Bisektion von Regressionen keine Patch-Versionen wie Godot 3.1.2. Verwenden Sie stattdessen das erste Release der Minor-Version wie Godot 3.1. Das liegt daran, dass Patch-Versionen aus einem separaten *stable branch* erstellt werden. Diese Art von Zweig folgt nicht der restlichen Entwicklung von Godot, die im ``master``-Zweig stattfindet.
es: Para bisectar regresiones, no utilices versiones de parche como Godot 3.1.2. En su lugar, utiliza la primera versión de la versión menor, como Godot 3.1. Esto se debe a que las versiones de parche se construyen a partir de una *rama estable* separada. Este tipo de rama no sigue el resto del desarrollo de Godot, que se realiza en la rama ``master``.
fr: Pour bissecter une régression, n'utilisez pas les versions de patchs telles que Godot 3.1.2. Utilisez plutôt la première version de la version mineure comme Godot 3.1. En effet, les versions de correction sont construites à partir d'une branche *stable* distincte. Ce type de branche ne suit pas le reste du développement de Godot, qui est fait dans la branche ``master``.
zh_cn: 对于二等分回归, 请勿使用修补程序版本, 例如Godot 3.1.2. 而是使用次要版本的第一个发行版, 例如Godot 3.1. 这是因为修补程序版本是从单独的* stable分支*构建的. 这种分支没有遵循Godot的其余开发, 而是在" master"分支中完成的.
zh_tw: 進行 Bisect 迴歸時，請不要使用如 Godot 3.1.2 這樣的修正釋出，請先使用主版本的釋出，如 Godot 3.1.這是因為，修正版本是在獨立的 **穩定版分支** 上建置的。這種分支並不會跟隨其他 Godot 在 ``master`` 分支中所進行的開發。

source: The Git bisect command
de: Der Befehl Git bisect
es: El comando "Git bisect"
fr: La commande git bisect
zh_cn: Git bisect 命令
zh_tw: Git 的 Bisect 指令

source: If you've found a build that didn't exhibit the bug in the above testing process, you can now start bisecting the regression. The Git version control system offers a built-in command for this: ``git bisect``. This makes the process semi-automated as you only have to build the engine, run it and try to reproduce the bug.
de: Wenn Sie einen Build gefunden haben, der den Fehler im obigen Testprozess nicht aufwies, können Sie nun damit beginnen, die Regression zu bisektieren. Das Git Versionskontrollsystem bietet dafür einen eingebauten Befehl: ``git bisect``. Das macht den Prozess halbautomatisch, da Sie nur die Engine bauen müssen, sie laufen lassen und versuchen, den Fehler zu reproduzieren.
es: Si has encontrado una compilación que no muestra el error durante el proceso de prueba mencionado anteriormente, ahora puedes comenzar a bisectar la regresión. El sistema de control de versiones Git ofrece un comando incorporado para esto: ``git bisect``. Esto hace que el proceso sea semi-automatizado, ya que solo tienes que compilar el motor, ejecutarlo e intentar reproducir el error.
fr: Si vous avez trouvé une compilation qui ne présentait pas le bogue dans le processus de test ci-dessus, vous pouvez maintenant commencer à couper la régression en deux. Le système de contrôle de version Git offre une commande intégrée pour cela : ``git bisect``. Cela rend le processus semi-automatique, car il suffit de construire le moteur, de l'exécuter et d'essayer de reproduire le bogue.
zh_cn: 如果您发现在上述测试过程中未显示该错误的构建，则可以立即将回归二等分。Git 版本控制系统为此提供了一个内置命令：\ ``git bisect``\ 。这使过程成为半自动化的过程，因为您只需要构建引擎，运行它并尝试重现该错误即可。
zh_tw: 如果在上述測試過程中找到了沒有出現該 Bug 的建置，則可以開始 Bisect 迴歸。Git 版本控制系統提供了一個內建指令來進行 Bisect 迴歸： ``git bisect`` 。有了這個指令便可將此一過程半自動化，只需要建置引擎並嘗試重現該 Bug 即可。

source: Before bisecting a regression, you need to set up a build environment to compile Godot from source. To do so, read the :ref:`Compiling <toc-devel-compiling>` page for your target platform. (Compiling Godot from source doesn't require C++ programming knowledge.)
de: Bevor Sie eine Regression bisectieren, müssen Sie eine Build-Umgebung einrichten, um Godot aus dem Quellcode zu kompilieren. Lesen Sie dazu die Seite :ref:`Kompilieren <toc-devel-compiling>` für Ihre Zielplattform. (Zum Kompilieren von Godot aus dem Quellcode sind keine C++-Programmierkenntnisse erforderlich.)
es: Antes de bisectar una regresión, necesitas configurar un entorno de compilación para compilar Godot desde el código fuente. Para hacerlo, lee la página de :ref:`Compilar <toc-devel-compiling>` para tu plataforma de destino. (Compilar Godot desde el código fuente no requiere conocimientos de programación en C++)
fr: Avant de bissecter une régression, vous devez mettre en place un environnement de compilation pour compiler Godot à partir de la source. Pour ce faire, lisez la page :ref:`Compilation <toc-devel-compilation>` pour votre plate-forme cible. (Compiler Godot à partir des sources ne nécessite pas de connaissances en programmation C++).
zh_cn: 在平分回归之前, 您需要设置一个构建环境以从源代码编译Godot. 为此, 请阅读目标平台的 :ref:`Compiling <toc-devel-compiling>` 页面. (从源代码编译Godot不需要C ++编程知识.)
zh_tw: 在 Bisect 迴歸前，需要先建置用於從原始碼編譯 Godot 的建置環境。要設定建置環境，請參考與建置目標平台對應的 :ref:`編譯 <toc-devel-compiling>` 頁面。(從原始碼編譯 Godot 並不需要 C++ 程式設計知識。)

source: Note that compiling Godot can take a while on slow hardware (up an hour for each full rebuild on a slow dual-core CPU). This means the full process can take up to several hours. If your hardware is too slow, you may want to stop there and report the results of your "pre-bisecting" on the GitHub issue so another contributor can continue bisecting from there.
de: Beachten Sie, dass das Kompilieren von Godot auf langsamer Hardware eine Weile dauern kann (bis zu einer Stunde für jeden vollständigen Neuaufbau auf einer langsamen Dual-Core-CPU). Das bedeutet, dass der gesamte Prozess bis zu mehrere Stunden dauern kann. Wenn Ihre Hardware zu langsam ist, möchten Sie vielleicht dort aufhören und die Ergebnisse Ihrer "Vor-Bisectierung" im GitHub Issue berichten, so dass ein anderer Mitwirkender von dort aus das Bisecting fortsetzen kann.
es: Ten en cuenta que compilar Godot puede llevar bastante tiempo en hardware lento (hasta una hora para cada reconstrucción completa en una CPU lenta de doble núcleo). Esto significa que el proceso completo puede tardar varias horas. Si tu hardware es demasiado lento, es posible que desees detenerte allí y reportar los resultados de tu "pre-bisecting" en el problema de GitHub para que otro colaborador pueda continuar bisectando desde ese punto.
fr: Notez que la compilation de Godot peut prendre un certain temps sur du matériel lent (jusqu'à une heure pour chaque recompilation complète sur un CPU dual-core lent). Cela signifie que le processus complet peut prendre jusqu'à plusieurs heures. Si votre matériel est trop lent, vous pouvez vous arrêter là et rapporter les résultats de votre "pré-bisection" sur le numéro de GitHub afin qu'un autre contributeur puisse continuer à bissecter à partir de là.
zh_cn: 请注意, 编译 Godot 可能需要在缓慢的硬件上一段时间(在缓慢的双核 CPU 上, 每次完全重建需要一个小时). 这意味着整个过程最多可能需要几个小时. 如果您的硬件太慢, 您可能希望停止并报告 GitHub 问题的 "预分节" 结果, 以便其他参与者可以继续从该部分开始参与.
zh_tw: 請主義，在較慢的硬體上編譯 Godot 可能會花費一些時間 (在較慢的雙核 CPU 上，每個建置可能會花費高達一個小時)。這表示，整個過程可能會耗費數個小時。如果你使用較慢的硬體，則你可以停在這裡，並在 GitHub Issue 上回報你在「Bisect 前」的結果來讓其他貢獻者能從此處繼續進行 Bisect。

source: To start bisecting, you must first determine the commit hashes (identifiers) of the "bad" and "good" build. "bad" refers to the build that exhibits the bug, whereas "good" refers to the version that doesn't exhibit the bug. If you're using a pre-release build as the "good" or "bad" build, browse the `download mirror <https://downloads.tuxfamily.org/godotengine/>`__, go to the folder that contains the pre-release you downloaded and look for the ``README.txt`` file. The commit hash is written inside that file.
de: Um mit dem Bisecting zu beginnen, müssen Sie zunächst die Commit-Hashes (Identifier) des "schlechten" und "guten" Builds ermitteln. "Schlecht" bezieht sich auf den Build, der den Fehler aufweist, während "gut" sich auf die Version bezieht, die den Fehler nicht aufweist. Wenn Sie einen Pre-Release-Build als "guten" oder "schlechten" Build verwenden, durchsuchen Sie den `Download-Mirror <https://downloads.tuxfamily.org/godotengine/>`__, gehen Sie in den Ordner, der den Pre-Release enthält, den Sie heruntergeladen haben und suchen Sie nach der Datei ``README.txt``. Der Commit-Hash wird in diese Datei geschrieben.
es: Para comenzar el bisecting, primero debes determinar los identificadores de los commits (hashes) de la compilación "mala" y "buena". "Mala" se refiere a la compilación que muestra el error, mientras que "buena" se refiere a la versión que no muestra el error. Si estás utilizando una compilación de prelanzamiento como la compilación "buena" o "mala", navega hacia el `mirror de descargas <https://downloads.tuxfamily.org/godotengine/>`__, ve a la carpeta que contiene el prelanzamiento que descargaste y busca el archivo "README.txt". El identificador del commit estará escrito dentro de ese archivo.
fr: Pour commencer à bissecter, vous devez d'abord déterminer les hashs de commit (identifiants) des "mauvaises" et "bonnes" constructions. "bad" se réfère à la version qui présente le bogue, tandis que "good" se réfère à la version qui ne présente pas le bogue. Si vous utilisez une pré-version comme "bonne" ou "mauvaise" version, naviguez dans le `miroir de téléchargement <https://downloads.tuxfamily.org/godotengine/>`__, allez dans le dossier qui contient la pré-version que vous avez téléchargée et cherchez le fichier ``README.txt``. Le hachage du commit est écrit à l'intérieur de ce fichier.
zh_cn: 要开始划分, 你必须首先确定 "坏" 和 "好" 的版本提交散列值(标识符)."坏" 指的是表现出错误的版本, 而 "好" 指的是没有表现出错误的版本. 如果你使用一个预发布版本作为 "好" 或 "坏" `下载镜像 <https://downloads.tuxfamily.org/godotengine/>`__, 进入包含你下载的预发布版本的文件夹, 寻找 ``README.txt`` 文件. 提交的哈希值就写在该文件中.
zh_tw: 要開始 Bisect，首先必須先判斷「壞的」與「好的」建置的 Commit 雜湊 (識別項)。「壞的」代表會出現 Bug 的建置，而「好的」則代表不會出現該 Bug 的版本。如果使用預釋出的建置來當作「好的」或「壞的」建置，則請瀏覽 `下載鏡像 <https://downloads.tuxfamily.org/godotengine/>`__ 頁面，前往包含你下載的預釋出版本的資料夾內，然後找到 ``README.txt`` 檔案。該檔案內有寫上 Commit 雜湊。

source: If you're using a stable release as the "good" or "bad" build, use one of the following commit hashes depending on the version:
de: Wenn Sie eine stabile Version als "guten" oder "schlechten" Build verwenden, benutzen Sie je nach Version einen der folgenden Commit-Hashes:
es: Si estás utilizando una versión estable como la compilación "buena" o "mala", usa uno de los siguientes identificadores de commit según la versión:
fr: Si vous utilisez une version stable comme "bonne" ou "mauvaise" compilation, utilisez l'un des hashs de commit suivants selon la version :
zh_cn: 如果您使用稳定版本作为“好”或“坏”版本，请根据版本使用以下提交哈希之一：
zh_tw: 如果你使用穩定版來作為「好的」或「壞的」建置，則請依據版本來使用下列其一 Commit 雜湊：

source: To refer to the latest state of the master branch, you can use ``master`` instead of a commit hash.
de: Um auf den letzten Stand des Master-Zweigs zu verweisen, können Sie ``master`` anstelle eines Commit-Hashs verwenden.
es: Para hacer referencia al estado más reciente de la rama ``master``, puedes usar ``master`` en lugar de un identificador de commit.
fr: Pour faire référence au dernier état de la branche master, vous pouvez utiliser ``master`` au lieu d'un hash de commit.
zh_cn: 要引用 master 分支的最新状态，可以使用 ``master`` 代替提交哈希。
zh_tw: 如果要參照 master 分支的最新狀態，則可以使用 ``master`` 來代替 Commit 雜湊。

source: :ref:`Get Godot's source code using Git <doc_getting_source>`. Once this is done, in the terminal window, use ``cd`` to reach the Godot repository folder and enter the following command:
de: :ref:`Holen Sie Godots Quellcode mit Git <doc_getting_source>`. Sobald dies geschehen ist, verwenden Sie im Terminalfenster ``cd``, um den Godot-Repository-Ordner zu erreichen, und geben Sie den folgenden Befehl ein:
es: :ref:`Obtener el código fuente de Godot utilizando Git <doc_getting_source>`. Una vez hecho esto, en la ventana de la terminal, utiliza ``cd`` para navegar hasta la carpeta del repositorio de Godot y ejecuta el siguiente comando:
fr: :ref:`obtenez le code source de Godot avec Git <doc_getting_source>`. Une fois cela fait, dans la fenêtre du terminal, utilisez ``cd`` pour atteindre le dossier du dépôt de Godot et entrez la commande suivante :
zh_cn: :ref:`使用 Git 获取 Godot 的源代码 <doc_getting_source>`\ 。完成后，在终端窗口中，使用 ``cd`` 进入 Godot 仓库文件夹并输入以下命令：
zh_tw: :ref:`使用 Git 來取得 Godot 的原始碼 <doc_getting_source>` 。完成後，在終端機視窗內使用 ``cd`` 來移動至 Godot 儲存庫資料夾內，然後輸入下列指令：

source: Compile Godot. This assumes you've set up a build environment:
de: Kompiliere Godot. Dies setzt voraus, dass Sie eine Build-Umgebung eingerichtet haben:
es: Compila Godot. Esto asume que has configurado un entorno de compilación:
fr: Compiler Godot. Cela suppose que vous avez mis en place un environnement de compilation :
zh_cn: 编译 Godot。这假定您已经设置好了构建环境：
zh_tw: 編譯 Godot。此處假設你已經設定好了建置環境：
