Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/bisecting_regressions.po
Languages: de, es, fr, zh_cn, zh_tw

source: Since building Godot takes a while, you want to dedicate as many CPU threads as possible to the task. This is what the ``-j`` parameter does. Here, the command assigns 4 CPU threads to compiling Godot.
de: Da der Build von Godot eine Weile dauert, möchten Sie so viele CPU-Threads wie möglich für die Aufgabe verwenden. Dies wird durch den Parameter ``-j`` erreicht. Hier weist der Befehl 4 CPU-Threads zum Kompilieren von Godot zu.
es: Dado que compilar Godot lleva tiempo, quieres dedicar tantos hilos de CPU como sea posible a la tarea. Eso es lo que hace el parámetro ``-j``. Aquí, el comando asigna 4 hilos de CPU para compilar Godot.
fr: Comme la compilation de Godot prend du temps, vous voulez y consacrer autant de threads CPU que possible. C'est ce que fait le paramètre ``-j``. Ici, la commande assigne 4 threads CPU à la compilation de Godot.
zh_cn: 由于构建 Godot 需要花上一定时间，因此您会希望为任务分配尽可能多的 CPU 线程。这就是 ``-j`` 参数的作用。在此，该命令会分配 4 个 CPU 线程来编译 Godot。
zh_tw: 由於建置 Godot 會需要一段時間，所以你可能會想儘量使用多個 CPU 執行緒來進行建置。``-j`` 參數就是用來指定執行緒數量的。在此例中，該指令指定使用 4 個 CPU 執行緒來編譯 Godot。

source: Run the binary located in the ``bin/`` folder and try to reproduce the bug.
de: Führen Sie die Binärdatei im Ordner ``bin /`` aus und versuchen Sie, den Fehler zu reproduzieren.
es: Ejecuta el archivo binario que se encuentra en la carpeta ``bin/`` y trata de reproducir el error.
fr: Exécutez le binaire situé dans le dossier ``bin/`` et essayez de reproduire le bogue.
zh_cn: 运行位于 ``bin/`` 文件夹中的二进制文件并尝试重现该错误。
zh_tw: 執行 ``bin/`` 資料夾內的二進位檔，然後嘗試復現 Bug。

source: If the build **still** exhibits the bug, run the following command:
de: Wenn der Build **immer noch** den Fehler aufweist, führen Sie den folgenden Befehl aus:
es: Si el compilado **sigue** presentando el error, ejecuta el siguiente comando:
fr: Si le build présente **encore** le bug, lancez la commande suivante :
zh_cn: 如果构建\ **仍然**\ 显示错误，请运行以下命令：
zh_tw: 若該建置中 **依然** 會遇到 Bug，則請執行下列指令：

source: If the build **does not** exhibit the bug, run the following command:
de: Wenn der Build den Fehler **nicht** aufweist, führen Sie den folgenden Befehl aus:
es: Si el compilado **no** presenta el error, ejecuta el siguiente comando:
fr: Si le build **ne présente pas** le bug, lancez la commande suivante :
zh_cn: 如果构建\ **没有**\ 显示错误，请运行以下命令：
zh_tw: 如果該建置 **沒有** 出現 Bug，請執行下列指令：

source: After entering one of the commands above, Git will switch to a different commit. You should now build Godot again, try to reproduce the bug, then enter ``git bisect good`` or ``git bisect bad`` depending on the result. You'll have to repeat this several times. The longer the commit range, the more steps will be required. 5 to 10 steps are usually sufficient to find most regressions; Git will remind you of the number of steps remaining (in the worst case scenario).
de: Nachdem Sie einen der obigen Befehle eingegeben haben, wird Git zu einem anderen Commit wechseln. Sie sollten nun Godot erneut builden, versuchen, den Fehler zu reproduzieren, und dann je nach Ergebnis ``git bisect good`` oder ``git bisect bad`` eingeben. Dies müssen Sie mehrere Male wiederholen. Je länger der Commit-Bereich ist, desto mehr Schritte werden benötigt. 5 bis 10 Schritte reichen normalerweise aus, um die meisten Regressionen zu finden; Git wird Sie an die Anzahl der verbleibenden Schritte erinnern (im worst-case Fall).
es: Después de ingresar uno de los comandos anteriores, Git cambiará a un commit diferente. Ahora debes compilar Godot nuevamente, intentar reproducir el error y luego ingresar ``git bisect good`` o ``git bisect bad`` según el resultado. Tendrás que repetir esto varias veces. Cuanto más amplio sea el rango de commits, más pasos serán necesarios. Por lo general, de 5 a 10 pasos son suficientes para encontrar la mayoría de las regresiones; Git te recordará el número de pasos restantes (en el peor de los casos).
fr: Après avoir entré l'une des commandes ci-dessus, Git passera à un commit différent. Vous devez maintenant recompiler Godot, essayer de reproduire le bug, puis entrer ``git bisect good`` ou ``git bisect bad`` selon le résultat. Vous devrez répéter cela plusieurs fois. Plus la plage de validation est longue, plus il faudra d'étapes. 5 à 10 étapes sont généralement suffisantes pour trouver la plupart des régressions ; Git vous rappellera le nombre d'étapes restantes (dans le pire des cas).
zh_cn: 输入上述命令之一后,Git 将切换到其他提交. 现在, 您应该再次构建 Godot, 尝试重现 Bug, 然后根据结果输入"git 一部分好 "或"git 一次坏". 你必须重复几次. 提交范围越长, 所需的步骤就越多.5 到 10 个步骤通常足以查找大多数回归;Git 将提醒您剩余步骤数(在最坏的情况下).
zh_tw: 輸入上述其中一個指令後，Git 會切換到不同的 Commit 上。接著應再次建置 Godot、嘗試復現 Bug、然後依據結果輸入 ``git bisect good`` 或 ``git bisect bad`` 。這個過程會需要重複多次。Commit 的範圍越大、就需要越多步驟。通常需要 5 到 10 個步驟才足夠找出大多數的迴歸；Git 會提示還剩下幾個步驟 (最糟情況下的剩餘步驟)。

source: Once you've completed enough steps, Git will display the commit hash where the regression appeared. Write this commit hash as a comment to the GitHub issue you've bisected. This will help in solving the issue. Thanks again for contributing to Godot :)
de: Wenn Sie genügend Schritte durchgeführt haben, zeigt Git den Commit-Hash an, wo die Regression aufgetreten ist. Schreiben Sie diesen Commit-Hash als Kommentar zu dem GitHub Issue, das Sie bisected haben. Dies wird bei der Lösung des Problems helfen. Nochmals vielen Dank für Ihren Beitrag zu Godot :)
es: Una vez que hayas completado suficientes pasos, Git mostrará el commit en el que apareció la regresión. Escribe este hash de commit como un comentario en la página del problema en GitHub donde hiciste el bisect. Esto ayudará a resolver el problema. ¡Gracias de nuevo por contribuir a Godot! :)
fr: Une fois que vous avez effectué suffisamment d'étapes, Git affichera le hach de commit où la régression est apparue. Écrivez ce hach de commit en commentaire du numéro de GitHub que vous avez découpé. Cela vous aidera à résoudre le problème. Merci encore d'avoir contribué à Godot :)
zh_cn: 完成足够的步骤后,Git将在出现回归的位置显示提交哈希. 将此提交哈希值写成对一分为二的GitHub问题的评论. 这将有助于解决问题. 再次感谢您对Godot的贡献:)
zh_tw: 完成了足夠的步驟後，Git 會顯示該迴歸出現的 Commit 雜湊。請將該 Commit 雜湊寫在所 Bisect 的 GitHub Issue 留言上。這樣有助於解決該問題。再次感謝你參與貢獻 Godot :)

source: You can read the full documentation on ``git bisect`` `here <https://git-scm.com/docs/git-bisect>`__.
de: Sie können die vollständige Dokumentation über ``git bisect`` `hier <https://git-scm.com/docs/git-bisect>`__ lesen.
es: Puedes leer la documentación completa sobre ``git bisect`` `aquí <https://git-scm.com/docs/git-bisect>`__.
fr: Vous pouvez lire la documentation complète sur ``git bisect`` `ici <https://git-scm.com/docs/git-bisect>`__.
zh_cn: 您可以在 ``git bisect`` 上阅读完整文档, `这里 <https://git-scm.com/docs/git-bisect>`__ .
zh_tw: 有關 ``git bisect`` 的完整說明文件可以參考 `此處 <https://git-scm.com/docs/git-bisect>`__ 。

source: Translation status
es: Estado de traducción
zh_cn: 翻译状态
