Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/community/contributing/content_guidelines.po
Languages: es, fr, zh_cn

source: Content guidelines
es: Directrices de contenido
fr: Directives relatives au contenu
zh_cn: 内容规范

source: This document is here to help us assess what we should include in the official documentation. Below, you will find a couple of principles and recommendations to write accessible content.
es: Este documento está aquí para ayudarnos a evaluar qué debemos incluir en la documentación oficial. A continuación, encontrarás algunos principios y recomendaciones para escribir contenido accesible.
fr: Ce document est là pour nous aider à évaluer ce que nous devons inclure dans la documentation officielle. Vous trouverez ci-dessous quelques principes et recommandations pour rédiger un contenu accessible.
zh_cn: 本文档致力于帮助大家评估哪些内容应该加入到官方文档中。你可以在下面找到一些关于如何编写简单易懂的内容的原则和建议。

source: We want to achieve two goals:
es: Nosotros queremos alcanzar dos metas:
fr: Nous visons deux objectifs :
zh_cn: 我们想实现两个目标：

source: **Empathize with our users.** We should write in a way that makes it easy for them to learn from the docs.
es: **Empatiza con nuestros usuarios.** Debemos escribir de una manera que les facilite aprender de la documentación.
fr: **Faites preuve d'empathie envers nos utilisateurs.** Nous devons écrire d'une manière qui leur permette d'apprendre facilement à partir des documents.
zh_cn: **与用户共情。**\ 写作时，应该让通过文档来学习变得简单。

source: **Write a complete reference manual**. Our goal here is not to teach programming foundations. Instead, we should provide a reference for how Godot's features work.
es: **Escribe un manual de referencia completo**. Nuestro objetivo aquí no es enseñar fundamentos de programación. En su lugar, debemos proporcionar una referencia sobre cómo funcionan las características de Godot.
fr: **Écrire un manuel de référence complet**. Notre objectif ici n'est pas d'enseigner les bases de la programmation. Au lieu de cela, nous devons fournir une référence sur la façon dont les fonctionnalités de Godot fonctionnent.
zh_cn: **编写完善的参考手册**\ 。我们这里的目标不是教授编程的基础知识。我们应该提供了解如何使用 Godot 功能的参考材料。

source: Guidelines and principles
es: Directrices y principios
fr: Lignes directrices et principes
zh_cn: 规范与原则

source: Below are the guidelines we should strive to follow. They are not hard rules, though: exceptionally, a topic will require breaking one or more of these. Still, we should strive to achieve the two goals listed above.
es: A continuación se presentan las directrices que debemos esforzarnos por seguir. No son reglas estrictas, sin embargo, en casos excepcionales, un tema podría requerir romper una o más de ellas. Aun así, debemos esforzarnos por alcanzar los dos objetivos mencionados anteriormente.
fr: Vous trouverez ci-dessous les lignes directrices que nous devons nous efforcer de suivre. Il ne s'agit cependant pas de règles strictes : exceptionnellement, un sujet nécessitera d'enfreindre une ou plusieurs de ces règles. Néanmoins, nous devons nous efforcer d'atteindre les deux objectifs énumérés ci-dessus.
zh_cn: 以下是我们应该努力遵守的规范。不过这些并不是硬性规定：特殊情况下，某个主题会需要打破这里的若干规范。不过我们还是应该尽量完成上面所列出的两个目标。

source: Writing complete and accessible documentation
es: Escribir documentación completa y accesible
fr: Rédiger une documentation complète et accessible
zh_cn: 编写完善易懂的文档

source: **A feature doesn't exist unless it is documented**. If a user can't find information about a feature and how it works, it doesn't exist to them. We should ensure that we cover everything Godot does.
es: **Una característica no existe a menos que esté documentada**. Si un usuario no puede encontrar información sobre una característica y cómo funciona, para ellos esa característica no existe. Debemos asegurarnos de cubrir todo lo que hace Godot.
fr: **Une fonctionnalité n'existe pas si elle n'est pas documentée**. Si un utilisateur ne peut pas trouver d'informations sur une fonctionnalité et son fonctionnement, elle n'existe pas pour lui. Nous devons nous assurer que nous couvrons tout ce que Godot fait.
zh_cn: **功能在编写文档前是不存在的**\ 。如果用户无法找到某个功能的信息和用法，那么这个功能对于他们就不存在。我们应该保证涉及到 Godot 的方方面面。

source: When adding or updating an engine feature, the documentation team needs to know about it. Contributors should open an issue on the `godot-docs` repository when their work gets merged and requires documentation.
es: Cuando se agrega o actualiza una característica del motor, el equipo de documentación necesita estar informado al respecto. Los colaboradores deben abrir un issue en el repositorio `godot-docs` cuando su trabajo se haya fusionado y requiera documentación.
fr: Lorsqu'une fonctionnalité du moteur est ajoutée ou mise à jour, l'équipe de documentation doit en être informée. Les contributeurs doivent ouvrir une question sur le dépôt `godot-docs` lorsque leur travail est fusionné et nécessite une documentation.
zh_cn: 添加或更新引擎的功能时，文档团队应该跟进。工作成果被合并后，如果需要文档，贡献者应该在 `godot-docs` 仓库创建 Issue。

source: Do your best to keep documents **under 1000 words in length**. If a page goes past that threshold, consider splitting it into two parts if possible. Limiting page size forces us to write concisely and to break large documents so they each focus on a particular problem.
es: Haz lo posible para mantener los documentos **con una extensión inferior a 1000 palabras**. Si una página supera ese límite, considera dividirla en dos partes si es posible. Limitar el tamaño de la página nos obliga a escribir de manera concisa y dividir documentos grandes para que cada uno se centre en un problema específico.
fr: Faites de votre mieux pour que les documents ** fassent moins de 1000 mots**. Si une page dépasse ce seuil, envisagez de la diviser en deux parties si possible. Limiter la taille des pages nous oblige à écrire de manière concise et à diviser les gros documents pour qu'ils se concentrent chacun sur un problème particulier.
zh_cn: 请竭尽所能将文档保持在\ **1000 个单词以内**\ 。如果页面超过了这个阈值，如果可能，请考虑将它拆分成两个部分。对页面的大小作出限制，强制我们在写作时保持简洁，将大段的文档进行拆分可以让每一部分都集中于某个特定的问题。

source: Make it clear what **problem** each page or section of a page tackles and what the user will learn from it. Users need to know if they're reading the correct guide to solving problems they encounter. For example, instead of writing the heading "Signals", consider writing "Reacting to changes with signals". The second title makes it clear what the purpose of signals is.
es: Asegúrate de dejar claro qué **problema** aborda cada página o sección de una página y qué aprenderá el usuario de ella. Los usuarios necesitan saber si están leyendo la guía correcta para resolver los problemas que encuentran. Por ejemplo, en lugar de escribir el encabezado "Señales", considera escribir "Reaccionar a cambios con señales". El segundo título deja claro cuál es el propósito de las señales.
fr: Indiquez clairement à quel **problème** chaque page ou section de page s'attaque et ce que l'utilisateur en tirera. Les utilisateurs ont besoin de savoir s’ils lisent le bon guide pour résoudre les problèmes qu’ils rencontrent. Par exemple, au lieu d'écrire le titre "Signaux", envisagez d'écrire "Réagir aux changements avec des signaux". Le deuxième titre indique clairement l'objectif des signaux.
zh_cn: 讲清楚每个页面或章节所针对的\ **问题**\ ，以及用户会学到什么。用户需要知道他们看的指南是否能够正确解决他们所遇到的问题。例如，请不要在题目里写“Signals”（信号），请考虑写“Reacting to changes with signals”（使用信号对变化作出响应）。后者标明了使用信号的目的。

source: Long section titles lead to long entries in the side menu, which can make navigation cumbersome. Try to keep headings five words long or less.
es: Los títulos de sección largos resultan en entradas largas en el menú lateral, lo que puede dificultar la navegación. Trata de mantener los encabezados con un máximo de cinco palabras o menos.
fr: Les longs titres de section entraînent de longues entrées dans le menu latéral, ce qui peut rendre la navigation difficile. Essayez de limiter la longueur des titres à cinq mots ou moins.
zh_cn: 章节标题太长，侧边菜单的项目就会变长，导航也会变得冗长。请尽量让题目保持在五个单词以内。

source: If the page assumes specific knowledge of other Godot features, mention it and link it to the corresponding documentation. For instance, a page about physics may use signals, in which case we could note that the page that introduces signals is a pre-requisite.
es: Si una página asume un conocimiento específico de otras características de Godot, mencionarlo y enlazarlo con la documentación correspondiente. Por ejemplo, una página sobre física puede utilizar señales, en cuyo caso podríamos mencionar que la página que presenta las señales es un prerequisito.
fr: Si la page suppose une connaissance spécifique d'autres fonctionnalités de Godot, mentionnez-le et liez-la à la documentation correspondante. Par exemple, une page sur la physique peut utiliser les signaux, auquel cas nous pourrions noter que la page qui présente les signaux est un prérequis.
zh_cn: 如果页面中要用到其他 Godot 特性，请进行提及并链接到对应的文档。例如，关于物理的页面可能会用到信号，那么就可以标明介绍信号的页面是该页面的先决条件。

source: Limiting cognitive load
es: Limitar la carga cognitiva
fr: Limiter la charge cognitive
zh_cn: 减少认知负担

source: Limit the cognitive load required to read the documentation. The simpler and more explicit language we use, the more efficient it becomes for people to learn. You can do so by:
es: Limitar la carga cognitiva requerida para leer la documentación. Cuanto más simple y explícito sea el lenguaje que utilizamos, más eficiente será para que las personas aprendan. Puedes lograrlo mediante:
fr: Limitez la charge cognitive nécessaire à la lecture de la documentation. Plus le langage utilisé est simple et explicite, plus l'apprentissage est efficace. Vous pouvez le faire en :
zh_cn: 减少阅读文档的认知负担。我们使用的语言越简单明了，大家学习起来效率就越高。你可以：

source: Introducing only one new concept at a time whenever possible.
es: Introducir solo un nuevo concepto a la vez siempre que sea posible.
fr: Introduisant un seul concept nouveau à la fois, dans la mesure du possible.
zh_cn: 尽可能一次只介绍一个新概念。

source: Using simple English, as we recommend in our writing guidelines.
es: Usar un inglés simple, como recomendamos en nuestras pautas de escritura.
fr: Utilisant un anglais simple, comme nous le recommandons dans nos directives de rédaction.
zh_cn: 就像在编写规范中推荐的一样，使用简单的英语。

source: Including one or more **concrete usage examples**. Prefer a real-world example to abstract code like ``foobar``.
es: Incluir uno o más **ejemplos de uso concretos**. Prefiere un ejemplo del mundo real en lugar de código abstracto como ``foobar``.
fr: Incluant un ou plusieurs **exemples concrets d'utilisation**. Préférez un exemple concret à un code abstrait comme ``foobar``.
zh_cn: 提供若干\ **实际使用示例**\ 。现实世界的例子比像 ``foobar`` 一样的抽象代码更好。

source: While many people may understand more complex language and abstract examples, you will lose others. Also, understandable writing and practical examples benefit everyone.
es: Si bien muchas personas pueden entender un lenguaje más complejo y ejemplos abstractos, también se perderá a otras. Escribir de forma comprensible y proporcionar ejemplos prácticos beneficia a todos.
fr: Si de nombreuses personnes peuvent comprendre un langage plus complexe et des exemples abstraits, vous en perdrez d'autres. Aussi, une écriture compréhensible et des exemples pratiques profitent à tous.
zh_cn: 虽然很多人能够理解复杂的语言和抽象的例子，你还是会失去其他人。而且，通俗易懂的写作和实际的例子能让所有人都受益。

source: Always make an effort to **put yourself in the user's shoes**. When we understand something thoroughly, it becomes evident to us. We may fail to think about details relevant to a newcomer, but **good documentation meets users where they are**. We should strive to explain each feature's capabilities or intended uses with the most straightforward language possible.
es: Siempre haz un esfuerzo por **ponerte en el lugar del usuario**. Cuando entendemos algo completamente, nos resulta evidente. Podemos olvidar pensar en detalles relevantes para un recién llegado, pero **una buena documentación llega a los usuarios donde están**. Debemos esforzarnos por explicar las capacidades o usos previstos de cada característica con el lenguaje más sencillo posible.
fr: Faites toujours l'effort de vous **mettre à la place de l'utilisateur**. Lorsque nous comprenons quelque chose de manière approfondie, cela devient évident pour nous. Nous pouvons ne pas penser aux détails pertinents pour un nouveau venu, mais **une bonne documentation rencontre les utilisateurs là où ils sont**. Nous devons nous efforcer d’expliquer les capacités ou les utilisations prévues de chaque fonctionnalité avec le langage le plus simple possible.
zh_cn: 始终努力\ **设身处地为用户着想**\ 。某件事情如果我们完全理解，对于我们而言就会变得显而易见。我们可能无法想象新手相关的细节，但\ **好的文档就是要为用户雪中送炭**\ 。我们应该用尽可能直白的语言，尽力去解释每一个特性的用处或用法。

source: Try to remember what you first needed to know when learning about the feature or concept. What new terms did you need to learn? What confused you? What was the hardest to grasp? You will want users to review your work, and we recommend you practice explaining the feature before writing about it.
es: Trata de recordar lo que necesitaste saber cuando aprendías sobre la característica o el concepto por primera vez. ¿Qué términos nuevos necesitaste aprender? ¿Qué te confundió? ¿Qué fue lo más difícil de comprender? Querrás que los usuarios revisen tu trabajo, y te recomendamos practicar explicar la característica antes de escribir sobre ella.
fr: Essayez de vous souvenir de ce que vous avez d'abord dû savoir au début de votre apprentissage de cette fonctionnalité ou de ce concept. Quels sont les nouveaux termes que vous avez dû apprendre ? Qu'est-ce qui vous a troublé ? Qu'est-ce qui a été le plus difficile à comprendre ? Vous souhaiterez que les utilisateurs examinent votre travail, et nous vous recommandons de vous entraîner à expliquer la fonctionnalité avant d'écrire à son sujet.
zh_cn: 回想一下学习某个功能或概念时，你首先需要了解的东西。你需要用到哪些新的术语？你困惑的点是什么？最难掌握的是什么？你会希望让用户对你的成果进行评审，我们建议你在着手写作之前，先练习一下如何解释这个功能。

source: Having programming foundations is a pre-requisite to use a complex engine like Godot. Talking about variables, functions, or classes is acceptable. But we should favor plain language over specific terminology like "metaprogramming". If you need to use precise terms, be sure to define them.
es: Tener bases de programación es un requisito previo para usar un motor complejo como Godot. Hablar de variables, funciones o clases es aceptable. Pero debemos preferir un lenguaje sencillo en lugar de terminología específica como "metaprogramación". Si es necesario utilizar términos precisos, asegúrate de definirlos.
fr: Avoir des bases de programmation est un pré-requis pour utiliser un moteur complexe comme Godot. Parler de variables, de fonctions ou de classes est acceptable. Mais il faut privilégier un langage simple plutôt qu'une terminologie spécifique comme "métaprogrammation". Si vous devez utiliser des termes précis, veillez à les définir.
zh_cn: 拥有编程基础是使用像 Godot 这样复杂的引擎的先决条件。你可以用到变量、函数、类。不过相对于“元编程”之类的特定术语，我们应该更倾向于使用平实的语言。如果你需要使用精准的术语，请一定要给出定义。

source: When a page assumes knowledge of another engine feature, declare it at the beginning and link to resources that cover what users need. You may also link to other websites for pre-requisites beyond the documentation's scope. For example, you could link to an introduction to programming in the getting started guide, or a website that teaches math theory in the math section.
es: Cuando una página asume el conocimiento de otra característica del motor, decláralo al principio y enlaza a recursos que cubran lo que los usuarios necesitan. También puedes enlazar a otros sitios web para requisitos previos más allá del alcance de la documentación. Por ejemplo, podrías enlazar a una introducción a la programación en la guía de inicio, o a un sitio web que enseñe teoría matemática en la sección de matemáticas.
fr: Lorsqu'une page suppose la connaissance d'une autre fonctionnalité du moteur, déclarez-la au début et créez un lien vers des ressources qui couvrent les besoins des utilisateurs. Vous pouvez également créer un lien vers d'autres sites Web pour les prérequis au-delà de la portée de la documentation. Par exemple, vous pouvez créer un lien vers une introduction à la programmation dans le guide de démarrage ou vers un site Web qui enseigne la théorie des mathématiques dans la section mathématiques.
zh_cn: 如果某个页面假设读者了解引擎的另一项功能，请在开头给出介绍和能够为用户提供必要信息的资源链接。如果先决条件不在文档的范畴内，你也可以链接到其他网站。例如在数学章节中，你可以链接到入门指南中的编程简介章节，也可以链接到某个教授数学理论的网站。

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
