Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/interpolation/physics_interpolation_introduction.po
Languages: es, fr, zh_cn

source: Introduction
es: Introducción
zh_cn: 前言

source: Physics ticks and rendered frames
es: Ticks de física y frames renderizados
zh_cn: 物理周期与渲染帧

source: One key concept to understand in Godot is the distinction between physics ticks (sometimes referred to as iterations or physics frames), and rendered frames. The physics proceeds at a fixed tick rate (set in :ref:`ProjectSettings.physics/common/physics_fps<class_ProjectSettings_property_physics/common/physics_fps>`), which defaults to 60 ticks per second.
es: Un concepto clave para entender en Godot es la distinción entre los ticks de física (a veces denominados iteraciones o frames de física) y los frames renderizados. La física avanza a una velocidad de tick fija (establecida en :ref:`ProjectSettings.physics/common/physics_fps<class_ProjectSettings_property_physics/common/physics_fps>`), que por defecto es de 60 ticks por segundo.
fr: Un concept clé à comprendre dans Godot est la distinction entre les ticks de physique (parfois appelés itérations ou trames de physique), et les trames rendues. La physique se déroule à un rythme fixe (défini dans :ref:`ProjectSettings.physics/common/physics_fps<class_ProjectSettings_property_physics/common/physics_fps>`), qui est par défaut de 60 ticks par seconde.
zh_cn: Godot 中有一个需要理解的关键概念，那就是物理周期（也叫迭代或者物理帧）和渲染帧的区别。物理处理的周期率是固定的（通过 :ref:`ProjectSettings.physics/common/physics_fps<class_ProjectSettings_property_physics/common/physics_fps>` 设置），默认为每秒 60 次。

source: However, the engine does not necessarily **render** at the same rate. Although many monitors refresh at 60 Hz (cycles per second), many refresh at completely different frequencies (e.g. 75 Hz, 144 Hz, 240 Hz or more). Even though a monitor may be able to show a new frame e.g. 60 times a second, there is no guarantee that the CPU and GPU will be able to *supply* frames at this rate. For instance, when running with V-Sync, the computer may be too slow for 60 and only reach the deadlines for 30 FPS, in which case the frames you see will change at 30 FPS (resulting in stuttering).
es: Sin embargo, el motor no necesariamente **renderiza** a la misma velocidad. Aunque muchos monitores se refrescan a 60 Hz (ciclos por segundo), muchos se refrescan a frecuencias completamente diferentes (por ejemplo, 75 Hz, 144 Hz, 240 Hz o más). Aunque un monitor pueda mostrar un nuevo frame, por ejemplo, 60 veces por segundo, no hay garantía de que la CPU y la GPU puedan *suministrar* frames a esta velocidad. Por ejemplo, al ejecutarse con V-Sync, la computadora puede ser demasiado lenta para alcanzar los 60 FPS y solo llegar a los plazos de 30 FPS, en cuyo caso los frames que ves cambiarán a 30 FPS (resultando en tartamudeo).
zh_cn: 然而，引擎不必以相同的频率进行\ **渲染**\ 。虽然很多显示器的刷新率是 60 Hz（每秒的循环数），但是也有很多使用的是完全不同的频率（例如 75 Hz、144 Hz、240 Hz 或者更高）。即便显示器可能可以每秒显示 60 个新帧，也无法保证 CPU 和 GPU 能够按照这个频率来\ *提供*\ 帧。例如，使用垂直同步运行时，计算机可能太慢了，无法达到 60 FPS，只能达到 30 FPS，那么你能看到的就变化就是 30 FPS 的（造成卡顿）。

source: But there is a problem here. What happens if the physics ticks do not coincide with frames? What happens if the physics tick rate is out of phase with the frame rate? Or worse, what happens if the physics tick rate is *lower* than the rendered frame rate?
es: Aquí hay un problema. ¿Qué sucede si los ticks de física no coinciden con los frames? ¿Qué sucede si la velocidad de tick de física está desfasada con la velocidad de frame? O peor aún, ¿qué sucede si la velocidad de tick de física es inferior a la velocidad de frame renderizado?
fr: Mais il y a un problème ici. Que se passe-t-il si les tics de la physique ne coïncident pas avec les images ? Que se passe-t-il si la fréquence des tics physiques est déphasée par rapport à la fréquence des images ? Ou pire, que se passe-t-il si le taux de tics de la physique est *plus bas* que le taux de trame rendu ?
zh_cn: 但问题来了。物理周期与帧不一致会怎样？物理周期率与帧率不同步会怎样？或者更夸张一点，物理周期率\ *低于*\ 渲染帧率会怎样？

source: This problem is easier to understand if we consider an extreme scenario. If you set the physics tick rate to 10 ticks per second, in a simple game with a rendered frame rate of 60 FPS. If we plot a graph of the positions of an object against the rendered frames, you can see that the positions will appear to "jump" every 1/10th of a second, rather than giving a smooth motion. When the physics calculates a new position for a new object, it is not rendered in this position for just one frame, but for 6 frames.
es: Este problema es más fácil de entender si consideramos un escenario extremo. Si estableces la velocidad de tick de física en 10 ticks por segundo, en un juego simple con una velocidad de frame renderizado de 60 FPS. Si trazamos un gráfico de las posiciones de un objeto en relación a los frames renderizados, puedes ver que las posiciones parecerán "saltar" cada 1/10 de segundo, en lugar de ofrecer un movimiento suave. Cuando la física calcula una nueva posición para un objeto, esta posición no se renderiza durante solo un frame, sino durante 6 frames.
fr: Ce problème est plus facile à comprendre si l'on considère un scénario extrême. Si vous définissez le taux de tics de la physique à 10 tics par seconde, dans un jeu simple avec un taux d'images rendues de 60 IPS. Si nous traçons un graphique des positions d'un objet en fonction des images rendues, vous pouvez voir que les positions semblent "sauter" tous les 1/10e de seconde, au lieu de donner un mouvement régulier. Lorsque la physique calcule une nouvelle position pour un nouvel objet, celui-ci n'est pas rendu dans cette position pour une seule image, mais pour 6 images.
zh_cn: 如果我们考虑比较极端的情况，就能够更方便地理解这个问题。如果你在某个简单的游戏里把物理周期率设为每秒 10 次，而渲染帧率是 60 FPS。如果我们绘制渲染帧与某个对象位置的关系图，你应该可以看到位置是每十分之一秒“跳动”一次的，进行的不是平滑的运动。物理计算出新对象的新位置时，并不是在这个位置渲染一帧，而是要持续 6 帧。

source: This jump can be seen in other combinations of tick / frame rate as glitches, or jitter, caused by this staircasing effect due to the discrepancy between physics tick time and rendered frame time.
es: Este salto se puede ver en otras combinaciones de velocidad de tick / velocidad de frame como fallas o vibraciones, causadas por este efecto de escalonamiento debido a la discrepancia entre el tiempo de tick de física y el tiempo de frame renderizado.
fr: Ce saut peut être observé dans d'autres combinaisons de tics / fréquence d'images sous forme de glitchs, ou de gigue, causés par cet effet d'escalier dû à l'écart entre le temps de tics de la physique et le temps d'image rendu.
zh_cn: 这种跳动也可以在其他周期/帧率的组合中见到，表现为这种台阶效应所产生的闪烁或者抖动，究其原因还是物理周期的时间与渲染帧的时间的差异。

source: What can we do about frames and ticks being out of sync?
es: ¿Qué podemos hacer cuando los fotogramas (frames) y los ticks están desincronizados?
fr: Que peut-on faire pour éviter que les images et les tics ne soient pas désynchronisés ?
zh_cn: 帧和周期不同步，我们能做什么？

source: Lock the tick / frame rate together?
es: ¿Sincronizar la tasa de ticks y fotogramas juntos?
fr: En vérouillant les tics et la fréquence d'images ensemble ?
zh_cn: 把周期/帧率锁死？

source: The most obvious solution is to get rid of the problem, by ensuring there is a physics tick that coincides with every frame. This used to be the approach on old consoles and fixed hardware computers. If you know that every player will be using the same hardware, you can ensure it is fast enough to calculate ticks and frames at e.g. 50 FPS, and you will be sure it will work great for everybody.
es: La solución más obvia es eliminar el problema asegurándose de que haya un tick físico que coincida con cada fotograma. Este solía ser el enfoque en las consolas antiguas y en las computadoras con hardware fijo. Si sabes que todos los jugadores estarán utilizando el mismo hardware, puedes asegurarte de que sea lo suficientemente rápido para calcular ticks y fotogramas a, por ejemplo, 50 FPS, y así garantizar que funcione de manera óptima para todos.
fr: La solution la plus évidente est de se débarrasser du problème en s'assurant qu'il y a un tic physique qui coïncide avec chaque image. C'était l'approche utilisée sur les anciennes consoles et les ordinateurs à matériel fixe. Si vous savez que tous les joueurs utiliseront le même matériel, vous pouvez vous assurer qu'il est suffisamment rapide pour calculer les tics et les images à 50 IPS, par exemple, et vous serez sûr que tout le monde sera satisfait.
zh_cn: 最明显的解决方案就是消灭问题本身，方法是保证物理周期与帧一致。一些古早的主机和固定硬件的计算机使用的就是这种做法。如果你知道所有玩家使用的都是相同的硬件，那么你就可以保证周期和帧的计算都能在，例如 50 FPS 里处理掉，这样你就可以确定大家都能够得到很好的体验。

source: However, modern games are often no longer made for fixed hardware. You will often be planning to release on desktop computers, mobiles and more, all of which have huge variations in performance, as well as different monitor refresh rates. We need to come up with a better way of dealing with the problem.
es: Sin embargo, los juegos modernos a menudo ya no se desarrollan para hardware fijo. Con frecuencia, se planea lanzar juegos en computadoras de escritorio, dispositivos móviles y más, todos los cuales tienen grandes variaciones en rendimiento, así como diferentes tasas de actualización de los monitores. Necesitamos encontrar una mejor manera de lidiar con este problema.
fr: Cependant, les jeux modernes ne sont souvent plus conçus pour un seul type de matériel. Vous aurez souvent à planifier de développer des jeux pour ordinateurs, téléphones et autres, qui présentent tous d'énormes variations de performances, ainsi que des taux de rafraîchissement d'écran différents. Nous devons trouver une meilleure façon de gérer ce problème.
zh_cn: 然而，现代的游戏通常都不是为固定的硬件开发的。你通常会计划在桌面计算机、移动设备等多处发布，在性能和显示器刷新率上都会有很大差异。我们需要找到更好的解决方法。

source: Adapt the tick rate?
es: ¿Adaptar la tasa de ticks?
fr: Adapter le taux de tics physique ?
zh_cn: 适应周期率？

source: Instead of designing the game at a fixed physics tick rate, we could allow the tick rate to scale according to the end users hardware. We could for example use a fixed tick rate that works for that hardware, or even vary the duration of each physics tick to match a particular frame duration.
es: En lugar de diseñar el juego con una tasa de ticks de física fija, podríamos permitir que la tasa de ticks se ajuste según el hardware del usuario final. Podríamos utilizar, por ejemplo, una tasa de ticks fija que funcione para ese hardware en particular, o incluso variar la duración de cada tick de física para que coincida con una duración de fotograma específica.
fr: Au lieu de concevoir le jeu à une fréquence de tics physique fixe, nous pourrions permettre à la fréquence de tics d'évoluer en fonction du matériel de l'utilisateur. Nous pourrions par exemple utiliser un taux de tic fixe qui fonctionne pour ce matériel, ou même varier la durée de chaque tic physique pour correspondre à une durée d'image particulière.
zh_cn: 既然不能按照固定的物理帧率来设计游戏了，那么我们可以根据终端用户的硬件来缩放周期率呀。例如我们可以使用在那种硬件上能够固定达到的周期率，甚至可以改变每一个物理周期的长度来匹配特定的帧长度。

source: This works, but there is a problem. Physics (*and game logic*, which is often also run in the ``_physics_process``) work best and most consistently when run at a **fixed**, predetermined tick rate. If you attempt to run a racing game physics that has been designed for 60 TPS (ticks per second) at e.g. 10 TPS, the physics will behave completely differently. Controls may be less responsive, collisions / trajectories can be completely different. You may test your game thoroughly at 60 TPS, then find it breaks on end users machines when it runs at a different tick rate.
es: Esto funciona, pero hay un problema. La física (*y la lógica del juego*, que a menudo también se ejecuta en el ``_physics_process``) funcionan mejor y de manera más consistente cuando se ejecutan a una tasa de ticks **fija** y predeterminada. Si intentas ejecutar la física de un juego de carreras diseñado para 60 TPS (ticks por segundo) a, por ejemplo, 10 TPS, la física se comportará de manera completamente diferente. Los controles pueden ser menos responsivos, las colisiones y trayectorias pueden ser completamente distintas. Puedes probar tu juego a fondo a 60 TPS y luego descubrir que se rompe en las máquinas de los usuarios finales cuando se ejecuta a una tasa de ticks diferente.
fr: Cela fonctionne, mais il y a un problème. La physique (*et la logique de jeu*, qui est souvent aussi exécutée dans ``_physics_process``) fonctionne mieux et de manière plus cohérente lorsqu'elle est exécutée à une vitesse de tics prédéterminée **fixe**. Si vous essayez d'exécuter un jeu de course physique qui a été conçu pour 60 TPS (tics par seconde) à 10 TPS par exemple, la physique se comportera de manière complètement différente. Les commandes peuvent être moins réactives, les collisions / trajectoires peuvent être complètement différentes. Vous pouvez tester votre jeu de manière approfondie à 60 TPS, puis constater qu'il est défaillant sur les machines des utilisateurs lorsqu'il fonctionne à un taux de tic par seconde différent.
zh_cn: 确实可行，但还是会有问题。物理（\ *游戏逻辑*\ 也一样，通常会在 ``_physics_process`` 里执行）只有在以\ **固定的**\ 预定义的周期运行时，效果才最佳、最稳定。如果某个赛车游戏的物理系统是按照 60 TPS（每秒周期数）设计的，而你尝试按照 10 TPS 运行，物理系统的行为会大幅改变。控制的响应速度会变慢，碰撞/轨迹会完全不同。你可能在 60 TPS 下完善地测试了你的游戏，但一到终端用户的机器上，用不同的周期率运行就会完蛋。

source: This can make quality assurance difficult with hard to reproduce bugs, especially in AAA games where problems of this sort can be very costly. This can also be problematic for multiplayer games for competitive integrity, as running the game at certain tick rates may be more advantageous than others.
es: Esto puede dificultar la calidad del aseguramiento debido a los errores difíciles de reproducir, especialmente en juegos AAA, donde problemas de este tipo pueden ser muy costosos. También puede ser problemático para juegos multijugador en términos de integridad competitiva, ya que ejecutar el juego a ciertas tasas de ticks puede ser más ventajoso que otras.
fr: Cela peut rendre l'assurance qualité difficile avec des bugs difficiles à reproduire, notamment dans les jeux AAA où les problèmes de ce type peuvent être très coûteux. Cela peut également être problématique pour les jeux multijoueurs à des fins d'intégrité compétitive, car l'exécution du jeu à certains taux de tics peut être plus avantageuse que d'autres.
zh_cn: 这样就会造成品控方面的困难，Bug 难以重现，尤其是 AAA 游戏，这种问题非常费时费力。这也会在多人游戏时造成公平竞争问题，因为在特定帧率下运行游戏可能相对更有优势。

source: Lock the tick rate, but use interpolation to smooth frames in between physics ticks
es: Bloquea la tasa de ticks, pero utiliza interpolación para suavizar los fotogramas entre los ticks de física
fr: Verrouiller la fréquence des tics, mais utiliser l'interpolation pour lisser les images entre les tics physiques
zh_cn: 锁定周期率，但在两个物理周期之间通过插值来平滑帧

source: This has become one of the most popular approaches to dealing with the problem. It is supported by Godot 3.5 and later in 3D (although it is optional and disabled by default).
es: Es cierto, esta ha llegado a ser una de las aproximaciones más populares para lidiar con el problema. Es compatible con Godot 3.5 y versiones posteriores en 3D (aunque es opcional y viene desactivado por defecto).
fr: C'est devenu l'une des approches les plus populaires pour régler le problème. Elle est prise en charge par Godot 3.5 et les versions ultérieures en 3D (bien qu'elle soit facultative et désactivée par défaut).
zh_cn: 这是此类问题最受欢迎的解决方案。Godot 从 3.5 其支持在 3D 中使用（虽然是可选的，默认关闭）。

source: We have established that the most desirable physics/game logic arrangement for consistency and predictability is a physics tick rate that is fixed at design-time. The problem is the discrepancy between the physics position recorded, and where we "want" a physics object to be shown on a frame to give smooth motion.
es: Hemos establecido que el arreglo más deseable para la consistencia y la previsibilidad de la física y la lógica del juego es una tasa de ticks de física fija en el momento del diseño. El problema radica en la discrepancia entre la posición de la física registrada y dónde "queremos" que un objeto de física se muestre en un fotograma para lograr un movimiento suave.
fr: Nous avons établi que l'arrangement physique/logique de jeu le plus souhaitable pour la cohérence et la prévisibilité est un taux de tic physique qui est fixé au moment de la conception du jeu. Le problème est la divergence entre la position physique enregistrée et l'endroit où nous "voulons" qu'un objet physique soit représenté sur une image pour donner un mouvement fluide.
zh_cn: 我们已经认识到，要让物理/游戏逻辑安排达到最理想、稳定、可预知的状态，就需要在设计时使用固定的物理周期率。问题在于这两个位置是不同的：物理对象记录的物理位置，以及我们为了达到平滑的运动而“想要”让它在特定的帧中显示的位置。

source: The answer turns out to be simple, but can be a little hard to get your head around at first.
es: La respuesta resulta ser simple, pero puede ser un poco difícil de comprender al principio.
fr: La réponse s’avère simple, mais peut être un peu difficile à comprendre au début.
zh_cn: 答案非常简单，不过第一次听起来可能会有点难以理解。

source: Instead of keeping track of just the current position of a physics object in the engine, we keep track of *both the current position of the object, and the previous position* on the previous physics tick.
es: En lugar de llevar un registro únicamente de la posición actual de un objeto de física en el motor, llevamos un registro de *tanto la posición actual del objeto como la posición anterior* en el tick de física anterior.
fr: Au lieu de seulement garder en mémoire la position actuelle d'un objet physique dans le moteur, on garde *à la fois de la position actuelle de l'objet et de la position précédente* lors du tic physique précédent.
zh_cn: 除了记录引擎里物理对象的当前位置之外，我们\ *还要去记录它在上一个物理周期时的位置*\ 。

source: Why do we need the previous position *(in fact the entire transform, including rotation and scaling)*? By using a little math magic, we can use **interpolation** to calculate what the transform of the object would be between those two points, in our ideal world of smooth continuous movement.
es: ¿Por qué necesitamos la posición anterior *(de hecho, toda la transformación, incluida la rotación y el escalado)*? Mediante un poco de magia matemática, podemos utilizar **interpolación** para calcular cuál sería la transformación del objeto entre esos dos puntos, en nuestro mundo ideal de movimiento suave y continuo.
fr: Pourquoi avons-nous besoin de la position précédente *(en fait, de toute la transformation, y compris la rotation et la mise à l'échelle)* ? En utilisant un peu de magie mathématique, nous pouvons utiliser l'**interpolation** pour calculer ce que serait la transformation de l'objet entre ces deux points, dans notre monde idéal de mouvement continu et fluide.
zh_cn: 为什么需要上一个位置\ *（实际是完整的变换，还包括旋转和缩放）*\ ？通过一点神奇的数学知识，我们就可以通过\ **插值**\ 来算出，如果在这两个点之间做理想的平滑连续运动的话，这个对象的变换应该是什么。

source: Linear interpolation
es: Interpolación lineal
fr: Interpolation linéaire
zh_cn: 线性插值

source: The simplest way to achieve this is linear interpolation, or lerping, which you may have used before.
es: La forma más sencilla de lograr esto es mediante interpolación lineal, también conocida como "lerp", que es posible que hayas utilizado antes.
fr: Le moyen le plus simple d'y parvenir est l'interpolation linéaire, ou lerping, que vous avez peut-être déjà utilisée auparavant.
zh_cn: 实现起来最简单的方法就是做线性插值，或者叫 lerp，你可能之前用过。

source: Let us consider only the position, and a situation where we know that the previous physics tick X coordinate was 10 units, and the current physics tick X coordinate is 30 units.
es: Consideremos únicamente la posición y una situación en la que sabemos que la coordenada X del tick de física anterior era de 10 unidades, y la coordenada X del tick de física actual es de 30 unidades.
fr: Considérons uniquement la position, et une situation où nous savons que la coordonnée X du tic physique précédent était de 10 unités, et que la coordonnée X du tic physique actuel est de 30 unités.
zh_cn: 假设我们只考虑位置，我们知道上一个物理周期 X 坐标为 10 个单位，当前物理周期 X 坐标为 30 个单位。

source: Although the maths is explained here, you do not have to worry about the details, as this step will be performed for you. Under the hood, Godot may use more complex forms of interpolation, but linear interpolation is the easiest in terms of explanation.
es: Aunque las matemáticas se explican aquí, no tienes que preocuparte por los detalles, ya que este paso se realizará automáticamente por ti. Bajo la superficie, Godot puede utilizar formas de interpolación más complejas, pero la interpolación lineal es la más fácil de explicar.
fr: Bien que les mathématiques soient expliquées ici, vous n'avez pas à vous soucier des détails, car cette étape sera effectuée pour vous. Sous le capot, Godot peut utiliser des formes plus complexes d'interpolation, mais l'interpolation linéaire est la plus facile en termes d'explication.
zh_cn: 虽然这里会解释一下数学只是，你不用担心细节，因为你不用自己来做这一步。Godot 可能会在底层使用更复杂的插值，但是线性插值是解释起来最简单的。

source: The physics interpolation fraction
es: La fraccion de interpolación de físicas
fr: La fraction d'interpolation physique
zh_cn: 物理插值分数

source: If our physics ticks are happening 10 times per second (for this example), what happens if our rendered frame takes place at time 0.12 seconds? We can do some math to figure out where the object would be to obtain a smooth motion between the two ticks.
es: Si nuestros ciclos de física ocurren 10 veces por segundo (para este ejemplo), ¿qué sucede si nuestro fotograma renderizado tiene lugar en el tiempo 0.12 segundos? Podemos hacer algunos cálculos para averiguar dónde estaría el objeto y lograr un movimiento fluido entre los dos ciclos.
fr: Si les tics de notre physique se produisent 10 fois par seconde (pour cet exemple), que se passe-t-il si notre image rendue a lieu à 0,12 seconde ? Nous pouvons faire quelques calculs pour déterminer où l'objet doit se trouver pour obtenir un mouvement fluide entre les deux tics.
zh_cn: 如果我们的物理周期正好是每秒钟 10 次（针对这个例子），如果渲染帧发生在 0.12 秒处会发生什么呢？我们可以通过数学得到，假如该物体在两次物理周期间存在平滑运动，那么它应该位于哪个地方。

source: First of all, we have to calculate how far through the physics tick we want the object to be. If the last physics tick took place at 0.1 seconds, we are 0.02 seconds *(0.12 - 0.1)* through a tick that we know will take 0.1 seconds (10 ticks per second). The fraction through the tick is thus:
es: Primero, tenemos que calcular qué tan lejos queremos que esté el objeto en el ciclo de física. Si el último ciclo de física ocurrió a los 0.1 segundos, estamos a 0.02 segundos *(0.12 - 0.1)* en un ciclo que sabemos que durará 0.1 segundos (10 ciclos por segundo). Por lo tanto, la fracción a través del ciclo es:
fr: Tout d'abord, nous devons calculer à quelle distance du tic physique nous voulons que l'objet se trouve. Si le dernier tic physique a eu lieu à 0,1 seconde, nous sommes à 0,02 seconde *(0,12 - 0,1)* d'un tic-tac dont nous savons qu'il prendra 0,1 seconde (10 tics par seconde). La fraction de la durée du tic est donc :
zh_cn: 首先，我们得算出我们希望该物体经过了该物理周期多久。如果上一个物理周期发生在 0.1 秒，那么我们就是经过了一个周期 0.1 秒（每秒 10 个周期）之中的 0.02 秒\ *（0.12 - 0.1）*\ 。因此在该周期中的分数就是：

source: This is called the **physics interpolation fraction**, and is handily calculated for you by Godot. It can be retrieved on any frame by calling :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>`.
es: Esto se conoce como la **fracción de interpolación de física**, y Godot lo calcula automáticamente por ti. Puedes obtenerlo en cualquier fotograma llamando a :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>`.
fr: On appelle ça la **fraction d'interpolation physique**, qui est calculée pour vous par Godot. Elle peut être récupérée sur n'importe quelle image en appelant :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>`.
zh_cn: 这就叫做\ **物理插值分数**\ ，Godot 会好心地帮你算出来。任何帧中都能通过调用 :ref:`Engine.get_physics_interpolation_fraction<class_Engine_method_get_physics_interpolation_fraction>` 得到。
