Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/interpolation/physics_interpolation_introduction.po
Languages: es, fr, zh_cn

source: Calculating the interpolated position
es: Calculando la posición interpolada
fr: Calcul de la position interpolée
zh_cn: 计算插值位置

source: Once we have the interpolation fraction, we can insert it into a standard linear interpolation equation. The X coordinate would thus be:
es: Una vez que tenemos la fracción de interpolación, podemos insertarla en una ecuación de interpolación lineal estándar. La coordenada X sería:
fr: Une fois que nous avons la fraction d'interpolation, nous pouvons l'insérer dans une équation d'interpolation linéaire standard. La coordonnée X serait donc :
zh_cn: 有了插值分数之后，我们就可以把它带入标准线性插值公式中。X 坐标就是：

source: So substituting our ``x_prev`` as 10, and ``x_curr`` as 30:
es: Entonces, sustituyendo nuestro valor ``x_prev`` como 10, y ``x_curr`` como 30:
fr: Donc en substituant notre ``x_prev`` par 10, et ``x_curr`` par 30 :
zh_cn: 那么把我们的 ``x_prev`` 替换为 10、\ ``x_curr`` 替换为 30：

source: Let's break that down:
es: Descompongamos eso:
fr: Décomposons ça :
zh_cn: 我们来仔细看看：

source: We know the X starts from the coordinate on the previous tick (``x_prev``) which is 10 units.
es: Sabemos que la coordenada X comienza desde la posición en el ciclo de la física anterior (``x_prev``), que es de 10 unidades.
fr: Nous savons que le X part de la coordonnée du tic précédent (``x_prev``) qui est de 10 unités.
zh_cn: 我们知道 X 是从上一周期的位置开始的（\ ``x_prev``\ ）也就是 10 个单位。

source: We know that after the full tick, the difference between the current tick and the previous tick will have been added (``x_curr - x_prev``) (which is 20 units).
es: Sabemos que después del ciclo de física completo, se habrá agregado la diferencia entre el ciclo actual y el ciclo anterior (``x_curr - x_prev``) (que son 20 unidades).
fr: Nous savons qu'après le tic complet, la différence entre le tic actuel et le tic précédent aura été ajoutée (``x_curr - x_prev``) (ce qui représente 20 unités).
zh_cn: 我们知道在完整的周期后，会加上当前周期与上一周期的差（\ ``x_curr - x_prev``\ ）（也就是 20 个单位）。

source: The only thing we need to vary is the proportion of this difference we add, according to how far we are through the physics tick.
es: Lo único que necesitamos variar es la proporción de esta diferencia que agregamos, de acuerdo con qué tan lejos estemos en el ciclo de física.
fr: La seule chose que nous devons faire varier est la proportion de cette différence que nous ajoutons, en fonction de l'avancement du tic physique.
zh_cn: 我们唯一需要变化的就是根据我们经过了这个物理周期的多少，来加上这个差值的多少。

source: Although this example interpolates the position, the same thing can be done with the rotation and scale of objects. It is not necessary to know the details as Godot will do all this for you.
es: Aunque este ejemplo interpola la posición, lo mismo se puede hacer con la rotación y la escala de los objetos. No es necesario conocer los detalles, ya que Godot hará todo esto por ti.
fr: Bien que cet exemple interpole la position, la même chose peut être faite avec la rotation et l'échelle des objets. Il n'est pas nécessaire de connaître les détails car Godot fera tout cela pour vous.
zh_cn: 尽管这个例子里我们插值的是位置，对象的旋转和缩放也是可以做插值的。不必了解细节，Godot 会帮你做好这些事情。

source: Smoothed transformations between physics ticks?
es: ¡Transformaciones suavizadas entre tics de física?
fr: Transformations lissées entre les tics physique ?
zh_cn: 在物理周期之间平滑变换？

source: Putting all this together shows that it should be possible to have a nice smooth estimation of the transform of objects between the current and previous physics tick.
es: Al poner todo esto junto, se muestra que debería ser posible tener una estimación agradable y suave de la transformación de objetos entre el tic de física actual y el tic anterior.
fr: Tout cela montre qu'il devrait être possible d'obtenir une estimation lisse de la transformation des objets entre le tic physique actuel et le précédent.
zh_cn: 综上所述，通过对象在当前及上一物理周期时的变换，就应该能够估算得到平滑的变换。

source: But wait, you may have noticed something. If we are interpolating between the current and previous ticks, we are not estimating the position of the object *now*, we are estimating the position of the object in the past. To be exact, we are estimating the position of the object *between 1 and 2 ticks* into the past.
es: Pero espera, puede que hayas notado algo. Si estamos interpolando entre el tic actual y el tic anterior, no estamos estimando la posición del objeto *ahora*, sino que estamos estimando la posición del objeto en el pasado. Para ser exactos, estamos estimando la posición del objeto *entre 1 y 2 ciclos* en el pasado.
fr: Mais attendez, vous avez peut-être remarqué quelque chose. Si nous interpolons entre le tick actuel et le précedent, nous ne sommes pas en train d'estimer la position de l'objet *maintenant*, nous sommes en train d'estimer la position de l'objet dans le passé. Pour être exact, nous estimons la position de l'objet *entre 1 et 2 ticks* dans le passé.
zh_cn: 但是等一下，你可能注意到了什么。如果我们插值的是当前周期和上一周期，那么我们并不是在估算该对象\ *现在*\ 的位置，而是在估算该对象过去的位置。确切地说，我们是在估算该对象过去\ *1 个周期和 2 个周期之间*\ 的位置。

source: In the past
es: En el pasado
fr: Dans le passé
zh_cn: 过去

source: What does this mean? This scheme does work, but it does mean we are effectively introducing a delay between what we see on the screen, and where the objects *should* be.
es: ¿Qué significa esto? Este esquema funciona, pero significa que estamos introduciendo efectivamente un retraso entre lo que vemos en la pantalla y dónde *deberían* estar los objetos.
fr: Qu'est-ce que cela signifie ? Ce système fonctionne, mais cela signifie que nous introduisons effectivement un délai entre ce que nous voyons à l'écran et l'endroit où les objets *devraient* se trouver.
zh_cn: 这是什么意思？这种做法确实是有效的，但是我们本质上确实也是在屏幕上看到的位置和对象\ *应该*\ 在的位置之间引入了延迟。

source: In practice, most people won't notice this delay, or rather, it is typically not *objectionable*. There are already significant delays involved in games, we just don't typically notice them. The most significant effect is there can be a slight delay to input, which can be a factor in fast twitch games. In some of these fast input situations, you may wish to turn off physics interpolation and use a different scheme, or use a high tick rate, which mitigates these delays.
es: En la práctica, la mayoría de las personas no notarán este retraso, o más bien, normalmente no es *objetable*. Ya existen retrasos significativos en los juegos, simplemente no los notamos típicamente. El efecto más significativo es que puede haber un ligero retraso en la entrada, lo que puede ser un factor en juegos de reflejos rápidos. En algunas de estas situaciones de entrada rápida, es posible que desees desactivar la interpolación de física y utilizar un esquema diferente, o usar una alta frecuencia de ciclos, lo que mitiga estos retrasos.
fr: En pratique, la majorité ne remarquera pas ce délai, ou plutôt, il n'est typiquement pas *insupportable*. Il existe déjà des délais importants dans les jeux vidéos, toutefois nous ne les remarquons typiquement pas. L'effet le plus important peut se manifester par un délai dans l'entrée, ce qui peut affecter les jeux avec des temps de réponse rapide. Dans de telles situations, vous pouvez désactiver l'interpolation physique et changer de schéma, ou utiliser un taux de tic élevé, puisque ceci atténue les délais.
zh_cn: 在实践中，大多数人不会注意到这个延迟，或者说，通常不会\ *引起反感*\ 。游戏里本就有显著的延迟，只是我们通常不会注意到。最显著的就是输入会有少量的延迟，快节奏的游戏里就会感觉到。在类似这种快速输入的情况下，你可能会想要关闭物理插值，使用别的反感，或者提高周期率，缓和这种延迟。

source: Why look into the past? Why not predict the future?
es: ¿Por qué mirar hacia el pasado? ¿Por qué no predecir el futuro?
fr: Pourquoi regarder dans le passé ? Pourquoi ne pas prédire l'avenir ?
zh_cn: 为什么要往过去看呢？为什么不预测未来？

source: There is an alternative to this scheme, which is: instead of interpolating between the previous and current tick, we use maths to *extrapolate* into the future. We try to predict where the object *will be*, rather than show it where it was. This can be done and may be offered as an option in future, but there are some significant downsides:
es: Existe una alternativa a este esquema, que consiste en: en lugar de interpolar entre el tic anterior y el actual, utilizamos matemáticas para *extrapolar* hacia el futuro. Intentamos predecir dónde estará el objeto, en lugar de mostrar dónde estuvo. Esto se puede hacer y podría ofrecerse como una opción en el futuro, pero hay algunas desventajas significativas:
fr: Il y a une alternative à ce schème : plutôt que d'interpoler entre le tic précédent et le tic actuel, nous utilisons les mathématiques pour *extrapoler*vers le futur. Nous essayons de prédire où l'objet *sera*, plutôt que de démontrer d'où il vient. Ceci est possible, et sera peut-être offert comme option dans le futur, mais il existe d'importants inconvénients :
zh_cn: 这种方案还有另一种变体，那就是：不在上周期和本周期之间插值，而是利用数学\ *外插*\ 出未来的值。我们要尝试预测对象\ *将会*\ 在哪里，而不是去显示它曾经在哪个位置。未来可能可以这么做，作为可选项提供，但还是有显著的问题的：

source: The prediction may not be correct, especially when an object collides with another object during the physics tick.
es: La predicción puede no ser correcta, especialmente cuando un objeto colisiona con otro objeto durante el tic de física.
fr: Il se peut que la prédiction ne soit pas correcte, surtout lorsqu'un objet entre en collision avec un autre durant le tic physique.
zh_cn: 预测可能是不准确的，尤其是在物理周期中该对象与另一个对象发生碰撞的时候。

source: Where a prediction was incorrect, the object may extrapolate into an "impossible" position, like inside a wall.
es: Cuando una predicción es incorrecta, el objeto puede extrapolar hacia una posición "imposible", como dentro de una pared.
fr: Là où une prédiction était incorrecte, l'objet peut être extrapolé vers une position "impossible", telle que dans un mur.
zh_cn: 预测错误的时候，该对象就可能外插到“不可能”的位置，类似于墙体的内部。

source: Providing the movement speed is slow, these incorrect predictions may not be too much of a problem.
es: Si la velocidad de movimiento es lenta, es posible que estas predicciones incorrectas no sean un problema grave.
fr: Si la vitesse de déplacement est lente, ces prédictions incorrectes ne seront probablement pas problématiques.
zh_cn: 如果运动速度比较慢，这些错误的预测可能不会造成太大的问题。

source: When a prediction was incorrect, the object may have to jump or snap back onto the corrected path. This can be visually jarring.
es: Cuando una predicción es incorrecta, el objeto puede tener que saltar o volver rápidamente a la trayectoria corregida. Esto puede ser visualmente desorientador o incómodo para el jugador.
fr: Lorsqu'une prédiction était incorrecte, l'objet peut devoir sauter ou revenir rapidement sur le chemin corrigé. Ceci peut être visuellement discordant.
zh_cn: 预测错误的时候，该对象可能必须跳跃或者吸附回正确路径。看起来就会非常扎眼。

source: Fixed timestep interpolation
es: Interpolación con paso de tiempo fijo
zh_cn: 固定步长插值

source: In Godot this whole system is referred to as physics interpolation, but you may also hear it referred to as **"fixed timestep interpolation"**, as it is interpolating between objects moved with a fixed timestep (physics ticks per second). In some ways the second term is more accurate, because it can also be used to interpolate objects that are not driven by physics.
es: En Godot, todo este sistema se conoce como "interpolación de física", pero también puede escucharlo referido como **"interpolación con paso de tiempo fijo"**, ya que está interpolando entre objetos movidos con un paso de tiempo fijo (tics de física por segundo). En ciertos aspectos, el segundo término es más preciso, porque también se puede utilizar para interpolar objetos que no están impulsados por la física.
fr: Dans Godot, ce système est souvent désigné "interpolation physique", mais vous pouvez également le voir appelé **"interpolation à intervalles fixes"**, puisqu'il s'agit d'une interpolation entre des objets déplacés à des intervalles de temps fixes (des ticks physiques par seconde). Dans certains contextes le second terme est plus approprié puisqu'il est utilisé pour interpoler des objets qui ne sont pas affectés par la physique.
zh_cn: 在 Godot 中，这样的整个系统就叫做物理插值，不过你可能还听说过\ **“固定步长插值”**\ 这样的叫法，这是因为在做插值的是在固定时间步长（每秒物理周期数）中移动前后的对象。某种意义上第二种术语更加准确，因为还可以被插值的对象也可以不是由物理驱动移动的。

source: Although physics interpolation is usually a good choice, there are exceptions where you may choose not to use Godot's built-in physics interpolation (or use it in a limited fashion). An example category is internet multiplayer games. Multiplayer games often receive tick or timing based information from other players or a server and these may not coincide with local physics ticks, so a custom interpolation technique can often be a better fit.
es: Aunque la interpolación de física suele ser una buena opción, hay excepciones donde puede que decidas no utilizar la interpolación de física incorporada en Godot (o usarla de manera limitada). Un ejemplo son los juegos multijugador en línea. Los juegos multijugador a menudo reciben información basada en tics o tiempos de otros jugadores o un servidor, y estos pueden no coincidir con los tics de física locales, por lo que una técnica de interpolación personalizada puede ser una opción más adecuada.
fr: Bien que l'interpolation physique soit typiquement un bon choix, il existe des exceptions où vous choisirez de ne pas utiliser le système d'interpolation (ou vous l'utiliserez de façon limitée). Les jeux multijoueurs en ligne sont un exemple d'une telle exception. Les jeux multijoueurs reçoivent souvent des tics ou de l'information temporelle des autres joueurs ou d'un serveur, et ceux-ci ne coïncideront pas nécessairement aux tics physiques locaux, alors une technique d'interpolation personnalisée peut être une meilleure option.
zh_cn: 尽管物理插值通常是不错的选择，但还是存在例外情况的，你可能不会想要使用 Godot 内置的物理插值（或者进行有限的使用）。互联网多人游戏就是一种例子。多人游戏经常会从其他玩家或者服务器获取周期和基于时间的信息，这些信息可以与本地物理周期是不同步的，所以做自定义插值可能更加合适。

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
