Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/c_sharp/c_sharp_features.po
Languages: pt_br

source: C# features
pt_br: Funcionalidades do C#

source: This page provides an overview of the commonly used features of both C# and Godot and how they are used together.
pt_br: Esta página fornece uma visão geral sobre os recursos comumente usados no C# e no Godot e como eles são usados juntos.

source: Type conversion and casting
pt_br: Conversão de Tipos e Casting

source: C# is a statically typed language. Therefore, you can't do the following:
pt_br: C# é uma linguagem estaticamente tipada. Portanto, você não pode fazer o seguinte:

source: The method ``GetNode()`` returns a ``Node`` instance. You must explicitly convert it to the desired derived type, ``Sprite`` in this case.
pt_br: O método ``GetNode()`` retorna uma instância do ``Node``. Você deve explicitamente converter para o tipo derivado desejado, ``Sprite`` neste caso.

source: For this, you have various options in C#.
pt_br: Para isso, você tem várias opções em C#.

source: **Casting and Type Checking**
pt_br: **Casting e Verificação de Tipo**

source: Throws ``InvalidCastException`` if the returned node cannot be cast to Sprite. You would use it instead of the ``as`` operator if you are pretty sure it won't fail.
pt_br: Lança ``InvalidCastException`` se o nó retornado não puder ser convertido em Sprite. Você o usaria em vez do operador ``as`` se tiver certeza de que não falhará.

source: **Using the AS operator**
pt_br: **Usando o operador AS**

source: The ``as`` operator returns ``null`` if the node cannot be cast to Sprite, and for that reason, it cannot be used with value types.
pt_br: O operador ``as`` retorna ``null`` se o nó não pode ser convertido para Sprite, e por esta razão, não pode ser usado com tipos de valor.

source: **Using the generic methods**
pt_br: **Usando os métodos genéricos**

source: Generic methods are also provided to make this type conversion transparent.
pt_br: Métodos genéricos também são providenciados para fazer esse tipo de conversão transparente.

source: ``GetNode<T>()`` casts the node before returning it. It will throw an ``InvalidCastException`` if the node cannot be cast to the desired type.
pt_br: ``GetNode<T>()`` faz a conversão do nó antes de retorná-lo. Um erro do tipo ``InvalidCastException`` será retornado caso o nó não possa ser convertido para o tipo desejado.

source: ``GetNodeOrNull<T>()`` uses the ``as`` operator and will return ``null`` if the node cannot be cast to the desired type.
pt_br: ``GetNodeOrNull<T>()`` usa o operador ``as`` e retornará ``null`` se o código não puder ser convertido para o tipo desejado.

source: **Type checking using the IS operator**
pt_br: **Verificação de tipo usando o operador IS**

source: To check if the node can be cast to Sprite, you can use the ``is`` operator. The ``is`` operator returns false if the node cannot be cast to Sprite, otherwise it returns true.
pt_br: Para verificar se o nó pode ser fundido para Sprite, você pode usar o operador ``is``. O operador ``is`` retorna falso se o nó não pode ser fundido para Sprite, caso contrário, ele retorna verdadeiro.

source: For more advanced type checking, you can look into `Pattern Matching <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
pt_br: Para uma verificação de tipos mais avançada, você pode procurar em `Correspondência de Padrões <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.

source: For a complete C# example, see the **Handling a signal** section in the step by step :ref:`doc_scripting` tutorial.
pt_br: Para um exemplo completo de C#, veja a seção **Manipulando um sinal** no tutorial passo a passo :ref:`doc_scripting`.

source: Declaring a signal in C# is done with the ``[Signal]`` attribute on a delegate.
pt_br: A declaração de um sinal em C# é feito com o atributo ``[Signal]`` em um delegate.

source: These signals can then be connected either in the editor or from code with ``Connect``. If you want to connect a signal in the editor, you need to (re)build the project assemblies to see the new signal. This build can be manually triggered by clicking the “Build” button at the top right corner of the editor window.
pt_br: Esses sinais podem então ser conectados no editor ou no código com ``Connect``. Se você quiser conectar um sinal no editor, você precisa (re)build as DLLs do projeto para ver o novo sinal. Esta compilação pode ser acionada manualmente clicando no botão "Build" no canto superior direito da janela do editor.

source: Emitting signals is done with the ``EmitSignal`` method.
pt_br: A emissão de sinais é feita com o método ``EmitSignal``.

source: Notice that you can always reference a signal name with the ``nameof`` keyword (applied on the delegate itself).
pt_br: Observe que você sempre pode referenciar um nome de sinal com a palavra-chave ``nameof`` (aplicada no próprio delegate).

source: Signals support parameters and bound values of all the `built-in types <https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ and Classes derived from :ref:`Godot.Object <class_Object>`. Consequently, any ``Node`` or ``Reference`` will be compatible automatically, but custom data objects will need to extend from `Godot.Object` or one of its subclasses.
pt_br: Sinais suportam parâmetros e valores vinculados de todos os `tipos internos <https://docs.microsoft.com/pt-br/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ e Classes derivadas de :ref:`Godot.Object <class_Object>`. Consequentemente, qualquer ``Node`` ou ``Reference`` será compatível automaticamente, mas os objetos de dados personalizados precisarão ser estendidos de `Godot.Object` ou de uma de suas subclasses.

source: Finally, signals can be created by calling ``AddUserSignal``, but be aware that it should be executed before any use of said signals (with ``Connect`` or ``EmitSignal``).
pt_br: Finalmente, os sinais podem ser criados chamando ``AddUserSignal``, mas esteja ciente de que ele deve ser executado antes de qualquer uso de tais sinais (com ``Connect`` ou ``EmitSignal``).

source: Preprocessor defines
pt_br: Definições de pré-processamento

source: Godot has a set of defines that allow you to change your C# code depending on the environment you are compiling to.
pt_br: Godot tem um conjunto de definições que permite a você mudar seu código C# dependendo do ambiente para o qual está compilando.

source: If you created your project before Godot 3.2, you have to modify or regenerate your `csproj` file to use this feature (compare ``<DefineConstants>`` with a new 3.2+ project).
pt_br: Se você criou seu projeto antes do Godot 3.2, você tem que modificar ou regenerar seu arquivo `csproj` para utilizar esta funcionalidade (compare ``<DefineConstants>``` com um novo projeto 3.2+).

source: Examples
pt_br: Exemplos

source: For example, you can change code based on the platform:
pt_br: Por exemplo, você pode alterar o código baseado na plataforma:

source: Or you can detect which engine your code is in, useful for making cross-engine libraries:
pt_br: Ou você pode detectar em qual engine seu código está, útil para fazer bibliotecas cross-engine:

source: Full list of defines
pt_br: Lista completa de definições

source: ``GODOT`` is always defined for Godot projects.
pt_br: ``GODOT`` é sempre definido para projetos Godot.

source: One of ``GODOT_64`` or ``GODOT_32`` is defined depending on if the architecture is 64-bit or 32-bit.
pt_br: Um dos ``GODOT_64`` ou ``GODOT_32`` são definidos dependendo se a arquitetura é 64-bit ou 32-bit.

source: When **exporting**, the following may also be defined depending on the export features:
pt_br: Ao **exportar**, o seguinte também pode ser definido dependendo das características de exportação:

source: One of ``GODOT_PC``, ``GODOT_MOBILE``, or ``GODOT_WEB`` depending on the platform type.
pt_br: Um dos ``GODOT_PC``, ``GODOT_MOBILE``, ou ``GODOT_WEB``, dependendo do tipo de plataforma.

source: One of ``GODOT_ARM64_V8A`` or ``GODOT_ARMEABI_V7A`` on Android only depending on the architecture.
pt_br: Um dos ``GODOT_ARM64_V8A`` ou ``GODOT_ARMEABI_V7A`` apenas no Android dependendo da arquitetura.

source: One of ``GODOT_ARM64`` or ``GODOT_ARMV7`` on iOS only depending on the architecture.
pt_br: Um dos ``GODOT_ARM64`` ou ``GODOT_ARMV7`` apenas no iOS, dependendo da arquitetura.

source: Any of ``GODOT_S3TC``, ``GODOT_ETC``, and ``GODOT_ETC2`` depending on the texture compression type.
pt_br: Um dos ``GODOT_S3TC``, ``GODOT_ETC``, ou ``GODOT_ETC2``, dependendo do tipo de compressão de textura.

source: Any custom features added in the export menu will be capitalized and prefixed: ``foo`` -> ``GODOT_FOO``.
pt_br: Quaisquer recursos personalizados adicionados no menu de exportação serão capitalizados e prefixados: ``foo`` -> ``GODOT_FOO``.

source: To see an example project, see the OS testing demo: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
pt_br: Para ver um exemplo de projeto, veja um teste de demo de OS: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
