Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/misc/jitter_stutter.po
Languages: de, ja, ru

source: Fixing jitter and stutter
de: Zittern und stottern beheben
ja: ジッターとスタッターの解消
ru: Исправление джиттеров и задержек

source: What are jitter and stutter?
de: Was ist zittern und stottern?
ja: ジッターとスタッターとは何ですか？
ru: Что такое джиттеры и задержки?

source: *Jitter* and *stutter* are two different alterations to visible motion of objects on screen that may affect a game, even when running at full speed. These effects are mostly visible in games where the world moves at a constant speed in a fixed direction, like runners or platformers.
de: *Zittern* und *Stottern* sind zwei verschiedene Änderungen der sichtbaren Bewegung von Objekten auf dem Bildschirm, die sich auf ein Spiel auswirken können, selbst wenn sie mit voller Geschwindigkeit laufen. Diese Effekte sind vor allem in Spielen sichtbar, in denen sich die Welt mit konstanter Geschwindigkeit in eine feste Richtung bewegt, wie Laufspiele oder Plattformer.
ja: *ジッター* および *スタッター* は、フルスピードで実行している場合でも、ゲームに影響を与える可能性のある画面上のオブジェクトの目に見える動きに対する2つの異なる変化です。これらの効果は、ランナーやプラットフォーマーなど、世界が一定の方向に一定の速度で移動するゲームでほとんど見られます。
ru: *Джиттер* и *задержка* это два разных изменения в визуальном движении объектов по экрану которые могут влиять на игру, даже при запуске на полной скорости. Эти эффекта главным образом видны в играх где мир движется с постоянной скоростью в фиксированном направлении, такие как раннеры или платформеры.

source: Distinguishing between them
de: Unterscheiden zwischen beiden
ja: それぞれを区別する
ru: Различия между ними

source: A game running at a normal framerate without exhibiting any effect will appear smooth:
de: Ein Spiel, das mit einer normalen Framerate läuft, ohne einen Effekt zu zeigen, erscheint flüssig:
ja: それらの効果を示さずに通常のフレームレートで実行されているゲームはスムーズに表示されます:
ru: Игра запущенная с нормальной частотой кадров и без использования эффектов будет проигрываться гладко:

source: A game exhibiting *jitter* will shake constantly in a very subtle way:
de: Ein Spiel mit *zittern* wird sich ständig auf sehr subtile Weise minimal bewegen:
ja: *ジッター*を示すゲームは非常に微妙な方法で絶えず揺れます:
ru: Игра с *джиттером* будет постоянно дёргаться в непонятной манере:

source: Finally, a game exhibiting *stutter* will appear smooth, but appear to *stop* or *roll back a frame* every few seconds:
de: Schließlich erscheint ein Spiel mit *stottern* flüssig, scheint jedoch alle paar Sekunden *anzuhalten* oder *einen Frame zurückzusetzen*:
ja: 最後に、\ *スタッター* を呈するゲームは一見滑らかに見えますが、数秒ごとに *停止* または*ロールバック* をおこします。
ru: Наконец, игра с *задержкой* будет проигрываться плавно, но будет *приостанавливаться* или *откатывать кадр назад* каждые пару секунд:

source: Jitter
de: Zittern
ja: ジッター
ru: Джиттер

source: There can be many causes of jitter, the most typical one happens when the game *physics frequency* (usually 60 Hz) runs at a different resolution than the monitor refresh rate. Check whether your monitor refresh rate is different from 60 Hz.
de: Es kann viele Ursachen für zittern geben. Die typischste tritt auf, wenn die *Physikfrequenz* des Spiels (normalerweise 60 Hz) mit einer anderen Auflösung als die Monitor-Aktualisierungsrate läuft. Überprüfen Sie, ob die Aktualisierungsrate Ihres Monitors eine andere als 60 Hz ist.
ja: ジッターの原因は数多くありますが、最も一般的なものは、ゲームの *物理周波数* (通常は60Hz)がモニタのリフレッシュレートとは異なる解像度で実行されたときに起こります。モニタのリフレッシュレートが60Hzと異なっているかどうかを確認します。
ru: Существует много причин вызывающие джиттер, самая обычная возникает когда игра с *частотой физики* (обычно 60 Гц) запускается в разрешении отличном от частоты обновления монитора. Проверьте если ваша частота монитора отличается от 60 Гц.

source: This is generally not a problem, given that most monitors are 60 Hz, and starting with Godot 3.1, a frame timer was introduced that tries to synchronize with refresh as well as possible.
de: Das ist normalerweise kein Problem, da die meisten Monitore 60Hz unterstützen und Godot ab Version 3.1 einen Timer besitzt, der so gut es geht einen Refresh zu synchronisieren versucht .

source: Sometimes only some objects appear to jitter (character or background). This happens when they are processed in different time sources (one is processed in the physics step while another is processed in the idle step). Godot 3.1 does some improvements to this, from allowing kinematic bodies to be animated in the regular _process loop, to further fixes in the frame timer.
de: Manchmal scheinen nur einige Objekte zu zittern (Charakter oder Hintergrund). Dies geschieht, wenn sie in verschiedenen Zeitquellen verarbeitet werden (eine wird im Physikschritt verarbeitet, während eine andere im Leerlaufschritt verarbeitet wird). Godot 3.1 verbessert dies, angefangen von der Animation von kinematischen Körpern in der regulären _process-Schleife bis hin zu weiteren Korrekturen im Frame-Timer.
ja: 場合によっては、一部のオブジェクトのみが揺れているように見えます(文字または背景)。これは、異なるタイムソースで処理された場合に発生します(1つは物理ステップで処理され、もう1つはアイドルステップで処理されます)。Godot 3.1では、キネマティックボディを通常の_processループでアニメーション化できるようにすることや、フレームタイマーをさらに修正することまで、いくつかの改善を加えています。
ru: Иногда только некоторые объекты начинают джиттерить (персонажи или задний фон). Это возникает когда они обрабатываются через различные источники времени (один обрабатывается на стадии физики, тогда как другой на стадии ожидания). Godot 3.1 внёс некоторые улучшения в эти процессы, от допуска тел с кинематикой к анимации в обычном цикле _process, до дальнейших исправлений в таймере кадра.

source: You can use physics interpolation to mitigate physics-related jittering. See `lawnjelly's smoothing-addon <https://github.com/lawnjelly/smoothing-addon>`__ for an add-on that can be dropped into any project to enable physics interpolation.
de: Sie können die Physikinterpolation verwenden, um physikbedingtes Zittern zu verringern. Ein Add-On, das in jedes Projekt eingefügt werden kann um die Interpolation der Physik zu ermöglichen, finden Sie unter `Lawnjelly's Glättungs-Addon <https://github.com/lawnjelly/smoothing-addon>`__.

source: Stutter
de: Stottern
ja: スタッター
ru: Задержка

source: Stutter may happen due to two different reasons. The first, and most obvious one, is the game not being able to keep full framerate performance. Solving this is game specific and will require optimization.
de: Stottern kann aus zwei verschiedenen Gründen auftreten. Das erste und offensichtlichste ist, dass das Spiel nicht in der Lage ist, die volle Framerate-Leistung aufrechtzuerhalten. Die Lösung hierfür ist abhängig vom Spiel und erfordert eine Optimierung.
ja: スタッターは、2つの異なる理由で発生する可能性があります。最初の、そして最も明白なものは、ゲームがフルフレームレートのパフォーマンスを維持できないことです。これを解決することはゲーム固有の命題であり、最適化が必要です。
ru: Задержка может возникнуть из-за двух разных причин. Первое, и самое очевидное, если игра не может поддерживать производительность частоты кадров. Исправление этого зависит от игры и может потребоваться провести оптимизацию.

source: The second is more complicated, because it is often not associated to the engine or game but the underlying operating system. Here is some information regarding stutter on different OSs.
de: Die zweite ist komplizierter, da sie häufig nicht der Engine oder dem Spiel, sondern dem zugrunde liegenden Betriebssystem zugeordnet ist. Hier finden Sie einige Informationen zum Stottern auf verschiedenen Betriebssystemen.
ja: 2つ目はより複雑です。これは、多くの場合、エンジンやゲームではなく、実行基盤のオペレーティングシステムに関連付けられているためです。さまざまなOSでのスタッターに関する情報を次に示します。
ru: Другая причина более сложная, поскольку часто не связывается с движком или игрой но зависит от операционной системы. Здесь показана некоторая информация о задержках на различных OS.

source: Windows is known to cause stutter in windowed games. This mostly depends on the hardware installed, drivers version and processes running in parallel (e.g. having many browser tabs open may cause stutter in a running game). To avoid this, starting with 3.1, Godot raises the game priority to "Above Normal". This helps considerably but may not completely eliminate stutter.
de: Es ist bekannt, dass Windows beim spielen im Fenstermodus Stottern verursacht. Dies hängt hauptsächlich von der installierten Hardware, der Treiberversion und den parallel ausgeführten Prozessen ab (z.B. kann das Öffnen vieler Browser-Registerkarten in einem laufenden Spiel zu Ruckeln führen). Um dies zu vermeiden erhöht Godot ab 3.1 die Spielpriorität auf "Über Normal". Dies hilft erheblich, kann jedoch das Stottern nicht vollständig beseitigen.
ja: Windowsは、ウィンドウで動作するゲームでスタッターを引き起こすことが知られています。これは主に、インストールされているハードウェア、ドライバーのバージョン、および並行して実行されているプロセスに依存します(たとえば、多くのブラウザタブを開いていると、実行中のゲームの動きが途切れることがあります)。
ru: Система Windows часто вызывает задержки в оконных играх. Это часто зависит от установленного железа, версий драйверов или процессов запущенных параллельно (т.е. если открыто много вкладок браузера это может привести в задержкам в запущенной игре). Для избегания этого, начиная с 3.1, Godot поднимает приоритет игрового процесса на *Выше Нормального*. Это значительно помогает, но может не до конца исправлять задержки.

source: Eliminating this completely requires giving your game full privileges to become "time critical", which is not advised. Some games may do it, but it is advised to learn to live with this problem, as it is common for Windows games and most users won't play games windowed (games that are played in a window, e.g. puzzle games, will usually not exhibit this problem anyway).
de: Um dies vollständig zu beseitigen, müssen Sie Ihrem Spiel die vollen Berechtigungen geben, um "zeitkritisch" zu werden, was nicht empfohlen wird. Einige Spiele können dies tun, es wird jedoch empfohlen mit diesem Problem zu leben, da dies bei Windows-Spielen üblich ist und die meisten Benutzer keine Spiele im Fenstermodus spielen (Spiele, die in einem Fenster gespielt werden, z.B. Puzzlespiele, zeigen normalerweise nicht dieses Problem).
ja: これを完全に排除するには、ゲームに「タイムクリティカル」になるための完全な権限を与える必要がありますが、これはお勧めしません。一部のゲームはそれを行う場合がありますが、この問題に耐えることを学ぶことをお勧めします。この問題はWindowsゲームでは一般的であり、また、ほとんどのユーザーはウィンドウでゲームをプレイしません(ウィンドウでプレイされるゲーム、たとえばパズルゲームでは、通常、この現象は問題にされません)。

source: For fullscreen, Windows gives special priority to the game so stutter is no longer visible and very rare. This is how most games are played.
de: Für den Vollbildmodus legt Windows besonderen Wert auf das Spiel, sodass Stottern nicht mehr sichtbar und sehr selten ist. So werden die meisten Spiele gespielt.
ja: フルスクリーンの場合、Windowsはゲームに特別な優先順位を与えるため、スタッターは表示されなくなり、非常にまれになります。これが、ほとんどのゲームのプレイ状態です。
ru: Для полноэкранного режима, Windows даёт игре специальный приоритет, так что игровые задержки не будут видны и станут очень редкими. Так работает большинство игр.

source: Stutter may be visible on Desktop Linux, but this is usually associated with different video drivers and compositors. Nouveau drivers often exhibit this, while AMD or NVidia proprietary don't. Some compositors may also trigger this problem (e.g. KWin), so it is advised to try using a different one to rule it out as the cause.
de: Unter Desktop Linux kann Stottern sichtbar sein, dies ist jedoch normalerweise mit verschiedenen Grafiktreibern und Compositors verbunden. Nouveau-Treiber weisen dies häufig auf, AMD- oder NVidia-eigene nicht. Einige Compositors können dieses Problem auch auslösen (z.B. KWin). Es wird daher empfohlen einen anderen zu verwenden, um dies als Ursache auszuschließen.
ja: スタッターはデスクトップLinuxで表示される場合がありますが、これは通常、個別のビデオドライバーとウィンドウマネージャが原因になります。Nouveauドライバーはしばしばこれを示しますが、AMDまたはNVidia独自のものは示しません。一部のウィンドウマネージャもこの問題を引き起こす可能性があります(KWinなど)。そのため、別のウィンドウマネージャを使用して原因を除外することをお勧めします。
ru: Задержка может быть видима в Десктопном Linux, но обычно она связывается с различными видео драйверами или композиторами. Драйверы Nouveau часто демонстрируют это, тогда как проприетарные AMD или NVidia - нет. Некоторые композиторы могут вызывать эту проблему(напр. KWin), так что советуем пытаться пробовать другие если какой-то вызывает проблему.

source: There is no workaround for driver or compositor stuttering other than reporting it as an issue to the driver or compositor developers.
de: Es gibt keine andere Problemumgehung für das Stottern von Treibern oder Compositors, als es den Treiber- oder Compositor-Entwicklern als Problem zu melden.
ja: ドライバーまたはウィンドウマネージャの開発者に問題として報告する以外に、ドライバーまたはウィンドウマネージャによるスタッターに対する回避策はありません。
ru: Не существует обходных путей для исправления задержек в драйвере или композиторе кроме как сообщения о проблеме разработчикам драйвера или композитора.

source: Generally, macOS is stutter-free, although recently some bugs were reported when running on fullscreen (this is a macOS bug). If you have a machine exhibiting this behavior, please let us know.
de: Im Allgemeinen ist MacOS ruckelfrei, obwohl kürzlich einige Fehler beim Ausführen im Vollbildmodus gemeldet wurden (dies ist ein MacOS-Fehler). Wenn Sie eine Maschine haben die dieses Verhalten zeigt, teilen Sie uns dies bitte mit.
ja: 一般的に、macOSはスタッターが発生しませんが、最近はフルスクリーンで実行しているときにいくつかのバグが報告されました(これはmacOSのバグです)。この動作を示す機械がある場合は、お知らせください。
ru: В целом, macOS свободна от задержек, хотя недавно были найдены некоторые ошибки при запуске в полноэкранном режиме. Если вы владеете устройством демонстрирующим данное поведение, пожалуйста сообщите нам.

source: Generally, Android is stutter and jitter-free because the running activity gets all the priority. That said, there may be problematic devices (older Kindle Fire is known to be one). If you see this problem on Android, please let us know.
de: Im Allgemeinen ist Android frei von stottern und zittern, da die laufende Aktivität Vorrang hat. Es kann jedoch problematische Geräte geben (z.B. ältere Kindle Fire). Wenn Sie dieses Problem auf Android sehen, lassen Sie es uns bitte wissen.
ja: 一般に、Androidは実行中のアクティビティがすべて優先されるため、スタッターとジッターがありません。ただし、問題のあるデバイスが存在する可能性があります(古いKindle Fireはその1つであることが知られています)。Androidでこの問題が発生した場合は、お知らせください。
ru: Android в целом лишён джиттеров и задержек поскольку запущенный процесс получает полный приоритет. Однако, на некоторых устройствах могут возникать проблемы (старые Kindle Fire известны этим). Если вы увидели проблему на вашем Android устройстве, пожалуйста сообщите нам.

source: iOS devices are generally stutter-free, but older devices running newer versions of the operating system may exhibit problems. This is generally unavoidable.
de: iOS-Geräte sind im Allgemeinen ruckelfrei, ältere Geräte auf denen neuere Versionen des Betriebssystems ausgeführt werden, können jedoch Probleme aufweisen. Dies ist in der Regel unvermeidlich.
ja: iOSデバイスは通常、スタッターがありませんが、新しいバージョンのオペレーティングシステムを実行している古いデバイスでは問題が発生する場合があります。これは一般的に避けられません。
ru: Устройства iOS в целом работают без задержек, но на старых устройствах запущенных на новых версиях операционной системы могут проявляться ошибки. Это в целом нельзя избежать.

source: Reporting stutter or jitter problems
de: Probleme mit stotter oder zittern melden
ja: スタッターまたはジッターの問題の報告
ru: Доклад о задержках и джиттерах

source: If you are reporting a stutter or jitter problem (opening an issue) not caused by any of the above reasons, please specify very clearly all the information possible about device, operating system, driver versions, etc. This may help to better troubleshoot it.
de: Wenn Sie ein Stottern oder Zittern melden (ein Problem eröffnen), das nicht aus einem der oben genannten Gründe verursacht wurde, geben Sie bitte alle möglichen Informationen zu Gerät, Betriebssystem, Treiberversionen usw. sehr detailliert an. Dies kann zur besseren Fehlerbehebung beitragen.
ja: 上記の理由のいずれでもないスタッターまたはジッターの問題を報告する(issueを開く)場合は、デバイス、オペレーティングシステム、ドライバーのバージョンなどについて可能な限りすべての情報を明確に指定してください。
ru: Если вы докладываете о задержке или джиттере (открывая проблему) не вызванную ни какой из вышеперечисленных проблем, пожалуйста точно опишите информацию об устройстве, операционной системе, версии драйверов, итд. Это может помочь для лучшего решения.

source: Also make sure to use the correct term (jitter or stutter) based on the exhibited behavior. This will help understand your issue much faster. Provide a project that can be used to reproduce the issue, and if possible a screen capture demonstrating the bug.
de: Stellen Sie außerdem sicher, dass Sie den richtigen Begriff (Zittern/Jitter oder Stottern/Stutter) verwenden, der auf dem gezeigten Verhalten basiert. Dies hilft uns Ihr Problem viel schneller zu verstehen. Stellen Sie ein Projekt bereit, mit dem das Problem reproduziert werden kann und wenn möglich einen Screenshot der den Fehler demonstriert.
ja: また、発生した動作に基づいて正しい用語(ジッターまたはスタッター)を使用するようにしてください。これにより、問題をより迅速に理解できます。問題の再現に使用できるプロジェクトを提供し、可能であればバグを示すスクリーンキャプチャを提供します。
ru: Также убедитесь что используете правильную терминологию (джиттер(jitter) или задержка(stutter)) в зависимости от наблюдаемого поведения. Это помогает намного быстрее понять вашу проблему. Предоставьте проект демонстрирующий вашу проблему, и если возможно видео захват экрана с демонстрацией ошибки.

source: This is generally not a problem, given that refresh rates higher than 60 Hz are barely visible to the human eye, and starting with Godot 3.1, a frame timer was introduced that tries to synchronize with refresh as best as possible.
ja: これは一般に問題ではありません。60Hzを超えるリフレッシュレートは人間の目にはほとんど見えないため、Godot 3.1から、可能な限りリフレッシュと同期しようとするフレームタイマーが導入されました。

source: Windows
ru: Windows (Окно)
