Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/visual_script/what_*_visual_scripting.po
Languages: cs, de, es, fr, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: What is Visual Scripting
cs: Co je vizuální skriptování
de: Was ist visuelles Skripten
es: Qué es Visual Scripting
fr: Qu'est-ce que le Visual Scripting
ja: ビジュアル・スクリプトとは何か
ko: Visual Scripting(비주얼 스크립팅)은 무엇인가요
pl: Czym jest Visual Scripting
pt_br: O que é o Visual Scripting
ru: Что такое Визуальное Программирование
uk: Що таке Visual Scripting
zh_cn: 什么是可视化脚本
zh_tw: 什麼是視覺腳本

source: Visual Scripting is a tool designed to make the entry barrier to programming much lower. As code is more visual, it needs less abstract thinking to be understood. Any artist, animator, game designer, etc. can look at it and quickly grasp the flow of logic.
cs: Visual Scripting je nástroj, který má výrazně snížit vstupní bariéru do programování. Protože je kód více vizuální, vyžaduje méně abstraktního myšlení, aby byl pochopen. Každý umělec, animátor, herní designér atd. se na něj může podívat a rychle pochopit tok logiky.
de: VisualScript ist ein Tool mit dem die Eintrittsbarriere für die Programmierung erheblich verringert werden soll. Da Code visueller ist, muss weniger abstrakt gedacht werden, um verstanden zu werden. Jeder Künstler, Animator, Spieledesigner usw. kann es sich ansehen und schnell den Fluss der Logik erfassen.
es: Visual Scripting es una herramienta designada a bajar la barrera de entrada de programación. Como el código es más visual, necesita menor pensamiento abstracto para comprenderlo. Cualquier artista, animador, diseñador, etc. puede mirarlo y comprender el flujo de la lógica.
fr: Le Visual Scripting est un outil conçu pour rendre la barrière d'entrée à la programmation beaucoup plus basse. Comme le code est plus visuel, il a besoin de moins de pensée abstraite pour être compris. N'importe quel artiste, animateur, concepteur de jeux, etc. peut le regarder et saisir rapidement le flux de la logique.
ja: ビジュアル・スクリプトは、プログラミングへの入り口の障壁をはるかに低くするように設計されたツールです。コードは視覚的なものであるため、理解するための抽象的思考が少なくて済みます。どんなアーティスト、アニメーター、ゲームデザイナーなどもそれを見て、論理の流れを素早く把握することができます。
ko: Visual Scripting은 프로그래밍 진입 장벽을 낮추기 위해 고안된 툴입니다. 코드보다 더 시각적이어서 이해하는데 쉽습니다. 아티스트, 애니메이터, 게임 디자이너 및 다른 사람들도 논리의 흐름을 쉽고 빠르게 파악할 수 있습니다.
pl: Visual Scripting jest narzędziem, które ma na celu zmniejszenie bariery wejścia na rynek programowania. Ponieważ kod jest rozrysowany w specjalnych blokach, wymaga mniejszej ilości abstrakcyjnego myślenia. Każdy artysta, animator, projektant gier itp. może na to spojrzeć i szybko zrozumieć logikę kodu.
pt_br: O Visual Scripting é uma ferramenta projetada para tornar a barreira de entrada para programação muito mais baixa. Como o código é mais visual, ele precisa de menos pensamento abstrato para ser entendido. Qualquer artista, animador, designer de jogos, etc., pode olhar para ele e captar rapidamente o fluxo da lógica.
ru: Визуальное Программирование - это инструмент, предназначенный для того, чтобы сделать входной барьер для программирования намного ниже. Поскольку код более нагляден, для его понимания необходимо меньше абстрактного мышления. Любой художник, аниматор, гейм-дизайнер и т.д. Может посмотреть на это и быстро понять поток логики.
uk: Visual Scripting - це інструмент, призначений знизити бар'єр для вступу до програмування. Оскільки код є більш візуальним, він потребує менш абстрактного мислення, для розуміння. Будь-який художник, аніматор, ігровий дизайнер тощо може подивитися на це і швидко зрозуміти потік логіки.
zh_cn: 可视化脚本（Visual Scripting）是一种工具，用于降低编程的入口壁垒。由于代码更直观，它需要较少的抽象思维来理解。任何艺术家、动画师、游戏设计师等都可以看到它，并快速掌握逻辑流程。
zh_tw: 視覺腳本是設計用來降低程式設計門檻的工具。因為程式碼變得視覺化，要理解程式碼便不需太多的抽象思考。任何美術家、動畫家、遊戲設計師…等都可以看視覺腳本並快速掌握邏輯流程。

source: The reason it does not make existing programming obsolete is, simply, that it does not scale as well. It takes considerably more time to create code with it, and it's often more difficult to modify than just writing a few characters.
cs: Důvodem, proč nepošle stávající programování do propadliště dějin, je jednoduše to, že se nedá dost dobře škálovat. Vytvoření kódu s ním zabere podstatně více času a jeho úprava je často obtížnější než pouhé napsání několika znaků.
de: Der Grund dafür, dass vorhandene Programme nicht überflüssig werden, ist einfach, dass sie nicht so gut skaliert werden. Das Erstellen von Code dauert erheblich länger und ist oft schwieriger zu ändern, als nur ein paar Zeichen zu schreiben.
es: La razón por la que no hace obsoleta la programación existente es, simplemente, que no escala muy bien. Toma más tiempo crear código con él y suele ser más difícil de modificar que sólo escribiendo unos pocos caracteres.
fr: La raison pour laquelle elle ne rend pas obsolète la programmation existante est simplement qu'elle n'évolue pas aussi bien. Il faut beaucoup plus de temps pour créer du code avec, et il est souvent plus difficile à modifier que d'écrire quelques caractères.
ja: それが既存のプログラミングを時代遅れにしない理由は、単に、それが同様に拡大縮小しないということです。これを使ってコードを作成するにはかなり時間がかかります。また、数文字を書くよりも変更が難しいことがよくあります。
ko: 이것이 기존의 프로그래밍을 구식으로 만들지는 못합니다, 간단히 말해 확장이 잘 되지 못합니다. 코드로 만드는 것보다 훨씬 더 많은 시간이 소요되고, 때로는 단지 몇 글자를 수정하는 것보다 더 어렵습니다.
pl: Powodem, dla którego nie czyni on istniejącego programowania przestarzałym, jest po prostu fakt, że nie jest ono zbyt dobrze skalowalny. Tworzenie przy jego pomocy kodu trwa znacznie dłużej i często trudniej jest go zmodyfikować niż napisanie kilku znaków.
pt_br: A razão pela qual não torna obsoleta a programação existente é, simplesmente, que ela não se adapte tão bem. Demora consideravelmente mais tempo para criar código com ele, e geralmente é mais difícil modificar do que apenas escrever alguns caracteres.
ru: Причина, по которой это не делает существующее программирование устаревшим, заключается в том, что такой "код" не масштабируется так же хорошо. Для создания кода с его помощью требуется значительно больше времени, и зачастую его сложнее модифицировать, чем просто написание нескольких символов.
uk: Причина, по якій це не робить наявне програмування застарілим, полягає в тому, що воно не досить добре масштабується. Для створення коду потрібно значно більше часу, і його часто важче змінити, ніж просто написати кілька символів.
zh_cn: 它没有使现有编程过时的原因很简单, 就是它拓展性不强. 用它来创建代码要花费相当多的时间, 并且修改它通常比仅仅编写几个字符更困难.
zh_tw: 為什麼視覺腳本沒有取代現有的程式設計方法呢？很簡單，因為視覺化程式設計的延展性並不好，要使用視覺腳本來寫程式也需要花費更多的時間，同時，要修改東西也遠比改幾個字元來得困難。

source: With the misunderstanding cleared up, the question that remains is what are the practical uses for Visual Scripting.
cs: Po tomto vyjasnění zbývá otázka, jaké je praktické využití pro Visual Scripting.
de: Nachdem das Missverständnis geklärt ist, bleibt die Frage, welche praktischen Verwendungsmöglichkeiten für visuelles Skripten bestehen.
es: Con este malentendido aclarado, queda la cuestión de cuáles son los usos prácticos de Visual Scripting.
fr: Une fois l'incompréhension dissipée, la question qui demeure est de savoir quelles sont les utilisations pratiques des scripts visuels.
ja: 誤解が解消された今もなお残っている問題は、ビジュアルスクリプティングの実用的な用途は何かということです。
ko: 오해가 해결되면서, 남은 질문은 Visual Scripting의 실용적인 용도입니다.
pl: Po wyjaśnieniu nieporozumień pozostaje pytanie, jakie są praktyczne zastosowania skryptów wizualnych.
pt_br: Com o mal-entendido esclarecido, a questão que permanece é quais são os usos práticos para o Visual Scripting.
ru: С устранением недоразумений остается вопрос, каково практическое применение Визуального Программирования.
uk: Після усунення непорозумінь, залишається питання, що полягає у тому, які практичні можливості з Visual Scripting використовувати.
zh_cn: 随着误解的消除, 剩下的问题是可视化脚本的实际用途是什么.
zh_tw: 既然解除了誤解，剩下的問題就是視覺腳本實際用途是什麼。

source: The most common use cases are as follows:
cs: Nejčastější případy použití jsou následující:
de: Die gebräuchlichsten Anwendungsfälle sind:
es: Algunos casos de uso comunes son:
fr: Les cas d'utilisation les plus courants sont les suivants :
ja: 最も一般的な使用例は次のとおりです:
ko: 가장 일반적인 사용 케이스는 다음과 같습니다:
pl: Najczęstsze przypadki zastosowań są następujące:
pt_br: Os casos de uso mais comuns são os seguintes:
ru: Наиболее распространенные варианты использования следующие:
uk: Найбільш поширені випадки використання:
zh_cn: 最常见的用例如下:
zh_tw: 常見的使用情景如下：

source: Game development beginners who want to learn an engine but have no programming experience yet.
cs: Začátečníci ve vývoji her, kteří se chtějí naučit engine, ale zatím nemají žádné zkušenosti s programováním.
de: Anfänger in der Spieleentwicklung, die eine Engine erlernen möchten, aber noch keine Programmiererfahrung haben.
es: Desarrolladores de videojuegos principiantes que quieren aprender a utilizar el motor pero no tienen experiencia previa en programación.
fr: Les débutants en développement de jeu qui veulent apprendre un moteur mais n'ont pas encore d'expérience en programmation.
ja: エンジンを学びたいがまだプログラミング経験がないゲーム開発初心者。
ko: 엔진을 배우고 싶지만 아직 프로그래밍 경험이 전혀 없는 게임 개발 입문자.
pl: Początkujący twórcy gier, którzy chcą nauczyć się silnika, ale nie mają jeszcze doświadczenia w programowaniu.
pt_br: Iniciantes no desenvolvimento de jogos que desejam aprender um mecanismo, mas ainda não têm experiência em programação.
ru: Новички в разработке игр, которые хотят изучить движок, но еще не имеют опыта программирования.
uk: Його використовують початківці в розробці ігор, які хочуть вивчити движок, але ще не мають досвіду програмування.
zh_cn: 游戏开发新手, 想要学习引擎, 但还没有编程经验.
zh_tw: 像學習遊戲引擎卻缺乏程式設計經驗的遊戲開發新手。

source: Artists and Game Designers who have no experience in programming and want to create quick prototypes or simple games.
cs: Umělci a herní designéři, kteří nemají zkušenosti s programováním a chtějí vytvářet rychlé prototypy nebo jednoduché hry.
de: Künstler und Game Designer, die keine Programmiererfahrung haben und schnelle Prototypen oder einfache Spiele erstellen möchten.
es: Artistas y diseñadores de videojuegos que no tienen experiencia programando y quieren crear prototipos rápidos o juegos simples.
fr: Artistes et concepteurs de jeux qui n'ont aucune expérience en programmation et qui veulent créer des prototypes rapides ou des jeux simples.
ja: プログラミングの経験がなく、簡単なプロトタイプや簡単なゲームを作りたいアーティストやゲームデザイナー。
ko: 프로그래밍에 대한 경험이 없고 간단한 프로토타입이나 게임을 만들과 싶어하는 아티스트와 게임 디자이너.
pl: Artyści i projektanci gier, którzy nie mają doświadczenia w programowaniu i chcą tworzyć proste gry lub ich prototypy.
pt_br: Artistas e Game Designers que não têm experiência em programação e querem criar protótipos rápidos ou jogos simples.
ru: Художники и гейм-дизайнеры, которые не имеют опыта программирования и хотят быстро создавать прототипы или простые игры.
uk: Художники та дизайнери ігор, які не мають досвіду програмування та хочуть створювати швидкі прототипи, чи прості ігри.
zh_cn: 没有编程经验的艺术家和游戏设计师, 希望快速创建游戏原型或简单的游戏.
zh_tw: 沒有程式設計經驗但像建立快速原型或簡單遊戲的藝術家與遊戲設計師。

source: Programmers working in a team that want to make part of the game logic available to Artists or Game Designers in order to offload some of their work.
cs: Programátoři pracující v týmu, kteří chtějí část herní logiky zpřístupnit umělcům nebo herním designérům, aby se zbavili části své práce.
de: Programmierer, die in einem Team arbeiten und Künstlern oder Spieledesignern einen Teil der Spielelogik zur Verfügung stellen möchten, um einen Teil ihrer Arbeit zu verlagern.
es: Programadores trabajando en un equipo que quieren hacer que parte de la lógica esté disponible para artistas o diseñadores para liberar un poco la carga de trabajo.
fr: Les programmeurs travaillant en équipe qui veulent mettre une partie de la logique du jeu à la disposition des artistes ou des concepteurs de jeux afin de se décharger d'une partie de leur travail.
ja: ゲームロジックの一部をアーティストやゲームデザイナーが利用できるようにしたいチームで作業しているプログラマー。
ko: 팀으로 일하면서 아티스트나 게임 디자이너에게 게임 논리의 일부를 주어 그들의 작업량을 줄이기 원하는 프로그래머.
pl: Programiści pracujący w zespole, który chce udostępnić artystom lub projektantom gier część logiki gry, aby trochę ich odciążyć.
pt_br: Programadores que trabalham em uma equipe que deseja fazer parte da lógica do jogo disponível para artistas ou designers de jogos, a fim de descarregar parte de seu trabalho.
ru: Программисты, работающие в команде, которые хотят сделать часть игровой логики доступной для художников или гейм-дизайнеров , чтобы переложить часть своей работы на них.
uk: Програмісти, що працюють в команді, яка хоче зробити частину логіки гри доступною для художників, або дизайнерів ігор, щоб перекласти частину своєї роботи.
zh_cn: 在一个团队中工作的程序员, 希望将游戏逻辑的一部分提供给艺术家或游戏设计师, 以便减少他们的工作负担.
zh_tw: 在團隊內工作，想把遊戲部分邏輯交給藝術家或遊戲設計師控制，進而減少自己工作量的程式設計師。

source: These scenarios are far more common than one might think, so this is why Godot has added this feature.
cs: Tyto scénáře jsou mnohem častější, než by se mohlo zdát, a proto Godot přidal tuto funkci.
de: Diese Szenarien sind weitaus häufiger als man denkt, deshalb hat Godot diese Funktion hinzugefügt.
es: Esos escenarios son más comunes de lo que se cree, por eso es que Godot agregó esta característica.
fr: Ces scénarios sont beaucoup plus fréquents qu'on ne le pense, c'est pourquoi Godot a ajouté cette fonctionnalité.
ja: これらのシナリオは、思っているよりはるかに一般的なので、Godotがこれを追加しました。
ko: 이 시나리오는 생각보다 훨씬 더 흔합니다, 그래서 Godot가 이 기능을 추가한 것입니다.
pl: Te scenariusze są o wiele bardziej powszechne niż mogłoby się wydawać, dlatego też Godot dodał ten element.
pt_br: Esses cenários são muito mais comuns do que se imagina, então é por isso que Godot adicionou esse recurso.
ru: Эти сценарии встречаются гораздо чаще, чем можно подумать, именно поэтому Godot добавил эту функцию.
uk: Ці випадки зустрічаються доволі часто, тому Godot додав цю функцію.
zh_cn: 这些场景比人们想象的要普遍得多, 因此这就是Godot添加此功能的原因.
zh_tw: 這些情境比大家能想像的還要普遍，所以 Godot 才新增了視覺腳本功能。

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
ko: 번역 상태
pl: Status tłumaczenia
pt_br: Progresso da Tradução
ru: Translation status (статус перевода)
uk: Стан перекладу
zh_cn: 翻译状态
zh_tw: 翻譯狀態
