Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/cross_language_scripting.po
Languages: es, ja, ko, pt_br, zh_cn, zh_tw

source: Cross-language scripting
es: Scripting de varios lenguajes
ja: クロスランゲージでのスクリプト作成
ko: 언어간 스크립팅
pt_br: Scripting entre linguagens
zh_cn: 跨语言脚本
zh_tw: 跨語言腳本撰寫

source: Godot allows you to mix and match scripting languages to suit your needs. This means a single project can define nodes in both C# and GDScript. This page will go through the possible interactions between two nodes written in different languages.
es: Godot permite mezclar lenguajes de script según tus necesidades. Esto quiere decir que un proyecto puede definir nodos en C# y GDScript. Esta página mostrará las posibles interacciones entre dos nodos escritos en diferentes lenguajes.
ko: Godot에선 여러분에 필요에 맞춰 스크립트 언어를 조합해 사용할 수 있습니다. 따라서 하나의 프로젝트에서 C#과 GDScript 모두로 노드를 정의할 수도 있습니다. 이 페이지에서는 서로 다른 언어로 작성된 노드 사이에서 발생할 수 있는 상호작용을 살펴볼 것입니다.
pt_br: O Godot permite que você misture e combine linguagens de script para atender às suas necessidades. Isso significa que um único projeto pode definir nós tanto em C# quanto em GDScript. Esta página passará pelas possíveis interações entre dois nós escritos em diferentes linguagens.
zh_cn: Godot允许您混合和匹配脚本语言以满足您的需求. 这意味着一个项目可以同时用C#和GDScript定义节点. 本页将介绍用不同语言编写的两个节点之间可能的交互.
zh_tw: 在 Godot 中可以依照需求來混合使用不同的腳本語言。這表示，單一專案內可以同時以 C# 與 GDScript 來定義節點。本頁將介紹如何讓兩個以不同語言撰寫的節點該如何互動。

source: The following two scripts will be used as references throughout this page.
es: Los siguientes dos scripts se utilizarán como referencias a lo largo de esta página.
ja: 次の2つのスクリプトは、このページ全体で参照として使用されます。
ko: 아래의 두 스크립트를 이 페이지를 진행하는 동안 참조할 것입니다.
pt_br: Os dois scripts a seguir serão usados como referências ao longo desta página.
zh_cn: 以下两个脚本用在整个页面中作为参考.
zh_tw: 下列兩個腳本會在本頁中都會用來作為參考。

source: Instantiating nodes
es: Instanciando nodos
ja: ノードのインスタンス化
ko: 노드 인스턴스화 하기
pt_br: Instanciando nós
zh_cn: 实例化节点
zh_tw: 實體化節點

source: If you're not using nodes from the scene tree, you'll probably want to instantiate nodes directly from the code.
es: Si no estás usando nodos del árbol de escena, probablemente quieras instanciar nodos directamente desde código.
ja: シーンツリーのノードを使用していない場合は、コードから直接ノードをインスタンス化することをお勧めします。
ko: 씬 트리에서 노드를 사용하고 있는 것이 아니라면, 아마 노드를 코드에서 직접 인스턴스화 하는 것을 원하실겁니다.
pt_br: Se você não estiver usando nós da árvore da cena, provavelmente vai querer instanciar os nós diretamente do código.
zh_cn: 如果不使用场景树中的节点, 则可能需要直接从代码实例化节点.
zh_tw: 若不使用場景樹中的節點，則可以直接從程式碼中實體化節點。

source: Instantiating C# nodes from GDScript
es: Instanciando nodos C# desde GDScript
ja: GDScriptからのC#ノードのインスタンス化
ko: GDScript에서 C# 노드 인스턴스화 하기
pt_br: Instanciando nós C# a partir do GDScript
zh_cn: 在 GDScript 中实例化 C# 节点
zh_tw: 在 GDScript 中實體化 C# 節點

source: Using C# from GDScript doesn't need much work. Once loaded (see :ref:`doc_gdscript_classes_as_resources`), the script can be instantiated with :ref:`new() <class_CSharpScript_method_new>`.
es: Usar C# de GDScript no necesita mucho trabajo. Una vez cargado (ver :ref:`doc_gdscript_classes_as_resources`), el script puede ser instanciado con :ref:`new() <class_CSharpScript_method_new>`.
ko: C# 노드는 GDScript에서 어렵지 않게 사용할 수 있습니다. 로딩이 끝나면 (:ref:`doc_gdscript_classes_as_resources`를 참고하세요) :ref:`new() <class_CSharpScript_method_new>`로 스크립트를 인스턴스화 할 수 있습니다.
pt_br: Usar C# a partir do GDScript não precisa de muito trabalho. Uma vez carregado (veja :ref:`doc_gdscript_classes_as_resources`) o script pode ser instanciado com :ref:`new() <class_CSharpScript_method_new>`.
zh_cn: 从GDScript中使用C#并不麻烦. 加载后(见 :ref:`doc_gdscript_classes_as_resources`)脚本就可以使用 :ref:`new() <class_CSharpScript_method_new>` 进行实例化.
zh_tw: 從 GDScript 中使用 C# 並不需花費額外功夫。載入後 (請參見 :ref:`doc_gdscript_classes_as_resources`) 便可以使用 :ref:`new() <class_CSharpScript_method_new>` 來實體化腳本。

source: When creating ``.cs`` scripts, you should always keep in mind that the class Godot will use is the one named like the ``.cs`` file itself. If that class does not exist in the file, you'll see the following error: ``Invalid call. Nonexistent function `new` in base``.
es: Cuando se crea un script ``.cs``, ten siempre en mente que la clase que usará Godot es la que está nombrada como el archivo ``.cs``. Si esa clase no existe en el archivo, verás el siguiente error: ``Invalid call. Nonexistent function `new` in base``.
ko: ``.cs`` 스크립트를 생성할 때, Godot은 ``.cs`` 파일과 동일한 이름의 클래스를 사용하려 한다는 것을 명심하십시오. 만약 그런 이름의 클래스가 파일 내에 없다면 다음 에러가 발생할 것입니다: ``Invalid call. Nonexistent function `new` in base``.
pt_br: Ao criar scripts ``.cs`` você deve sempre ter em mente que a classe que o Godot usará é a nomeada como o próprio arquivo ``.cs.`` Se essa classe não existir no arquivo, você verá o seguinte erro: ``Chamada inválida. Função inexistente `new` na base``.
zh_cn: 创建 ``.cs`` 脚本时, 应始终记住 Godot 将使用和这个 ``.cs`` 文件名相同的类. 如果文件中不存在该类, 您将看到以下错误: ``Invalid call. Nonexistent function `new` in base`` .
zh_tw: 建立 ``.cs`` 腳本後，請記得 Godot 類別與 ``.cs`` 檔案本身的名字。若與檔名相同的類別不存在與檔案中，則會看到這個錯誤：``Invalid call. Nonexistent function `new` in base`` 。

source: For example, MyCoolNode.cs should contain a class named MyCoolNode.
es: Por ejemplo, "MyCoolNode.cs"debe contener una clase llamada "MyCoolNode".
ja: たとえば、MyCoolNode.csにはMyCoolNodeという名前のクラスが含まれている必要があります。
ko: 예를 들어, MyCoolNode.cs내에 MyCoolNode 클래스가 존재해야 합니다.
pt_br: Por exemplo, MyCoolNode.cs deve conter uma classe chamada MyCoolNode.
zh_cn: 比如,MyCoolNode.cs 应该包含一个名为 MyCoolNode 的类.
zh_tw: 舉例來說，MyCoolNode.cs 應該包含名為 MyCoolNode 的類別。

source: You also need to check your ``.cs`` file is referenced in the project's ``.csproj`` file. Otherwise, the same error will occur.
es: También necesitas revisar que tu archivo ``.cs`` esté referenciado en el archivo de proyecto``.csproj``. De otro modo sucederá el mismo error.
ko: ``.cs`` 파일이 프로젝트의 ``.csproj`` 파일 내에서 참조되었는지 역시 확인해야 합니다. 만약 참조되지 않았다면 위와 동일한 에러가 발생합니다.
pt_br: Você também precisa verificar se seu arquivo ``.cs`` é referenciado no arquivo ``.csproj`` do projeto. Caso contrário, o mesmo erro ocorrerá.
zh_cn: 您还需要检查在项目的 ``.csproj`` 文件中引用了该 ``.cs`` 文件的内容. 否则, 将发生相同的错误.
zh_tw: 你也需要檢查 ``.cs`` 檔案是否在專案中的 ``.csproj`` 檔案中參照。否則也會出現相同的錯誤。

source: Instantiating GDScript nodes from C#
es: Instanciando nodos GDScript desde C#
ja: C#からのGDScriptノードのインスタンス化
ko: GDScript 노드를 C#에서 인스턴스화 하기
pt_br: Instanciando nós GDScript a partir do C#
zh_cn: 在C#中实例化GDScript节点
zh_tw: 在 C# 中實體化 GDScript 節點

source: From the C# side, everything work the same way. Once loaded, the GDScript can be instantiated with :ref:`GDScript.New() <class_GDScript_method_new>`.
es: Desde el lado de C#, todo funciona de la misma manera. Una vez cargado, el GDScript puede ser instanciado con :ref:`GDScript.New() <class_GDScript_method_new>`.
ja: C#側から見ても、すべてが同じように機能します。ロードされると、GDScriptは :ref:`GDScript.New()<class_GDScript_method_new>` でインスタンス化できます。
ko: C#에서의 방법도 위와 크게 다르지 않습니다. 로딩이 완료되면 GDScript를 :ref:`GDScript.New() <class_GDScript_method_new>`로 인스턴스화 할 수 있습니다.
pt_br: Do lado C#, tudo funciona da mesma maneira. Uma vez carregado, um GDScript pode ser instanciado com :ref:`GDScript.New() <class_GDScript_method_new>`.
zh_cn: 在 C# 端, 所有的工作方式相同. 加载后,GDScript 可以被实例化, 使用 :ref:`GDScript.New() <class_GDScript_method_new>`.
zh_tw: 在 C# 這邊，所有東西的運作方式都一樣。載入後，GDScript 便可以使用 :ref:`GDScript.New() <class_GDScript_method_new>` 來實體化。

source: Here we are using an :ref:`class_Object`, but you can use type conversion like explained in :ref:`doc_c_sharp_features_type_conversion_and_casting`.
es: Aquí usaremos un :ref:`class_Object`, pero puedes usar conversión de tipos como está explicado en :ref:`doc_c_sharp_features_type_conversion_and_casting`.
ko: 여기서는 :ref:`class_Object`을 사용했지만, :ref:`doc_c_sharp_features_type_conversion_and_casting`에 설명된 것처럼 변환할 수도 있습니다.
pt_br: Aqui estamos usando um :ref:`class_Object` mas você pode usar conversão de tipo como explicado em :ref:`doc_c_sharp_features_type_conversion_and_casting`.
zh_cn: 在这里我们使用一个 :ref:`class_Object` , 但是也可以使用类型转换, 如 :ref:`doc_c_sharp_features_type_conversion_and_casting` 章节所述.
zh_tw: 這裡我們用的是 :ref:`class_Object` ，但可以使用任何如 :ref:`doc_c_sharp_features_type_conversion_and_casting` 內說明的型別轉換方式。

source: Accessing fields
es: Accediendo campos
ja: フィールドへのアクセス
ko: 멤버 변수 접근하기
pt_br: Acessando campos
zh_cn: 访问字段
zh_tw: 存取欄位

source: Accessing C# fields from GDScript
es: Accediendo campos C# desde GDScript
ja: GDScriptからC#フィールドにアクセスする
ko: GDScript에서 C# 멤버 변수에 접근하기
pt_br: Acessando campos C# a partir do GDScript
zh_cn: 从 GDScript 中访问 C# 字段
zh_tw: 在 GDScript 中存取 C# 欄位

source: Accessing C# fields from GDScript is straightforward, you shouldn't have anything to worry about.
es: Acceder a los campos C# desde GDScript es sencillo, no deberías tener nada de qué preocuparte.
ja: GDScriptからC#フィールドにアクセスするのは簡単です。心配する必要はありません。
ko: GDScript에서는 크게 신경 쓸 것 없이 쓰던 그대로 C# 멤버 번수에 접근할 수 있습니다.
pt_br: Acessar os campos do C# no GDScript é simples, você não deve ter nada com que se preocupar.
zh_cn: 从GDScript访问 C# 字段很简单, 没什么可担心的.
zh_tw: 要從 GDScript 存取 C# 欄位很簡單，沒什麼好擔心的。

source: Note that it doesn't matter if the field is defined as a property or an attribute. However, trying to set a value on a property that does not define a setter will result in a crash.
es: Nota que no importa si el campo está definido como propiedad o atributo. Sin embargo, tratar de asignar un valor a una propiedad que no define un setter resultará en un crash.
ko: 멤버 변수가 속성(property)인지 어트리뷰트인지는 중요하지 않지만, setter가 없는 속성(property)의 값을 바꾸려고 하면 오류가 발생한다는 점을 명심하십시오.
pt_br: Observe que não importa se o campo é definido como uma propriedade ou um atributo, mas tentar definir um valor em uma propriedade que não tem um setter resultará em um crash.
zh_cn: 需要注意的是, 字段定义为属性(property)或特性(attribute)并不重要, 但尝试在未定义 setter 的属性(property)上设置值将导致崩溃.
zh_tw: 請注意，不管欄位是定義為 Property 還是 Attribute，只要沒定義 Setter，賦值時就會導致當機。

source: Accessing GDScript fields from C#
es: Accediendo a los campos de GDScript desde C#
ja: C#からGDScriptフィールドにアクセスする
ko: C#에서 GDScript 멤버 변수 접근하기
pt_br: Acessando campos do GDScript no C#
zh_cn: 从 C# 中访问 GDSscript
zh_tw: 在 C# 中存取 GDScript 欄位

source: As C# is statically typed, accessing GDScript from C# is a bit more convoluted, you will have to use :ref:`Object.Get() <class_Object_method_get>` and :ref:`Object.Set() <class_Object_method_set>`. The first argument is the name of the field you want to access.
es: Como C# es tipado estáticamente, acceder GDScript desde C# es un poco complejo, deberás usar :ref:`Object.Get() <class_Object_method_get>` y :ref:`Object.Set() <class_Object_method_set>`. El primer argumento es el nombre del campo al que quieres acceder.
ja: C#は静的に型指定されるため、C#からGDScriptにアクセスするのはもう少し複雑です。 :ref:`Object.Get()<class_Object_method_get>` および :ref:`Object.Set()<class_Object_method_set>` を使用する必要があります。最初の引数は、アクセスするフィールドの名前です。
ko: C#이 정적 언어이기 때문에, C#에서 GDScript에 접근하는 것은 조금 복잡합니다. 첫 번째 인수로 접근할 멤버 변수의 이름을 입력하고 :ref:`Object.Get() <class_Object_method_get>`또는 :ref:`Object.Set() <class_Object_method_set>`을 사용해야 합니다.
pt_br: Como C# é estáticamente tipado, acessar os campos de GDScript a partir do C# é um pouco mais complicado, você terá que usar :ref:`Object.Get() <class_Object_method_get>` e :ref:`Object.Set() <class_Object_method_set>`. O primeiro argumento é o nome do campo que você quer acessar.
zh_cn: 由于 C# 是静态类型, 因此从 C# 访问 GDScript 会有点复杂, 因此您必须使用 :ref:`Object.Get() <class_Object_method_get>` 和 :ref:`Object.Set() <class_Object_method_set>` . 第一个参数是要访问的字段的名称.
zh_tw: 由於 C# 是靜態型別，從 C# 中存取 GDScript 就稍微有點複雜，我們需要使用 :ref:`Object.Get() <class_Object_method_get>` 與 :ref:`Object.Set() <class_Object_method_set>` 。第一個參數即為欲存取欄位的名稱。

source: Keep in mind that when setting a field value you should only use types the GDScript side knows about. Essentially, you want to work with built-in types as described in :ref:`doc_gdscript` or classes extending :ref:`class_Object`.
es: Ten en cuenta que al establecer un valor de campo sólo debes usar los tipos que el lado GDScript conoce. Esencialmente, quieres trabajar con tipos incorporados como se describe en :ref:`doc_gdscript` o clases que se extienden :ref:`class_Object`.
ja: フィールド値を設定するときは、GDScript側が知っている型のみを使用する必要があることに注意してください。基本的に、\ :ref:`doc_gdscript` または :ref:`class_Object` を拡張するクラスで説明されている組み込み型を使用する必要があります。
ko: 멤버 변수에 값을 입력할 때 GDScript가 인식할 수 있는 타입의 값을 넘겨줘야 합니다. 따라서 :ref:`doc_gdscript`에 있는 내장(built-in) 타입 또는 :ref:`class_Object`의 파생 클래스를 사용해야 할 겁니다.
pt_br: Tenha em mente que ao definir um valor de campo você só deve usar tipos conhecidos pelo GDScript. Essencialmente, você precisa trabalhar com tipos embutidos descritos em :ref:`doc_gdscript` ou classes que estendam :ref:`class_Object`.
zh_cn: 牢记在给字段赋值时只能使用 GDScript 知道的类型. 实质上指的是 GDScript 的内置类型 :ref:`doc_gdscript` 或者 :ref:`class_Object` 的扩展类.
zh_tw: 請記得當設定欄位值時，使用的型別應該是 GDScript 那段能認得的型別。特別是在使用如 :ref:`doc_gdscript`` 中說明的內建型別或擴充了 :ref:`class_Object` 的類別時。

source: Calling methods
es: Llamando métodos
ja: メソッドの呼び出し
ko: 메서드 호출하기
pt_br: Chamando métodos
zh_cn: 调用方法
zh_tw: 呼叫方法

source: Calling C# methods from GDScript
es: Llamando métodos C# desde GDScript
ja: GDScriptからのC#メソッドの呼び出し
ko: GDScript에서 C# 메서드 호출하기
pt_br: Chamando métodos C# a partir do GDScript
zh_cn: 在GDScript中调用C#方法
zh_tw: 在 GDScript 中呼叫 C# 方法

source: Again, calling C# methods from GDScript should be straightforward. The marshalling process will do its best to cast the arguments to match function signatures. If that's impossible, you'll see the following error: ``Invalid call. Nonexistent function `FunctionName```.
es: Una vez más, llamar a métodos C# desde GDScript debería ser sencillo. El proceso de clasificación hará todo lo posible para convertir los argumentos para que coincidan con las firmas de funciones. Si eso es imposible, verá el siguiente error: ``Llamada no válida. Función `FunctionName``` inexistente.
ko: 말했듯이 GDScript에서는 쓰던대로 C# 메서드를 호출할 수 있습니다. 넘긴 인자들의 타입은 마샬링에서 가능한 한 함수 원형에 맞게 변환될 것이며, 만약 불가능하다면 다음의 에러가 발생합니다: ``Invalid call. Nonexistent function `FunctionName```.
pt_br: Novamente, chamar métodos de C# no GDScript deve ser simples. O processo de marshalling fará o seu melhor para converter seu argumento para bater com as assinaturas de funções. Se isso for impossível, você verá o seguinte erro: ``Chamada inválida. Função inexistente `FunctionName```.
zh_cn: 从 GDScript 调用 C# 方法同样是很简单的. 调用过程将尽力强制转换你的参数类型去匹配函数签名. 如果失败则会看到以下错误 ``Invalid call. Nonexistent function `FunctionName``` .
zh_tw: 同樣地，從 GDScript 中呼叫 C# 方法應該很簡單。封送處理程序會儘可能地將引數的型別轉換為符合函式簽章的型別。若無法自動轉換，則會看到這個錯誤： ``Invalid call. Nonexistent function `FunctionName``` 。

source: Calling GDScript methods from C#
es: Llamando métodos GDScript desde C#
ja: C#からのGDScriptメソッドの呼び出し
ko: C#에서 GDScript 메서드 호출하기
pt_br: Chamando métodos de GDScript no C#
zh_cn: 从 C# 中 调用 GDScript 方法
zh_tw: 在 C# 中呼叫 GDScript 方法

source: To call GDScript methods from C# you'll need to use :ref:`Object.Call() <class_Object_method_call>`. The first argument is the name of the method you want to call. The following arguments will be passed to said method.
es: Para llamar a los métodos de GDScript desde C# necesitarás usar :ref:`Object.Call() <class_Object_method_call>`. El primer argumento es el nombre del método que quieres llamar. Los siguientes argumentos se pasarán a dicho método.
ko: C#에서 GDScript 메서드를 호출하려면 첫 인자로 호출할 메서드 이름을 입력하고 :ref:`Object.Call() <class_Object_method_call>`을 호출하면 됩니다. 이후에 입력된 인자들은 호출할 메서드에게 넘겨집니다.
pt_br: Para chamar os métodos de GDScript a partir do C# você precisará usar :ref:`Object.Call() <class_Object_method_call>`. O primeiro argumento é o nome do método que você quer chamar. Os próximos argumentos serão passados para esse método.
zh_cn: 从 C# 中调用 GDScript 方法需要使用 :ref:`Object.Call() <class_Object_method_call>` . 第一个参数是想要调用方法的名称. 接下来的其他参数会传递给被调用的方法.
zh_tw: 從 C# 中呼叫 GDScript 方法則需要使用 :ref:`Object.Call() <class_Object_method_call>` 。第一個引數為欲呼叫的函式名稱，接下來的引數則會被傳入該方法中。

source: As you can see, if the first argument of the called method is an array, you'll need to cast it as ``object``. Otherwise, each element of your array will be treated as a single argument and the function signature won't match.
es: Como puedes ver, si el primer argumento del método llamado es un array, necesitarás lanzarlo como "object". De lo contrario, cada elemento de tu array será tratado como un único argumento y la firma de la función no coincidirá.
ko: 만약 위와 같이 호출할 함수의 첫 인자가 배열일 때에는, 배열을 ``object`` 로 타입 변환해야 합니다. 그렇지 않으면 배열의 각 원소들이 하나의 인자로 취급되어 함수 원형과 맞지 않게 됩니다.
pt_br: Como você pode ver, se o primeiro argumento do método chamado é um array, você precisará convertê-lo para ``object``. Caso contrário, cada elemento de seu array será tratado como um único argumento e a assinatura da função não corresponderá.
zh_cn: 如您所见，如果被调用方法的第一个参数为数组类型，你需要强制转换成 ``object``\ 。否则数组的每个元素将被当做单个参数传入，这将导致与被调用的函数签名参数不匹配。
zh_tw: 如上所示，若呼叫方法的第一個引數為陣列，則需要將其轉換型別為 ``object`` 。否則，該陣列的每個元素都會被當作各個單一引數，進而不符合函式簽章。

source: Inheritance
es: Herencia
ja: 継承
ko: 상속(Inheritance)
pt_br: Herança
zh_cn: 继承
zh_tw: 繼承

source: A GDScript file may not inherit from a C# script. Likewise, a C# script may not inherit from a GDScript file. Due to how complex this would be to implement, this limitation is unlikely to be lifted in the future. See `this GitHub issue <https://github.com/godotengine/godot/issues/38352>`__ for more information.
es: Un archivo GDSCript no puede heredar de un script C# del mismo en que un script C# no puede heredar de un archivo GDScript. Debido a la complejidad que llevaría implementarla, es poco probable que esta limitación sea cambiada en el futuro. Ver `esta issue en GitHub <https://github.com/godotengine/godot/issues/38352>`__ para más información.
ko: GDScript 파일이 C# 스크립트를 상속할 수 없고, 그 반대 역시 불가능합니다. 이 동작을 구현하는 것이 매우 까다로우므로, 이 제한은 바뀌지 않을 가능성이 높습니다. 자세한 내용은 이 `GitHub issue <https://github.com/godotengine/godot/issues/38352>`__ 를 참고하세요.
pt_br: Um arquivo GDscript não pode herdar de um script em C#. De forma semelhante, um script C# também não pode herdar de um arquivo GDscript. Devido a complexidade de sua implementação, essa limitação tem poucas chances de permanecer no futuro. Veja `esse problema na plataforma GitHub <https://github.com/godotengine/godot/issues/38352>`__ para mais informações.
zh_cn: GDScript文件可能无法从C＃脚本继承. 同样地,C＃脚本可能无法从GDScript文件继承. 由于实现起来非常复杂, 因此将来不太可能取消此限制. 详见 `这个 GitHub issue <https://github.com/godotengine/godot/issues/38352>`_ .
zh_tw: GDScript 檔案不能繼承 C# 腳本。同樣地，C# 腳本也不能繼承 GDScript 檔案。由於要實作這個功能會很複雜，此一限制應該也會延續到未來的版本中。 請參考 `這個 GitHub Issue (英文) <https://github.com/godotengine/godot/issues/38352>`__ 來瞭解詳情。

source: Translation status
es: Estado de traducción
ja: 翻訳ステータス
ko: 번역 상태
pt_br: Progresso da Tradução
zh_cn: 翻译状态
zh_tw: 翻譯狀態
