Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/idle_and_physics_processing.po
Languages: es, fr, ja, pt_br, zh_cn

source: Idle and Physics Processing
es: **Procesamiento en Reposo y Físico**
fr: Traitement physique et traitement passif
ja: アイドル処理と物理処理
pt_br: Processamento Ocioso e Físico
zh_cn: 空闲处理与物理处理

source: Games run in a loop. Each frame, you need to update the state of your game world before drawing it on screen. Godot provides two virtual methods in the Node class to do so: :ref:`Node._process() <class_Node_method__process>` and :ref:`Node._physics_process() <class_Node_method__physics_process>`. If you define either or both in a script, the engine will call them automatically.
zh_cn: 游戏是使用循环来运行的。每一帧，你都需要先更新游戏世界的状态，然后再把它画到屏幕上。Godot 在 Node 类中提供了两个虚方法来完成这项工作：\ :ref:`Node._process() <class_Node_method__process>` 和 :ref:`Node._physics_process() <class_Node_method__physics_process>`\ 。如果你在脚本中定义了其中之一或者两者都定义了，引擎就会自动进行调用。

source: There are two types of processing available to you:
es: Existen dos tipos de procesamiento disponibles para usted:
fr: Deux types de traitement sont à votre disposition :
ja: 2種類の処理が用意されています:
pt_br: Há dois tipos de processamento disponíveis para você:
zh_cn: 你可以使用两种类型的处理：

source: **Idle processing** allows you to run code that updates a node every frame, as often as possible.
es: El **procesamiento en reposo (Idle processing)** te permite ejecutar código que actualiza un nodo en cada cuadro, tan frecuentemente como sea posible.
fr: **Le traitement passif** vous permet d'exécuter un code qui met à jour un nœud à chaque trame, aussi souvent que possible.
ja: **アイドル処理** を使うと、ノードを毎フレーム更新するようなコードを、可能な限り頻繁に実行することができます。
pt_br: O **processamento ocioso** permite que você execute o código que atualiza um nó a cada quadro, com a maior frequência possível.
zh_cn: **空闲处理**\ （Idle processing）可以用来执行每帧更新节点的代码，执行频率会尽可能地快。

source: **Physics processing** happens at a fixed rate, 60 times per second by default. This is independent of your game's actual framerate, and keeps physics running smoothly. You should use it for anything that involves the physics engine, like moving a body that collides with the environment.
es: Así es, el **procesamiento en reposo (Idle processing)** te permite ejecutar código que actualiza un nodo en cada cuadro, tan frecuentemente como sea posible. Es útil para tareas que no necesitan estar sincronizadas con el motor de físicas y pueden ejecutarse en cualquier momento durante el ciclo del juego.
fr: **Le traitement physique** se fait à un rythme fixe de 60 fois par seconde par défaut. Ce rythme est indépendant de la fréquence d'images réelle de votre jeu et permet un fonctionnement fluide de la physique. Vous devriez l'utiliser pour tout ce qui implique le moteur physique, comme le déplacement d'un corps qui entre en collision avec l'environnement.
ja: **物理処理** は固定レートで行われ、デフォルトでは1秒間に60回です。これはゲームの実際のフレームレートとは無関係で、物理がスムーズに行われるようにします。物理エンジンが関係するもの、たとえば、環境と衝突する体を動かすような場合に使用するとよいでしょう。
pt_br: O **processamento físico** ocorre a uma taxa fixa, 60 vezes por segundo por padrão. Isso é independente da taxa de quadros real do seu jogo e mantém a física funcionando sem problemas. Você deve usá-lo para qualquer coisa que envolva o motor de física, como mover um corpo que colide com o ambiente.
zh_cn: **物理处理**\ （Physics processing）的频率是固定的，默认为每秒 60 次。它和游戏的实际帧率无关，可以让物理平滑执行。任何与物理引擎相关的东西都应该用它，比如移动可能与环境相碰撞的实体。

source: You can activate idle processing by defining the ``_process()`` method in a script. You can turn it off and back on by calling :ref:`Node.set_process() <class_Node_method_set_process>`.
es: Puedes activar el procesamiento en reposo (Idle processing) definiendo el método ``_process()`` en un script. Puedes desactivarlo y volverlo a activar llamando a :ref:`Node.set_process() <class_Node_method_set_process>`.
fr: Vous pouvez activer le traitement passif en définissant la méthode ``_process()`` dans un script. Vous pouvez le désactiver et le réactiver en appelant :ref:`Node.set_process() <class_Node_method_set_process>`.
ja: スクリプトで ``_process()`` メソッドを定義することで、アイドル処理を有効にすることができます。また、 :ref:`Node.set_process() <class_Node_method_set_process>` を呼び出すことで、アイドル処理をオフにしたりオンに戻したりすることができます。
pt_br: Você pode ativar o processamento ocioso definindo o método ``_process()`` em um script. Você pode desativá-lo e ativá-lo novamente chamando :ref:`Node.set_process() <class_Node_method_set_process>`.
zh_cn: 在脚本中定义 ``_process()`` 方法就会激活空闲处理。可以通过调用 :ref:`Node.set_process() <class_Node_method_set_process>` 来进行开关。

source: The engine calls this method every time it draws a frame:
es: El motor llama a este método cada vez que dibuja un frame:
fr: Le moteur de jeu appelle cette méthode à chaque fois il affiche la trame :
ja: エンジンはフレームを描画するたびに以下のメソッドを呼び出します:
pt_br: O motor chama este método toda vez que ele desenha um quadro:
zh_cn: 每次引擎需要绘制一帧的时候就会调用该方法：

source: Keep in mind that the frequency at which the engine calls ``_process()`` depends on your application's framerate, which varies over time and across devices.
es: Ten en cuenta que la frecuencia con la que el motor llama a ``_process()`` depende de la tasa de cuadros por segundo (framerate) de tu aplicación, la cual puede variar con el tiempo y entre diferentes dispositivos.
fr: Gardez à l'esprit que la fréquence à laquelle le moteur appelle ``_process()`` dépend du framerate de votre application, qui varie dans le temps et selon les appareils.
ja: エンジンが ``_process()`` を呼び出す頻度は、アプリケーションのフレームレートに依存し、時間やデバイスによって異なることを覚えておいてください。
pt_br: Tenha em mente que a frequência com que o motor chama ``_process()`` depende da taxa de quadros do seu aplicativo, que varia com o tempo e entre os dispositivos.
zh_cn: 请记住，引擎调用 ``_process()`` 的频率以应用的帧率为准，可能根据时间的变化、设备的变化而变化。

source: The function's ``delta`` parameter is the time elapsed in seconds since the previous call to ``_process()``. Use this parameter to make calculations independent of the framerate. For example, you should always multiply a speed value by ``delta`` to animate a moving object.
es: El parámetro ``delta`` de la función es el tiempo transcurrido en segundos desde la llamada anterior a ``_process()``. Utiliza este parámetro para realizar cálculos independientes de la tasa de cuadros por segundo. Por ejemplo, siempre debes multiplicar un valor de velocidad por ``delta`` para animar un objeto en movimiento. Esto asegura que la animación sea consistente y suave independientemente de las variaciones en el framerate.
fr: Le paramètre ``delta`` de la fonction est le temps écoulé en secondes depuis le précédent appel à ``_process()``. Utilisez ce paramètre pour effectuer des calculs indépendants du taux de rafraîchissement. Par exemple, vous devez toujours multiplier une valeur de vitesse par ``delta`` pour animer un objet en mouvement.
ja: この関数の ``delta`` パラメーターは、 ``_process()`` が前回呼び出されてからの経過時間 (秒) です。このパラメーターは、フレームレートに依存しない計算を行うために使用します。例えば、移動するオブジェクトをアニメーションさせるには、常に速度の値に ``delta`` を乗じる必要があります。
pt_br: O parâmetro ``delta`` da função é o tempo decorrido em segundos desde a chamada anterior para ``_process()``. Use este parâmetro para fazer cálculos independentes da taxa de quadros. Por exemplo, você deve sempre multiplicar um valor de velocidade por ``delta`` para animar um objeto em movimento.
zh_cn: 函数的参数 ``delta`` 是从上一次调用 ``_process()`` 开始所经过的秒数。借助这个参数就可以进行与帧率无关的计算。例如，为移动物理做动画时，应该始终将速度值乘上 ``delta``\ 。

source: Physics processing works with a similar virtual function: ``_physics_process()``. Use it for calculations that must happen before each physics step, like moving a character that collides with the game world. As mentioned above, ``_physics_process()`` runs at fixed time intervals as much as possible to keep the physics interactions stable. You can change the interval between physics steps in the Project Settings, under Physics -> Common -> Physics Fps. By default, it's set to run 60 times per second.
es: El procesamiento de físicas funciona con una función virtual similar: ``_physics_process()``. Utilízala para cálculos que deben realizarse antes de cada paso de físicas, como mover un personaje que colisiona con el mundo del juego. Como se mencionó anteriormente, ``_physics_process()`` se ejecuta a intervalos de tiempo fijos tanto como sea posible para mantener las interacciones físicas estables. Puedes cambiar el intervalo entre pasos de físicas en la Configuración del Proyecto, bajo Física -> Común -> Fps de Física. Por defecto, está configurado para ejecutarse 60 veces por segundo.
fr: Le traitement physique fonctionne avec une fonction virtuelle similaire : ``_physics_process()``. Utilisez-la pour les calculs qui doivent se produire avant chaque étape physique, comme le déplacement d'un personnage qui entre en collision avec le monde du jeu. Comme mentionné ci-dessus, ``_physics_process()`` s'exécute à intervalles de temps fixes autant que possible pour garder les interactions physiques stables. Vous pouvez modifier l'intervalle entre les étapes de la physique dans les paramètres du projet, sous Physics -> Common -> Physics Fps. Par défaut, il est réglé pour s'exécuter 60 fois par seconde.
ja: 物理処理は、同様の仮想関数 ``_physics_process()`` で動作します。これはゲーム世界に衝突判定を持つキャラクターの制御など、各物理ステップの前に実行する必要がある処理に使用します。前述のとおり、 ``_physics_process()`` は物理的な相互作用を安定させるために、可能な限り固定時間間隔(デフォルトでは毎秒60回)で呼び出されます。この間隔は、プロジェクト設定の Physics -> Common-> Physics Fps で変更できます。
pt_br: O processamento de física funciona com uma função virtual semelhante: ``_physics_process()``. Use-o para cálculos que devem acontecer antes de cada etapa da física, como mover um personagem que colide com o mundo do jogo. Como mencionado acima, ``_physics_process()`` executa em intervalos de tempo fixos tanto quanto possível para manter as interações físicas estáveis. Você pode alterar o intervalo entre as etapas de física nas configurações do projeto, em Physics -> Common -> Physics Fps. Por padrão, ele está configurado para ser executado 60 vezes por segundo.
zh_cn: 物理处理使用的是类似的虚函数：\ ``_physics_process()``\ 。可用于必须在每一次物理迭代前进行的计算，比如移动可能与游戏世界发生碰撞的角色。前面提到过，为了实现平稳的物理交互，\ ``_physics_process()`` 的执行间隔是尽可能固定的。你可以在“项目设置”的“Physics -> Common -> Physics Fps”（物理 -> 常规 -> 物理 FPS）中修改物理迭代之间的间隔。默认设置是每秒 60 次。

source: The function ``_process()`` is not synchronized with physics. Its rate depends on hardware and game optimization. It also runs after the physics step in single-threaded games.
es: La función ``_process()`` no está sincronizada con la física. Su frecuencia depende del hardware y la optimización del juego. Además, se ejecuta después del paso de física en juegos de un solo hilo.
fr: La fonction ``_process()``, cependant, n'est pas synchronisée avec la physique. Son taux de rafraîchissement n'est pas constant et dépend de l'optimisation du hardware et du jeu. Son exécution se fait après le traitement de la physique sur les jeux mono-threadés.
ja: 一方、\ ``_process()`` 関数は物理処理と同期されません。そのレートは一定ではなく、ハードウェアとゲームの最適化に依存します。シングルスレッドのゲームでは、物理ステップの後に実行されます。
pt_br: A função ``_process()`` não é sincronizada com a física. Sua taxa de quadros não é constante e depende do hardware e da otimização do jogo. Sua execução é feita depois do passo da física em jogos de single-thread.
zh_cn: ``_process()`` 函数没有与物理进行同步，频率会受到硬件和游戏优化的影响。在单线程游戏中，会在物理迭代后执行。

source: You can see the ``_process()`` function at work by creating a scene with a single Label node, with the following script attached to it:
es: Puedes ver la función ``_process()`` en acción al crear una escena con un solo nodo Label y adjuntarle el siguiente script:
fr: Une façon simple de voir la fonction ``_process()`` au travail est de créer une scène avec un seul nœud Label, auquel est attaché le script suivant :
ja: Labelノードが1つあるシーンを作成し、以下のスクリプトをアタッチすると、\ ``_process()``\ 関数の動作を確認できます:
pt_br: Você pode ver a função ``_process()`` em ação criando uma cena com um único nó Label, com o seguinte script anexado a ele:
zh_cn: 要观察 ``_process()`` 的执行，可以创建一个只有一个 Label 节点的场景，把下面的脚本附加给它：

source: When you run the scene, you should see a counter increasing each frame.
es: Cuando ejecutes la escena, deberías ver un contador incrementándose en cada cuadro.
fr: Lorsque vous exécutez la scène, vous devriez voir un compteur augmenter à chaque image.
ja: シーンを実行すると、カウンターが各フレームごとに増加しているのが確認できます。
pt_br: Ao executar a cena, você deverá ver um contador aumentando cada quadro.
zh_cn: 运行场景，你应该就会看到一个每帧都会增加的计数器。

source: Translation status
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
pt_br: Progresso da Tradução
zh_cn: 翻译状态
