Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/scene_tree.po
Languages: de, es, fr, ko, pt_br, zh_tw

source: After a scene is loaded, it is often desired to change this scene for another one. The simple way to do this is to use the :ref:`SceneTree.change_scene() <class_SceneTree_method_change_scene>` function:
de: Nachdem eine Szene geladen wurde ist es oftmals erwünscht jene Szene umzutauschen mit einer anderen. Der einfachste Weg dies zu tun ist mittels der :ref:`SceneTree.change_scene()<class_SceneTree_method_change_scene>` Funktion:

source: Rather than using file paths, one can also use ready-made :ref:`PackedScene <class_PackedScene>` resources using the equivalent function :ref:`SceneTree.change_scene_to(PackedScene scene) <class_SceneTree_method_change_scene_to>`:
de: Anstelle Dateipfade zu nutzen kann man auch zum Gebrauch bereite, sogenannte "PackedScenes" verwenden. :ref: `PackedScene <class_PackedScene>` Ressourcen verwenden die entsprechende Funktion :ref:`SceneTree.change_scene_to(PackedScene scene) <class_SceneTree_method_change_scene_to>`:

source: These are quick and useful ways to switch scenes but have the drawback that the game will stall until the new scene is loaded and running. At some point in the development of your game, it may be preferable to create proper loading screens with progress bar, animated indicators or thread (background) loading. This must be done manually using autoloads (see next chapter) and :ref:`doc_background_loading`.
de: Hierbei handelt es sich um die schnellen und einfachen Mittel und Wege zwischen Szenen zu wechseln, haben aber den Nachteil das Spiel zu verzögern bis die neue Szene geladen wurde und spielbereit ist. Ab einem gewissen Punkt ist es wichtig, für Ihr Spiel richtige Ladescreens, Fortschrittsbalken etc. zu implementieren. Thread(Hintergrund-) Laden ist auch möglich. Dies müsste allerdings manuell erledigt werden durch die Nutzung von Autoloads (siehe nächstes Kapitel) und :ref:`doc_background_loading`.

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ko: 번역 상태
pt_br: Progresso da Tradução
zh_tw: 翻譯狀態

source: This means that as explained in previous tutorials, it will get the ``_enter_tree()`` and ``_ready()`` callbacks (as well as ``_exit_tree()``).
es: Esto significa que, como se explicó en tutoriales anteriores, los autoguardados recibirán las devoluciones de llamada ``_enter_tree()`` y ``_ready()`` (así como ``_exit_tree()``).
fr: Cela signifie que, comme expliqué dans les tutoriels précédents, il recevra les rappels de ``_enter_tree()`` et ``_ready()`` (ainsi que ``_exit_tree()``).
ko: 즉, 이전 튜토리얼에서 설명했듯이 ``_enter_tree()``, ``_ready()`` 콜백 (및 ``_exit_tree()``)을 가져옵니다.
pt_br: Isto significa que, como explicado em tutoriais anteriores, receberá as ligações ``_enter_tree()`` e ``_ready()`` (assim como ``_exit_tree()``).
zh_tw: 這表示，如之前解釋過的，節點會取得 _enter_tree() 與 _ready() 回呼函式（另外還有 _exit_tree()）。

source: The root node of that scene (only one root, remember?) is added as either a child of the "root" Viewport (from SceneTree), or to any of its descendants.
zh_tw: 該場景的根節點（只有一個根節點，還記得嗎？）不是被加到（SceneTree 內的）「root」檢視區作為子節點，就是被加到 root 檢視區的子節點或次級子節點當中。

source: After a scene is loaded, you may want to change this scene for another one. One way to do this is to use the :ref:`SceneTree.change_scene_to_file() <class_SceneTree_method_change_scene_to_file>` function:
zh_tw: 場景載入後，通常會有需要更改目前的場景成另一個場景。最簡單的方法是使用 :ref:`SceneTree.change_scene() <class_SceneTree_method_change_scene>` 函式：

source: Rather than using file paths, one can also use ready-made :ref:`PackedScene <class_PackedScene>` resources using the equivalent function :ref:`SceneTree.change_scene_to_packed(PackedScene scene) <class_SceneTree_method_change_scene_to_packed>`:
zh_tw: 除了使用檔案路徑，還可以通過 :ref:`SceneTree.change_scene_to(PackedScene scene) <class_SceneTree_method_change_scene_to>` 來使用預先準備好的 :ref:`PackedScene <class_PackedScene>` 資源：

source: These are quick and useful ways to switch scenes but have the drawback that the game will stall until the new scene is loaded and running. At some point in the development of your game, it may be preferable to create proper loading screens with progress bar, animated indicators or threaded (background) loading. This must be done manually using :ref:`doc_singletons_autoload` and :ref:`doc_background_loading`.
zh_tw: 這幾個切換場景的方法比較快速且實用，但缺點是遊戲在新場景載入並開始執行之前都會停止。遊戲開發到某個程度的時候最高做個合適的載入畫面，並配合使用進度條、動畫指示器、或執行緒（背景）載入。這些東西必須手動使用 Autoload（詳見下一章）或是 :ref:`doc_background_loading` 。

source: When a scene (or part of it) is removed, they receive the "exit scene" notification ( ``_exit_tree()`` callback in GDScript) in bottom-to-top order (the exact reverse of top-to-bottom order).
es: Cuando se elimina una escena (o parte de ella), reciben la notificación "exit scene" ( callback ``_exit_tree()`` en GDScript) en orden ascendente.
