Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/scene_tree.po
Languages: de, es, fr, ko, pt_br, zh_tw

source: Using SceneTree
de: Szenen-Baum
es: Usando el Árbol de Escenas
fr: Utilisation de SceneTree
ko: 씬 트리(SceneTree) 사용하기
pt_br: Usando Árvore de cena

source: Introduction
de: Einführung
es: Introducción
ko: 소개
pt_br: Introdução
zh_tw: 前言

source: In previous tutorials, everything revolved around the concept of nodes. Scenes are collections of nodes. They become active once they enter the *scene tree*.
de: In der vorangegangen Anleitung drehte sich alles um das Konzept der Nodes. Szenen sind Sammlungen von Nodes. Sie werden aktiv sobald sie in den Szenen-Baum (*scene tree*) eingefügt werden.
es: En tutoriales previos, todo giraba en torno al concepto de nodos. Las escenas son simplemente una colección de nodos. Ellas se activan una vez que entran al *árbol de escenas*.
fr: Dans le tutoriel précédent, tout tournait autour du concept des nœuds. Chaque scène est simplement une collection de nœud. Elles deviennent actives une fois entrée dans *l'arbre de scène*.
ko: 이전 튜토리얼에서는 모든 것이 노드 개념을 중심으로 진행됐습니다. 씬은 노드의 모음입니다. 노드는 *씬 트리(scene tree)*\ 에 들어가면 활성화됩니다.
pt_br: Nos tutoriais anteriores, tudo girava em torno do conceito de nós. Cenas são simplesmente uma coleção de nós. Elas se tornam ativos quando entram na *árvore de cena*.
zh_tw: 到目前位置的教學都是圍繞著節點的概念延伸的。場景是節點的集合。而場景會在進入 **場景樹** 後變為有效場景 (Active Scene)。

source: MainLoop
de: Hauptschleife
ko: 메인루프(MainLoop)
pt_br: Loop principal

source: The way Godot works internally is as follows. There is the :ref:`OS <class_OS>` class, which is the only instance that runs at the beginning. Afterwards, all drivers, servers, scripting languages, scene system, etc are loaded.
de: Godot arbeitet intern wie folgt. Eine OS-Klasse (:ref:`OS<class_OS>`) ist die einzige Instanz die zu Begin ausgeführt wird. Darauf folgend werden Treiber, Server, Scriptsprachen, Szenen-System etc. geladen.
es: La forma en la cual Godot funciona internamente es la siguiente. Existe la clase :ref:`OS<class_OS`, la cual es la única instancia que corre desde el principio. Posteriormente son cargados todos los controladores, servidores, lenguajes de scripting, sistema de escenas, etc.
fr: La façon dont Godot fonctionne en interne est la suivante : Au départ, la seule instance qui fonctionne est la classe :ref:`OS <class_OS>`, ensuite, tous les pilotes, serveurs, langages de script, système de gestion de scènes ... sont chargés.
ko: Godot가 내부적으로 작동하는 방식은 다음과 같습니다. 처음에 실행되는 유일한 인스턴스인 :ref:`OS <class_OS>` 클래스가 있습니다. 그 이후에 모든 드라이버, 서버, 스크립팅 언어, 씬 시스템 등을 불러옵니다.
pt_br: A maneira como o Godot trabalha internamente é a seguinte. Há a classe :ref:`OS <class_OS>`, que é a única instância que é executada no início. Depois, todos os drivers, servidores, linguagens de script, sistema de cena, etc. são carregados.
zh_tw: Godot 內部以下列方式運作。有一個 :ref:`OS <class_OS>` 類別，是在開始執行的時候唯一的實體。之後便會加載所有的驅動程式、伺服器、腳本語言、場景系統…等。

source: When initialization is complete, :ref:`OS <class_OS>` needs to be supplied a :ref:`MainLoop <class_MainLoop>` to run. Up to this point, all this is internals working (you can check main/main.cpp file in the source code if you are ever interested to see how this works internally).
de: Sobald die Initialisierung abgeschlossen ist, wird :ref:`OS<class_OS>` ein :ref:`MainLoop<class_MainLoop>` übergeben um ausgeführt zu werden. Bis zu diesem Punkt ist alles interner Ablauf (siehe main/main.cpp im source code falls Interesse besteht die Internen Abläufe nachzuvollziehen).
es: Una vez finalizada la inicialización, :ref:`OS <class_OS>` necesita que se le suministre un :ref:`MainLoop <class_MainLoop>` para que se ejecute. Hasta este punto, todo esto está funcionando internamente (puedes comprobar el archivo main/main.cpp en el código fuente si alguna vez estás interesado en ver cómo funciona internamente).
fr: Quand l'initialisation est terminée, :ref:`OS <class_OS>` doit être fournie à :ref:`MainLoop <class_MainLoop>` pour fonctionner. Jusqu'à ce point, tout ceci est du fonctionnement interne (vous pouvez consulter le fichier main/main.cpp dans le code source si jamais vous êtes intéressé de voir comment cela fonctionne en interne).
ko: 초기화가 완료될 때 :ref:`OS <class_OS>`\ 를 실행하려면 :ref:`MainLoop <class_MainLoop>`\ 가 제공되어야 합니다. 여기까지는 이 모든 것이 내부적으로 작동하는 방식입니다(내부적으로 어떻게 작동하는지 알고 싶다면 소스 코드에서 main/main.cpp 파일을 확인하세요).
pt_br: Quando a inicialização estiver completa, :ref:`OS <class_OS>` precisa de um :ref:`MainLoop <class_MainLoop>` para ser executado. Até este ponto, tudo isso é funcionamento interno (você pode verificar o arquivo main/main.cpp no código-fonte, se você estiver interessado em ver como isso funciona internamente).
zh_tw: 當初始化完成後， :ref:`OS <class_OS>` 就必須要提供 :ref:`MainLoop <class_MainLoop>` 來執行。到這裡為止，都是屬於內部運作（若你有興趣瞭解內部如何運作，可以閱讀原始碼的 。main/main.cpp 檔案）。

source: The user program, or game, starts in the MainLoop. This class has a few methods, for initialization, idle (frame-synchronized callback), fixed (physics-synchronized callback), and input. Again, this is low level and when making games in Godot, writing your own MainLoop seldom makes sense.
de: Die Nutzer-Anwendung, oder das Spiel, startet im MainLoop. Diese Klasse definiert Methoden für die Initialisierung, Idle (Bild-synchrone Rückrufmethode), fixed (Physik-synchrone Rückrufmethode) und Eingabe (input). Dies sind tief gehende Funktionen, welche in der typischen Erstellung eines Spiels nur sehr selten verwendet werden.
es: El programa del usuario o juego, comienza en el MainLoop. Esta clase tiene algunos métodos, para inicialización, inactivo (devolución de llamada sincronizada por el marco), fijo (devolución de llamada sincronizada por la física) y entrada. De nuevo, este es de bajo nivel y cuando creas juegos en Godot, escribir tu propio MainLoop tiene poco sentido.
fr: Le programme utilisateur, ou le jeu, démarre dans le MainLoop. Cette classe a quelques méthodes, pour l'initialisation, l'inactivité (rappel synchronisé par trame), fixé (rappel synchronisé par la physique) et les entrées. Encore une fois, ceci est bas niveau et lorsque vous créez des jeux avec Godot, écrire votre propre MainLoop a rarement du sens.
ko: 사용자 프로그램, 게임은 MainLoop에서 시작됩니다. 이 클래스에는 초기화, 유휴: 프레임에 동기화된 콜백(idle: frame-synchronized callback), 고정: 물리에 동기화된 콜백(fixed: physics-synchronized callback) 및 입력에 대한 몇 가지 메서드가 있습니다. 다시 말하지만, 이는 로우 레벨이며 Godot에서 게임을 만들 때 MainLoop를 작성하는 것은 거의 의미가 없습니다.
pt_br: O programa do usuário, ou jogo, inicia no MainLoop. Essa classe tem alguns métodos, para inicialização, ocioso (retorno de chamada com sincronia de quadros), fixo (retorno de chamada com sincronização física) e entrada. Novamente, isso é de baixo nível e ao fazer jogos no Godot, escrever seu próprio MainLoop raramente faz sentido.
zh_tw: 使用者程式，或稱為遊戲，會在 MainLoop 內開始執行。這個類別有幾個方法，可以用來初始化、閒置（影格同步回呼）、固定（物理同步回呼）、與輸入。同樣地，這些都屬於低階的功能，而在 Godot 內製作遊戲的時候撰寫自己的 MainLoop 沒什麼意義。

source: SceneTree
de: Szenenbaum
es: Árbol de Escenas
fr: ArbreDesScènes
ko: 씬트리

source: One of the ways to explain how Godot works is that it's a high level game engine over a low level middleware.
de: Godot kann so erklärt werden, dass es eine High Level Game Engine über einer Low Level Middleware ist.
es: Una de las maneras de explicar cómo funciona Godot es que es un motor de juegos de alto nivel sobre un middleware de bajo nivel.
fr: L'un des manières d'expliquer comment Godot fonctionne est qu'il est un moteur de jeu de haut niveau, construit par-dessus un middleware de bas niveau.
ko: Godot가 어떻게 작동하는지 설명하는 방법 중 하나는 Godot가 저수준 미들웨어보다 높은 수준의 게임 엔진이라는 것입니다.
pt_br: Uma das maneiras de explicar como Godot funciona é que é um mecanismo de jogo de alto nível sobre um middleware de baixo nível.
zh_tw: 還有一種可以說明 Godot 運作方式的方法就是將 Godot 看作是有低級中間件 (Middleware) 的高級遊戲引擎。

source: The scene system is the game engine, while the :ref:`OS <class_OS>` and servers are the low level API.
de: Das Szenensystem ist die Game Engine, wohingegen das :ref:`OS <class_OS> und Server zur Low Level API gehören.
es: El sistema de escenas es el motor del juego, mientras que la clase :ref:`OS <class_OS>` y los servidores son la API de bajo nivel.
fr: Le système de gestion de scènes est le game engine, tandis que :ref:`OS <class_OS>` et les serveurs sont partis de l'API de bas niveau.
ko: 씬 시스템은 게임 엔진이고 :ref:`OS <class_OS>`\ 와 서버는 로우 레벨 API입니다.
pt_br: O sistema de cena é o mecanismo do jogo, enquanto o :ref:`OS <class_OS>` e os servidores são a API de baixo nível.
zh_tw: 場景系統是遊戲引擎，而 :ref:`OS <class_OS>` 與伺服器則為低階 API。

source: The scene system provides its own main loop to OS, :ref:`SceneTree <class_SceneTree>`. This is automatically instanced and set when running a scene, no need to do any extra work.
de: Das Szenen-System stellt eine Implemetierung des MainLoops dar (:ref:`SceneTree <class_SceneTree>`) welcher OS so übergeben wird. Dies geschieht standardmäßig automatisch sobald eine Szene ausgeführt wird und erfordert kein manuelles Eingreifen.
es: El sistema de escenas provee al SO su propio bucle principal, :ref:`SceneTree <class_SceneTree>`. Este es automáticamente instanciado y configurado cuando se ejecuta una escena, no es necesario ningún trabajo extra.
fr: Le système de scène fournit sa propre boucle principale à l'OS, :ref:`SceneTree <class_SceneTree>`. Elle est automatiquement instanciée et configurée lors de l'exécution d'une scène, aucun travail supplémentaire est nécessaire.
ko: 씬 시스템은 OS, 즉 :ref:`SceneTree <class_SceneTree>`\ 에 자체 메인 루프를 제공합니다. 메인 루프는 씬이 실행되는 동안 자동으로 인스턴스화되고 설정되므로 추가 작업을 수행할 필요가 없습니다.
pt_br: O sistema de cena fornece seu próprio loop principal para o SO, :ref:`SceneTree <class_SceneTree>`. Isso é automaticamente instanciado e definido ao executar uma cena, sem necessidade de qualquer trabalho extra.
zh_tw: 場景系統提供了自己的 MainLoop 給 OS，即為 :ref:`SceneTree <class_SceneTree>` 。這個類別會在場景執行時自動實體化，所以不需要額外做什麼。

source: It's important to know that this class exists because it has a few important uses:
de: Es ist wichtig zu wissen, dass es diese Klasse gibt, weil sie einige wichtige Verwendungszwecke hat:
es: Es necesario saber que esta clase existe porque tiene algunos usos importantes:
fr: Il est important de savoir que cette classe existe car elle a des utilisations importantes :
ko: 이 클래스는 몇 가지 중요한 용도로 쓰이기 때문에 이 클래스가 존재한다는 것을 아는 것이 중요합니다:
pt_br: É importante saber que essa classe existe porque tem alguns usos importantes:
zh_tw: 而重要的是要知道有這個類別存在，因為他有一些重要的用途：

source: It contains the root :ref:`Viewport <class_Viewport>`, to which a scene is added as a child when it's first opened to become part of the *Scene Tree* (more on that next).
de: Es beinhaltet die Wurzel :ref:`Viewport<class_Viewport>`, zu welcher eine Szene hinzugefügt wird, als Kind, welches beim ersten Öffnen Teil des Szenen-Baums (*Scene Tree*) wird.
es: Contiene el :ref:`Viewport <class_Viewport>` raíz, al cual se añade una escena hija cuando se abre por primera vez, para ser parte del *Árbol de Escenas* (más información a continuación).
fr: Elle contient le :ref:`Viewport <class_Viewport>` racine, à laquelle une scène est ajoutée en tant qu'enfant lorsqu'elle est ouverte pour la première fois, afin de faire partie de l'arborescence de scène *Scene Tree* (plus d'informations là-dessus par la suite).
pt_br: Ele contém o :ref:`Viewport <class_Viewport>` raiz, para o qual uma cena é adicionada como filha quando é aberta pela primeira vez, para se tornar parte da *Árvore da Cena* (mais sobre isso a seguir).
zh_tw: 包含了根 :ref:`Viewport <class_Viewport>` ，也就是場景第一次打開並進入 **場景樹** 時會被加為子節點的地方（詳細見下方）。

source: It contains information about the groups and has the means to call all nodes in a group or get a list of them.
de: Es enthält Informationen zu Gruppen und hat Möglichkeiten Node-Methoden einer Gruppe aufzurufen oder eine Liste dieser zu erstellen.
es: Contiene información sobre los grupos y dispone de los medios para llamar a todos los nodos de un grupo u obtener una lista de ellos.
fr: Elle contient des informations sur les groupes et permet d'appeler tous les nœuds d'un groupe ou d'obtenir une liste de ceux-ci.
ko: 그룹에 관한 정보가 포함되어 있어서 그룹의 모든 노드를 호출하거나 그룹의 목록을 가져옵니다.
pt_br: Ele contém informações sobre os grupos e tem meios para chamar todos os nós de um grupo ou obter uma lista deles.
zh_tw: 包含了有關群組的資訊，且能夠呼叫群組中的所有節點或取得群組中節點的列表。

source: It contains some global state functionality, such as setting pause mode or quitting the process.
de: Es beinhaltet einige Funktionalität zum Globalen Zustand, wie dem Pausieren oder Beenden des Prozesses.
es: Contiene alguna funcionalidad de estado global, como configurar el modo de pausa o salir del proceso.
fr: Elle contient certaines fonctionnalités d'état global, comme le réglage du mode pause ou quitter le processus.
ko: 일시 정지 모드 설정이나 프로세스 종료와 같은, 일부 전역 상태 기능이 포함되어 있습니다.
pt_br: Ela contém alguma funcionalidade de estado global, como configurar o modo de pausa ou encerrar o processo.
zh_tw: 包含了一些全域狀態的功能，如設定暫停模式或結束處理程式。

source: When a node is part of the Scene Tree, the :ref:`SceneTree <class_SceneTree>` singleton can be obtained by calling :ref:`Node.get_tree() <class_Node_method_get_tree>`.
de: Wenn ein Node teil des Szenen-Baums (Scene Tree) ist, kann auf den Szenen-Baum (:ref:`SceneTree<class_SceneTree>`) als Singleton über :ref:`Node.get_tree() <class_Node_method_get_tree>`zugegriffen werden.
es: Cuando un nodo es parte del Árbol de Escenas, el singleton :ref:`SceneTree <class_SceneTree>` puede obtenerse simplemente llamando :ref:`Node.get_tree() <class_Node_method_get_tree>`.
fr: Lorsqu'un nœud fait partie de l'arbre des scènes, le singleton :ref:`SceneTree <class_SceneTree>` peut être obtenu en appelant simplement :ref:`Node.get_tree() <class_Node_method_get_tree>`.
ko: 노드가 씬 트리의 일부인 경우 :ref:`Node.get_tree() <class_Node_method_get_tree>`\ 를 호출해서 :ref:`SceneTree <class_SceneTree>` 싱글톤(Singleton)을 가져올 수 있습니다.
pt_br: Quando um nó é parte da Scene Tree, o singleton :ref:`SceneTree <class_SceneTree>` pode ser obtido chamando :ref:`Node.get_tree() <class_Node_method_get_tree>`.
zh_tw: 當節點成為場景樹的一部分後，便可以通過呼叫 :ref:`Node.get_tree() <class_Node_method_get_tree>` 來取得 :ref:`SceneTree <class_SceneTree>` 單例 (Singleton)。

source: Root viewport
de: Wurzel Fenster (Viewport)
es: Viewport raíz
fr: Le viewport racine
ko: 루트 뷰포트(Root viewport)
pt_br: Viewport raiz
zh_tw: 根檢視區

source: The root :ref:`Viewport <class_Viewport>` is always at the top of the scene. From a node, it can be obtained in two different ways:
de: Das Wurzel-Fenster (:ref:`Viewport <class_Viewport>`) ist immer am oberen Ende der Szene. Durch einen Node kann über folgende Wege auf es zugegriffen werden:
es: El :ref:`Viewport <class_Viewport>` raíz está siempre en la parte superior de la escena. Desde un nodo, se puede obtener de dos maneras diferentes:
fr: Le :ref:`Viewport <class_Viewport>` racine est toujours en haut de la scène. A partir d'un nœud, il peut être obtenu de deux manières différentes :
ko: 루트 :ref:`Viewport <class_Viewport>`\ 는 항상 씬의 맨 위에 있습니다. 노드에서 두 가지 다른 방법으로 가져올 수 있습니다:
pt_br: A raiz :ref:`Viewport <class_Viewport>` está sempre no topo da cena. De um nó, ela pode ser obtida de duas maneiras diferentes:
zh_tw: 根 :ref:`Viewport <class_Viewport>` 永遠為場景的最上層。在一個節點內，根檢視區可以通過兩種不同方式取得：

source: This node contains the main viewport. Anything that is a child of a :ref:`Viewport <class_Viewport>` is drawn inside of it by default, so it makes sense that the top of all nodes is always a node of this type otherwise nothing would be seen.
de: Dieser Node enthält das Haupt-Fenster (Viewport - :ref:`Viewport <class_Viewport>`). Alles was diesem untergeordnet ist wird standardmäßig dargestellt, so macht es Sinn das die Wurzel aller Nodes immer ein Node dieses Typs ist, andererseits ist nichts sichtbar.
es: Este nodo contiene el viewport principal. Cualquier cosa hija de un :ref:`Viewport <class_Viewport>` es dibujado en su interior por defecto, toma sentido entonces que el nodo principal sea siempre uno de este tipo, de otro modo no se podría dibujar nada en pantalla.
fr: Ce nœud contient la fenêtre d'affichage principale. Tout ce qui est un enfant d'un :ref:`Viewport <class_Viewport>` est dessiné à l'intérieur de celui-ci par défaut, il est donc logique que le nœud en amont de tous les autres soit toujours un nœud de ce type, sinon rien ne serait vu.
ko: 이 노드는 메인 뷰포트를 포함합니다. :ref:`Viewport <class_Viewport>`\ 의 모든 자식은 기본적으로 그 안에 그려지므로 모든 노드의 맨 위는 항상 이 타입의 노드이며 그렇지 않으면 아무 것도 보이지 않을 것입니다.
pt_br: Este nó contém a janela de exibição principal. Qualquer coisa que é filho de uma :ref:`Viewport <class_Viewport>` é desenhada dentro dele por padrão, então faz sentido que o topo de todos os nós seja sempre um nó deste tipo, caso contrário nada seria visto.
zh_tw: 這個節點包含了主檢視區。所有東西 :ref:`Viewport <class_Viewport>` 的子節點預設都是繪製在其內部的，因此所有節點的最上層都會是 Viewport 型別，否則就不會顯示任何東西。

source: While other viewports can be created in the scene (for split-screen effects and such), this one is the only one that is never created by the user. It's created automatically inside SceneTree.
de: Wärend andere Fenster (Viewport) in der Szene erstellt werden können (für Split-screens z.B.), ist dieses das einzige das nicht vom Nutzer erstellt wird. Es wird automatisch durch den Szenen-Baum (SceneTree) bereitgestellt.
es: Mientras que se pueden crear otros viewports en la escena (para obtener resultados en pantalla dividida, etc.), ésta es la única que nunca es creada por el usuario. Se crea automáticamente dentro de SceneTree.
fr: Alors que d'autres viewports peuvent être créés dans la scène (pour des effets d'écran partagé et autres), celui-ci est le seul qui n'est jamais créé par l'utilisateur. Il est créé automatiquement à l'intérieur de SceneTree.
ko: 씬에 다른 뷰포트를 만들 수도 있지만(분할 화면 효과 등을 위해서) 루트 뷰포트는 유저가 만들 수 없는 유일한 노드입니다. 씬 트리에서 자동으로 생성됩니다.
pt_br: Enquanto outras viewports podem ser criadas na cena (para efeitos de tela dividida e tal), esta é a única que nunca é criada pelo usuário. É criado automaticamente dentro do SceneTree.
zh_tw: 雖然場景內也可以建立其他的 Viewport（用於畫面分割效果等），但根 Viewport 永遠都不會是由使用者建立的，而是在 SceneTree 內自動建立的。

source: Scene tree
de: Szenen-Baum (SceneTree)
es: Árbol de escenas
fr: Scene tree (Arbre de scène)
ko: 씬 트리
pt_br: Árvore de cena
zh_tw: 場景樹

source: When a node is connected, directly or indirectly, to the root viewport, it becomes part of the *scene tree*.
de: Wenn ein Node eingebunden wird, direkt oder indirekt, in das Wurzel-Fenster (Viewport) wird es Teil des Szenen-Baums (*SceneTree*).
es: Cuando un nodo es conectado, directa o indirectamente, al viewport raíz, se convierte en parte del *árbol de escenas*.
fr: Lorsqu'un nœud est connecté, directement ou indirectement, au viewport racine, il fait partie de l'arborescence des scènes.
ko: 노드가 루트 뷰포트에 직·간접적으로 연결되면 *씬 트리*\ 의 일부가 됩니다.
pt_br: Quando um nó é conectado, direta ou indiretamente, à viewport raiz, ele se torna parte da *árvore de cena*.
zh_tw: 當節點直接或間接地連接上了根檢視區，就變成了 **場景樹** 的一部分。

source: When nodes enter the *Scene Tree*, they become active. They get access to everything they need to process, get input, display 2D and 3D visuals, receive and send notifications, play sounds, etc. When they are removed from the *scene tree*, they lose these abilities.
de: Sobald Nodes den *Szenenbaum* betreten werden sie aktiv. Sie erhalten Zugang zu allem, was sie verarbeiten müssen, erhalten Eingabe, zeigen 2D- als auch 3D Grafiken, erhalten und senden Benachrichtigungen, spielen Töne ab, et cetera. Doch als bald sie vom *Szenenbaum* entfernt werden verlieren sie jene Fähigkeiten.
es: Cuando los nodos entran en el *Árbol de Escenas*, se activan. Tienen acceso a todo lo que necesitan para procesar, obtener entradas, mostrar 2D y 3D, notificaciones, reproducir sonido, etc. Cuando se remueven del *árbol de escenas*, pierden acceso a todas esas funcionalidades.
fr: Lorsque les nœuds entrent dans l'*arbre de scène*, ils deviennent actifs. Ils ont accès à tout ce dont ils ont besoin pour fonctionner, obtenir des entrées, afficher des données en 2D et 3D, recevoir et envoyer des notifications, jouer du son, etc. Lorsqu'ils sont retirés de l'*arbre de scène*, ils perdent cet accès.
ko: 노드는 *씬 트리*\ 에 들어가면 활성화됩니다. 노드는 입력을 받거나 처리하고, 2D 및 3D 오브젝트를 화면에 표시하고, 알림을 송·수신하고, 소리를 재생하는 등 필요한 모든 것에 접근할 수 있습니다. 노드가 *씬 트리*\ 에서 제거되면 이러한 능력을 잃게 됩니다.
pt_br: Quando os nós entram na *Scene Tree*, eles se tornam ativos. Eles têm acesso a tudo o que precisam para processar, obter entrada, exibir visuais em 2D e 3D, enviar e receber notificações, reproduzir sons, etc. Quando são removidos da *árvore de cena*, eles perdem essas habilidades.
zh_tw: 當節點進入 **場景樹** 便成為了有效節點。這些節點將可以存取所有節點需要處理的資源，如取得輸入、顯示 2D 或 3D 畫面、接受與送出通知、播放聲音…等。當節點從 **場景樹** 中移除後便失去了這些能力。

source: Tree order
de: Baumstruktur
es: Orden del árbol
fr: Ordre de l'arborescence
ko: 트리 순서
pt_br: Ordem da árvore
zh_tw: 樹順序

source: Most node operations in Godot, such as drawing 2D, processing, or getting notifications are done in tree order. This means that parents and siblings with a lower rank in the tree order will get notified before the current node.
de: Die meisten Node Tätigkeiten in Godot, wie z.B. 2D Zeichen, Verarbeiten, oder Benachrichtigungen erhalten, werden nacheinander entsprechend der Baumstruktur abgearbeitet. Dies hat zur Folge, dass Eltern- als auch Geschwisterelemente mit einer tiefergelegenen Positionen benachrichtigt werden vor dem aktuellen Node.

source: "Becoming active" by entering the *Scene Tree*
de: "Werden aktiv" durch das Betreten des *Szenenbaums*
es: "Activación" entrando en el *Árbol de escenas*
fr: "Activation" en entrant dans l'*arbre de scène* (Scene Tree)
ko: *씬 트리*\ 에 들어가서 "활성화되기"
pt_br: "Tornando-se ativo" entrando na * Scene Tree *
zh_tw: 藉由進入 **場景樹** 來「成為有效狀態」

source: A scene is loaded from disk or created by scripting.
de: Eine Szene wird von der Festplatte geladen oder selbst geskriptet.
es: Una escena es cargada desde disco o creada mediante scripting.
fr: Une scène est chargée à partir du disque ou créée par un script.
ko: 씬은 디스크에서 불러오거나 스크립트에 의해 만들어집니다.
pt_br: Uma cena é carregada do disco ou criada pelo script.
zh_tw: 某個場景由硬碟載入或由腳本建立。

source: The root node of that scene (only one root, remember?) is added as either a child of the "root" Viewport (from SceneTree), or to any child or grandchild of it.
de: Das Root-Node jener Szene (nur ein einziges Root-Element, schon vergessen?) wird entweder als Kind des "Root-Viewports" (vom Szenenbaum), oder als Kind oder Enkel hinzugefügt.

source: Every node of the newly added scene, will receive the "enter_tree" notification ( _enter_tree() callback in GDScript) in top-to-bottom order.
de: Jedes Node der neu hinzugefügten Szene wird die "enter_tree"-Benachrichtigung (_enter_tree() callback in GDScript) von oben aus abwärts nach unten erhalten.

source: An extra notification, "ready" ( _ready() callback in GDScript) is provided for convenience, when a node and all its children are inside the active scene.
de: Eine zusätzliche Mitteilung, "ready" ( _ready() Aufruf in GDScript) wird erstellt, wenn das Node und alle seine Kinder innerhalb der aktiven Szene sind.

source: When a scene (or part of it) is removed, they receive the "exit scene" notification ( _exit_tree() callback in GDScript) in bottom-to-top order
de: Sobald eine Szene (oder ein Teil davon) entfernt wird, erhalten sie die "exit scene"-Benachrichtigung (_exit_tree() callback in GDScript) in von unten nach oben gehenden Reihenfolge

source: Changing current scene
de: Änderung der aktuellen Szene
es: Cambiando la escena actual
fr: Changement de la scène courante
ko: 현재 씬 변경하기
pt_br: Alterando a cena atual
zh_tw: 修改目前場景
