Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/custom_modules_*_cpp.po
Languages: es, fr, zh_cn, zh_tw

source: Custom modules in C++
es: Módulos personalizados en C++
fr: Modules personnalisées en C++
zh_cn: 自定义 C++ 模块
zh_tw: 以 C++ 語言自定模組

source: Modules
es: Módulos
zh_cn: 模块
zh_tw: 模組

source: Godot allows extending the engine in a modular way. New modules can be created and then enabled/disabled. This allows for adding new engine functionality at every level without modifying the core, which can be split for use and reuse in different modules.
es: Godot permite extender el motor de forma modular. Se pueden crear nuevos módulos, y después, activarlos o desactivarlos. Esto permite añadir nuevas funcionalidades para el motor en todos los niveles sin modificar el núcleo, el cual se puede escindir para su uso y reutilizar en diferentes módulos.
fr: Godot permet d'étendre le moteur de façon modulaire. Les nouveaux modules peuvent être créés et être ensuite activés ou désactivés. Cela permet d'ajouter de nouvelles fonctionnalités au moteur à chaque niveau sans modifier le cœur du moteur , qui peuvent être découpées pour l’utilisation et la réutilisation dans d'autres modules.
zh_cn: Godot 允许通过模块化的方式对引擎进行扩展. 你可以创建新的模块, 然后启用/禁用它. 这允许在每个级别添加新的引擎功能, 而无需修改内核, 可以将其拆分以供在不同模块中使用和重用.
zh_tw: 在 Godot 中可以通過模組化的方法來擴充引擎。可以建立新的模組，並啟用或禁用該模組。這樣一來便能在不修改核心的情況下，在任何一個層級上為引擎加上新功能，而這些功能也能拆分為不同的模組來使用於復用。

source: Modules are located in the ``modules/`` subdirectory of the build system. By default, dozens of modules are enabled, such as GDScript (which, yes, is not part of the base engine), the Mono runtime, a regular expressions module, and others. As many new modules as desired can be created and combined. The SCons build system will take care of it transparently.
es: Los módulos se encuentran en el subdirectorio ``modules/`` del sistema de compilación. Por defecto, decenas de módulos están activados, como GDScript (pues sí, no es parte del motor base), el tiempo de ejecución de Mono, un módulo de expresiones regulares, entre otros. Se pueden crear y combinar tantos módulos nuevos como se quiera. El sistema de compilación SCons se encargará de ello transparentemente.
fr: Les modules sont situés dans le sous-répertoire ``modules/`` du système de construction. Par défaut, des dizaines de modules sont activés, tels que GDScript (qui, oui, ne fait pas partie du moteur de base), le runtime Mono, un module d'expressions régulières, et d'autres. Il est possible de créer et de combiner autant de nouveaux modules que souhaité. Le système de construction SCons s'en chargera de manière transparente.
zh_cn: 模块位于构建系统的 ``modules/`` 子目录下. 默认情况下, 有几十个模块被启用, 如GDScript(是的, 它不是基础引擎的一部分), Mono运行时, 正则表达式模块和其他. 可以根据需要创建和组合尽可能多的新模块.SCons构建系统将清晰地处理它.
zh_tw: 模組放在建置系統的 ``modules/`` 子資料夾中。Godot 預設啟用了數個模組，如 GDScript (沒錯，GDScript 並非基礎引擎的一部分)、Mono 執行環境、正規表示式模組…以及其他更多模組。可以建立任意數量的新模組並任意組合使用。SCons 會自動處理。

source: What for?
es: ¿Para qué?
fr: Pourquoi ?
zh_cn: 可以做什么？
zh_tw: 可以做什麼？

source: While it's recommended that most of a game be written in scripting (as it is an enormous time saver), it's perfectly possible to use C++ instead. Adding C++ modules can be useful in the following scenarios:
es: Mientras se recomienda que la mayor parte de un juego se escriba en scripts (ya que ahorra mucho tiempo), resulta posible usar C++ en su lugar. Añadir módulos C++ puede resultar útil en los siguientes escenarios:
fr: Bien qu'il soit recommandé que la majeure partie d'un jeu soit écrite en scripting (car c'est un énorme gain de temps), il est parfaitement possible d'utiliser C++ à la place. L'ajout de modules C++ peut être utile dans les scénarios suivants :
zh_cn: 尽管我们建议使用脚本编写游戏的大部分代码(因为这能够节省大量的时间), 但使用 C++ 进行开发也是完全可行的. 在以下情况下, 添加C ++模块可能会很有用:
zh_tw: 雖然對於大多數的遊戲來說我們都建議通過腳本來撰寫 (因為能大幅節省時間)，但使用 C++ 也完全沒問題。下列情況適合撰寫新的 C++ 模組：

source: Binding an external library to Godot (like PhysX, FMOD, etc).
es: Vincular una biblioteca externa a Godot (como PhysX, FMOD, etc.).
fr: Relier une librairie externe à Godot (comme PhysX, FMOD, etc).
zh_cn: 将外部库绑定到 Godot（例如 PhysX、FMOD 等）。
zh_tw: 將外部函式庫繫結到 Godot 中 (如 PhysX, FMOD…等)。

source: Optimize critical parts of a game.
es: Optimizar partes críticas de un juego.
fr: Optimiser des parties critiques d'un jeu.
zh_cn: 优化游戏的核心部分。
zh_tw: 最佳化遊戲中重要的部分。

source: Adding new functionality to the engine and/or editor.
es: Añadir una nueva funcionalidad al motor y/o al editor.
fr: Ajouter de nouvelles fonctionnalités au moteur et/ou à l'éditeur.
zh_cn: 为引擎和/或编辑器添加新功能。
zh_tw: 為引擎與／或編輯器加上新功能。

source: Porting an existing game to Godot.
zh_tw: 移植現有遊戲。

source: Write a whole, new game in C++ because you can't live without C++.
es: Escribe un nuevo juego entero en C++ porque no puedes vivir sin C++.
fr: Écrire tout un jeu en C++ car vous ne pouvez pas vivre sans C++.
zh_cn: 使用 C++ 编写整个新游戏，因为你离不开 C++。
zh_tw: 如果你沒有 C++ 活不下去的話，可以用 C++ 來撰寫一個完整的新遊戲。

source: Creating a new module
es: Crear un nuevo módulo
fr: Créer un nouveau module
zh_cn: 创建新模块
zh_tw: 建立新模組

source: Before creating a module, make sure to :ref:`download the source code of Godot and compile it <toc-devel-compiling>`.
es: Antes de crear un módulo, asegúrate de :ref:`descargar el código fuente de Godot y compilarlo <toc-devel-compiling>`.
fr: Avant de créer un module, assurez-vous de :ref:`télécharger le code source de Godot et de le compiler <toc-devel-compiling>`.
zh_cn: 创建模块之前，请先\ :ref:`下载 Godot 源代码并编译 <toc-devel-compiling>`\ 。
zh_tw: 在建立模組之前，請先下載 Godot 的原始碼並進行編譯。在說明文件中有相關的教學。

source: To create a new module, the first step is creating a directory inside ``modules/``. If you want to maintain the module separately, you can checkout a different VCS into modules and use it.
es: Para crear un nuevo módulo, el primer paso es crear un directorio dentro de ``modules/``. Si quieres mantener el módulo por separado, puedes obtener un VCS diferente en módulos para utilizarlo.
fr: Pour créer un nouveau module, la première étape est de créer un dossier dans ``modules/``. Si vous voulez maintenir votre module séparément, vous pouvez mettre en place un système de gestion de versions dans modules.
zh_cn: 要创建一个新模块, 首先我们要在 ``modules/`` 文件夹下创建一个新目录. 如果要单独维护模块, 则可以在版本控制系统(VCS)检出到模块中并使用它.
zh_tw: 要建立新的模組，第一步就是在 ``modules/`` 中建立一個新資料夾。若想分開維護模組的話，可以將不同的 VCS 簽出 (Checkout) 到 modules 內來使用。

source: The example module will be called "summator" (``godot/modules/summator``). Inside we will create a summator class:
zh_tw: 實例模組的名字就叫“summator（加法器）”（ ``godot/modules/summator`` ）。我們在裡面建立一個簡單的加法器類：

source: And then the cpp file.
es: Y después, el archivo cpp.
fr: Et puis le fichier cpp.
zh_cn: 然后是 cpp 文件。
zh_tw: 以及 cpp 檔。

source: Then, the new class needs to be registered somehow, so two more files need to be created:
es: Esta nueva clase necesita ser registrada de alguna forma, así que se necesitan dos archivos más para ser creada:
fr: Ensuite, la nouvelle classe doit être enregistrée d'une manière ou d'une autre, deux fichiers supplémentaires doivent être créés :
zh_cn: 然后, 需要以某种方式注册新类, 因此需要再创建两个文件:
zh_tw: 接著，我們需要用某種方式註冊這個新類別，所以需要建立另外兩個檔案：

source: These files must be in the top-level folder of your module (next to your ``SCsub`` and ``config.py`` files) for the module to be registered properly.
es: Los archivos anteriores deben estar en la carpeta de nivel superior de tu módulo (junto a tus archivos ``SCsub`` y ``config.py``) para que el módulo se registre correctamente.
fr: Ces fichiers doivent se trouver dans le dossier de haut niveau de votre module (à côté de vos fichiers ``SCsub`` et ``config.py``) pour que le module soit correctement enregistré.
zh_cn: 这些文件必须在你的模块的顶层文件夹中( ``SCsub`` 和 ``config.py`` 文件旁边), 这样模块才能被正确注册.
zh_tw: 這幾個檔案必須要放在模組的最上層目錄 (也就是 ``SCsub`` 與 ``config.py`` 檔的旁邊)，這樣一來模組才能被正確註冊。

source: These files should contain the following:
es: Estos archivos deberán contener lo siguiente:
fr: Ces fichiers doivent contenir les éléments suivants :
zh_cn: 这些文件应包含以下内容:
zh_tw: 這幾個檔案的內容如下：

source: Next, we need to create a ``SCsub`` file so the build system compiles this module:
es: Lo siguiente que necesitamos es crear un archivo ``SCsub``para que se compile este módulo:
fr: Ensuite, nous devons créer un fichier ``SCsub`` pour que le système de compilation compile ce module :
zh_cn: 接下来, 我们需要创建一个 ``SCsub`` 文件, 以便构建系统编译此模块:
zh_tw: 接下來，我們需要建立 ``SCsub`` 檔案，這樣建置系統才能編譯該模組：

source: With multiple sources, you can also add each file individually to a Python string list:
es: Con múltiples fuentes, también puede agregar cada archivo individualmente a una lista de cadenas de Python:
fr: Avec des sources multiples, vous pouvez également ajouter chaque fichier individuellement à une liste de chaînes de caractère Python :
zh_cn: 使用多个源文件, 你还可以将每个文件分别添加到Python字符串列表中:
zh_tw: 當有多個原始碼時，可以分別將各個檔案加到 Python 字串列表中：

source: This allows for powerful possibilities using Python to construct the file list using loops and logic statements. Look at some modules that ship with Godot by default for examples.
es: Esto permite grandes posibilidades usando Python para construir la lista de archivos usando bucles y declaraciones lógicas. Eche un vistazo a algunos módulos que vienen con Godot por defecto para ver ejemplos.
fr: Cela offre de puissantes possibilités en utilisant Python pour construire la liste des fichiers à l'aide de boucles et d'instructions logiques. Regardez certains modules qui sont livrés avec Godot par défaut pour des exemples.
zh_cn: 使用循环和逻辑语句, 这使得使用Python来构建文件列表有了强大的可行性. 请看Godot默认的一些模块的例子.
zh_tw: 通過這種做法，我們便可以通過 Python 的迴圈與邏輯陳述式來達成各種可能性。請參考 Godot 預設附帶的模組為例。

source: To add include directories for the compiler to look at you can append it to the environment's paths:
es: Puedes agregar directorios de inclusión a las rutas de entorno para que sean vistos por el compilador:
fr: Pour ajouter des répertoires d'include à consulter par le compilateur, vous pouvez l'ajouter aux chemins de l'environnement :
zh_cn: 要添加供编译器查看的包含目录, 可以将其追加到环境的路径中:
zh_tw: 要新增讓編譯器搜尋的 include 資料夾，可以將資料夾附加到編譯環境的路徑內：

source: If you want to add custom compiler flags when building your module, you need to clone ``env`` first, so it won't add those flags to whole Godot build (which can cause errors). Example ``SCsub`` with custom flags:
es: Si desea añadir banderas personalizadas de compilador al construir su módulo, primero necesita clonar `` env ``, para que no añada esas banderas a toda la compilación de Godot (lo cual puede causar errores). Ejemplo de `` SCsub`` con banderas personalizadas:
fr: Si vous voulez ajouter des drapeaux de compilation personnalisés lors de la construction de votre module, vous devez d'abord cloner `env`, afin qu'il n'ajoute pas ces drapeaux à la construction de Godot (ce qui peut causer des erreurs). Exemple ``SCsub`` avec des drapeaux personnalisés :
zh_cn: 如果你想在构建模块时添加自定义编译器标志，你需要先克隆 ``env`` ，这样它就不会把这些标志添加到整个Godot构建中（这可能导致错误）。例子 ``SCsub`` 带有自定义标志:
zh_tw: 若要為模組新增自定編譯器旗標，則需要先複製 ``env`` 變數，以免修改到整個 Godot 建置用的旗標 (進而導致發生錯誤)。下列為使用自定旗標的 ``SCsub`` 範例：

source: And finally, the configuration file for the module, this is a Python script that must be named ``config.py``:
zh_tw: 最後是模組的組態設定檔，這個設定檔是一個名為 ``config.py`` 的簡易 Python 腳本：

source: The module is asked if it's OK to build for the specific platform (in this case, ``True`` means it will build for every platform).
es: Se le pregunta al módulo si está bien construirlo para la plataforma especificada (en este caso, ``True`` significa que se construirá para cada plataforma).
fr: Il est demandé au module s'il peut être construit pour la plate-forme spécifique (dans ce cas, ``True`` signifie qu'il sera construit pour chaque plate-forme).
zh_cn: 询问模块是否可以针对特定平台进行构建(在这种情况下, ``True`` 表示它将针对每个平台进行构建).
zh_tw: 建置時會詢問是否能在各個特定的平台上進行建置 (在這個例子中， ``True`` 則代表所有平台上都會進行建置)。

source: And that's it. Hope it was not too complex! Your module should look like this:
es: Y eso es todo. ¡Espero que no haya sido demasiado complicado! Su módulo debería verse así:
fr: Et c'est tout. J'espère que ce n'était pas trop complexe ! Votre module devrait ressembler à ceci :
zh_cn: 就是这样. 希望它不太复杂！ 你的模块应如下所示:
zh_tw: 就這樣。希望不會太複雜！最終模組應該會長這樣：

source: You can then zip it and share the module with everyone else. When building for every platform (instructions in the previous sections), your module will be included.
es: Luego puede comprimirlo y compartir el módulo con todos los demás. Cuando se construya para cada plataforma (instrucciones en las secciones anteriores), se incluirá su módulo.
fr: Vous pouvez ensuite le zipper et partager le module avec tous les autres. Lors de la construction de chaque plateforme (instructions dans les sections précédentes), votre module sera inclus.
zh_cn: 然后, 你可以压缩它并与其他所有人分享该模块. 当针对每个平台进行构建时(上一节中的说明), 你的模块将包括在内.
zh_tw: 接著可以將該模組打包為壓縮檔，然後將模組分享給其他人。當為所有平台編譯時 (有關編譯的說明在前一段中)，該模組都會被包含在內。

source: There is a parameter limit of 5 in C++ modules for things such as subclasses. This can be raised to 13 by including the header file ``core/method_bind_ext.gen.inc``.
es: Hay un límite de 5 parámetros en los módulos de C ++ para cosas como subclases. Este límite puede llegar a alcanzar 13 si se incluye el archivo de encabezado ``core / method_bind_ext.gen.inc``.
fr: Il existe une limite de 5 paramètres dans les modules C++ pour des choses telles que les sous-classes. Cette limite peut être portée à 13 en incluant le fichier d'en-tête ``core/method_bind_ext.gen.inc``.
zh_cn: 对于子类之类的东西,C ++模块中的参数限制为5. 通过包含头文件 ``core/method_bind_ext.gen.inc``, 可以将其增加到13个.
zh_tw: 對於如子類別別 (Subclass) 的東西，C++ 模組內限制最多只能有 5 個參數。包含了標頭檔 ``core/method_bind_ext.gen.inc`` 便可提升至 13 個。

source: Using the module
es: Usar el módulo
fr: Utilisation du module
zh_cn: 使用模块
zh_tw: 使用模組

source: You can now use your newly created module from any script:
es: Ahora puede usar su módulo recién creado desde cualquier script:
fr: Vous pouvez maintenant utiliser votre module nouvellement créé à partir de n'importe quel script :
zh_cn: 现在, 你可以通过任何脚本使用新创建的模块:
zh_tw: 現在，可以在任何腳本內使用剛才建立的模組了：

source: The output will be ``60``.
es: La salida será ``60``.
fr: La sortie sera ``60``.
zh_cn: 输出将是 ``60`` .
zh_tw: 輸出為 ``60`` 。

source: The previous Summator example is great for small, custom modules, but what if you want to use a larger, external library? Refer to :ref:`doc_binding_to_external_libraries` for details about binding to external libraries.
es: El ejemplo Summator anterior es excelente para módulos personalizados pequeños, pero podría preguntarse qué sucede si desea usar una biblioteca externa más grande. Consulte :ref:`doc_binding_to_external_libraries` para más detalles sobre la vinculación de librerías externas.
fr: L'exemple précédent de Summator est parfait pour les petits modules personnalisés, mais que faire si vous souhaitez utiliser une bibliothèque externe plus importante ? Référez-vous à :ref:`doc_binding_to_external_libraries` pour plus de détails sur la liaison avec les bibliothèques externes.
zh_cn: 前面的Summator例子对于小型的自定义模块来说是很好的, 但是如果你想使用一个更大的外部库呢？请参考 :ref:`doc_binding_to_external_libraries`, 了解有关绑定外部库的细节.
zh_tw: 剛才的 Summator 例子適合小型的自定模組，但如果想使用大型的外部函式庫呢？有關繫結外部函式庫的詳細訊息，請參考 :ref:`doc_binding_to_external_libraries` 。

source: If your module is meant to be accessed from the running project (not just from the editor), you must also recompile every export template you plan to use, then specify the path to the custom template in each export preset. Otherwise, you'll get errors when running the project as the module isn't compiled in the export template. See the :ref:`Compiling <toc-devel-compiling>` pages for more information.
es: Si se debe acceder a su módulo desde el proyecto en ejecución (no solo desde el editor), también debe recompilar cada plantilla de exportación que planea usar, y después especificar la ruta a la plantilla personalizada en cada ajuste preestablecido de exportación. De lo contrario, obtendrá errores al ejecutar el proyecto, ya que el módulo no se compila en la plantilla de exportación. Consulte las páginas :ref:`Compilación de <toc-devel-compiling>` para obtener más información.
fr: Si votre module est destiné à être accessible depuis le projet en cours (et pas seulement depuis l'éditeur), vous devez également recompiler chaque modèle d'exportation que vous prévoyez d'utiliser, puis spécifier le chemin d'accès au modèle personnalisé dans chaque préréglage d'exportation. Sinon, vous obtiendrez des erreurs lors de l'exécution du projet car le module n'est pas compilé dans le modèle d'exportation. Voir les pages :ref:`Compilation <toc-devel-compilation>` pour plus d'informations.
zh_cn: 如果要从正在运行的项目（而不仅仅是从编辑器）访问模块，则还必须重新编译计划使用的每个导出模板，然后在每个导出预设中指定自定义模板的路径。否则，由于未在导出模板中编译模块，因此在运行项目时会出现错误。更多信息见\ :ref:`编译 <toc-devel-compiling>`\ 页面。
zh_tw: 若模組時要用來在執行中專案內存取的 (即不只是從編輯器中)，則必須要重新編譯每個要使用到的匯出樣板，然後在各個匯出預設設定中指定自定樣板的路徑。否則在執行專案的時候會產生錯誤，因為模組沒有被編譯到匯出樣板中。更多資訊請參考 :ref:`編譯 <toc-devel-compiling>` 一頁。

source: Compiling a module externally
es: Compilar un módulo externamente
fr: Compilation d'un module en externe
zh_cn: 从外部编译模块
zh_tw: 從外部編譯模組

source: Compiling a module involves moving the module's sources directly under the engine's ``modules/`` directory. While this is the most straightforward way to compile a module, there are a couple of reasons as to why this might not be a practical thing to do:
es: Compilar un módulo implica mover las fuentes del módulo directamente al directorio ``modules/``. Si bien esta es la forma más sencilla de compilar un módulo, hay un par de razones por las que esto podría no ser algo práctico:
fr: La compilation d'un module implique de déplacer les sources du module directement sous le répertoire ``modules/`` du moteur. Bien que ce soit la façon la plus simple de compiler un module, il y a plusieurs raisons pour lesquelles cela n'est pas pratique :
zh_cn: 编译一个模块需要将模块的源代码直接移到引擎的 ``modules/`` 目录下. 虽然这是最直接的编译模块的方法, 但是有几个原因说明为什么这样做不实用:
zh_tw: 編譯模組會需要將模組的原始碼直接移至 ``modules/`` 資料夾內。雖然這種方法是編譯模組最直觀的方式，但有些情況下我們可能不想用這種方式：

source: Having to manually copy modules sources every time you want to compile the engine with or without the module, or taking additional steps needed to manually disable a module during compilation with a build option similar to ``module_summator_enabled=no``. Creating symbolic links may also be a solution, but you may additionally need to overcome OS restrictions like needing the symbolic link privilege if doing this via script.
es: Tener que copiar manualmente las fuentes de los módulos cada vez que desee compilar el motor con o sin el módulo, o tomar los pasos adicionales necesarios para desactivar manualmente un módulo durante la compilación con una opción de compilación similar a ``module_summator_enabled=no``. La creación de enlaces simbólicos también puede ser una solución, pero es posible que deba superar las restricciones del sistema operativo como necesitar el privilegio de enlace simbólico si lo hace a través de un script.
fr: Devoir copier manuellement les sources des modules chaque fois que vous voulez compiler le moteur avec ou sans le module, ou prendre des mesures supplémentaires nécessaires pour désactiver manuellement un module pendant la compilation avec une option de compilation similaire à ``module_summator_enabled=no``. La création de liens symboliques peut également être une solution, mais vous devrez peut-être en outre surmonter des restrictions du système d'exploitation, comme le fait d'avoir besoin du privilège de lien symbolique si vous le faites par script.
zh_cn: 每次编译引擎时, 不管有没有模块, 都必须手动复制模块源码, 或者在编译过程中使用类似 ``module_summator_enabled=no`` 的编译选项, 采取额外的步骤手动禁用模块. 创建符号链接也是一种解决方案, 但你可能还需要克服操作系统的限制, 比如如果通过脚本来做, 需要符号链接的权限.
zh_tw: 不管要不要編譯模組，每次編譯引擎的時候都需要手動複製模組的原始碼，甚至還需要額外的步驟來手動在編譯時期通過如 ``module_summator_enabled=no`` 這樣的建置選項來停用模組。建立符號連結可能是個解法，但如果要通過腳本實作的話，可能會需要解決一些如符號連結權限這樣的作業系統限制。

source: Depending on whether you have to work with the engine's source code, the module files added directly to ``modules/`` changes the working tree to the point where using a VCS (like ``git``) proves to be cumbersome as you need to make sure that only the engine-related code is committed by filtering changes.
es: Dependiendo de si tienes que trabajar con el código fuente del motor, los archivos del módulo agregados directamente a la carpeta ``modules/`` cambian el árbol de trabajo hasta el punto en que usar un Sistema de Control de Versiones (como ``git``) puede ser complicado, ya que necesitas asegurarte de que solo se hagan commits de los cambios relacionados con el motor mediante la filtración de los cambios.
fr: Selon que vous devez ou non travailler avec le code source du moteur, les fichiers de module ajoutés directement à ``modules/`` modifient l'arborescence de travail au point où l'utilisation d'un VCS (comme ``git``) s'avère lourde car vous devez vous assurer que seul le code lié au moteur est commit en filtrant les modifications.
zh_cn: 根据你是否需要使用引擎的源代码, 直接添加到 ``modules/`` 的模块文件会改变工作树, 以至于使用VCS(比如 ``git`` )被证明是很麻烦的, 因为你需要通过过滤变化来确保只提交与引擎相关的代码.
zh_tw: 依據是否有要修改引擎的程式碼，當使用 VCS (如 ``git``) 時如果將模組檔案直接放到 ``modules/`` 會更改到工作樹，進而造成需要篩選更改來只 Commit 引擎相關程式碼的麻煩。

source: So if you feel like the independent structure of custom modules is needed, lets take our "summator" module and move it to the engine's parent directory:
es: Si sientes que la estructura independiente de módulos personalizados es necesaria, tomemos nuestro módulo "summator" y muévelo al directorio principal del motor:
fr: Donc, si vous pensez que la structure indépendante des modules personnalisés est nécessaire, prenons notre module "summator" et déplaçons-le dans le répertoire parent du moteur :
zh_cn: 所以, 如果你觉得需要自定义模块的独立结构, 把 "summator" 模块移到引擎的父目录下:
zh_tw: 因此，如果想要在自定模組上使用獨立的架構，我們可以將「summator」模組移到引擎上層的資料夾：

source: Compile the engine with our module by providing ``custom_modules`` build option which accepts a comma-separated list of directory paths containing custom C++ modules, similar to the following:
es: Para compilar el motor con nuestro módulo, proporcionemos la opción de compilación ``custom_modules``, que acepta una lista separada por comas de rutas de directorios que contienen módulos C++ personalizados, similar a lo siguiente:
fr: Compilez le moteur avec notre module en fournissant l'option de compilation ``custom_modules`` qui accepte une liste de chemins de répertoire séparés par des virgules contenant des modules C++ personnalisés, comme ci-dessous :
zh_cn: 通过提供 ``custom_modules`` 构建选项来编译我们的引擎, 该选项接受一个以逗号分隔的包含自定义C++模块的目录路径列表, 类似于下面:
zh_tw: 然後通過提供一個 ``custom_moduels`` 建置選項來將自定模組與引擎一起編譯。這個建置選項允許傳入一組以逗號分隔的列表，其中為包含自定 C++ 模組的路徑，用法如下：

source: The build system shall detect all modules under the ``../modules`` directory and compile them accordingly, including our "summator" module.
es: El sistema de compilación detectará automáticamente todos los módulos en el directorio ``../modules`` y los compilará según corresponda, incluido nuestro módulo "summator".
fr: Le système de compilation doit détecter tous les modules du répertoire ``../modules`` et les compiler en conséquence, y compris notre module "summator".
zh_cn: 构建系统将检测到 ``./modules`` 目录下的所有模块并进行相应的编译, 包括 "summator" 模块.
zh_tw: 建置系統應該會自動偵測 ``../modules`` 資料夾下的所有模組然後進行編譯。其中，包含了我們的「summator」模組。
