Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/custom_modules_*_cpp.po
Languages: es, fr, zh_cn, zh_tw

source: Any path passed to ``custom_modules`` will be converted to an absolute path internally as a way to distinguish between custom and built-in modules. It means that things like generating module documentation may rely on a specific path structure on your machine.
es: Cualquier ruta proporcionada a ``custom_modules`` se convertirá internamente en una ruta absoluta como una forma de distinguir entre módulos personalizados e integrados. Esto significa que cosas como generar la documentación del módulo pueden depender de una estructura de ruta específica en tu máquina.
fr: Tout chemin passé à ``custom_modules`` sera converti en un chemin absolu en interne afin de distinguer les modules personnalisés des modules intégrés. Cela signifie que des choses comme la génération de la documentation des modules peuvent dépendre d'une structure de chemin spécifique sur votre machine.
zh_cn: 传递给 ``custom_modules`` 的任何路径都将在内部转换为绝对路径, 以区分自定义模块和内置模块, 这意味着像生成模块文档这样的事情可能会依赖于你机器上的特定路径结构.
zh_tw: 所有傳到 ``custom_modules`` 的路徑都會被自動轉換為絕對路徑，以區分自定與內建模組。這表示，如產生模組說明文件等行為可能需要以來建置用機器上特定的路徑結構。

source: :ref:`Introduction to the buildsystem - Custom modules build option <doc_buildsystem_custom_modules>`.
es: :ref:`Introducción al sistema de compilación - Opción de compilación de módulos personalizados <doc_buildsystem_custom_modules>`.
fr: :ref:`Introduction au système de compilation - Option de compilation de modules personnalisés <doc_buildsystem_custom_modules>`.
zh_cn: :ref:`构建系统介绍 - 自定义模块构建选项 <doc_buildsystem_custom_modules>`.
zh_tw: :ref:`建置系統簡介 - 自定模組建置選項 <doc_buildsystem_custom_modules>` 。

source: Customizing module types initialization
zh_tw: 自訂展現形式

source: Modules can interact with other built-in engine classes during runtime and even affect the way core types are initialized. So far, we've been using ``register_summator_types`` as a way to bring in module classes to be available within the engine.
zh_tw: 模組可以在運作時與其他內建引擎類別互動，甚至影響核心型別的初始化方式。到目前為止，我們一直在使用“register_summator_types”作為引入模組類別以在引擎中可用的方法。

source: A crude order of the engine setup can be summarized as a list of the following type registration methods:
zh_tw: 引擎設定的粗略順序可以概括為以下型別註冊方法的列表：

source: Our ``Summator`` class is initialized during the ``register_module_types()`` call. Imagine that we need to satisfy some common module run-time dependency (like singletons), or allow us to override existing engine method callbacks before they can be assigned by the engine itself. In that case, we want to ensure that our module classes are registered *before* any other built-in type.
zh_tw: 我們的“Summator”類別在“register_module_types()”呼叫期間初始化。想像一下，我們需要滿足一些常見的模組運作時依賴性（例如單例），或者允許我們覆蓋現有的引擎方法回調，然後才能由引擎本身分配它們。在這種情況下，我們希望確保我們的模組類別在任何其他內建型別*之前*註冊。

source: This is where we can define an optional ``preregister_summator_types()`` method which will be called before anything else during the ``preregister_module_types()`` engine setup stage.
zh_tw: 這是我們可以定義一個可選的“preregister_summator_types()”方法的地方，該方法將在“preregister_module_types()”引擎設定階段期間在其他任何事情之前被呼叫。

source: We now need to add this method to ``register_types`` header and source files:
zh_tw: 我們現在需要將此方法新增到「register_types」頭檔和來源檔案：

source: Unlike other register methods, we have to explicitly define ``MODULE_SUMMATOR_HAS_PREREGISTER`` to let the build system know what relevant method calls to include at compile time. The module's name has to be converted to uppercase as well.
zh_tw: 與其他註冊方法不同，我們必須明確定義“MODULE_SUMMATOR_HAS_PREREGISTER”，以使建置系統知道在編譯時要包含哪些相關方法呼叫。模組的名稱也必須轉換為大寫。

source: Improving the build system for development
es: Mejorando el sistema de compilación para el desarrollo
fr: Améliorer le système de construction pour le développement
zh_cn: 改善开发的构建系统
zh_tw: 為開發環境改進建置系統

source: This shared library support is not designed to support distributing a module to other users without recompiling the engine. For that purpose, use a GDExtension instead.
zh_tw: 如果想要在不對引擎進行重新編譯的情況下，將模組分發給其他使用者，請使用 :ref:`GDNative <doc_what_is_gdnative>`。此處的共用庫支援並不是為此設計的。

source: So far, we defined a clean SCsub that allows us to add the sources of our new module as part of the Godot binary.
es: Hasta ahora, hemos definido un SCsub limpio que nos permite agregar las fuentes de nuestro nuevo módulo como parte del binario de Godot.
fr: Jusqu'à présent, nous avons défini un SCsub propre et simple qui nous permet d'ajouter les codes sources de notre nouveau module dans le programme binaire de Godot.
zh_cn: 到目前为止，我们定义了一个干净的 SCsub，让我们能够将新模块的源文件添加为 Godot 二进制文件的一部分。
zh_tw: 到目前為止，我們建立了一個用來將新模組的原始碼加到 Godot 二進位檔中的一個簡易的 SCsub 檔案。

source: This static approach is fine when we want to build a release version of our game, given we want all the modules in a single binary.
es: Este enfoque estático es adecuado cuando queremos compilar una versión de lanzamiento de nuestro juego y deseamos que todos los módulos estén en un solo binario.
fr: Cette approche statique est très bien quand nous voulons construire une version finale ("release") de notre jeu puisque nous voulons tous les modules dans un seul binaire.
zh_cn: 那么当我们要构建游戏的发行版，并希望将所有模块都放在一个二进制文件中时，这种静态方法就很好。
zh_tw: 當我們只是要建置遊戲的釋出版本時，由於我們想將所有模組都放在單一二進位檔中，這種靜態的方法沒什麼問題。

source: However, the trade-off is that every single change requires a full recompilation of the game. Even though SCons is able to detect and recompile only the file that was changed, finding such files and eventually linking the final binary takes a long time.
es: Sin embargo, el inconveniente es que cada cambio requiere una recompilación completa del juego. Aunque SCons puede detectar y recompilar solo el archivo que ha sido modificado, encontrar dichos archivos y finalmente vincular el binario final lleva mucho tiempo.
fr: Cependant, le compromis est que chaque changement signifie une recompilation complète du jeu. Même si SCons est capable de détecter et de recompiler uniquement les fichiers qui ont changé, trouver de tels fichiers et éventuellement relier le binaire final est une partie longue et coûteuse.
zh_cn: 然而，代价是每一个变化都意味着游戏的全面重新编译。即使 SCons 能够检测并重新编译已经改变的文件，找到这些文件并最终链接到最终的二进制文件会花费很长时间。
zh_tw: 但是，這種做法的代價就是每次改動時都需要重新編譯整個遊戲。就算 SCons 有辦法偵測並只重新編譯有改動的部分，要找出這些檔案並將其連結到最終的二進位檔是一段耗時且消耗資源的過程。

source: The solution to avoid such a cost is to build our own module as a shared library that will be dynamically loaded when starting our game's binary.
es: La solución para evitar ese costo es construir nuestro propio módulo como una biblioteca compartida que se cargará dinámicamente al iniciar el binario de nuestro juego.
fr: La solution pour éviter un tel coût est de construire notre module comme une bibliothèque partagée qui sera chargée dynamiquement au démarrage du binaire de notre jeu.
zh_cn: 避免这种成本的解决方案是将我们自己的模块构建为共享库, 该库在启动游戏二进制文件时将动态加载.
zh_tw: 要避免消耗這些資源的方法就是將我們的模組建置為會在開啟遊戲二進位檔時動態載入的共用函式庫。

source: Once compiled, we should end up with a ``bin`` directory containing both the ``godot*`` binary and our ``libsummator*.so``. However given the .so is not in a standard directory (like ``/usr/lib``), we have to help our binary find it during runtime with the ``LD_LIBRARY_PATH`` environment variable:
es: Una vez compilado, obtendremos un directorio ``bin`` que contiene tanto el ejecutable ``godot*`` como nuestra librería ``libsummator*.so``. Sin embargo, dado que la librería .so no se encuentra en un directorio estándar (como ``/usr/lib``), debemos ayudar a nuestro ejecutable a encontrarla durante la ejecución usando la variable de entorno ``LD_LIBRARY_PATH``:
fr: Une fois compilé, nous devrions aboutir à un répertoire ``bin`` contenant à la fois le binaire ``godot*`` et notre ``libsummator*.so``. Cependant, étant donné que le .so n'est pas dans un répertoire standard (comme ``/usr/lib``), nous devons aider notre binaire à le trouver pendant l'exécution avec la variable d'environnement ``LD_LIBRARY_PATH`` :
zh_cn: 一旦编译完成, 我们应该有一个 ``bin`` 目录, 其中包含 ``godot*`` 可执行文件和 ``libsummator*.so`` . 然而, 鉴于.so不在一个标准的目录中(如 ``/usr/lib`` ), 我们必须在运行时用 ``LD_LIBRARY_PATH`` 环境变量帮助可执行文件找到它:
zh_tw: 編譯後，就會出現同時包含了 ``godot*`` 與 ``libsummator*.so`` 的 ``bin`` 。但，由於 .so 並不在標準資料夾內 (如 ``/usr/lib``) 中，因此我們必須要通過 ``LD_LIBRARY_PATH`` 環境變數來讓我們的二進位檔能在執行時期找到這些函式庫：

source: You have to ``export`` the environment variable. Otherwise, you won't be able to run your project from the editor.
es: Debes ``exportar`` la variable de entorno. De lo contrario, no podrás ejecutar tu proyecto desde el editor.
fr: Vous devez exporter avec ``export`` la variable d'environnement. Sinon, vous ne pourrez pas lancer votre projet depuis l'éditeur.
zh_cn: 你必须 ``export`` 这个环境变量，否则你将无法从编辑器中运行你的项目。
zh_tw: 必須要 ``export`` 環境變數，否則將無法從編輯器來執行專案。

source: On top of that, it would be nice to be able to select whether to compile our module as shared library (for development) or as a part of the Godot binary (for release). To do that we can define a custom flag to be passed to SCons using the ``ARGUMENT`` command:
es: Además, sería conveniente poder seleccionar si queremos compilar nuestro módulo como una biblioteca compartida (para desarrollo) o como parte del binario de Godot (para distribución). Para hacer esto, podemos definir una bandera personalizada que se pasará a SCons usando el comando ``ARGUMENT``:
fr: De plus, il serait bon de pouvoir choisir de compiler notre module comme bibliothèque partagée (pour le développement) ou comme partie du binaire Godot (pour la version finale). Pour ce faire, nous pouvons définir un indicateur personnalisé à passer à SCons en utilisant la commande ``ARGUMENT`` :
zh_cn: 最重要的是，能够选择将我们的模块编译为共享库（用于开发）还是作为 Godot 二进制文件的一部分（用于发布）将是一件很不错的事情。为此，我们可以使用 ``ARGUMENT`` 命令定义要传递给 SCons 的自定义标志：
zh_tw: 此外，也可以能夠選擇是要將我們的模組作為共用函式庫 (用於開發) 還是作為 Godot 二進位檔的一部分 (用於釋出) 也不錯。要這麼做，我們必須要通過 ``ARGUMENT`` 指令定義一個會傳給 SCons 的自定旗標：

source: Now by default ``scons`` command will build our module as part of Godot's binary and as a shared library when passing ``summator_shared=yes``.
es: Ahora, por defecto, el comando ``scons`` construirá nuestro módulo como parte del binario de Godot y como una biblioteca compartida cuando se le pase ``summator_shared=yes``.
fr: Maintenant, par défaut, la commande ``scons`` va construire notre module comme une partie du binaire de Godot et comme une bibliothèque partagée en passant ``summator_shared=yes``.
zh_cn: 现在默认情况下, ``scons`` 命令会将我们的模块构建为Godot二进制文件的一部分, 并在传递 ``summator_shared=yes`` 时构建为共享库.
zh_tw: 現在，預設的 ``scons`` 指令會將我們的模組作為 Godot 二進位檔的一部分來編譯，而傳入 ``summator_shared=yes`` 時則會作為共用函式庫編譯。

source: Finally, you can even speed up the build further by explicitly specifying your shared module as target in the SCons command:
es: Finalmente, incluso puedes acelerar aún más la compilación especificando explícitamente tu módulo compartido como objetivo en el comando SCons. Por ejemplo:
fr: Enfin, vous pouvez même accélérer la construction en spécifiant explicitement votre module partagé comme cible dans la commande scons :
zh_cn: 最后, 你甚至可以通过在SCons命令中明确指定你的共享模块为目标来进一步加快构建速度:
zh_tw: 最後，我們還可以明確將共享函式庫指定為 SCons 指令的建構目標來進一步加速建構過程：

source: Writing custom documentation
es: Escribiendo documentación personalizada
fr: Rédaction de documentation personnalisée
zh_cn: 编写自定义文档
zh_tw: 撰寫自定說明文件

source: Writing documentation may seem like a boring task, but it is highly recommended to document your newly created module to make it easier for users to benefit from it. Not to mention that the code you've written one year ago may become indistinguishable from the code that was written by someone else, so be kind to your future self!
zh_tw: 撰寫說明文件看起來可能是一件無聊的工作，但我們非常建議為新建立的模組撰寫說明文件，這樣一來可以讓其他使用者更輕鬆地從模組中獲益。更不用提你自己一年前寫的程式碼看起來可能跟別人寫的程式差不多，因此也請善待未來的自己吧！

source: There are several steps in order to setup custom docs for the module:
es: Hay varios pasos para configurar la documentación personalizada para el módulo:
fr: Il y a plusieurs étapes pour mettre en place de la documentation personnalisée pour le module :
zh_cn: 为了设置模块的自定义文档, 有几个步骤:
zh_tw: 要為模組設定自定說明文件有幾個步驟：

source: Make a new directory in the root of the module. The directory name can be anything, but we'll be using the ``doc_classes`` name throughout this section.
es: Crear un nuevo directorio en la raíz del módulo. El nombre del directorio puede ser cualquier cosa, pero usaremos el nombre ``doc_classes`` en esta sección.
fr: Créez un nouveau répertoire à la racine du module. Le nom du répertoire peut être n'importe quoi, mais nous utiliserons le nom ``doc_classes`` tout au long de cette section.
zh_cn: 在模块的根目录中创建一个新目录. 目录名称可以是任何名称, 但是在本节中, 我们将使用 ``doc_classes`` 名称.
zh_tw: 在模組的根目錄建立新資料夾。該資料夾可任意明明，但我們會在本段落中使用 ``doc_classes`` 這個名稱。

source: Now, we need to edit ``config.py``, add the following snippet:
es: Ahora necesitamos editar ``config.py``, agrega el siguiente código:
fr: Maintenant, nous devons éditer ``config.py`` et ajouter l'extrait suivant :
zh_cn: 现在, 我们需要编辑 ``config.py`` , 添加以下片段:
zh_tw: 接著，我們需要編輯 ``config.py`` ，加入下列程式碼片段：

source: The ``get_doc_path()`` function is used by the build system to determine the location of the docs. In this case, they will be located in the ``modules/summator/doc_classes`` directory. If you don't define this, the doc path for your module will fall back to the main ``doc/classes`` directory.
es: La función ``get_doc_path()`` se utiliza por el sistema de compilación para determinar la ubicación de la documentación. En este caso, estará ubicada en el directorio ``modules/summator/doc_classes``. Si no defines esto, la ruta de la documentación para tu módulo se establecerá por defecto en el directorio principal ``doc/classes``.
fr: La fonction ``get_doc_path()`` est utilisée par le système de compilation pour déterminer l'emplacement des documents. Dans ce cas, ils seront situés dans le répertoire ``modules/summator/doc_classes``. Si vous ne le définissez pas, le chemin de la documentation de votre module reviendra au répertoire principal ``doc/classes``.
zh_cn: 构建系统使用 ``get_doc_path()`` 函数来确定文档的位置. 在这种情况下, 它们将位于 ``modules/summator/doc_classes`` 目录下. 如果你不定义这个, 你的模块的文档路径将退回到主 ``doc/classes`` 目录.
zh_tw: ``get_doc_path()`` 函式是建置系統所使用的，用於判斷說明文件的位置。在這個例子中，說明文件會放在 ``modules/summator/doc_classes`` 資料夾中。若沒有定義這個函式，則模組說明文件的路徑會被遞補為主要的 ``doc/classes`` 資料夾。

source: The ``get_doc_classes()`` method is necessary for the build system to know which registered classes belong to the module. You need to list all of your classes here. The classes that you don't list will end up in the main ``doc/classes`` directory.
es: El método ``get_doc_classes()`` es necesario para que el sistema de compilación sepa qué clases registradas pertenecen al módulo. Debes listar todas tus clases aquí. Las clases que no listes se ubicarán en el directorio principal ``doc/classes``.
fr: La méthode ``get_doc_classes()`` est nécessaire pour que le système de compilation sache quelles classes déclarées appartiennent au module. Vous devez lister toutes vos classes ici. Les classes que vous ne listerez pas se retrouveront dans le répertoire principal ``doc/classes``.
zh_cn: ``get_doc_classes()`` 方法对于构建系统知道哪些注册的类属于该模块是必要的. 你需要在这里列出你所有的类. 你没有列出的类最终将出现主 ``doc/classes`` 目录中.
zh_tw: 必須要有 ``get_doc_classes()`` 方法，這樣一來建置系統才知道哪些已註冊的類別屬於這個模組。在此處必須要列出所有的類別。沒有在此處定義的類別會遞補到主要的 ``doc/classes`` 資料夾中。

source: You can use Git to check if you have missed some of your classes by checking the untracked files with ``git status``. For example::
es: Puedes usar Git para verificar si has omitido algunas de tus clases al revisar los archivos no rastreados con ``git status``. Por ejemplo:
fr: Vous pouvez utiliser Git pour vérifier si vous avez manqué certaines de vos classes en vérifiant les fichiers non tracés avec ``git status``. Par exemple :
zh_cn: 你可以用 Git 来检查是否漏掉了一些类，用 ``git status`` 检查未跟踪的文件。例如： ::
zh_tw: 可以使用 ``git status`` 來通過 Git 檢查未簽出與未追蹤的檔案，來確認是否有遺漏的類別。舉例來說：

source: Example output::
es: Ejemplo de salida:
fr: Exemple de sortie :
zh_cn: 输出示例： ::
zh_tw: 範例輸出：

source: Now we can generate the documentation:
es: Ahora podemos generar la documentación:
fr: Nous pouvons maintenant générer la documentation :
zh_cn: 现在我们可以生成文档:
zh_tw: 接著，我們可以產生說明文件：

source: We can do this via running Godot's doctool i.e. ``godot --doctool <path>``, which will dump the engine API reference to the given ``<path>`` in XML format.
es: Podemos hacer esto ejecutando la herramienta de documentación de Godot, es decir, ``godot --doctool <ruta>``, lo que volcará la referencia de la API del motor en el directorio proporcionado ``<ruta>`` en formato XML.
fr: Nous pouvons le faire en exécutant le doctool de Godot, c'est-à-dire ``godot --doctool <path>``, qui supprimera la référence API du moteur vers le ``<path>`` donné au format XML.
zh_cn: 我们可以通过运行Godot的doctool, 即 ``godot -doctool <path>`` , 它将以XML格式转储引擎API引用到给定的 ``<path>`` .
zh_tw: 可以通過執行 Godot 的 doctool 來產生，即 ``godot --doctool <路徑>`` ，該指令會以 XML 格式傾印引擎的 API 參照文件到指定的 ``<路徑>`` 內。

source: In our case we'll point it to the root of the cloned repository. You can point it to an another folder, and just copy over the files that you need.
es: En nuestro caso, lo apuntaremos al directorio raíz del repositorio clonado. También puedes apuntarlo a otra carpeta y simplemente copiar los archivos que necesitas.
fr: Dans notre cas, nous le ferons pointer vers la racine du dépôt cloné. Vous pouvez le faire pointer vers un autre dossier, et il suffit de copier les fichiers dont vous avez besoin.
zh_cn: 在我们的例子中, 将把它指向克隆的版本库的根目录. 你可以把它指向另一个文件夹, 然后复制需要的文件.
zh_tw: 在這個例子中，我們會將文件輸出至 Clone 的儲存庫根目錄內。在實際使用時可以指定其他資料夾，然後依據需求複製這些檔案到所需的地方。

source: Run command:
es: Ejecute el comando:
fr: Exécuter la commande :
zh_cn: 运行命令:
zh_tw: 執行指令：

source: Now if you go to the ``godot/modules/summator/doc_classes`` folder, you will see that it contains a ``Summator.xml`` file, or any other classes, that you referenced in your ``get_doc_classes`` function.
es: Ahora, si vas a la carpeta ``godot/modules/summator/doc_classes``, verás que contiene un archivo llamado ``Summator.xml``, o cualquier otra clase que hayas referenciado en tu función ``get_doc_classes``.
fr: Maintenant, si vous allez dans le dossier ``godot/modules/summator/doc_classes``, vous verrez qu'il contient un fichier ``Summator.xml``, ou toute autre classe, que vous avez référencé dans votre fonction ``get_doc_classes``.
zh_cn: 现在, 如果进入 ``godot/modules/summator/doc_classes`` 文件夹, 会看到它包含一个在 ``get_doc_classes`` 函数中引用的 ``Summator.xml`` 文件, 或者其他类.
zh_tw: 接著若開啟 ``godot/modules/summator/doc_classes`` 資料夾，就可以看到裡面有 ``Summator.xml`` 檔案，或在 ``get_doc_classes`` 函式中參照的其他類別。

source: Edit the file(s) following :ref:`doc_class_reference_primer` and recompile the engine.
zh_tw: 依據 :ref:`doc_updating_the_class_reference` 中的說明編輯這些檔案，然後重新編譯引擎。

source: Once the compilation process is finished, the docs will become accessible within the engine's built-in documentation system.
es: Una vez que el proceso de compilación haya finalizado, la documentación estará disponible en el sistema de documentación integrado del motor.
fr: Une fois le processus de compilation terminé, les documents deviendront accessibles dans le système de documentation intégré au moteur.
zh_cn: 一旦编译过程完成, 这些文档将可以在引擎的内置文档系统中访问.
zh_tw: 完成編譯後，就可以從引擎內建的說明文件系統中存取這些文件。

source: In order to keep documentation up-to-date, all you'll have to do is simply modify one of the XML files and recompile the engine from now on.
es: Para mantener la documentación actualizada, simplemente tendrás que modificar uno de los archivos XML y recompilar el motor a partir de ahora.
fr: Afin de maintenir la documentation à jour, il vous suffit de modifier un des fichiers XML et de recompiler le moteur.
zh_cn: 为了保持文档的更新, 你所要做的就是简单地修改其中一个XML文件, 然后从现在开始重新编译引擎.
zh_tw: 之後若要維持這些文件為最新版本，只需要修改其中的 XML 檔，然後重新編譯引擎。

source: If you change your module's API, you can also re-extract the docs, they will contain the things that you previously added. Of course if you point it to your godot folder, make sure you don't lose work by extracting older docs from an older engine build on top of the newer ones.
es: Si cambias la API de tu módulo, también puedes extraer nuevamente la documentación; esta contendrá las cosas que agregaste previamente. Por supuesto, si apuntas la extracción a tu carpeta de Godot, asegúrate de no perder el trabajo al extraer documentación más antigua de una versión anterior del motor sobre las más recientes.
fr: Si vous modifiez l'API de votre module, vous pouvez également ré-extraire la documention, elles contiendront les éléments que vous avez précédemment ajoutés. Bien sûr, si vous le pointez vers votre dossier godot, assurez-vous de ne pas perdre de travail en extrayant une ancienne documentation d'une ancienne compilation du moteur sur les nouvelles.
zh_cn: 如果你改变了模块的API, 可以重新提取文档, 它们会包含你之前添加的东西. 当然如果你把它指向 godot 文件夹, 请确保不会因为在新的文档上提取旧引擎构建的旧文档而损失工作.
zh_tw: 當修改了模組 API 時，則也需要重新截取說明文件。截取出來的說明文件會包含之前新增過的內容。當然，若將說明文件指向到 Godot 資料夾時，請確保不要從舊的引擎建置截取到新的引擎建置上，以免遺失改動。

source: Note that if you don't have write access rights to your supplied ``<path>``, you might encounter an error similar to the following:
es: Ten en cuenta que si no tienes derechos de escritura en la ``<ruta>`` que proporcionaste, es posible que encuentres un error similar al siguiente:
fr: Notez que si vous n'avez pas les droits d'accès en écriture à votre ``<path>`` fourni, vous pourriez rencontrer une erreur similaire à la suivante :
zh_cn: 请注意, 如果你对提供的 ``<path>`` 没有写访问权限, 可能会遇到类似下面的错误:
zh_tw: 如果沒有所提供 ``<路徑>`` 的寫入權限，則可能會遇到類似下列錯誤：

source: Writing custom unit tests
zh_cn: 编写自定义单元测试
zh_tw: 撰寫自定說明文件

source: It's possible to write self-contained unit tests as part of a C++ module. If you are not familiar with the unit testing process in Godot yet, please refer to :ref:`doc_unit_testing`.
zh_tw: 可以將獨立的單元測試編寫為 C++ 模組的一部分。如果您還不熟悉 Godot 中的單元測試流程，請參閱 doc_unit_testing。

source: The procedure is the following:
zh_tw: 有下列事項需注意：

source: Create a new directory named ``tests/`` under your module's root:
zh_tw: 在模組的根目錄下建立一個名為「tests/」的新目錄：

source: Create a new test suite: ``test_summator.h``. The header must be prefixed with ``test_`` so that the build system can collect it and include it as part of the ``tests/test_main.cpp`` where the tests are run.
zh_tw: 建立一個新的測試套件：「test_summator.h」。標頭必須以“test_”為前綴，以便建置系統可以收集它並將其包含在執行測試的“tests/test_main.cpp”中。

source: Write some test cases. Here's an example:
zh_tw: 編寫一些測試案例。這是一個例子：

source: Compile the engine with ``scons tests=yes``, and run the tests with the following command:
zh_tw: 使用“sconstests=yes”編譯引擎，並使用以下命令執行測試：

source: You should see the passing assertions now.
zh_tw: 現在你就應該會看到出現了群組。

source: Adding custom editor icons
es: Añadir iconos de editor personalizados
fr: Ajout d'icônes d'éditeur personnalisé
zh_cn: 添加自定义编辑器图标
zh_tw: 新增自定編輯器圖示

source: Similarly to how you can write self-contained documentation within a module, you can also create your own custom icons for classes to appear in the editor.
es: De manera similar a cómo puedes escribir documentación autocontenida dentro de un módulo, también puedes crear tus propios iconos personalizados para que aparezcan en el editor junto a las clases.
fr: De la même manière que vous pouvez écrire une documentation autonome dans un module, vous pouvez également créer vos propres icônes personnalisées pour les classes afin qu'elles apparaissent dans l'éditeur.
zh_cn: 与如何在模块中编写独立的文档类似, 你也可以为类创建自己的自定义图标, 以使其出现在编辑器中.
zh_tw: 與在模組中撰寫自封式說明文件類似，也可以為類別建立會出現在編輯器中的自定圖示。

source: For the actual process of creating editor icons to be integrated within the engine, please refer to :ref:`doc_editor_icons` first.
es: Para obtener información detallada sobre el proceso de creación de iconos de editor para integrarlos en el motor, consulta primero la sección :ref:`doc_editor_icons`.
fr: Pour le processus de création des icônes d'éditeur à intégrer dans le moteur, veuillez d'abord vous référer à :ref:`doc_editor_icons`.
zh_cn: 有关创建要集成到引擎中的编辑器图标的实际过程, 首先请参考 :ref:`doc_editor_icons`.
zh_tw: 有關建立整合進引擎之編輯器圖示的實際過程，請先參考 :ref:`doc_editor_icons` 。
