Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/core_and_modules/custom_modules_*_cpp.po
Languages: es, fr, zh_cn, zh_tw

source: Once you've created your icon(s), proceed with the following steps:
es: Una vez que hayas creado tus iconos, sigue los siguientes pasos:
fr: Une fois que vous avez créé votre(vos) icône(s), procédez selon les étapes suivantes :
zh_cn: 创建图标后, 请执行以下步骤:
zh_tw: 建立好圖示後，請執行下列步驟：

source: Make a new directory in the root of the module named ``icons``. This is the default path for the engine to look for module's editor icons.
es: Crea un nuevo directorio en la raíz del módulo llamado ``icons``. Esta es la ubicación predeterminada para que el motor busque los iconos del editor del módulo.
fr: Faire un nouveau répertoire dans la racine du module nommé ``icons``. Ceci est le chemin par défaut que le moteur utilisera pour chercher les icônes du module pour l'éditeur.
zh_cn: 在名为 ``icons`` 的模块的根目录中创建一个新目录. 这是引擎查找模块的编辑器图标的默认路径.
zh_tw: 在模組的根目錄建立一個名為 ``icons`` 的資料夾。該資料夾是引擎尋找模組編輯器圖示的預設路徑。

source: Move your newly created ``svg`` icons (optimized or not) into that folder.
es: Mueve tus iconos ``svg`` recién creados (optimizados o no) a esa carpeta.
fr: Déplacez vos icônes ``svg`` nouvellement créées (optimisé ou non) dans ce dossier.
zh_cn: 将新创建的 ``svg`` 图标(已优化或未优化)移动到该文件夹中.
zh_tw: 將新建立的 ``svg`` 圖示 (無論是否經過最佳化) 移至該資料夾內。

source: Recompile the engine and run the editor. Now the icon(s) will appear in editor's interface where appropriate.
es: Vuelve a compilar el motor y ejecuta el editor. Ahora los iconos aparecerán en la interfaz del editor donde corresponda.
fr: Recompilez le moteur et exécutez l'éditeur. Maintenant les icônes apparaîtront dans l'interface de l'éditeur où c'est nécessaire.
zh_cn: 重新编译引擎并运行编辑器. 现在, 相应的图标将出现在编辑器的界面中合适的位置中.
zh_tw: 重新編譯引擎並執行編輯器。接著，該圖示會顯示在編輯器界面中適當的位置。

source: If you'd like to store your icons somewhere else within your module, add the following code snippet to ``config.py`` to override the default path:
es: Si deseas almacenar tus iconos en algún otro lugar dentro de tu módulo, agrega el siguiente fragmento de código a ``config.py`` para anular la ruta predeterminada:
fr: Si vous souhaitez stocker vos icônes ailleurs dans votre module, ajoutez l'extrait de code suivant à ``config.py`` pour remplacer le chemin par défaut :
zh_cn: 如果你想将图标存储在模块内的其他位置, 请将以下代码段添加到 ``config.py`` 以覆盖默认路径:
zh_tw: 如果想將圖示儲存在模組中其他的位置，請將下列程式碼片段新增至 ``config.py`` 以複寫預設路徑：

source: Summing up
es: Resumiendo
fr: En résumé
zh_cn: 总结
zh_tw: 總結

source: Remember to:
es: Recordar a:
fr: Se rappeler de :
zh_cn: 记得:
zh_tw: 請記住：

source: Use ``GDCLASS`` macro for inheritance, so Godot can wrap it.
es: Usa la macro ``GDCLASS`` para herencia, así Godot puede encapsularla.
zh_cn: 对于继承使用 ``GDCLASS`` 宏, 因此Godot可以封装它。
zh_tw: 使用 ``GDCLASS`` 來處理繼承，這樣 Godot 才能對其進行封裝

source: Use ``_bind_methods`` to bind your functions to scripting, and to allow them to work as callbacks for signals.
zh_tw: 使用 ``_bind_methods`` 來將函式繫結至腳本，這樣才能讓這些函式擁有回呼與訊號的功能。

source: **Avoid multiple inheritance for classes exposed to Godot**, as ``GDCLASS`` doesn't support this. You can still use multiple inheritance in your own classes as long as they're not exposed to Godot's scripting API.
zh_tw: **避免暴露給 Godot 的類別的多重繼承**，因為「GDCLASS」不支援這一點。您仍然可以在自己的類別中使用多重繼承，只要它們不暴露於 Godot 的腳本 API。

source: But this is not all, depending what you do, you will be greeted with some (hopefully positive) surprises.
es: Pero eso no es todo, dependiendo de lo que hagas, serás recibido con algunas (espero que positivas) sorpresas.
fr: Mais ce n'est pas tout, en fonction de ce que vous faites, vous rencontrez quelques surprises (espérons-les positives).
zh_cn: 但这还不是全部, 取决于你做什么, 你会得到一些(希望是积极的)惊喜.
zh_tw: 但依據使用情況，還有其他要注意的點。在實際製作模組的過程還會遇到許多驚喜 (希望是正面的驚喜)。

source: If you inherit from :ref:`class_Node` (or any derived node type, such as Sprite2D), your new class will appear in the editor, in the inheritance tree in the "Add Node" dialog.
zh_tw: 若從 :ref:`class_Node` (以及其他衍生 Node 型別，如 Sprite) 繼承，則新類別會出現在編輯器的「新增節點」對話框中的繼承樹中。

source: If you inherit from :ref:`class_Resource`, it will appear in the resource list, and all the exposed properties can be serialized when saved/loaded.
es: Si hereda de: ref: `class_Resource`, aparecerá en la lista de recursos y todas las propiedades expuestas se pueden serializar cuando se guardan / cargan.
fr: Si vous héritez de la :ref:`class_Resource`, elle apparaîtra dans la liste des ressources, et toutes les propriétés exposées peuvent être sérialisées lors de l'enregistrement/chargement.
zh_cn: 如果你从 :ref:`class_Resource` 继承, 则它将出现在资源列表中, 并且所有暴露的属性在保存/加载时都可以序列化.
zh_tw: 若從 :ref:`class_Resource` 繼承，則類別會出現在資源列表中，且所有暴露的屬性都能在保存與載入時被序列化。

source: By this same logic, you can extend the Editor and almost any area of the engine.
es: Con esta misma lógica, usted puede ampliar el Editor y casi cualquier área del motor.
fr: Par cette même logique, vous pouvez étendre l'Éditeur et presque n'importe quelle zone du moteur.
zh_cn: 通过同样的逻辑, 你可以扩展编辑器, 以及引擎中几乎所有领域.
zh_tw: 通過相同的方法，也可以擴充編輯器以及引擎幾乎所有的部分。

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
zh_tw: 翻譯狀態
