Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/ssl_certificates.po
Languages: es, fr, zh_cn

source: SSL certificates
es: Certificados SSL
fr: Certificats SSL
zh_cn: SSL 证书

source: Introduction
es: Introducción
zh_cn: 前言

source: Godot includes SSL certificates from Mozilla, but you can provide your own with a .crt file in the project settings:
es: Godot incluye un certificado SSL de Mozilla, pero puedes especificar un archivo .crt en los ajustes del proyecto:
fr: Godot inclut les certificats SSL de Mozilla, mais vous pouvez fournir le vôtre avec un fichier .crt dans les paramètres du projet :
zh_cn: Godot包括了来自Mozilla的SSL证书, 但你可以在项目设置中用.crt文件提供你自己的:

source: This file should contain any number of public certificates in `PEM format <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__.
es: Este archivo puede contener cualquier número de certificados públicos en `formato PEM <https://es.wikipedia.org/wiki/Privacy_Enhanced_Mail>`__.
fr: Le fichier devrait contenir un nombre quelconque de certificats publics au format `PEM format <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__.
zh_cn: 该文件应包含任意数量的 `PEM 格式的公共证书 <https://en.wikipedia.org/wiki/Privacy-enhanced_Electronic_Mail>`__ .

source: Of course, remember to add .crt as filter so the exporter recognizes this when exporting your project.
es: Por supuesto, recuerda añadir .crt como filtro para que el exportador lo reconozca al exportar tu proyecto.
fr: Il ne faut bien sûr pas oublier d’ajouter .crt dans les filtres, pour que l’exporteur le reconnaisse au moment d’exporter votre projet.
zh_cn: 当然, 请记住将.crt添加为过滤器, 以便导出器在导出项目时识别这一点.

source: There are two ways to obtain certificates:
es: Hay dos formas de obtener certificados:
fr: Il y a deux manières d’obtenir des certificats :
zh_cn: 获取证书有两种方法:

source: Approach 1: self signed cert
es: Enfoque 1: certificado autofirmado
fr: Approche 1 : certificat auto-signé
zh_cn: 方法 1：自签名证书

source: The first approach is the simplest: generate a private and public key pair and add the public key (in PEM format) to the .crt file. The private key should go to your server.
es: El primer enfoque es el más simple: genera un par de claves privadas y públicas, y pon el par público en el archivo.crt (en formato PEM). La clave privada debe ir a tu servidor.
fr: La première approche est la plus simple : générer une paire de clés privée-publique, et mettre la clé publique (au format PEM) dans le fichier .crt. La clé privée ira dans votre serveur.
zh_cn: 第一种方法最简单: 生成一个私钥和公钥对, 并将公钥(PEM格式)添加到.crt文件中. 私钥应该放到你的服务器上.

source: OpenSSL has `some documentation <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ about this. This approach also **does not require domain validation** nor requires you to spend a considerable amount of money in purchasing certificates from a CA.
es: OpenSSL tiene `algo de documentación <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ sobre esto. Este enfoque también **no requiere validación de dominio** ni requiere que tu gastes una cantidad considerable de dinero en la compra de certificados de una CA.
fr: Il y a `une documentation <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ à ce sujet pour OpenSSL. Cette approche ne **demande pas la validation du domaine**, ni de dépenser une forte somme d’argent pour acheter des certificats à une autorité de certification (CA).
zh_cn: OpenSSL有 `一些文档 <https://raw.githubusercontent.com/openssl/openssl/master/doc/HOWTO/keys.txt>`__ 谈到这些. 这种方法也 **不需要域名验证** 也不要求你花费现金从CA购买证书.

source: Approach 2: CA cert
es: Enfoque 2: certificado CA
fr: Approche 2 : certificat CA
zh_cn: 方法 2：CA 证书

source: The second approach consists of using a certificate authority (CA) such as Verisign, Geotrust, etc. This is a more cumbersome process, but it's more "official" and ensures your identity is clearly represented.
es: El segundo enfoque consiste en utilizar una autoridad de certificación (CA) como Verisign, Geotrust, etc. Este es un proceso más engorroso, pero es más "oficial" y asegura que tu identidad está claramente representada.
fr: La deuxième approche consiste à utiliser une autorité de certification (CA) comme Verisign, Geotrust, etc. C’est une procédure plus complexe, mais elle est plus « officielle » et vous assure que votre autorité est clairement représentée.
zh_cn: 第二种方法是借助 Verisign、Geotrust 等证书颁发机构（CA）。这是一个更加繁琐的过程，但它更加“正式”并且可以确保你的身份被清晰地表示。

source: Unless you are working with large companies or corporations, or need to connect to someone else's servers (i.e., connecting to Google or some other REST API provider via HTTPS), this method is not as useful.
es: A menos que estés trabajando con grandes empresas o corporaciones, o necesites conectarte a los servidores de otra persona (es decir, conectarte a Google o a algún otro proveedor de REST API a través de HTTPS), este método no es tan útil.
fr: À moins que vous ne travailliez avec de grandes sociétés ou groupes, ou que vous ayez besoin de vous connecter aux serveurs de quelqu’un d’autre (c’est-à-dire se connecter à Google ou à d’autres fournisseurs d’API REST par HTTPS), cette méthode n’est pas aussi utile.
zh_cn: 除非你与大公司或企业合作, 或需要连接到别人的服务器(即通过HTTPS连接到谷歌或其他REST API供应商), 否则这种方法就不那么有用.

source: Also, when using a CA issued cert, **you must enable domain validation**, to ensure the domain you are connecting to is the one intended, otherwise any website can issue any certificate in the same CA and it will work.
es: Además, cuando se utiliza un certificado emitido por CA, **debes habilitar la validación de dominio**, para asegurarte de que el dominio al que te estás conectando es el deseado, de lo contrario cualquier sitio web puede emitir cualquier certificado en la misma CA y funcionará.
fr: De plus, lorsque vous utilisez un certificat délivré par une autorité de certification, **vous devez activer la validation de domaine**, pour vous assurer que le domaine auquel vous vous connectez est bien celui prévu, sinon tout site web peut délivrer n'importe quel certificat dans la même autorité de certification et cela fonctionnera.
zh_cn: 此外, 当使用CA颁发的证书时, **你必须启用域名验证** , 以确保你要连接的域名是你想连接的域名, 否则一个CA颁发的证书将会成功用到任意数量的网站中.

source: If you are using Linux, you can use the supplied certs file, generally located in:
es: Si estás usando Linux, puedes usar el archivo certs suministrado, generalmente ubicado en:
fr: Si vous utilisez Linux, vous pouvez utiliser le fichier de certificats fourni, généralement situé dans :
zh_cn: 如果你使用的是Linux, 则可以使用系统提供的证书文件, 通常位于:

source: This file allows HTTPS connections to virtually any website (i.e., Google, Microsoft, etc.).
es: Este archivo permite conexiones HTTPS a prácticamente cualquier sitio web (por ejemplo, Google, Microsoft, etc.).
fr: Ce fichier permet des connexions HTTPS à pratiquement n'importe quel site web (c'est-à-dire Google, Microsoft, etc.).
zh_cn: 此文件允许HTTPS连接到几乎任何网站(即Google,Microsoft等).

source: Or pick any of the more specific certificates there if you are connecting to a specific one.
es: O elije cualquiera de los certificados más específicos si te estás conectando a uno específico.
fr: Vous pouvez aussi choisir l'un des certificats plus spécifiques qui s'y trouvent si vous vous connectez à un en particulier.
zh_cn: 或者, 如果要连接到特定网站, 请选择任何更加具体的证书.

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
