Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/networking/websocket.po
Languages: es, ja, uk

source: HTML5 and WebSocket
es: HTML5 y WebSocket
ja: HTML5およびWebSocket
uk: HTML5 і WebSocket

source: The WebSocket protocol was standardized in 2011 with the original goal of allowing browsers to create stable and bidirectional connections with a server. Before that, browsers used to only support HTTPRequests, which is not well-suited for bidirectional communication.
es: El protocolo WebSocket fue estandarizado en 2011 con el objetivo original de permitir a los navegadores crear conexiones estables y bidireccionales con un servidor. Antes de eso, los navegadores sólo soportaban HTTPRequests, lo que no es adecuado para la comunicación bidireccional.
uk: Протокол WebSocket був стандартизований у 2011 році з метою дозволити браузерам створювати стабільні двонаправлені з’єднання із сервером. До цього браузери підтримували лише HTTP-запити, що не дуже підходило для двостороннього зв’язку.

source: The protocol is quite simple, message based, and a very powerful tool to send push notifications to browsers, and has been used to implement chats, turn-based games, etc. It still uses a TCP connection, which is good for reliability but not for latency, so not good for real-time applications like VoIP and fast-paced games (see :ref:`WebRTC <doc_webrtc>` for those use cases).
es: El protocolo es bastante simple, basado en mensajes, y una herramienta muy poderosa para enviar notificaciones push a los navegadores, y se ha utilizado para implementar chats, juegos por turnos, etc. Todavía utiliza una conexión TCP, que es buena para la fiabilidad pero no para la latencia, por lo que no es buena para aplicaciones en tiempo real como VoIP y juegos de ritmo rápido (ver :ref:`WebRTC <doc_webrtc>` para esos casos de uso).
ja: プロトコルは非常にシンプルで、メッセージベースであり、ブラウザにプッシュ通知を送信するための非常に強力なツールであり、チャット、ターンベースのゲームなどを実装するために使用されています。遅延のため、VoIPやテンポの速いゲームなどのリアルタイムアプリケーションには適していません(これらのユースケースについては、\ :ref:`WebRTC <doc_webrtc>` を参照してください)。
uk: Протокол досить простий, заснований на повідомленнях, і є дуже потужним інструментом для надсилання push-повідомлень у браузери, а також використовувався для впровадження чатів, покрокових ігор тощо. Він все ще використовує TCP-з’єднання, що добре для надійності, але не для затримки, тому не підходить для програм реального часу, таких як VoIP (див. :ref:`WebRTC <doc_webrtc>` для цих випадків).

source: Due to its simplicity, its wide compatibility, and being easier to use than a raw TCP connection, WebSocket soon started to spread outside the browsers, in native applications as a mean to communicate with network servers.
es: Debido a su simplicidad, su amplia compatibilidad, y siendo más fácil de usar que una conexión TCP en bruto, WebSocket pronto comenzó a difundirse fuera de los navegadores, en aplicaciones nativas como un medio para comunicarse con los servidores de la red.
ja: そのシンプルさ、幅広い互換性、および生のTCP接続より使いやすいため、WebSocketは、ネットワークサーバーと通信するための手段として、ブラウザ以外のネイティブアプリケーションですぐに広がり始めました。
uk: Завдяки своїй простоті, широкій сумісності та тому, що він простіше у використанні, ніж необроблене TCP-з’єднання, WebSocket незабаром почав поширюватися за межами браузерів, у рідних додатках, як засіб зв’язку з мережевими серверами.

source: Godot supports WebSocket in both native and HTML5 exports.
es: Godot soporta WebSocket tanto en exportaciones nativas como en HTML5.
ja: Godotは、ネイティブエクスポートとHTML5エクスポートの両方でWebSocketをサポートしています。
uk: Godot підтримує WebSocket як в рідному, так і в HTML5 експорті.

source: Using WebSocket in Godot
es: Usando WebSockets en Godot
ja: GodotでWebソケットを使う
uk: Використання WebSocket в Godot

source: WebSocket is implemented in Godot via three main classes :ref:`WebSocketClient <class_WebSocketClient>`, :ref:`WebSocketServer <class_WebSocketServer>`, and :ref:`WebSocketPeer <class_WebSocketPeer>`. The WebSocket implementation is compatible with the High Level Multiplayer. See section on :ref:`high-level multiplayer <doc_high_level_multiplayer>` for more details.
es: WebSocket se implementa en Godot a través de tres clases principales :ref:`WebSocketClient <class_WebSocketClient>`, :ref:`WebSocketServer <class_WebSocketServer>`, y :ref:`WebSocketPeer <class_WebSocketPeer>`. La implementación de WebSocket es compatible con el Multijugador de Alto Nivel. Ver la sección :ref:`high-level multiplayer <doc_high_level_multiplayer>` para más detalles.
ja: WebSocketは、3つのメインクラス :ref:`WebSocketClient <class_WebSocketClient>`\ 、\ :ref:`WebSocketServer <class_WebSocketServer>` および :ref:`WebSocketPeer <class_WebSocketPeer>` を介してGodotに実装されます。WebSocket実装は、High Level Multiplayerと互換性があります。詳細については、\ :ref:`high-level multiplayer <doc_high_level_multiplayer>` のセクションを参照してください。
uk: WebSocket реалізується в Godot за допомогою трьох основних класів :ref:`WebSocketClient <class_WebSocketClient>`, :ref:`WebSocketServer <class_WebSocketServer>` і :ref:`WebSocketPeer <class_WebSocketPeer>`. Реалізація WebSocket сумісна з мультиплеєром високого рівня. Додаткову інформацію дивіться у розділі про :ref:`багатокористувацьку гру високого рівня<doc_high_level_multiplayer>`.

source: When exporting to Android, make sure to enable the ``INTERNET`` permission in the Android export preset before exporting the project or using one-click deploy. Otherwise, network communication of any kind will be blocked by Android.
es: Cuando exportes a Android, asegúrate de habilitar el permiso ``INTERNET`` en la configuración de exportación de Android antes de exportar el proyecto o utilizar el despliegue de un solo clic. De lo contrario, la comunicación de red de cualquier tipo será bloqueada por Android.
uk: Під час експорту в Android обов’язково ввімкніть дозвіл ``INTERNET`` у попередньо налаштованих експортах Android, перш ніж експортувати проект, або використовувати розгортання одним клацанням мишки. Інакше Android заблокує будь-який мережевий зв’язок.

source: Minimal client example
es: Ejemplo mínimo de cliente
ja: 最小限のクライアントの例
uk: Мінімальний приклад клієнта

source: This example will show you how to create a WebSocket connection to a remote server, and how to send and receive data.
es: Este ejemplo le mostrará cómo crear una conexión WebSocket con un servidor remoto, y cómo enviar y recibir datos.
ja: この例では、リモートサーバーへのWebSocket接続を作成する方法と、データを送受信する方法を示します。
uk: Цей приклад покаже вам, як створити з’єднання WebSocket з віддаленим сервером, а також як надсилати та отримувати дані.

source: This will print:
es: Esto imprimirá:
ja: これは次のように出力されます:
uk: Буде виведено:

source: Minimal server example
es: Ejemplo mínimo de servidor
ja: 最小限のサーバーの例
uk: Мінімальний приклад сервера

source: This example will show you how to create a WebSocket server that listens for remote connections, and how to send and receive data.
es: Este ejemplo le mostrará cómo crear un servidor WebSocket que escuche las conexiones remotas, y cómo enviar y recibir datos.
uk: Цей приклад покаже вам, як створити сервер WebSocket, який прослуховує віддалені з’єднання, а також як надсилати та отримувати дані.

source: This will print (when a client connects) something similar to this:
es: Esto imprimirá (cuando un cliente se conecta) algo similar a esto:
ja: これは(クライアントが接続したときに)次のようなものを出力します:
uk: Буде виведено (коли клієнт підключиться) щось подібне до цього:

source: Advanced chat demo
es: Demostración avanzada de sala de chat
ja: 高度なチャットデモ
uk: Розширена демонстрація чату

source: A more advanced chat demo which optionally uses the multiplayer mid-level abstraction and a high level multiplayer demo are available in the `godot demo projects <https://github.com/godotengine/godot-demo-projects>`_ under `networking/websocket_chat` and `networking/websocket_multiplayer`.
es: Una demostración de chat más avanzada que utiliza opcionalmente la abstracción multijugador de nivel medio y una demostración multijugador de alto nivel están disponibles en los `proyectos de demostración de Godot <https://github.com/godotengine/godot-demo-projects>`_ en `networking/websocket_chat` y `networking/websocket_multiplayer`.
ja: オプションとして、マルチプレイヤーの中レベルの抽象化とハイレベルマルチプレイヤーデモを使用するより高度なチャットデモは、\ `networking/websocket_chat` と `networking/websocket_multiplayer` 内の `godot demo projects <https://github.com/godotengine/godot-demo-projects> `_ にあります。
uk: Більш просунута демонстрація чату, яка за бажанням використовує багатокористувацьку абстракцію середнього рівня та демоверсію для кількох гравців високого рівня, доступна в `демонстраційних проектах godot<https://github.com/godotengine/godot-demo-projects>`_ у розділах `networking/websocket_chat` та `networking/websocket_multiplayer`.

source: Translation status
es: Estado de traducción
ja: 翻訳ステータス
uk: Стан перекладу
