Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_format_string.po
Languages: cs, es, fr, ja, pt_br, zh_cn

source: GDScript format strings
cs: Formátovací řetězce GDScriptu
es: Cadenas de formato en GDScript
fr: Chaînes de format GDScript
ja: GDScriptフォーマット文字列
pt_br: Formatação de Strings em GDScript
zh_cn: GDScript 格式字符串

source: GDScript offers a feature called *format strings*, which allows reusing text templates to succinctly create different but similar strings.
cs: GDScript nabízí vlastnost nazvanou *formátové řetězce*, která umožňuje opakované použití textových šablon pro rychlé vytváření podobných řetězců.
es: GDScript ofrece una funcionalidad llamada *cadenas de formato* que permite reutilizar plantillas de texto para crear distintas cadenas de una manera breve y compacta.
fr: GDScript fournit une fonctionnalité appelée *chaîne de formatage* qui permet de réutiliser des modèles de texte pour créer succinctement des chaînes différentes mais similaires.
ja: GDScriptは\ *フォーマット文字列*\ と呼ばれる機能を提供します。これはテキストテンプレートを再利用して、異なるが似ている文字列を簡潔に作成することを可能にします。
pt_br: A GDScript oferece uma funcionalidade chamada *formatação de strings* que permite a sucinta reutilização de modelos de texto para criar strings diferentes mas parecidas.
zh_cn: GDScript提供了一个名为 *格式字符串* 的功能，该功能允许重用文本模板来简洁地创建格式相似，内容可变的字符串。

source: Format strings are just like normal strings, except they contain certain placeholder character-sequences. These placeholders can then easily be replaced by parameters handed to the format string.
cs: Formátovací řetězce jsou stejné jako normální řetězce, jen obsahují určité zástupné znaky. Tyto zástupné znaky pak lze snadno nahradit parametry předanými formátovacímu řetězci.
es: Las cadenas de formato son como las cadenas normales, excepto que contienen ciertas secuencias de caracteres asociadas entre sí. De esta forma, se pueden reemplazar fácilmente por parámetros entregados a la cadena de formato.
fr: Les chaînes de format sont comme les chaînes normales, sauf qu'elles contiennent certaines séquences de caractères génériques. Ces séquences de caractères génériques peuvent ensuite être facilement remplacés par des paramètres transmis à la chaîne de format.
ja: フォーマット文字列は、特定のプレースホルダ文字シーケンスを含むことを除けば、通常の文字列とまったく同じです。これらのプレースホルダは、フォーマット文字列に渡されるパラメーターに簡単に置き換えることができます。
pt_br: Strings de formatação são como strings normais, exceto que elas contém certas sequências de caracteres de substituição. Essas sequências podem ser facilmente substituídas por parâmetros passados para a string de formatação.
zh_cn: 格式字符串与普通字符串一样，只不过会包含某些占位符字符序列。这些占位符可以轻松地替换为传递给格式字符串的参数。

source: As an example, with ``%s`` as a placeholder, the format string ``"Hello %s, how are you?"`` can easily be changed to ``"Hello World, how are you?"``. Notice the placeholder is in the middle of the string; modifying it without format strings could be cumbersome.
cs: Například s ``%s`` jako zástupným znakem lze formátovací řetězec ``"Hello %s, how are you?``` snadno změnit na ``"Hello World, how are you?"``. Všimněte si, že zástupný znak je uprostřed řetězce; jeho úprava by bez formátovacích řetězců mohla být těžkopádná.
es: Por ejemplo, con ``%s`` como parámetro, la cadena de formato ``"Hello %s, how are you?`` puede cambiarse fácilmente por ``"Hello World, how are you?"``. Nota que el parámetro está en el medio de la cadena; modificarlo sin cadenas de formato podría ser engorroso.
fr: Par exemple, en utilisant un emplacement réservé tel que ``%s``, la chaîne de format ``"Hello %s, how are you?"`` peut facilement être changée en ``"Hello World, how are you?"``. Notez la présence de l'emplacement réservé au milieu de la chaîne. Changer celle-ci sans utiliser de chaînes de format peut s'avérer laborieux.
pt_br: Como um exemplo, com ``%s`` como substituto, a string de formatação ``"Olá %s, como vai?"`` pode ser facilmente mudada para ``"Olá Mundo, como vai?"``. Note que o substituto está no meio da string; modificá-lo sem os formatos seria trabalhoso.
zh_cn: 例如，以 ``%s`` 作为占位符，格式字符串 ``"你好 %s，吃了吗？`` 可以很轻易地更改为 ``"你好世界，吃了吗？"``\ 。注意：占位符在字符串中间，在不使用格式字符串的情况下进行修改可能会很麻烦。

source: Usage in GDScript
cs: Použití v GDScriptu
es: Utilización en GDScript
fr: Utilisation en GDScript
ja: GDScriptでの使用
pt_br: Uso na GDScript
zh_cn: 在 GDScript 中的用法

source: Examine this concrete GDScript example:
cs: Prohlédněte si tento konkrétní příklad GDScript:
es: Mira este ejemplo concreto en GDScript:
fr: Examinez cet exemple concret en GDScript :
ja: 具体的なGDScriptの例を見てみましょう:
pt_br: Examine este exemplo concreto de GDScript::
zh_cn: 可以看一下这个具体的 GDScript 示例：

source: Placeholders always start with a ``%``, but the next character or characters, the *format specifier*, determines how the given value is converted to a string.
cs: Zástupné znaky vždy začínají znakem ``%``, ale další znak nebo znaky, *specifikátor formátu*, určují, jak bude daná hodnota převedena na řetězec.
es: Los parámetros siempre comienzan con ``%``, pero el siguiente caracter o caracteres, el *format specifier* determina cómo el valor será convertido a cadena.
fr: Les emplacements réservés commencent toujours par un ``%``, mais le ou les caractères suivants, le *spécificateur de format*, détermine comment la valeur donnée est convertie en chaîne.
ja: プレースホルダは常に ``%`` で始まりますが、次の文字(*format specifier*)は、指定された値を文字列に変換する方法を決定します。
pt_br: Placeholders sempre começam com um ``%``, mas o(s) próximo(s) caractere(s) o *especificador de formato*, determina como o valor dado é convertido em uma string.
zh_cn: 占位符始终以 ``%`` 开头，而后面的字符，即 *格式说明符*\，将决定如何将给定值转换为字符串。

source: The ``%s`` seen in the example above is the simplest placeholder and works for most use cases: it converts the value by the same method by which an implicit String conversion or ``str()`` would convert it. Strings remain unchanged, Booleans turn into either ``"True"`` or ``"False"``, an integral or real number becomes a decimal, other types usually return their data in a human-readable string.
cs: ``%s``, který vidíte ve výše uvedeném příkladu, je nejjednodušší zástupný znak a funguje pro většinu případů: převádí hodnotu stejným způsobem, jakou by ji převedl implicitní převod řetězce nebo ``str()``. Řetězce zůstanou beze změny, logické hodnoty se transformují buď na ``"True"`` nebo ``"False"``, celé nebo reálné číslo se změní na desetinné, ostatní typy obvykle vracejí svá data v lidsky čitelné podobě.
es: El ``%s`` visto en el ejemplo anterior es el más simple y se puede utilizar para la mayoría de los casos: convierte el valor con el mismo método por el cual una conversión implícita de String o ``str()`` lo haría. Las cadenas (string) se mantienen sin cambio, booleanos (bool) se convierten a ``"True"`` o ``"False"``, un entero o real (int, float) se convierte en decimal, otros tipos normalmente devuelven sus datos en una cadena formateada de una manera legible.
fr: Le ``%s`` vu dans l'exemple ci-dessus est l'emplacement réservé le plus simple et fonctionne pour la plupart des cas d'utilisation : il convertit la valeur par la même méthode par laquelle une conversion de chaîne implicite ou ``str()`` la convertirait. Les chaînes restent inchangées, les booléens deviennent soit ``"True"`` ou ``"False"``, un nombre entier ou réel devient un nombre décimal, les autres types retournent généralement leurs données dans une chaîne de caractère lisible par un être humain.
ja: 上記の例で見られる ``%s`` は最も単純なプレースホルダで、ほとんどの場合で機能します。暗黙の文字列変換または ``str()`` が変換するのと同じ方法で値を変換します。 文字列は変更されません。ブール値は ``"True"`` または ``"False"`` に変わります。整数または実数は10進数になります。他の型は通常、人間が読める文字列でデータを返します。
pt_br: O ``%s`` no exemplo acima é o mais simples dos espaços reservados e funciona para a maioria dos casos: Ele converte o valor pelo mesmo método pelo qual uma conversão implícita para String ou ``str()`` o faria. Strings não são alteradas, Booleanos são convertidos em ``"True"`` ou ``"False"``, um valor integral ou real se transfona em um decimal e outros tipos normalmente retornam o seu dado em uma string legível por humanos.
zh_cn: 上面的示例中所示的 ``%s`` 是最简单的占位符，适用于大多数场合，用与隐式 ``String`` 转型相同的方法或 ``str()`` 来转换传入的值：字符串保持不变，布尔值变成 ``"True"`` 或 ``"False"``\，整数或实数变为小数，其他类型通常以人类可读的字符串形式返回其数据。

source: There is also another way to format text in GDScript, namely the ``String.format()`` method. It replaces all occurrences of a key in the string with the corresponding value. The method can handle arrays or dictionaries for the key/value pairs.
cs: V jazyce GDScript existuje také další způsob formátování textu, a to metoda ``String.format()```. Ta nahradí všechny výskyty určitého znaku v řetězci určitou hodnotou. Metoda může pracovat s poli nebo slovníky pro dvojice klíč/hodnota.
es: También hay otro modo de formatear texto en GDScript, el método ``String.format()``. Este método reemplaza todas las ocurrencias de una clave en la cadena por el correspondiente valor. Puede utilizar arrays o diccionarios para los pares clave/valor.
fr: Il existe également une autre façon de formater du texte dans GDScript, à savoir la méthode ``String.format ()``. Elle remplace toutes les occurrences d'une clé dans la chaîne, par la valeur correspondante. La méthode peut gérer des tableaux ou des dictionnaires pour des paires de clé/valeur.
ja: GDScriptでテキストをフォーマットする別の方法、すなわち ``String.format()`` メソッドもあります。文字列内に出現するすべてのキーを対応する値に置き換えます。 このメソッドは、キー/値ペアの配列または辞書を処理できます。
pt_br: Existe também outra forma de formatar texto no GDScript, utilizando o método ``String.format()``. Ele troca todas as ocorrências de uma chave na string pelo valor correspondente. O método consegue lidar com arrays ou dicionários para os pares de chave/valor.
zh_cn: 在 GDScript 中还有另一种格式化文本的方式，那就是 ``String.format()`` 方法。该方法将字符串中所有出现的键替换为相应的值，可以处理数组或键值对的字典。

source: Arrays can be used as key, index, or mixed style (see below examples). Order only matters when the index or mixed style of Array is used.
cs: Pole lze použít s klíči nebo indexy, oba styly lze i kombinovat (viz příklady níže). Na pořadí záleží pouze při použití indexového nebo smíšeného stylu pole.
es: Los arrays pueden ser utilizados como clave, índice o estilo mixto (ver ejemplos a continuación). El orden sólo importa cuando se utiliza el índice o el estilo mixto del Array.
fr: Les tableaux peuvent être utilisés par clé, index ou en style mixte (voir les exemples ci-dessous). L'ordre n'a d'importance que lorsqu'on utilise l'index ou le style mixte de Array.
ja: 配列はキー、インデックス、または混合スタイルとして使用できます(下記の例を参照)。配列のインデックスまたは混合スタイルが使用されている場合にのみ順序が重要になります。
pt_br: Listas podem ser utilizadas como chave, index ou uma mistura de tipos (veja exemplos abaixo). A ordem importante apenas quando o Index ou a mistura de tipos da lista é utilizada.
zh_cn: 数组可以用作键、索引或混合样式（参见以下示例），仅当使用数组的索引或混合样式时，其顺序才需要引起注意。

source: A quick example in GDScript:
cs: Rychlý příklad v GDScript:
es: Un ejemplo rápido en GDScript:
fr: Un bref exemple en GDScript :
ja: GDScriptの簡単な例:
pt_br: Um exemplo rápido em GDScript:
zh_cn: GDScript 的一个简单示例：

source: There are other `format specifiers`_, but they are only applicable when using the ``%`` operator.
cs: Existují i další `formátové specifikátory`_, ale ty jsou použitelné pouze při použití operátoru ``%``.
es: Existen otros "especificadores de formato" o `format specifiers`, pero son sólo aplicables cuando se utiliza el operador ``%``.
fr: Il y a d'autres `spécificateurs de format`_, mais ils ne sont applicables que lorsqu'on utilise l'opérateur ``%``.
ja: 他の `書式指定子` もありますが、 ``%`` 演算子を使用する場合にのみ適用できます。
pt_br: Existem outros `formatos especificadores`_, mas eles só são aplicáveis quando usado com o operador ``%``.
zh_cn: 还有其他 `格式说明符`_\，仅在使用 ``%`` 操作符时适用。

source: Multiple placeholders
cs: Více zástupných symbolů
es: Parámetros múltiples
fr: Emplacements réservés multiples
ja: 複数のプレースホルダ
pt_br: Múltiplos espaços reservados
zh_cn: 多个占位符

source: Format strings may contain multiple placeholders. In such a case, the values are handed in the form of an array, one value per placeholder (unless using a format specifier with ``*``, see `dynamic padding`_):
cs: Formátovací řetězce mohou obsahovat více zástupných znaků. V takovém případě jsou hodnoty předávány ve formě pole, jedna hodnota na každý zástupný znak (pokud není použit specifikátor formátu s ``*``, viz `dynamické vyplňování`_):
es: Las cadenas de formato pueden contener múltiples variables. En cuyo caso, los valores son manejados en forma de array, un valor por variable (a menos que se utilice un especificador de formato con un ``*``, ver `Rellenador Dinamico`_):
fr: Les chaînes de formatage peuvent contenir plusieurs emplacements réservés. Dans un tel cas, les valeurs sont présentées sous la forme d'un tableau, une valeur par emplacement réservé (sauf si vous utilisez un spécificateur de format avec ``*``, voir `remplissage dynamique`_) :
ja: フォーマット文字列には複数のプレースホルダを含めることができます。そのような場合、値は配列の形で渡され、プレースホルダごとに1つの値になります( ``*`` でフォーマット指定子を使用しない限り。 `動的パディング` を参照):
pt_br: Strings de formatação podem conter múltiplos espaços reservados. Nesse caso, os valores são tratados na forma de um array, um valor para cada espaço reservado (a não ser que se use um especificador de formato com ``*``, veja `dynamic padding`_ – "espaço de preenchimento dinâmico"):
zh_cn: 格式字符串也可以包含多个占位符，在这种情况下，传入的值将以数组的形式进行处理，每个占位符为一个数组元素（除非使用带 ``*`` 的格式说明符，参见 `动态填充`_\）：

source: Note the values are inserted in order. Remember all placeholders must be replaced at once, so there must be an appropriate number of values.
cs: Všimněte si, že hodnoty jsou vkládány popořádku. Nezapomeňte, že všechny zástupné symboly musí být nahrazeny najednou, takže je potřeba i odpovídající počet hodnot.
es: Observa que los valores se insertan en orden. Recuerda que todos los marcadores de posición deben ser reemplazados a la vez, por lo que debe haber un número apropiado de valores.
fr: Notez que les valeurs sont insérées dans l'ordre. À chaque emplacement réservé doit correspondre une valeur. Pensez donc à passer le nombre de valeurs adéquat.
ja: 値が順番に挿入されていることに注意してください。すべてのプレースホルダは一度に置き換えられる必要があるので、適切な数の値が必要です。
pt_br: Note que os valores são inseridos em ordem. Lembre-se que todos os espaços reservados devem ser substituídos de uma vez, para isso o numero de valores deve ser apropriado.
zh_cn: 注意：这些值是按顺序插入的，切记必须同时替换所有占位符，故必须有适当数量的传入值。

source: Format specifiers
cs: Specifikátory formátu
es: Especificadores de formato
fr: Les spécificateurs de format
ja: 書式指定子
pt_br: Especificadores de formato
zh_cn: 格式说明符

source: There are format specifiers other than ``s`` that can be used in placeholders. They consist of one or more characters. Some of them work by themselves like ``s``, some appear before other characters, some only work with certain values or characters.
cs: V zástupných znacích lze použít i jiné specifikátory formátu než ``s``. Skládají se z jednoho nebo více znaků. Některé z nich fungují samy o sobě podobně jako ``s``, některé se objevují před jinými znaky, některé fungují pouze s určitými hodnotami nebo znaky.
es: Existen otros especificadores de formato aparte de ``s`` que pueden ser utilizado en parámetros. Estos consisten de uno o más caracteres. Algunos de ellos trabajan por sí mismos, como ``s``, algunos se colocan antes que otros caracteres, otros sólo funcionan con ciertos valores o caracteres.
fr: Il existe des spécificateurs de format autres que ``s`` qui peuvent être utilisés dans les emplacements réservés. Ils consistent en un ou plusieurs caractères. Certains d'entre eux fonctionnent par eux-mêmes comme ``s``, certains apparaissent avant les autres caractères, d'autres ne fonctionnent qu'avec certaines valeurs ou caractères.
ja: プレースホルダで使用できる書式指定子は、 ``s`` 以外にもあります。これらは1つ以上の文字で構成されます。その中には、 ``s`` のように単独で動作するものもあれば、他の文字の前に現れるものもあり、特定の値や文字だけで動作するものもあります。
pt_br: Existem outros especificadores de formato além de ``s`` que podem ser usados nos espaços reservados. Eles consistem de um ou mais caracteres. Alguns dos quais funcionam por conta própria como ser ``s``, alguns aparecem antes de outros caracteres, e alguns apenas funcionam com certos tipos de valores ou caracteres.
zh_cn: 除 ``s`` 之外，在占位符中还有其他格式说明符可以使用。这些格式说明符由一个或多个字符组成，其中一些可以像 ``s`` 一样独立起效，还有一些则出现在其他字符之前，还有一部分仅适用于特定的值或字符使用。

source: Placeholder types
cs: Typy zástupných symbolů
es: Tipos de parámetros
fr: Types d'emplacements réservés
ja: プレースホルダ・タイプ
pt_br: Tipos de espaços reservados
zh_cn: 占位符类型

source: One and only one of these must always appear as the last character in a format specifier. Apart from ``s``, these require certain types of parameters.
cs: Jeden a to právě jeden z nich se musí vždy objevit jako poslední znak ve specifikátoru formátu. Kromě ``s`` vyžadují všechny ostatní určité typy parametrů.
es: Uno y sólo uno de estos debe aparecer como último caracter en un especificador de formato. Aparde de ``s`` , estos requieren ciertos tipos de parámetros.
fr: Un et un seul d'entre eux doivent toujours apparaître en tant que dernier caractère dans un spécificateur de format. En dehors de ``s``, ceux-ci nécessitent certains types de paramètres.
ja: これらのうちの1つだけが、常にフォーマット指定子の最後の文字として表示されている必要があります。 ``s`` とは別に、これらは特定の種類のパラメーターを必要とします。
pt_br: Apenas um destes deve sempre aparecer como o ultimo caractere em um especificador de formato. Diferentemente do ``s``, estes requerem certos tipos de parâmetros.
zh_cn: 下列格式说明符中，有且只有一个作为最后一个字符出现。除 ``s`` 外，其它格式说明符还需要特定类型的参数。

source: **Simple** conversion to String by the same method as implicit String conversion.
cs: **Jednoduchý** převod na řetězec pomocí implicitní metody konverze na String.
es: Conversión **simple** a cadena (string) por el mismo método que una conversión implícita en cadena.
fr: **Simple** conversion en chaîne par la même méthode que la conversion implicite de chaîne.
ja: 暗黙的な文字列変換と同じメソッドによる文字列への\ **単純な**\ 変換。
pt_br: Conversão **simples** para uma String pelo mesmo método que uma conversão implícita para String.
zh_cn: 通过与隐式 ``String`` 转型的相同方法将传入的值 **轻松**\转换为 ``String``.

source: A single **Unicode character**. Expects an unsigned 8-bit integer (0-255) for a code point or a single-character string.
cs: Jeden znak **Unicode**. Očekává 8bitové celé číslo bez znaménka (0-255) pro codepoint nebo jednoznakový řetězec.
es: **Caracter Unicode** simple. Espera un entero sin signo de 8 bits (unsigned 8-bit integer, 0-255) para un código de posición o una cadena de caracteres simple.
fr: Un seul **caractère Unicode**. Attend un entier non signé 8 bits (0-255) pour un point de code ou une chaîne d'un seul caractère.
ja: 単一の\ **Unicode文字**\ 。 コードポイントまたは1文字の文字列には、符号なし8ビット整数(0〜255)が必要です。
pt_br: Um único **Caractere unicode**. Espera um numero inteiro de 8-bits (0-255) representando o código do caractere ou uma string de um único caractere.
zh_cn: 单个 **Unicode 字符** . 对于代码点或单个字符, 需要一个无符号的8位整数(0-255).

source: A **decimal integral** number. Expects an integral or real number (will be floored).
cs: **desítkové celé číslo**. Očekává celé nebo reálné číslo (bude zaokrouhleno).
es: Un número **decimal**. Espera un decimal o real (será redondeado).
fr: Un nombre **entier décimal**. Attend un nombre entier ou réel (sera arrondi à l'entier inférieur).
ja: 単一の\ **10進整数**\ 。整数または実数(floorで切り捨てられます)を指定してください。
pt_br: Um número **Inteiro decimal**. Espera um numero inteiro ou real (que será aproximado para baixo).
zh_cn: 一个 **十进制** 整数. 需要一个整数或实数(向下取整).

source: An **octal integral** number. Expects an integral or real number (will be floored).
cs: **osmičkové celé číslo**. Očekává celé nebo reálné číslo (bude zaokrouhleno).
es: Un número **octal**. Espera un entero o real (será redondeado).
fr: Un nombre **entier octal**. Attend un nombre entier ou réel (sera arrondi à l'entier inférieur).
ja: 単一の\ **8進整数**\ 。整数または実数(floorで切り捨てられます)を指定してください。
pt_br: Um número **inteiro octal**. Espera um numero inteiro ou real (que será aproximado para baixo).
zh_cn: 一个 **八进制** 整数. 需要一个整数或实数(向下取整).

source: A **hexadecimal integral** number with **lower-case** letters. Expects an integral or real number (will be floored).
cs: **hexadecimální celé číslo** s **malými** písmeny. Očekává celé nebo reálné číslo (bude zaokrouhleno).
es: Un número **hexadecimal** con letras en **minúsculas**. Espera un entero o real (será redondeado).
fr: Un nombre **entier hexadécimal** avec des lettres **minuscules**. Attend un nombre entier ou réel (sera arrondi à l'entier inférieur).
ja: 単一の\ **小文字の16進整数**\ 。整数または実数(floorで切り捨てられます)を指定してください。
pt_br: Um número **inteiro hexadecimal** com letras em **caixa-baixa**. Espera um numero inteiro ou real (que será aproximado para baixo).
zh_cn: 一个 **小写** 字母的 **十六进制** 整数. 需要一个整数或实数(向下取整).

source: A **hexadecimal integral** number with **upper-case** letters. Expects an integral or real number (will be floored).
cs: **hexadecimální celé číslo** s **velkými** písmeny. Očekává celé nebo reálné číslo (bude zaokrouhleno).
es: Un número **hexadecimal** con letras en **mayúsculas**. Espera un número entero o real (será redondeado).
fr: Un nombre **entier hexadécimal** avec des lettres **majuscules**. Attend un nombre entier ou réel (sera arrondi à l'entier inférieur).
ja: 単一の\ **大文字の16進整数**\ 。整数または実数(floorで切り捨てられます)を指定してください。
pt_br: Um número **inteiro hexadecimal** com letras em **caixa-alta**. Espera um numero inteiro ou real (que será aproximado para baixo).
zh_cn: 一个 **大写** 字母的 **十六进制** 整数. 需要一个整数或实数(向下取整).

source: A **decimal real** number. Expects an integral or real number.
cs: **desítkové reálné** číslo. Očekává celé nebo reálné číslo.
es: Un número **real**. Espera un número entero o real.
fr: Un nombre **décimal réel**. Attend un nombre entier ou réel.
ja: 単一の\ **10進実数**\ 。整数または実数を指定してください。
pt_br: Um número **decimal inteiro**. Espera receber um número inteiro ou real.
zh_cn: 一个\ **十进制实数**\ 。需要一个整数或实数。

source: Placeholder modifiers
cs: Modifikátory zástupných symbolů
es: Modificadores de parámetros
fr: Modificateurs d'emplacement réservé
ja: プレースホルダ修飾子
pt_br: Modificadores temporários
zh_cn: 占位符的修饰符

source: These characters appear before the above. Some of them work only under certain conditions.
cs: Tyto znaky se objevují před výše uvedenými. Některé z nich fungují pouze za určitých podmínek.
es: Estos caracteres aparecen antes de los mencionados anteriormente. Algunos de ellos sólo funcionan bajo ciertas condiciones.
fr: Ces caractères apparaissent avant les précédents. Ils ne fonctionnent que sous certaines conditions.
ja: これらの文字は上記の前に表示されます。中には、特定の条件下でのみ機能するものもあります。
pt_br: Estes caracteres aparecem antes dos acima. Alguns deles só funcionam em certas condições.
zh_cn: 这些字符在上述占位符前出现. 其中一些只在特定情况下生效.

source: In number specifiers, **show + sign** if positive.
cs: V číselných specifikátorech **zobrazí znaménko +**, pokud je kladné.
es: En especificadores numéricos, **muestra el signo +** si es positivo.
fr: Dans les spécificateurs de nombres, **afficher le signe +** si positif.
ja: 数値指定子で、正の場合は\ **+記号を表示**\ します。
pt_br: Nos especificadores numéricos, **mostra o simbolo +** se positivo.
zh_cn: 用在数字说明符中，如果为正数则\ **显示 + 号**\ 。

source: Integer
cs: Číslo
es: Entero
fr: Nombre entier
ja: 整数
pt_br: Inteiro
zh_cn: 整数

source: Set **padding**. Padded with spaces or with zeroes if integer starts with ``0`` in an integer or real number placeholder. The leading ``0`` is ignored if ``-`` is present. When used after ``.``, see ``.``.
es: Define el **padding**. Rellenado con espacios o ceros si el entero comienza con ``0`` en un parámetro entero. Cuando se utiliza después de ``.``, ver ``.``.
pt_br: Defina o **espaçamento**. Espaçado com espaços ou com zeros se o número inteiro começa com ``0`` num número inteiro ou num número real com substituto. O principal ``0`` é ignorado se ``-`` estiver presente. Quando utilizado depois de ``.``, veja ``.``.
zh_cn: 设置\ **填充**\ 。用空格填充，如果整数或实数占位符的整数部分以 ``0`` 开头则用零填充。存在 ``-`` 时会忽略开头的 ``0``\ 。当在 ``.`` 后使用时，请参阅 ``.``\ 。
