Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_styleguide.po
Languages: cs, es, fr, pt_br

source: To declare the return type of a function, use ``-> <type>``:
cs: Chcete-li deklarovat návratový typ funkce, použijte ``-> <type>``:
es: Para declarar el tipo de retorno de una función, usa ``-> <tipo>``:
fr: Pour déclarer le type de retour d'une fonction, utilisez ``-> <type>`` :
pt_br: Para declarar o tipo de retorno de uma função, use ``-> <type>``:

source: Inferred types
cs: Odvozené typy
es: Tipos inferidos
fr: Types inférés
pt_br: Tipos inferidos

source: Alternatively, you can use the ``as`` keyword to cast the return type, and that type will be used to infer the type of the var.
es: Alternativamente, puedes usar la palabra clave ``as`` para castear el tipo de retorno, y ese tipo será usado para inferir en el tipo de la variable.
fr: Alternativement, vous pouvez utiliser le mot-clé ``as`` pour transtyper le type de retour, et ce type sera utilisé pour inférer le type de la variable.
pt_br: Alternativamente, você pode usar a palavra-chave ``as`` para inferir o tipo de retorno, e esse tipo será usado para inferir o tipo da variável.

source: This option is also considered more :ref:`type-safe<doc_gdscript_static_typing_safe_lines>` than the first.
es: Esta opción también se considera más :ref:`segura en cuanto al tipo<doc_gdscript_static_typing_safe_lines>` que la primera.
fr: Cette option est aussi considérée plus :ref:`type-safe<doc_gdscript_static_typing_safe_lines>` que la première.
pt_br: Esta opção também é considerada mais :ref: `type-safe <doc_gdscript_static_typing_safe_lines>` do que a primeira.

source: Translation status
cs: Stav překladu
es: Estado de traducción
fr: État de la traduction
pt_br: Progresso da Tradução
