Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_styleguide.po
Languages: cs, es, fr, pt_br

source: GDScript style guide
cs: Průvodce stylem GDScript
es: Guía de estilo de GDScript
fr: Guide de style GDScript
pt_br: Guia de Estilo GDScript

source: This style guide lists conventions to write elegant GDScript. The goal is to encourage writing clean, readable code and promote consistency across projects, discussions, and tutorials. Hopefully, this will also support the development of auto-formatting tools.
cs: Tento průvodce stylem uvádí konvence pro psaní elegantního GDScriptu. Cílem je podpořit psaní čistého, čitelného kódu a podporovat konzistenci napříč projekty, diskusemi a kurzy. Doufejme, že to také podpoří vývoj nástrojů automatického formátování.
es: Esta guía de estilo enumera las convenciones para escribir un GDscript elegante. La meta es motivar la escritura de un código limpio, legible y promover la consistencia entre proyectos, discusiones y tutoriales. Esperamos que esto también motive al desarrollo de herramientas de autoformateo.
fr: Ce guide de style liste les standards pour écrire du GDScript élégant. Le but est d'encourager l'écriture de code propre et lisible ainsi que de promouvoir l'uniformité au travers des projets, les discussions et les tutoriels. Nous espérons que cela encouragera le développement d'outil d'auto-formatage.
pt_br: Este guia de estilo lista as convenções utilizadas para escrever código GDScript elegante. O objetivo é encorajar a escrita de código limpo e legível, além de promover a consistência entre projetos, discussões e tutoriais. Esperamos que isto também encoraje a criação de ferramentas de auto-formatação.

source: Since GDScript is close to Python, this guide is inspired by Python's `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ programming style guide.
cs: Protože GDScript je blízký jazyku Python, je tato příručka inspirována příručkou `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ programovacího stylu jazyka Python.
es: Como GDScript es similar a Python, esta guía ha sido inspirada por la guía de estilo de programación `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__.
fr: Puisque GDScript ressemble à Python, ce guide est inspiré par le guide de style de programmation de Python `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ .
pt_br: Já que o GDScript é próximo da linguagem Python, este guia é inspirado no guia de estilos `PEP 8 <https://www.python.org/dev/peps/pep-0008/>`__ do Python.

source: Style guides aren't meant as hard rulebooks. At times, you may not be able to apply some of the guidelines below. When that happens, use your best judgment, and ask fellow developers for insights.
cs: Průvodci stylem nejsou zamýšleny jako striktní pravidla. Občas se může stát, že některé z níže uvedených pokynů nebudete moci použít. V takovém případě se řiďte vlastním úsudkem a požádejte kolegy vývojáře o radu.
es: Las guías de estilos no están hechas con la intención de ser tratadas como reglamento estricto. Algunas veces no serás capaz de utilizar algunos de los lineamientos indicados, cuando eso suceda utiliza tu mejor criterio y busca la opinión de otros desarrolladores.
fr: Les guides de style ne sont pas conçus comme des livres de règles rigides. Parfois, il se peut que vous ne puissiez pas appliquer certaines des règles ci-dessous. Lorsque cela se produit, utilisez votre jugement et demandez à vos collègues développeurs de vous donner leur avis.
pt_br: Guias de estilo não são regras. Às vezes, você talvez não poderá aplicar algumas das diretrizes abaixo. Quando isso acontecer, use seu melhor julgamento, e peça opiniões de outros desenvolvedores.

source: In general, keeping your code consistent in your projects and within your team is more important than following this guide to a tee.
cs: Obecně platí, že udržování konzistentního kódu v projektech a v týmu je důležitější než dodržování tohoto návodu do puntíku.
es: En general, mantener tu código consistente en tus proyectos y entre todos los de tu equipo es más importante que seguir esta guía al pié de la letra.
fr: En général, garder votre code consistant dans vos projets et au sein de votre équipe est plus important que de suivre ce guide à la lettre.
pt_br: Em geral, manter seu código consistente em seus projetos e em seu time é mais importante que seguir este guia à risca.

source: Godot's built-in script editor uses a lot of these conventions by default. Let it help you.
cs: Vestavěný editor skriptů Godot používá mnoho těchto konvencí ve výchozím nastavení. Nechte si s jím pomoci.
es: El editor de scripts de Godot usa muchas de estas convenciones por defecto. Deja que te ayude.
fr: L'éditeur de script intégré dans Godot utilise beaucoup de ces standards par défaut. Laissez-le vous aider.
pt_br: O editor de scripts padrão do Godot usa várias dessas convenções por padrão. Deixe que isso te ajude.

source: Here is a complete class example based on these guidelines:
cs: Zde je kompletní příklad třídy založený na těchto pokynech:
es: Aquí tenemos un ejemplo completo de una clase basada en esos lineamientos:
fr: Voici un exemple de classe complet basé sur ces lignes directrices :
pt_br: Aqui está um exemplo completo baseado nessas regras:

source: Formatting
cs: Formátování
es: Formateando
fr: Formatage
pt_br: Formatação

source: Encoding and special characters
cs: Kódování a speciální znaky
es: Codificación y caracteres especiales
fr: Encodage et caractères spéciaux
pt_br: Codificação e caracteres especiais

source: Use line feed (**LF**) characters to break lines, not CRLF or CR. *(editor default)*
cs: Pro zalomení řádků používejte znaky pro posuv řádku (**LF**), nikoli CRLF nebo CR. *(výchozí nastavení editoru)*
es: Utiliza caracteres de salto de línea (*LF*) para separar líneas, no *CRLF* o *CR*. *(por defecto del editor)*
fr: Utilisez le saut de ligne (**LF**) pour terminer les lignes, et non CRLF ou CR. *(éditeur par défaut)*
pt_br: Use caracteres line feed (**LF**) para quebrar linhas, não CRLF ou CR. *(padrão do editor)*

source: Use one line feed character at the end of each file. *(editor default)*
cs: Na konci každého souboru použijte jeden znak posuvu řádku. *(výchozí nastavení editoru)*
es: Utiliza un carácter de salto de línea al final de cada archivo. *(por defecto del editor)*
fr: Utilisez un caractère de saut de ligne à la fin de chaque fichier. *(éditeur par défaut)*
pt_br: Use um caractere line feed no final de cada arquivo. *(padrão do editor)*

source: Use **UTF-8** encoding without a `byte order mark <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(editor default)*
cs: Použijte kódování **UTF-8** bez značky pořadí bajtů <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(výchozí nastavení editoru)*
es: Usa la codificación **UTF-8** sin `Marca de orden de bytes <https://es.wikipedia.org/wiki/Marca_de_orden_de_bytes>`_. *( por defecto del editor) *
fr: Utilisez l'encodage **UTF-8** sans `indicateur d'ordre d'octet <https://en.wikipedia.org/wiki/Byte_order_mark>`_. *(éditeur par défaut)*
pt_br: Use a codificação **UTF-8** sem uma `marca de ordem de byte <https://pt.wikipedia.org/wiki/Marca_de_ordem_de_byte>`_. *(padrão do editor)*

source: Use **Tabs** instead of spaces for indentation. *(editor default)*
cs: Pro odsazení použijte místo mezer **Tabulátory**. *(výchozí nastavení editoru)*
es: Usa **Tabs** en lugar de espacios para la indentación. *(por defecto del editor) *
fr: Utilisez **Tabs** au lieu d'espaces pour l'indentation. *(éditeur par défaut)*
pt_br: Use **Tabs** ao invés de espaços para indentação. *(padrão do editor)*

source: Indentation
cs: Odsazení
es: Indentación
pt_br: Recuo

source: Each indent level should be one greater than the block containing it.
cs: Každá úroveň odsazení by měla být o jednu větší než blok, který ji obsahuje.
es: Cada nivel de la Indentación deberá uno mayor que el bloque que lo contiene.
fr: Chaque niveau d'indentation doit être supérieur d'une unité au bloc qui le contient.
pt_br: Cada nível de indentação deve ser uma unidade maior que a do bloco que o contém.

source: **Good**:
cs: **Dobré**:
es: **Bien**:
fr: **Bon** :
pt_br: **Bom**:

source: **Bad**:
cs: **Špatné**:
es: **Mal**:
fr: **Mauvais** :
pt_br: **Ruim**:

source: Use 2 indent levels to distinguish continuation lines from regular code blocks.
cs: K odlišení pokračovaní řádků od běžných bloků kódu použijte 2 úrovně odsazení.
es: Use 2 niveles de Indentación para distinguir las lineas de continuación de bloques regulares de código.
fr: Utiliser 2 niveaux d'indentations pour distinguer les suites de lignes des blocs de code réguliers.
pt_br: Use 2 níveis de indentação para distinguir linhas contínuas de blocos de código regulares.

source: Exceptions to this rule are arrays, dictionaries, and enums. Use a single indentation level to distinguish continuation lines:
cs: Výjimkou tvoří pole, slovníky a výčty. Pro odlišení pokračovacích řádků použijte jednu úroveň odsazení:
es: Las excepciones a esta regla son los arrays, diccionarios y enumeraciones. Usa una sangría simple para distinguir líneas de continuación:
fr: Les exceptions à cette règle sont les tableaux, les dictionnaires et les énumérations. Utilisez un seul niveau d'indentation pour distinguer les lignes de continuation :
pt_br: Exceções a essa regra são matrizes, dicionários e enums. Use apenas um nível de indentação para distinguir linhas contínuas:

source: Trailing comma
cs: Koncová čárka
es: Coma final
fr: Virgule de fin
pt_br: Vírgula extra

source: Use a trailing comma on the last line in arrays, dictionaries, and enums. This results in easier refactoring and better diffs in version control as the last line doesn't need to be modified when adding new elements.
cs: V polích, slovnících a výčtech používejte na posledním řádku čárku. To vede ke snazšímu refaktoringu a lepšímu porovnávání ve správě verzí, protože při přidávání nových prvků není třeba upravovat poslední řádek.
es: Utiliza una coma final en la última línea de arrays, diccionarios y enumeraciones. Esto resulta en una refactorización más sencilla y mejores indicaciones de diferencias (diffs) al trabajar con control de versions, ya que la última línea no necesita ser modificada cuando se agregan nuevos elementos.
fr: Utilisez une virgule de fin de ligne sur la dernière ligne des tableaux, dictionnaires et énumérations. Ceci a pour résultat un refactoring plus facile et de meilleures différences dans le contrôle de version car la dernière ligne n'a pas besoin d'être modifiée lors de l'ajout de nouveaux éléments.
pt_br: Use uma vírgula extra na última linha em matrizes, dicionários, e enums. Isso resulta em refatoração mais fácil e melhores amostras de diferenças em controle de versão, já que a última linha não precisa ser modificada ao adicionar novos elementos.

source: Trailing commas are unnecessary in single-line lists, so don't add them in this case.
cs: Koncové čárky jsou v jednořádkových seznamech zbytečné, proto je v tomto případě nepřidávejte.
es: Las comas de finalización no son necesarias en listas de una sola línea, así que no las agregues en ese caso.
fr: Les virgules de fin de ligne sont inutiles dans les listes en une ligne, alors ne les ajoutez pas dans ce cas.
pt_br: Vírgulas extras não desnecessárias em listas de uma linha só, então não adicione nesse caso.

source: Blank lines
cs: Prázdné řádky
es: Lineas en blanco
fr: Lignes vides
pt_br: Linhas em branco

source: Surround functions and class definitions with two blank lines:
cs: Definice funkcí a tříd obklopte dvěma prázdnými řádky:
es: Envuelve las funciones y definiciones de clases con dos lineas vacías:
fr: Encadrer les fonctions et les définitions de classes par deux ligne vide :
pt_br: Deixe uma linha vazia em cima e embaixo de definições de classes e funções:

source: Use one blank line inside functions to separate logical sections.
cs: Uvnitř funkcí použijte jeden prázdný řádek pro oddělení logických sekcí.
es: use una linea blanca dentro de las funciones para separar secciones lógicas.
fr: Utiliser une ligne vide à l'intérieur des fonctions pour séparer les sections logiques.
pt_br: Use uma linha vazia dentro de funções para separar seções lógicas.

source: We use a single line between classes and function definitions in the class reference and in short code snippets in this documentation.
es: En la referencia de clases y en fragmentos cortos de código en esta documentación, utilizamos una sola línea entre las definiciones de clases y funciones.
fr: Nous utilisons une seule ligne entre les classes et les définitions de fonctions dans la référence de la classe et dans les courts extraits de code de cette documentation.

source: Line length
cs: Délka řádku
es: Longitud de línea
fr: Longueur de la ligne
pt_br: Tamanho de linha

source: Keep individual lines of code under 100 characters.
cs: Udržujte jednotlivé řádky kódu pod 100 znaků.
es: Mantiene líneas de código individuales por debajo de los 100 caracteres.
fr: Gardez chaque ligne de code en dessous de 100 caractères.
pt_br: Mantenha linhas individuais de código abaixo de 100 caracteres.

source: If you can, try to keep lines under 80 characters. This helps to read the code on small displays and with two scripts opened side-by-side in an external text editor. For example, when looking at a differential revision.
cs: Pokud můžete, snažte se, aby řádky neměly více než 80 znaků. To usnadňuje čtení kódu na malých displejích a při otevření dvou skriptů vedle sebe v externím textovém editoru. Například při prohlížení rozdílové revize.
es: Si puedes, trata de mantener las líneas debajo de 80 caracteres. Esto ayuda a que se pueda leer el código en pantallas pequeñas y posibilita tener abiertos dos scripts lado a lado en un editor de texto externo. Por ejemplo, cuando se está mirando una revisión diferencial.
fr: Si vous le pouvez, essayez de ne pas dépasser 80 caractères par ligne. Cela permet de lire le code sur de petits écrans et avec deux scripts ouverts côte à côte dans un éditeur de texte externe. Par exemple, lorsqu'il s'agit d'une révision différentielle.
pt_br: Se puder, tente manter linhas com menos de 80 caracteres. Isso ajuda a ler o código em telas pequenas e com dois scripts abertos lado-a-lado em um editor de texto externo. Por exemplo, quando estiver olhando uma revisão diferente.

source: One statement per line
cs: Jeden příkaz na řádek
es: Una declaración/instrucción por linea
fr: Une Instruction par ligne
pt_br: Uma declaração por linha

source: Never combine multiple statements on a single line. No, C programmers, not even with a single line conditional statement.
cs: Nikdy nekombinujte více příkazů na jednom řádku. Ne, programátoři v C, ani s jednořádkovým podmíněným příkazem.
es: Nunca combine múltiples declaraciones en una única línea. No, programadores de C, ni siquiera declaraciones condicionales en una única línea.
fr: Ne combinez jamais plusieurs instructions sur une même ligne. Non, les programmeurs C, pas avec une seule ligne d'instruction conditionnelle.
pt_br: Nunca combine várias instruções em uma única linha. Não, programadores de C, nem com uma expressão condicional de uma linha só.

source: The only exception to that rule is the ternary operator:
cs: Jedinou výjimkou z tohoto pravidla je ternární operátor:
es: La única excepción a esta regla es el operador ternario:
fr: La seule exception à cette règle est l'opérateur ternaire :
pt_br: A única exceção a essa regra é o operador ternário:

source: Format multiline statements for readability
es: Formatear las sentencias de varias líneas para facilitar su lectura
fr: Formatez les instructions sur plusieurs lignes pour la lisibilité
pt_br: Formatar instruções de várias linhas para facilitar a leitura

source: When you have particularly long ``if`` statements or nested ternary expressions, wrapping them over multiple lines improves readability. Since continuation lines are still part of the same expression, 2 indent levels should be used instead of one.
es: Cuando se tiene sentencias ``if`` particularmente extensas o expresiones ternarias anidadas, envolverlas en varias líneas mejora la legibilidad. Dado que las líneas de continuación siguen formando parte de la misma expresión, deben utilizarse dos niveles de sangría en lugar de uno.
fr: Quand vous avez des instructions ``if`` particulièrement longues ou des expressions ternaires imbriquées, les séparer en plusieurs lignes améliore la lisibilité. Comme les lignes suivantes font parties de la même expression, 2 niveaux d'indentation devraient être utilisés au lieu d'un.
pt_br: Quando você tem instruções ``if`` particularmente longas ou expressões ternárias aninhadas, envolvê-las em várias linhas melhora a legibilidade. Visto que as linhas de continuação ainda fazem parte da mesma expressão, 2 níveis de indentação devem ser usados em vez de um.

source: GDScript allows wrapping statements using multiple lines using parentheses or backslashes. Parentheses are favored in this style guide since they make for easier refactoring. With backslashes, you have to ensure that the last line never contains a backslash at the end. With parentheses, you don't have to worry about the last line having a backslash at the end.
es: GDScript permite envolver las sentencias con múltiples líneas utilizando paréntesis o barras invertidas. En esta guía de estilo se prefieren los paréntesis porque facilitan la refactorización. Con las barras invertidas, tienes que asegurarte de que la última línea nunca contenga una barra invertida al final. Con los paréntesis, no tiene que preocuparse de que la última línea tenga una barra invertida al final.
fr: GDScript permet d'écrire des instructions sur plusieurs lignes à l'aide de parenthèses ou d'antislashs. Les parenthèses sont privilégiées dans ce guide de style car elles permettent une refactorisation plus simple. Avec les antislashs, vous devez vous assurer que la dernière ligne ne contient pas un antislash à la fin. Avec les parenthèses, vous n'avez pas à vous soucier d'un antislash à la fin de la dernière ligne.
pt_br: GDScript permite agrupar instruções usando várias linhas usando parênteses ou barras invertidas. Os parênteses são preferidos neste guia de estilo, uma vez que facilitam a refatoração. Com barras invertidas, você deve garantir que a última linha nunca contenha uma barra invertida no final. Com parênteses, você não precisa se preocupar com a barra invertida no final da última linha.

source: When wrapping a conditional expression over multiple lines, the ``and``/``or`` keywords should be placed at the beginning of the line continuation, not at the end of the previous line.
es: Cuando se envuelve una expresión condicional en múltiples líneas, las palabras clave ``and``/``or`` deben ser colocadas al comienzo de la continuación de la línea, no al final de la anterior.
fr: Quand vous séparez une expression conditionnelle en plusieurs lignes, les mots-clés ``and``/``or`` devraient être placé en début de ligne, et non à la fin de la ligne précédente.
pt_br: Ao envolver uma expressão condicional em várias linhas, as palavras-chave ``and`` / ``or`` devem ser colocadas no início da continuação da linha, não no final da linha anterior.

source: Avoid unnecessary parentheses
cs: Vyhněte se zbytečným závorkám
es: Evita paréntesis innecesarios
fr: Évitez les parenthèses inutiles
pt_br: Evite parênteses desnecessários

source: Avoid parentheses in expressions and conditional statements. Unless necessary for order of operations or wrapping over multiple lines, they only reduce readability.
cs: Vyhněte se závorkám ve výrazech a podmíněných příkazech. Pokud to není nutné pro pořadí operací nebo obalení přes více řádků, pouze snižují čitelnost.
es: Evite paréntesis en expresiones y condicionales. A menos que sean necesarios para el orden de las operaciones o para envolver multilineas, solo reducen la legibilidad.
fr: Évitez les parenthèses dans les expressions et les déclarations conditionnelles. À moins qu'elles ne soient nécessaires pour l'ordre des opérations ou qu'elles s'étendent sur plusieurs lignes, elles ne font que réduire la lisibilité.
pt_br: Evite parênteses em expressões e instruções condicionais. A menos que seja necessário para a ordem das operações ou quebra de várias linhas, eles apenas reduzem a legibilidade.

source: Boolean operators
cs: Logické operátory
es: Operador booleanos
fr: Opérateurs booléens
pt_br: Operadores booleanos

source: Prefer the plain English versions of boolean operators, as they are the most accessible:
cs: Dávejte přednost jednoduchým anglickým verzím logických operátorů, protože jsou nejpřístupnější:
es: Usa la versión en inglés de operadores booleanos, ya que son más accesibles:
fr: Préférez les versions en anglais des opérateurs booléens, car elles sont les plus accessibles :
pt_br: Prefira a versão por extenso dos operadores booleanos, já que elas são mais acessíveis:

source: Use ``and`` instead of ``&&``.
cs: Místo ``&&`` použijte ``and``.
es: Usa ``and`` en lugar de ``&&``.
fr: Utilisez ``and`` au lieu de ``&&``.
pt_br: Use ``and`` ao invés de ``&&``.

source: Use ``or`` instead of ``||``.
cs: Místo ``||``` použijte ``or``.
es: Usa ``or`` en lugar de ``||``.
fr: Utilisez ``or`` au lieu de ``||``.
pt_br: Use ``or`` ao invés de ``||``.

source: You may also use parentheses around boolean operators to clear any ambiguity. This can make long expressions easier to read.
cs: Můžete také použít závorky kolem logických operátorů, abyste odstranili případné nejasnosti. To může usnadnit čtení dlouhých výrazů.
es: También puedes usar paréntesis alrededor de operadores booleanos para evitar cualquier ambigüedad. Esto hace que expresiones largas sean más fáciles de leer.
fr: Vous pouvez également utiliser des parenthèses autour des opérateurs booléens pour éviter toute ambiguïté. Cela peut améliorer la lisibilité des longues expressions.
pt_br: Você pode usar parênteses ao redor de operadores booleanos para tirar ambiguidade. Isso pode facilitar e leitura de expressões longas.

source: Comment spacing
cs: Mezery mezi komentáři
es: Espaciado de comentarios
fr: Espace de commentaires
pt_br: Espaçamento de comentários

source: Whitespace
cs: Mezery
es: Espacio en blanco
fr: Espaces
pt_br: Espaço em branco

source: Always use one space around operators and after commas. Also, avoid extra spaces in dictionary references and function calls.
cs: Kolem operátorů a za čárkami dělejte vždy jednu mezeru. Vyhněte se také dalším mezerám v odkazech na jednotlivé hodnoty slovníku a ve volání funkcí.
es: Utiliza siempre un espacio entre los operadores y después de las comas. Evita los espacios adicionales en las referencias de los diccionarios y las llamadas de función.
fr: Utiliser toujours un seul espace autour des opérateurs et après les virgules. Éviter les espaces supplémentaires dans les références de dictionnaires et les appels de fonctions.
pt_br: Sempre use um espaço ao redor de operadores e depois de vírgulas. Evite espaços extras em referências de dicionário e chamadas de função.

source: Don't use spaces to align expressions vertically:
cs: Nepoužívejte mezery k zarovnání výrazů na výšku:
es: No uses espacios para alinear la verticalidad de las expresiones:
fr: Ne pas utiliser d'espaces pour aligner verticalement les expressions :
pt_br: Não use espaços para alinhas expressões verticalmente:

source: Quotes
cs: Uvozovky
es: Comillas
fr: Guillemets
pt_br: Aspas
