Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_format_string.po
Languages: cs, es, fr, ja, pt_br, zh_cn

source: **Pad to the right** rather than the left.
cs: **Zarovnává doprava**, nikoli doleva.
es: Rellena a la derecha, en lugar de la izquierda.
fr: **Remplissage à droite** plutôt qu'à gauche.
ja: 左ではなく右にパディングされます。
pt_br: **Preencha para a direita** ao invés da esquerda.
zh_cn: **在右侧填充**\ 而不是左侧。

source: **Dynamic padding**, expect additional integral parameter to set padding or precision after ``.``, see `dynamic padding`_.
cs: **Dynamické vyplňování**, očekávejte další celočíselný parametr pro nastavení vyplňování nebo přesnosti za ``.``, viz `dynamické vyplňování`_.
es: **Relleno dinámico**, espera un parámetro entero adicional para especificar el relleno o precisión después ``.``, de ver `relleno dinámico`_.
fr: **Remplissage dynamique**, attend un paramètre entier additionnel pour fixer le remplissage ou la précision après ``.``, voir `remplissage dynamique`_.
ja: **動的パディング**\ 。 ``.`` の後にパディングまたは精度を設定するために追加の整数パラメーターが必要です。`動的パディング` を参照してください。
pt_br: **Preenchimento dinâmico**, espera parâmetro integral adicional para colocar o preenchimento ou precisão após ``.``, veja `preenchimento dinâmico`_.
zh_cn: **动态填充**\ ，期望存在额外的整数参数，用以设置填充或 ``.`` 后的精度，请参阅\ `动态填充`_\ 。

source: Padding
cs: Zarovnávání
es: Relleno
fr: Remplissage(Padding)
ja: パディング
pt_br: Preenchimento
zh_cn: 填充

source: The ``.`` (*dot*), ``*`` (*asterisk*), ``-`` (*minus sign*) and digit (``0``-``9``) characters are used for padding. This allows printing several values aligned vertically as if in a column, provided a fixed-width font is used.
cs: Znaky ``.``` (*tečka*), ``*`` (*hvězdička*), ``-`` (*minus*) a číslice (``0``-``9``) se používají pro zarovnávání. To umožňuje tisk několika hodnot zarovnaných vertikálně jako ve sloupci, pokud je použito písmo s pevnou šířkou.
es: Los caracteres ``.`` (*punto*), ``*`` (*asterisco*), ``-`` (*signo menos*) y dígitos (``0``-``9``) son utilizados para relleno. Esto permite imprimir valores alineados verticalmente como en una columna, siempre que se utilice una fuente con ancho fijo.
fr: Les caractères ``.`` (*point*), ``*`` (*astérisque*), ``-`` (*signe moins*) et chiffres (``0``-``9``) sont utilisés pour le remplissage. Ceci permet d'imprimer plusieurs valeurs alignées verticalement comme dans une colonne, à condition d'utiliser une police à largeur fixe.
ja: ``.`` (*ドット*), ``*`` (*アスタリスク*), ``-`` (*マイナス記号*) および数字 (``0``-``9``) の文字が埋め込みに使用されます。これにより、固定幅フォントが使用されている場合に、縦に並んだ複数の値を列のように出力できます。
pt_br: Os caracteres ``.`` (*ponto*), ``*`` (*asterisco*), ``-`` (*sinal negativo*) e dígitos (``0``-``9``) são usados para preenchimento. Isso permite mostrar vários valores alinhados verticalmente, como se fosse uma coluna, desde que uma fonte de largura fixa seja usada.
zh_cn: 字符 ``.`` (*句号*), ``*`` (*星号*), ``-`` (*减号*)和数字(``0``-``9``)用于填充. 这允许竖直对齐打印几个值, 就像在一列中使用提供固定宽度的字体一样.

source: To pad a string to a minimum length, add an integer to the specifier:
cs: Chcete-li řetězec zarovnat na minimální délku, přidejte ke specifikátoru celé číslo:
es: Para rellenar una cadena a una longitud mínima, añade un número entero al specifier:
fr: Pour remplir une chaîne jusqu'à une longueur minimale, ajoutez un entier au spécificateur :
ja: 文字列を最小の長さにするには、指定子に整数を追加します:
pt_br: Para preencher um texto com comprimento mínimo, acrescente um inteiro ao especificador:
zh_cn: 要使字符串满足一个最小长度, 需要在标识符前添加一个整数:

source: If the integer starts with ``0``, integral values are padded with zeroes instead of white space:
cs: Pokud celé číslo začíná ``0``, jsou celočíselné hodnoty doplněny nulami namísto mezer:
es: Si el entero comienza con ``0``, los valores enteros son rellenados con ceros en lugar de espacios en blanco:
fr: Si l'entier commence par ``0``, les valeurs entières sont remplies avec des zéros au lieu d'espaces :
ja: 整数が ``0`` で始まる場合、整数値は空白ではなくゼロでパディングされます:
pt_br: Se o inteiro inicia com ``0``, os valores inteiros serão preenchidos com zeros ao invés de com espaços em branco:
zh_cn: 如果这个整数以 ``0`` 开头, 那么整数值将用0填充, 而不是空格:

source: Precision can be specified for real numbers by adding a ``.`` (*dot*) with an integer following it. With no integer after ``.``, a precision of 0 is used, rounding to integral value. The integer to use for padding must appear before the dot.
cs: Přesnost lze u reálných čísel zadat přidáním znaku ``.`` (*tečka*), za kterým následuje celé číslo. Bez uvedení celého čísla za ``.`` se použije přesnost 0 se zaokrouhlením na celočíselnou hodnotu. Celé číslo, které se má použít pro zarovnání, se musí objevit před tečkou.
es: La precisión puede ser especificada por números reales agregando un ``.`` (*punto*) con un entero posteriormente. Sin entero después de ``.``, se utilizará una precisión de 0, redondeando al valor entero. El entero a usar para relleno debe aparecer antes que el punto.
fr: La précision peut être spécifiée pour les nombres réels en ajoutant un ``.`` (*point*) suivi par un entier. Sans entier après le ``.``, une précision de 0 est utilisée, arrondissant à la valeur entière. L'entier utilisé pour le remplissage doit apparaître avant le point.
ja: ``.`` (*ドット*)を追加することで、実数に対して精度を指定できます。それに続く整数で``.`` の後に整数がないと、0の精度が使用され整数値に丸められます。パディングに使用する整数は、ドットの前になければなりません。
pt_br: A precisão pode ser especificada para números reais adicionando um ``.``(*ponto*) com um número inteiro em seguida. Se nenhum número inteiro estiver após o ponto, uma precisão de 0 é utilizada, arredondando o número para um valor inteiro. O inteiro utilizado para espaçamento deve aparecer antes do ponto.
zh_cn: 可以通过添加 ``.`` (*点*)并后跟一个整数来指定实数的精度. ``.`` 后没整数时, 精度为0, 舍入为整数值. 要用于填充的整数则必须出现在点之前.

source: The ``-`` character will cause padding to the right rather than the left, useful for right text alignment:
cs: Znak ``-`` způsobí zarovnání vpravo, nikoli vlevo, což je užitečné pro zarovnávání textu vpravo:
es: El caracter ``-`` provocará un relleno a la derecha en vez de la izquierda, útil para alineo de texto a la derecha:
fr: Le caractère ``-`` provoquera le remplissage à droite plutôt qu'à gauche, ce qui est utile pour l'alignement du texte :
ja: ``-`` 文字を使用すると、左ではなく右にスペースが挿入され、テキストの右揃えに便利です:
pt_br: O caractere ``-`` fará um preenchimento para a direita, em vez de à esquerda, sendo útil para o alinhamento do texto à direita:
zh_cn: ``-`` 字符将导致向右而不是向左填充, 对文本右对齐很有用:

source: Dynamic padding
cs: Dynamické zarovnávání
es: Relleno dinámico
fr: Remplissage dynamique
ja: 動的パディング
pt_br: Preenchimento dinâmico
zh_cn: 动态填充

source: By using the ``*`` (*asterisk*) character, the padding or precision can be set without modifying the format string. It is used in place of an integer in the format specifier. The values for padding and precision are then passed when formatting:
cs: Pomocí znaku ``*``` (*hvězdička*) lze nastavit zarovnání nebo přesnost bez úpravy formátovacího řetězce. Používá se místo celého čísla ve specifikátoru formátu. Hodnoty pro zarovnání a přesnost se pak předávají při formátování:
es: Al utilizar el caracter ``*`` (*asterisco*), el relleno o precisión podrán especificarse sin modificar la cadena string. Se usa en vez de un entero en el format specifier. Los valores para relleno y precisión son pasados al aplicarse el formato:
fr: En utilisant le caractère ``*`` (*astérisque*), le remplissage ou la précision peuvent être réglés sans modifier la chaîne de format. Il est utilisé à la place d'un entier dans le spécificateur de format. Les valeurs pour le remplissage et la précision sont alors passées lors du formatage :
ja: ``*`` (*アスタリスク*)文字を使用すると、フォーマット文字列を変更せずにパディングまたは精度を設定できます。フォーマット指定子の整数の代わりに使用されます。 フォーマット時にパディングと精度の値が渡されます:
pt_br: Ao usar o caractere ``*`` (*asterisco*), o preenchimento ou a precisão podem ser definidos sem modificar o texto de formatação. Isso é usado no lugar de um inteiro no especificador de formato. Os valores para preenchimento e precisão serão então passados ao formatar:
zh_cn: 通过使用 ``*`` ( *星号* )字符, 可以在不修改格式字符串的情况下设置填充或精度. 它用于代替格式说明符中的整数. 然后在格式化时传递填充和精度的值:

source: It is still possible to pad with zeroes in integer placeholders by adding ``0`` before ``*``:
cs: V celočíselných zástupných znacích je stále možné zarovnávat nulami přidáním ``0``` před ``*``:
es: Es posible rellenar con ceros en las variables enteras agregando ``0`` antes del ``*``:
fr: Il est toujours possible de remplir avec des zéros dans les spécificateurs de nombre entiers en ajoutant ``0`` avant ``*`` :
ja: ``*`` の前に ``0`` を追加することで、整数のプレースホルダに0を埋め込むこともできます:
pt_br: É possível preencher com zeros nos locais reservados para inteiros ao adicionar ``0`` antes de ``*``:
zh_cn: 通过在 ``*`` 之前添加 ``0`` , 仍然可以在整数占位符中填充0:

source: Escape sequence
cs: Escape sekvence
es: Secuencias de escape
fr: Séquence d'échappement
ja: エスケープシーケンス
pt_br: Sequência de escape
zh_cn: 转义序列

source: To insert a literal ``%`` character into a format string, it must be escaped to avoid reading it as a placeholder. This is done by doubling the character:
cs: Chcete-li do formátovacího řetězce vložit prostý znak ``%``, je třeba jej escapovat. Tak se zabrání jeho čtení jako zástupného znaku. Toto se provádí zdvojením znaku:
es: Para insertar un carácter literal ``%`` dentro de una format string, debe "escaparse" para impedir que se lea como variable. Esto se consigue duplicando el carácter:
fr: Pour insérer un caractère littéral ``%`` dans une chaîne de formatage, il faut l'échapper pour éviter de le lire comme un caractère de remplacement. Cela se fait en doublant le caractère :
ja: フォーマット文字列にリテラルの ``%`` 文字を挿入するには、プレースホルダとして読み取られないようにエスケープする必要があります。これは文字を2倍にすることによって行われます:
pt_br: Para inserir um caractere ``%`` literal em um texto de formatação, ele deve ser escapado para evitar que seja lido como um espaço reservado. Isso é feito duplicando o caractere:
zh_cn: 要将文字 ``%`` 字符插入格式字符串中, 必须对其进行转义以避免将其读取为占位符. 这是通过将字符加倍来完成的:

source: Format method examples
cs: Příklady formátovacích metod
es: Ejemplos de métodos de formateo
fr: Exemples de méthodes de formatage
ja: フォーマット方法の例
pt_br: Exemplos de métodos de formatação
zh_cn: 格式方法示例

source: The following are some examples of how to use the various invocations of the ``String.format`` method.
cs: Následuje několik příkladů použití různých volání metody ``String.format``.
es: Los siguientes son algunos ejemplos de cómo utilizar las varias invocaciones del método ``String.format`` .
fr: Voici quelques exemples de l'utilisation de différents appels à la méthode ``String.format``.
ja: 以下は、 ``String.format`` メソッドのさまざまな呼び出しの使用方法の例です。
pt_br: Os seguintes são alguns exemplos de como usar as várias invocações do método ``String.format``.
zh_cn: 以下是如何使用 ``String.format`` 方法的各种调用的一些示例.

source: **Type**
cs: **Typ**
es: **Tipo**
ja: **型**
pt_br: **Tipo**
zh_cn: **类型**

source: **Style**
cs: **Styl**
es: **Estilo**
ja: **様式**
pt_br: **Estilo**
zh_cn: **样式**

source: **Example**
cs: **Příklad**
es: **Ejemplo**
fr: **Exemple**
ja: **例**
pt_br: **Exemplo**
zh_cn: **示例**

source: **Result**
cs: **Výsledek**
es: **Resultado**
fr: **Résultat**
ja: **結果**
pt_br: **Resultado**
zh_cn: **结果**

source: Dictionary
cs: Slovník
es: Diccionario
fr: Dictionnaire
ja: 辞書(ディクショナリ)
pt_br: Dicionário
zh_cn: 字典

source: key
cs: klíč
es: clave
fr: clé
ja: キー
pt_br: chave
zh_cn: 键

source: ``"Hi, {name} v{version}!".format({"name":"Godette", "version":"3.0"})``
es: ``"Hola, {name} v{version}!".format({"name":"Godette", "version":"3.0"})``
fr: ``"Salut, {nom} v{version} !".format({"nom":"Godette", "version":"3.0"})``
ja: ``"やあ、 {name} v{version}!".format({"name":"Godette", "version":"3.0"})``
pt_br: ``"Olá, {nome} v{versao}!".format({"nome":"Godette", "versao":"3.0"})``

source: Hi, Godette v3.0!
es: Hola, Godette v3.0!
fr: Salut, Godette v3.0 !
ja: やあ、 Godette v3.0!
pt_br: Olá, Godette v3.0!

source: index
es: índice
fr: index, position
ja: インデックス
pt_br: índice
zh_cn: 索引

source: ``"Hi, {0} v{1}!".format({"0":"Godette", "1":"3.0"})``
es: ``"Hola, {0} v{1}!".format({"0":"Godette", "1":"3.0"})``
fr: ``"Salut, {0} v{1} !".format({"0":"Godette", "1":"3.0"})``
ja: ``"やあ、 {0} v{1}!".format({"0":"Godette", "1":"3.0"})``
pt_br: ``"Oi, {0} v{1}!".format({"0":"Godette", "1":"3.0"})``

source: mix
es: mezcla
fr: mixte
ja: キーとインデックス
pt_br: mistura
zh_cn: 混合

source: ``"Hi, {0} v{version}!".format({"0":"Godette", "version":"3.0"})``
es: ``"Hola, {0} v{version}!".format({"0":"Godette", "version":"3.0"})``
fr: ``"Salut, {0} v{version} !".format({"0":"Godette", "version":"3.0"})``
ja: ``"やあ、 {0} v{version}!".format({"0":"Godette", "version":"3.0"})``
pt_br: ``"Oi, {0} v{versao}!".format({"0":"Godette", "versao":"3.0"})``

source: Array
cs: Pole
fr: Tableau
ja: 配列
pt_br: Vetor
zh_cn: 数组

source: ``"Hi, {name} v{version}!".format([["version","3.0"], ["name","Godette"]])``
es: ``"Hola, {name} v{version}!".format([["version":"3.0"], ["name":"Godette"])``
fr: ``"Salut, {nom} v{version} !".format([["version":"3.0"],["nom":"Godette"]])``
ja: ``"やあ、 {name} v{version}!".format([["version","3.0"], ["name","Godette"]])``
pt_br: ``"Oi, {nome} v{versao}!".format([["versao":"3.0"], ["nome":"Godette"]])``

source: ``"Hi, {0} v{1}!".format(["Godette","3.0"])``
es: ``"Hola, {0} v{1}!".format(["Godette","3.0"])``
fr: ``"Salut, {0} v{1} !".format(["Godette","3.0"])``
ja: ``"やあ、 {0} v{1}!".format(["Godette","3.0"])``
pt_br: ``"Oi, {0} v{1}!".format(["Godette","3.0"])``

source: ``"Hi, {name} v{0}!".format([3.0, ["name","Godette"]])``
es: ``"Hola, {name} v{0}!".format([3.0, ["name","Godette"]])``
fr: ``"Salut, {nom} v{0} !".format([3.0, ["nom":"Godette"]])``
ja: ``"やあ、 {name} v{0}!".format([3.0, ["name","Godette"]])``
pt_br: ``"Oi, {nome} v{0}!".format([3.0, ["nome":"Godette"]])``

source: no index
cs: žádný index
es: sin índice
fr: pas d'index
ja: インデックスなし
pt_br: sem índice
zh_cn: 没有索引

source: ``"Hi, {} v{}!".format(["Godette", 3.0], "{}")``
es: ``"Hola, {} v{}!".format(["Godette", "3.0"], "{}")``
fr: ``"Salut, {} v{}".format(["Godette", "3.0"], "{}")``
ja: ``"やあ、 {} v{}!".format(["Godette", 3.0], "{}")``
pt_br: ``"Oi, {} v{}".format(["Godette", 3.0], "{}")``

source: Placeholders can also be customized when using ``String.format``, here's some examples of that functionality.
cs: Zástupné znaky lze také přizpůsobit pomocí ``String.format``, zde je několik příkladů této funkce.
es: Los parámetros pueden ser personalizados cuando se utiliza ``String.format``, aquí hay unos ejemplos sobre esa funcionalidad.
fr: Les emplacements réservés peuvent également être personnalisés lors de l'utilisation de ``String.format``, voici quelques exemples de cette fonctionnalité.
ja: ``String.format`` を使用するときにプレースホルダをカスタマイズすることもできます。これはその機能の例です。
pt_br: Espaços reservados também podem ser personalizados utilizando ``String.format``, aqui estão alguns exemplos dessa funcionalidade.
zh_cn: 使用 ``String.format`` 时, 也可以自定义占位符, 这是该功能的一些示例.

source: Infix (default)
cs: Infix (výchozí)
es: Infijo (por defecto)
fr: Infixe (par défaut)
ja: インフィックス(デフォルト)
pt_br: Infixo (padrão)
zh_cn: 中缀(默认)

source: ``"Hi, {0} v{1}".format(["Godette", "3.0"], "{_}")``
es: ``"Hola, {0} v{1}".format(["Godette", "3.0"], "{_}")``
fr: ``"Salut, {0} v{1}".format(["Godette", "3.0"], "{_}")``
ja: ``"やあ、 {0} v{1}".format(["Godette", "3.0"], "{_}")``
pt_br: ``"Oi, {0} v{1}".format(["Godette", "3.0"], "{_}")``

source: Hi, Godette v3.0
es: Hola, Godette v3.0
fr: Salut, Godette v3.0
ja: やあ、 Godette v3.0
pt_br: Oi, Godette v3.0

source: Postfix
es: Sufijo
fr: Postfixe
ja: ポストフィックス
pt_br: Pós-fixo
zh_cn: 后缀

source: ``"Hi, 0% v1%".format(["Godette", "3.0"], "_%")``
es: ``"Hola, 0% v1%".format(["Godette", "3.0"], "_%")``
fr: ``"Salut, 0% v1%".format(["Godette", "3.0"], "_%")``
ja: ``"やあ、 0% v1%".format(["Godette", "3.0"], "_%")``
pt_br: ``"Oi, 0% v1%".format(["Godette", "3.0"], "_%")``

source: Prefix
es: Prefijo
fr: Préfixe
ja: 折り返しの接頭辞:
pt_br: Prefixo
zh_cn: 前缀

source: ``"Hi, %0 v%1".format(["Godette", "3.0"], "%_")``
es: ``"Hola, %0 v%1".format(["Godette", "3.0"], "%_")``
fr: ``"Salut, %0 v%1".format(["Godette", "3.0"], "%_")``
ja: ``"やあ、 %0 v%1".format(["Godette", "3.0"], "%_")``
pt_br: ``"Oi, %0 v%1".format(["Godette", "3.0"], "%_")``

source: Combining both the ``String.format`` method and the ``%`` operator could be useful, as ``String.format`` does not have a way to manipulate the representation of numbers.
cs: Kombinace metody ``String.format`` a operátoru ``%`` by mohla být užitečná, protože ``String.format`` nemá možnost manipulovat s reprezentací čísel.
es: Combinar el método ``String.format`` y el operador ``%`` puede ser útil ya que ``String.format`` no tiene un modo de manipular la representación de números.
fr: Combiner la méthode ``String.format`` et l'opérateur ``%`` pourrait être utile puisque ``String.format`` n'a pas de possibilité de manipuler une représentation numérique.
ja: ``String.format`` には数値の表現を操作する方法がないため、``String.format`` メソッドと ``%`` 演算子の両方を組み合わせると便利です。
pt_br: Combinar o método ``String.format`` e o operador ``%`` pode ser útil, já que ``String.format`` não possui uma maneira de manipular a representação de números.
zh_cn: 结合 ``String.format`` 方法和 ``％`` 运算符可能很有用, 因为 ``String.format`` 没有办法操纵数字的表示.

source: ``"Hi, {0} v{version}".format({0:"Godette", "version":"%0.2f" % 3.114})``
es: ``"Hola, {0} v{version}".format({0:"Godette", "version":"%0.2f" % 3.114})``
fr: ``"Salut, {0} v{version}".format({0:"Godette", "version":"%0.2f" % 3.114})``
ja: ``"やあ、 {0} v{version}".format({0:"Godette", "version":"%0.2f" % 3.114})``
pt_br: ``"Oi, {0} v{versao}".format({0:"Godette", "versao":"%0.2f" % 3.114})``

source: Hi, Godette v3.11
es: Hola, Godette v3.11
fr: Salut, Godette v3.11
ja: やあ、 Godette v3.11
pt_br: Oi, Godette v3.11

source: Translation status
cs: Stav překladu
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
pt_br: Progresso da Tradução
zh_cn: 翻译状态
