Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/gdscript/gdscript_styleguide.po
Languages: cs, es, fr, pt_br

source: Use double quotes unless single quotes make it possible to escape fewer characters in a given string. See the examples below:
cs: Použijte dvojité uvozovky, pokud jednoduché uvozovky neumožňují v daném řetězci vynechání escapovaných znaků. Viz příklady níže:
es: Utiliza comillas dobles a menos que las comillas simple hagan positble escapar menos caracteres en una cadena dada. Revisa los ejemplos a continuación:
fr: Utilisez des guillemets doubles dans la mesure du possible, sauf si les guillemets simples peuvent réduire le nombre de caractères à échapper dans une chaîne de caractères donnée. Voir l'exemple ci-dessous :
pt_br: Use duas aspas a não ser que uma aspa só te deixe escapar menos caracteres em uma string. Veja os exemplos abaixo:

source: Numbers
cs: Čísla
es: Numeros
fr: Nombres
pt_br: Números

source: Don't omit the leading or trailing zero in floating-point numbers. Otherwise, this makes them less readable and harder to distinguish from integers at a glance.
cs: U čísel s pohyblivou řádovou čárkou nevynechávejte počáteční ani koncovou nulu. V opačném případě se stanou hůře čitelnými a na první pohled se hůře odlišují od celých čísel.
es: No omitas el cero inicial o final en los números reales. De lo contrario, esto los hace menos legibles y más difíciles de distinguir de los números enteros a simple vista.
fr: N'omettez pas le zéro de tête ou de queue dans les nombres à virgule flottante. Sinon, cela les rend moins lisibles et plus difficiles à distinguer des nombres entiers d'un seul coup d'œil.
pt_br: Não omita o zero à esquerda ou à direita em números de ponto flutuante. Caso contrário, isto os torna menos legíveis e mais difíceis de distinguir de inteiros à primeira vista.

source: Use lowercase for letters in hexadecimal numbers, as their lower height makes the number easier to read.
cs: V hexadecimálních číslech používejte malá písmena, protože jejich menší výška usnadňuje čtení čísla.
es: Use minúsculas para las letras en números hexadecimales, ya que su menor altura hace que el número sea más fácil de leer.
fr: Utilisez des minuscules pour les lettres des nombres hexadécimaux, car leur hauteur réduite rend le nombre plus facile à lire.
pt_br: Use letras minúsculas em números hexadecimais, pois sua altura mais baixa torna o número mais fácil de ler.

source: Take advantage of GDScript's underscores in literals to make large numbers more readable.
cs: Využijte podtržítka v literálech jazyka GDScript, aby byla velká čísla čitelnější.
es: Aprovechen los subrayados de GDScript en los literales para hacer más legibles los grandes números.
fr: Profitez des underscores de GDScript dans les littéraux pour rendre les grands nombres plus lisibles.
pt_br: Aproveite os sublinhados do GDScript em literais para tornar números grandes mais legíveis.

source: Naming conventions
cs: Konvence pojmenování
es: Convenciones para la definición de nombres
fr: Conventions de nommage
pt_br: Convenções de nomes

source: These naming conventions follow the Godot Engine style. Breaking these will make your code clash with the built-in naming conventions, leading to inconsistent code.
cs: Tyto konvence pojmenování odpovídají stylu Godot Engine. Jejich porušení způsobí, že váš kód bude v rozporu se zabudovanými konvencemi pro pojmenování, což povede k nekonzistentnímu kódu.
es: Estas convenciones de nombres siguen el estilo de Godot Engine. Romperlas hará que tu código choque con las convenciones de nomenclaturas incorporadas, lo que crea un código inconsistente.
fr: Ces conventions de nommage suivent le style du moteur Godot. Si vous ne les respectez pas, votre code se détachera des conventions de nommage existantes, ce qui entraînera un code incohérent.
pt_br: Estas convenções de nomeação seguem o estilo do Godot Engine. Quebrá-las fará com que o seu código fique diferente das convenções de nomeação embutidas, o que deixa o seu código inconsistente.

source: File names
cs: Názvy souborů
es: Nombres de archivo
fr: Nom de fichier
pt_br: Nomes de arquivo

source: Use snake_case for file names. For named classes, convert the PascalCase class name to snake_case::
cs: Pro názvy souborů použijte snake_case. U pojmenovaných tříd převeďte název třídy PascalCase na snake_case::
es: Utiliza snake_case para nombres de archivos. Para clases con nombre, convierte el nombre de clase en PascalCase a snake_case::
fr: Utilisez snake_case pour les noms de fichiers. Pour les classes nommées, convertissez le nom de la classe de PascalCase en snake_case :
pt_br: Use snake_case para nomes de arquivo. Para classes nomeadas, converta o nome da classe PascalCase em snake_case::

source: This is consistent with how C++ files are named in Godot's source code. This also avoids case sensitivity issues that can crop up when exporting a project from Windows to other platforms.
cs: To je v souladu s tím, jak jsou pojmenovány soubory C++ ve zdrojovém kódu Godotu. Tím se také vyhnete problémům velkých a malých písmen, které mohou nastat při exportu projektu ze systému Windows na jiné platformy.
es: Esto es consistente con cómo son nombrados los archivos en el código fuente C++ de Godot. Esto también evita problema de sensibilidad a mayúsculas que pueden surgir cuando se exporta un proyecto desde Windows a otras plataformas.
fr: Cela correspond à la façon dont les fichiers C++ sont nommés dans le code source de Godot. Cela permet également d'éviter les problèmes de sensibilité à la casse qui peuvent survenir lors de l'exportation d'un projet de Windows vers d'autres plateformes.
pt_br: Isto é consistente com a forma como os arquivos C++ são nomeados no código-fonte do Godot. Isto também evita problemas de sensibilidade de caixa que podem surgir ao exportar um projeto do Windows para outras plataformas.

source: Classes and nodes
cs: Třídy a uzly
es: Clases y Nodos
fr: Classes et Nœuds
pt_br: Classes e nós

source: Use PascalCase for class and node names:
cs: Pro názvy tříd a uzlů použijte PascalCase:
es: Utiliza PascalCase para nombres de clases y nodos:
fr: Utiliser le PascalCase pour les noms des classes et des nœuds :
pt_br: Use PascalCase para nomes de classes e nós:

source: Also use PascalCase when loading a class into a constant or a variable:
cs: Při načítání třídy do konstanty nebo proměnné použijte také PascalCase:
es: También usa el PascalCase al cargar una clase en una constante o una variable:
fr: Utiliser aussi le PascalCase lorsque vous chargez une classe dans une constante ou une variable :
pt_br: Use PascalCase também quando estiver carregando uma classe em uma constante ou variável:

source: Functions and variables
cs: Funkce a proměnné
es: Funciones y Variables
fr: Fonctions et Variables
pt_br: Funções e variáveis

source: Use snake\_case to name functions and variables:
cs: Pro pojmenování funkcí a proměnných použijte snake\_case:
es: Usa snake\_case para nombrar funciones y variables:
fr: Utiliser le snake\_case pour nommer les fonctions et variables :
pt_br: Use snake\_case para nomear funções e variáveis:

source: Prepend a single underscore (\_) to virtual methods functions the user must override, private functions, and private variables:
cs: K virtuálním metodám, které musí uživatel implementovat, soukromým funkcím a soukromým proměnným přidejte jedno podtržítko (\_):
es: Utilice un solo símbolo de subrayado (\_) para los métodos virtuales que el usuario debe sobreescribir, funciones privadas y variables privadas:
fr: Préfixer un seul trait de soulignement (\_) aux méthodes virtuelles que l'usager doit redéfinir, les fonctions privées, et les variables privées :
pt_br: Prefixe métodos virtuais (funções que o usuário deve sobrescrever), funções privadas e variáveis privadas com um único sublinhado (\_):

source: Signals
cs: Signály
es: Señales
fr: Signaux
pt_br: Sinais

source: Use the past tense to name signals:
cs: Pro pojmenování signálů použijte minulý čas:
es: Usa el tiempo pasado para nombrar señales:
fr: Utiliser le passé pour nommer les signaux :
pt_br: Utilize o tempo pretérito para nomear sinais:

source: Constants and enums
cs: Konstanty a výčtové typy
es: Constantes y enumerables
fr: Constantes et énumérations
pt_br: Constantes e enums

source: Write constants with CONSTANT\_CASE, that is to say in all caps with an underscore (\_) to separate words:
cs: Zapisujte konstanty pomocí CONSTANT\_CASE, tj. všemi velkými písmeny s podtržítkem (\_) pro oddělení slov:
es: Escribe constantes en CONSTANT\_CASE, todas en mayusculas con el símbolo de subrayado (\_) para separar palabras:
fr: Écrivez les constantes avec CONSTANT\_CASE, c'est-à-dire en majuscules avec un trait de soulignement (\_) pour séparer les mots :
pt_br: Utilize CONSTANT\_CASE, com todas as letras maiúsculas e um sublinhado para separas as palavras:

source: Use PascalCase for enum *names* and CONSTANT\_CASE for their members, as they are constants:
cs: Pro *názvy enumů* použijte PascalCase a pro jejich členy CONSTANT\_CASE, protože se jedná o konstanty:
es: Usa PascalCase para *nombres* de enums y CONSTANT\_CASE para sus miembros, ya que son constantes:
fr: Utilisez PascalCase pour les énumération(enum) *names* et CONSTANT\_CASE pour leurs membres, car ce sont des constantes :
pt_br: Use PascalCase para *nomes* de enums e CONSTANT\_CASE para seus membros, já que são constantes:

source: Code order
cs: Pořadí kódu
es: Orden de código
fr: Ordre du code
pt_br: Ordem do código

source: This first section focuses on code order. For formatting, see :ref:`formatting`. For naming conventions, see :ref:`naming_conventions`.
cs: Tato první část se zaměřuje na pořadí kódu. O formátování viz :ref:`formatting`. Konvence pojmenování viz :ref:`naming_conventions`.
es: Esta sección inicial se enfoca en el orden del código. Para el formato, ver :ref:`formatting`. Para convenciones de nombre, ver :ref:`naming_conventions`.
fr: Cette première section porte sur l'ordre du code. Pour le formatage, voir :ref:`formatting`. Pour les conventions de nommage, voir :ref:`naming_conventions`.
pt_br: Esta primeira seção foca na ordem do código. Para formatação, veja :ref:`formatação <formatting>`. Para convenções de nomes, veja :ref:`convenções de nomes <naming_conventions>`.

source: We suggest to organize GDScript code this way:
cs: Doporučujeme uspořádat kód GDScript tímto způsobem:
es: Sugerimos organizar el código GDScript de este modo:
fr: Nous suggérons d'organiser le code GDScript de cette manière :
pt_br: Sugerimos que você organize seu código GDScript assim:

source: We optimized the order to make it easy to read the code from top to bottom, to help developers reading the code for the first time understand how it works, and to avoid errors linked to the order of variable declarations.
cs: Pořadí jsme optimalizovali tak, aby bylo snadné číst kód shora dolů, aby vývojáři, kteří čtou kód poprvé, pochopili, jak funguje, a aby se předešlo chybám souvisejícím s pořadím deklarace proměnných.
es: Optimizamos el orden para hacer más fácil leer el código desde arriba hacia abajo, para ayudar a que los desarrolladores que leen el código por primera vez entiendan cómo funciona y para evitar errores vinculados al orden de declaración de variables.
fr: Nous avons optimisé l'ordre pour rendre le code plus simple à lire de haut en bas, afin d'aider les développeurs à comprendre comment le code fonctionne la première fois qu'ils le lisent, et pour éviter les erreurs liées à l'ordre de déclaration des variables.
pt_br: Otimizamos essa ordem pra deixar o código mais fácil de ler de cima pra baixo, para ajudar desenvolvedores lendo o código pela primeira vez a entender como ele funciona, e para evitar erros referentes à ordem da declaração de variáveis.

source: This code order follows four rules of thumb:
cs: Toto pořadí kódů se řídí čtyřmi základními pravidly:
es: Este orden de código sigue cuatros reglas:
fr: Cet ordre du code suit quatre règles générales :
pt_br: Essa ordem de código segue quatro regras gerais:

source: Properties and signals come first, followed by methods.
cs: Nejdříve jsou na řadě vlastnosti a signály a poté metody.
es: Propiedades y señales vienen primero, seguidas de métodos.
fr: Les propriétés et signaux viennent en premier, suivis des méthodes.
pt_br: Propriedades e sinais vêm primeiro, seguidos por métodos.

source: Public comes before private.
cs: Veřejné přijde před soukromé.
es: Público viene antes de privado.
fr: Publique vient avant privé.
pt_br: Público vem antes de privado.

source: Virtual callbacks come before the class's interface.
cs: Virtuální zpětná volání jsou před rozhraním třídy.
es: Callbacks virtuales vienen antes de la interfaz de clase.
fr: Les rappels(callbacks) virtuels précèdent l'interface de la classe.
pt_br: Callbacks virtuais vêm antes da interface da classe.

source: The object's construction and initialization functions, ``_init`` and ``_ready``, come before functions that modify the object at runtime.
cs: Funkce pro konstrukci a inicializaci objektu, ``_init`` a ``_ready``, předcházejí funkce, které modifikují objekt za běhu.
es: Las funciones de construcción e inicialización de objetos, ``_init`` and ``_ready``, vienen antes de funciones que modifican el objeto en tiempo de ejecución.
fr: Les fonctions de construction et d'initialisation de l'objet, ``_init`` et ``_ready``, viennent avant les fonctions qui modifient l'objet à l'exécution.
pt_br: As funções de construção e inicialização do objeto, ``_init`` e ``_ready``, vêm antes de funções que o modificam durante a execução.

source: Class declaration
cs: Deklarace třídy
es: Declaración de la clase
fr: Déclaration de classe
pt_br: Declaração de classe

source: Signals and properties
cs: Signály a vlastnosti
es: Señales y propiedades
fr: Signaux et propriétés
pt_br: Sinais e propriedades

source: Write signal declarations, followed by properties, that is to say, member variables, after the docstring.
cs: Deklarace signálů, za kterými následují vlastnosti, tedy členské proměnné, zapisujte až za docstring.
es: Escribe la declaración de señales, seguida por propiedades, es decir, las variables miembro después de la docstring.
fr: Écrivez les déclarations de signaux, suivies des propriétés, c'est-à-dire les variables membres, après la docstring.
pt_br: Escreva declarações de sinal, seguida de propriedades, ou seja, variáveis do membro, depois da docstring.

source: Enums should come after signals, as you can use them as export hints for other properties.
cs: Enumy by měly být uvedeny až za signály, protože je můžete použít jako nápovědu pro export ostatních vlastností.
es: Los enums deberán venir después de las señales, ya que puedes usarlos como "export hints" para otras propiedades.
fr: Les énumérations doivent venir après les signaux, car vous pouvez les utiliser comme indices d’exportation pour les autres propriétés.
pt_br: Enums vêm depois de sinais, já que você pode usá-los como inferências de exportação para outras propriedades.

source: Then, write constants, exported variables, public, private, and onready variables, in that order.
cs: Poté napište konstanty, exportované proměnné, veřejné, soukromé proměnné a proměnné onready, a to v tomto pořadí.
es: Luego, escribe constantes, variables exportadas, públicas, privades y onready, en ese orden.
fr: Ensuite, écrivez les constantes, les variables exportées puis les variables publiques, privées et onready, dans cet ordre.
pt_br: Então, escreva constantes, variáveis exportados, públicos, privados, e onready, nessa ordem.

source: The GDScript compiler evaluates onready variables right before the ``_ready`` callback. You can use that to cache node dependencies, that is to say, to get child nodes in the scene that your class relies on. This is what the example above shows.
cs: Překladač GDScript vyhodnocuje proměnné onready těsně před zpětným voláním ``_ready``. Toho můžete využít k ukládání závislostí uzlů do mezipaměti, tj. k získání podřízených uzlů scény, na které vaše třída spoléhá. Právě to ukazuje výše uvedený příklad.
es: El compilador GDScript evalúa variables onready justo antes del callback ``_ready``. Puedes usar esto para guardar referencias a dependencias de nodos, es decir, para obtener nodos en la escena de lo que tu clase depende. Esto es lo que muestra el ejemplo anterior.
fr: Le compilateur GDScript évalue les variables marquées onready juste avant le rappel ``_ready``. Vous pouvez utiliser cela pour mettre en cache les dépendances des nœuds, c'est-à-dire pour obtenir des nœuds enfants dans la scène sur laquelle votre classe s'appuie. C'est ce que montre l'exemple ci-dessus.
pt_br: O compilador de GDScript avalia variáveis onready logo após o callback ``_ready``. Você pode usar isso para garantir que todas as dependências existem, ou seja, criar os nós filhos da cena em que sua classe depende. É isso que o exemplo acima mostra.

source: Member variables
cs: Členské proměnné
es: Varaibles miembro
fr: Variables membres
pt_br: Variáveis de membro

source: Don't declare member variables if they are only used locally in a method, as it makes the code more difficult to follow. Instead, declare them as local variables in the method's body.
cs: Nedeklarujte členské proměnné, pokud se používají pouze lokálně v metodě, protože to znesnadňuje orientaci v kódu. Místo toho je deklarujte jako lokální proměnné v těle metody.
es: No declares variables miembro si sólo serán usadas localmente en un método, esto hace el código más difícil de seguir. En lugar de esto declaralas como varaibles locales en el cuerpo del método.
fr: Ne déclarez pas les variables membres si elles ne sont utilisées que localement dans une méthode, car cela rend le code plus difficile à suivre. Déclarez-les plutôt comme des variables locales dans le corps de la méthode.
pt_br: Não declare variáveis de membro se elas forem usadas apenas localmente em um método, pois torna o código mais difícil de seguir. Em vez disso, declare-as como variáveis locais no corpo do método.

source: Local variables
cs: Lokální proměnné
es: Variables locales
fr: Variables locales
pt_br: Variáveis locais

source: Declare local variables as close as possible to their first use. This makes it easier to follow the code, without having to scroll too much to find where the variable was declared.
cs: Lokální proměnné deklarujte co nejblíže jejich prvnímu použití. To usnadňuje sledování kódu, aniž byste museli příliš rolovat, abyste našli místo, kde byla proměnná deklarována.
es: Declara las variables locales tan cerca como puedas de su primer uso. Esto hace que sea más fácil de seguir el código sin tener que desplazar el código demasiado para encontrar dónde fue declarada la variable.
fr: Déclarez les variables locales le plus près possible de leur première utilisation. Il est ainsi plus facile de suivre le code, sans avoir à trop le faire défiler pour retrouver l'endroit où la variable a été déclarée.
pt_br: Declare variáveis locais o mais pŕoximo possível de seu primeiro uso. Isto torna mais fácil seguir o código, sem ter que rolar muito para encontrar onde a variável foi declarada.

source: Methods and static functions
cs: Metody a statické funkce
es: Métodos y funciones estáticas
fr: Méthodes et fonctions statiques
pt_br: Métodos e funções estáticas

source: After the class's properties come the methods.
cs: Po vlastnostech třídy následují metody.
es: Después las propiedades de la clase vienen los métodos.
fr: Après les propriétés de la classe viennent les méthodes.
pt_br: Depois das propriedades da classe vêm os métodos.

source: Start with the ``_init()`` callback method, that the engine will call upon creating the object in memory. Follow with the ``_ready()`` callback, that Godot calls when it adds a node to the scene tree.
cs: Začněte zpětnou metodou ``_init()``, kterou engine zavolá při vytvoření objektu v paměti. Následuje zpětné volání ``_ready()``, které Godot zavolá při přidání uzlu do stromu scény.
es: Comienza por el método callback ``_init()`` que el motor llamará cuando se crea el objeto en memoria. Seguido del callback ``_ready()``, el que Godot llama cuando un nodo es agregado al árbol de escena.
fr: Commencez avec la méthode de rappel ``_init ()``, que le moteur appellera lors de la création de l'objet en mémoire. Continuez avec la méthode de rappel ``_ready ()``, que Godot appelle quand il ajoute un nœud à l'arbre des scènes.
pt_br: Comece com o método ``_init()``, que a engine chamará assim que o objeto for criado na memória. Siga com o método ``_ready()``, que o Godot chama quando ela adiciona um nó à árvore da cena.

source: These functions should come first because they show how the object is initialized.
cs: Tyto funkce by měly být na prvním místě, protože ukazují, jak se objekt inicializuje.
es: Estas funciones deben ser lo primero porque muestran cómo se inicializa el objeto.
fr: Ces fonctions doivent apparaître en premier car elles indiquent comment l'objet est initialisé.
pt_br: Estas funções devem vir primeiro pois elas mostram como o objeto é inicializado.

source: Other built-in virtual callbacks, like ``_unhandled_input()`` and ``_physics_process``, should come next. These control the object's main loop and interactions with the game engine.
cs: Další vestavěná virtuální zpětná volání, jako ``_unhandled_input()`` a ``_physics_process``, by měly následovat. Ty řídí hlavní smyčku objektu a interakci s herním enginem.
es: Otros callbacks virtuales integrados, como ``_unhandled_input()`` y ``_physics_process``, van después. Estos controlan el bucle principal del objeto y las interacciones con el motor de juegos.
fr: D'autres méthodes de rappel virtuelles intégrées, comme ``_unhandled_input()`` et ``_physics_process``, doivent venir ensuite. Celles-ci contrôlent la boucle principale de l'objet et les interactions avec le moteur de jeu.
pt_br: Outros callbacks virtuais, como ``_unhandled_input()`` e ``_physics_process``, devem vir depois. Estes controlam os loops principais do objeto e suas interações com a engine.

source: The rest of the class's interface, public and private methods, come after that, in that order.
cs: Zbytek rozhraní třídy, veřejné a soukromé metody, následují v tomto pořadí.
es: El resto de la interfaz de la clase, métodos públicos y privados, vienen después en ese orden.
fr: Le reste de l'interface de la classe, les méthodes publiques et privées, viennent ensuite dans cet ordre.
pt_br: O resto da interface da classe, métodos públicos e privados, vêm depois, nessa ordem.

source: Static typing
cs: Statické typování
es: Tipado estáticas
fr: Typage statique
pt_br: Tipagem estática

source: Since Godot 3.1, GDScript supports :ref:`optional static typing<doc_gdscript_static_typing>`.
cs: Od verze Godot 3.1 podporuje GDScript :ref:`volitelné statické typování<doc_gdscript_static_typing>`.
es: Desde Godot 3.1, GDScript soporta :ref:`tipado estático opcional<doc_gdscript_static_typing>`.
fr: Depuis Godot 3.1, GDScript supporte le :ref:`typage statique optionnel<doc_gdscript_static_typing>`.
pt_br: Desde o Godot 3.1, GDScript suporta :ref:`tipagem estática opcional<doc_gdscript_static_typing>`.

source: Declared types
cs: Deklarované typy
es: Tipos declarados
fr: Types déclarés
pt_br: Tipos declarados

source: To declare a variable's type, use ``<variable>: <type>``:
cs: Chcete-li deklarovat typ proměnné, použijte ``<proměnná>: <typ>``:
es: Para declarar el tipo de una variable, usa ``<variable>: <type>``:
fr: Pour déclarer le type d'une variable, utilisez ``<variable>: <type>`` :
pt_br: Para declarar o tipo de uma variável, use ``<variável>: <tipo>``:
