Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/command_line_tutorial.po
Languages: es

source: Command line tutorial
es: Tutorial de línea de comandos

source: Some developers like using the command line extensively. Godot is designed to be friendly to them, so here are the steps for working entirely from the command line. Given the engine relies on almost no external libraries, initialization times are pretty fast, making it suitable for this workflow.
es: A algunos desarrolladores les gusta usar la línea de comandos extensivamente. Godot está diseñado para ser amigable con ellos, así que aquí están los pasos para trabajar completamente desde la línea de comandos. Dado que el motor depende de pocas o ninguna librería externa, los tiempos de inicialización son bastante rápidos, lo que lo hace adecuado para este flujo de trabajo.

source: Command line reference
es: Referencia de la línea de comandos

source: **General options**
es: **Opciones generales**

source: Command
es: Comando

source: Description
es: Descripción

source: Display the list of command line options.
es: Muestra la lista de opciones de línea de comandos.

source: Display the version string.
es: Muestra una cadena con la versión.

source: Use verbose stdout mode.
es: Usa el modo stdout verboso.

source: Quiet mode, silences stdout messages. Errors are still displayed.
es: Modo silencioso, silencia los mensajes de stdout. Los errores seguirán siendo mostrados.

source: **Run options**
es: **Opciones de ejecución**

source: Start the editor instead of running the scene (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Inicia el editor en lugar de ejecutar la escena (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` debe estar habilitado).

source: Start the project manager, even if a project is auto-detected (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Inicie el administrador de proyectos, incluso si un proyecto se detecta automáticamente (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` debe estar habilitado).

source: Quit after the first iteration.
es: Salir después de la primera iteración.

source: Use a specific locale (<locale> being a two-letter code). See :ref:`doc_locales` for more details.
es: Usa una configuración de región específica (<locale> es un código de dos letras). Ver :ref:`doc_locales`para más detalles.

source: ``--path <directory>``
es: ``--path <directorio>``

source: Path to a project (<directory> must contain a 'project.godot' file).
es: Ruta a un proyecto (<directory> debe contener un archivo 'project.godot').

source: Scan folders upwards for 'project.godot' file.
es: Buscar en las carpetas superiores el archivo 'project.godot'.

source: ``--main-pack <file>``
es: ``--main-pack <archivo>``

source: Path to a pack (.pck) file to load.
es: Ruta a un archivo de paquete (.pck) a cargar.

source: ``--render-thread <mode>``
es: ``--render-thread <modo>``

source: Render thread mode ('unsafe', 'safe', 'separate'). See :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` for more details.
es: Modo de renderizado del hilo ('unsafe', 'safe', 'separate'). Ver :ref:`Thread Model <class_ProjectSettings_property_rendering/threads/thread_model>` para más detalles.

source: ``--remote-fs <address>``
es: ``--remote-fs <dirección>``

source: Remote filesystem (``<host/IP>[:<port>]`` address).
es: Sistema de archivos remoto (``<host/IP>[:<port>]`` dirección).

source: Audio driver. Use ``--help`` first to display the list of available drivers.
es: Controlador de audio. Usa ``--help`` primero para mostrar la lista de controladores disponibles.

source: Video driver. Use ``--help`` first to display the list of available drivers.
es: Controlador de video. Usa ``--help`` primero para mostrar la lista de controladores disponibles.

source: **Display options**
es: **Opciones de visualización**

source: Request fullscreen mode.
es: Solicitar modo de pantalla completa.

source: Request a maximized window.
es: Solicitar una ventana maximizada.

source: Request windowed mode.
es: Solicitar modo ventana.

source: Request an always-on-top window.
es: Solicita una ventana siempre en la cima.

source: Request window resolution.
es: Solicitar resolución de ventana.

source: Request window position.
es: Solicitar posición de la ventana.

source: Force low-DPI mode (macOS and Windows only).
es: Forzar el modo de baja DPI (solo macOS y Windows).

source: Disable window creation (Windows only). Useful together with ``--script``.
es: Deshabilitar la creación de ventanas (solo Windows). Útil junto con `` --script``.

source: **Debug options**
es: **Opciones de depuración**

source: Debug options are only available in the editor and debug export templates (they require ``debug`` or ``release_debug`` build targets, see :ref:`doc_introduction_to_the_buildsystem_target` for more details).
es: Las opciones de depuración solo están disponibles en el editor y el depurador de plantillas de exportación (estas requieren ``debug`` o ``release_debug``, ver :ref:`doc_introduction_to_the_buildsystem_target`para más detalles).

source: Debug (local stdout debugger).
es: Depurar (depurador stdout local).

source: Breakpoint list as source::line comma-separated pairs, no spaces (use %%20 instead).
es: Lista de puntos de interrupción como fuente::pares separados por comas, sin espacios (usar %%20 en su lugar).

source: Enable profiling in the script debugger.
es: Habilite la creación de perfiles en el depurador de scripts.

source: ``--remote-debug <address>``
es: ``--remote-debug <dirección>``

source: Remote debug (``<host/IP>:<port>`` address).
es: Depurado remoto (``<host/IP>:<port>`` dirección).

source: Show collision shapes when running the scene.
es: Mostrar la forma de la colisión mientras se ejecuta la escena.

source: Show navigation polygons when running the scene.
es: Mostrar polígonos de navegación mientras se ejecuta la escena.

source: Simulate high CPU load (delay each frame by <ms> milliseconds).
es: Simular una alta carga de CPU (retrasar cada fotograma <ms> milisegundos).

source: ``--time-scale <scale>``
es: ``--time-scale <escala>``

source: Force time scale (higher values are faster, 1.0 is normal speed).
es: Forzar la escala de tiempo (los valores altos son más rápidos, 1.0 es la velocidad normal).

source: Disable render loop so rendering only occurs when called explicitly from script.
es: Deshabilite el bucle de renderizado para que el renderizado solo ocurra cuando se llama explícitamente desde el script.

source: Disable crash handler when supported by the platform code.
es: Deshabilite el controlador de fallas cuando sea compatible con el código de la plataforma.

source: Force a fixed number of frames per second. This setting disables real-time synchronization.
es: Forzar un número fijo de fotogramas por segundo. Esta configuración deshabilita la sincronización en tiempo real.

source: Print the frames per second to the stdout.
es: Imprime los fotogramas por segundo en la stdout.

source: **Standalone tools**
es: **Herramientas independientes**

source: Run a script.
es: Ejecutar un script.

source: Only parse for errors and quit (use with ``--script``).
es: Analizar solo los errores y salir (usar con `` --script``).

source: Export the project using the given export target. Export only main pack if path ends with .pck or .zip (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Exporta el proyecto usando el objetivo de exportación indicado. Exporta sólo el paquete principal si termina con .pck o .zip (tiene que tener habilitado :ref:`tools <doc_introduction_to_the_buildsystem_tools>`).

source: Like ``--export``, but use debug template (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Como ``--export``, pero use la plantilla de depuración (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` debe estar habilitada).

source: ``--doctool <path>``
es: ``--doctool <ruta>``

source: Dump the engine API reference to the given <path> in XML format, merging if existing files are found (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Volcar la referencia de la API del motor a la <ruta> en formato XML, fusionando si se encuentran archivos existentes (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` debe estar habilitado).

source: Disallow dumping the base types (used with ``--doctool``, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Anular el volcado de tipos base (utilizados con ``--doctool``, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` debe estar habilitado).

source: Build the scripting solutions (e.g. for C# projects, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Cree las soluciones de secuencias de comandos (por ejemplo, para proyectos de C#, :ref:`tools <doc_introduction_to_the_buildsystem_tools>` debe estar habilitado).

source: Generate JSON dump of the Godot API for GDNative bindings (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Genere un volcado en JSON de la API de Godot para enlaces de GDNative (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` debe estar habilitado).

source: Run a unit test. Use ``--help`` first to display the list of tests. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Ejecute una prueba unitaria. Usar``--help`` primero para mostrar la lista de pruebas. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` debe estar habilitado).

source: ``--export-pack <preset> <path>``
es: ``--export-pack <preestablecido> <ruta>``

source: Like ``--export``, but only export the game pack for the given preset. The <path> extension determines whether it will be in PCK or ZIP format. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` must be enabled).
es: Como el parametro ``--export``, solo exporta el paquete del juego con el ajuste preestablecido ya dado. La extensión <path> determina si estará en formato PCK o ZIP. (:ref:`tools <doc_introduction_to_the_buildsystem_tools>` deben estar habilitadas para funcionar correctamente).

source: Path
es: Ruta

source: It is recommended that your Godot binary be in your PATH environment variable, so it can be executed easily from any place by typing ``godot``. You can do so on Linux by placing the Godot binary in ``/usr/local/bin`` and making sure it is called ``godot``.
es: Se recomienda que el binario de godot se encuentre en la variable de entorno PATH, para que pueda ejecutarse fácilmente desde cualquier lugar escribiendo ``godot``. Puedes hacerlo en Linux colocando el binario de Godot en ``/usr/local/bin`` y asegurándote de que se llame ``godot``.

source: Setting the project path
es: Configuración de la ruta del proyecto

source: Depending on where your Godot binary is located and what your current working directory is, you may need to set the path to your project for any of the following commands to work correctly.
es: Dependiendo de dónde se encuentre el binario de Godot y cuál sea su directorio de trabajo actual, es posible que necesites establecer la ruta a tu proyecto para que cualquiera de los siguientes comandos funcione correctamente.

source: This can be done by giving the path to the ``project.godot`` file of your project as either the first argument, like this:
es: Esto se puede hacer indicando la ruta al archivo ``project.godot`` de tu proyecto como primer argumento, de esta forma:

source: Or by using the ``--path`` argument:
es: O usando el argumento ``--path``:

source: For example, the full command for exporting your game (as explained below) might look like this:
es: Por ejemplo, el comando completo para exportar tu juego (como se explica a continuación) podría verse así:

source: Creating a project
es: Creación de un proyecto

source: Creating a project from the command line can be done by navigating the shell to the desired place and making a project.godot file.
es: Para crear un proyecto desde la línea de comandos, navega hasta el lugar deseado y crea un archivo project.godot vacío.

source: The project can now be opened with Godot.
es: El proyecto ahora puede abrirse con Godot.

source: Running the editor
es: Ejecutar el editor

source: Running the editor is done by executing Godot with the ``-e`` flag. This must be done from within the project directory or a subdirectory, otherwise the command is ignored and the project manager appears.
es: El editor se abre ejecutando Godot con el parámetro ``-e``. Esto debe hacerse desde el directorio del proyecto, o desde un subdirectorio, de lo contrario el comando se ignora y aparece el gestor de proyectos.

source: If a scene has been created and saved, it can be edited later by running the same code with that scene as argument.
es: Si una escena ha sido creada y guardada, puede ser editada más tarde ejecutando el mismo código con esa escena como argumento.

source: Erasing a scene
es: Borrar una escena

source: Godot is friends with your filesystem and will not create extra metadata files. Use ``rm`` to erase a scene file. Make sure nothing references that scene or else an error will be thrown upon opening.
es: Godot es amigo de tu sistema de archivos, y no creará archivos de metadatos adicionales, simplemente usa ``rm`` para borrar un archivo. Asegúrate de que nada hace referencia a esa escena, de lo contrario se producirá un error al abrirla.

source: Running the game
es: Ejecutar el juego

source: To run the game, simply execute Godot within the project directory or subdirectory.
es: Para ejecutar el juego, simplemente ejecuta Godot dentro del directorio o subdirectorio del proyecto.

source: When a specific scene needs to be tested, pass that scene to the command line.
es: Cuando sea necesario probar una escena específica, pásala por línea de comandos.

source: Debugging
es: Depuración

source: Catching errors in the command line can be a difficult task because they just fly by. For this, a command line debugger is provided by adding ``-d``. It works for running either the game or a simple scene.
es: Capturar errores en línea de comandos puede ser una tarea difícil porque simplemente pasan uno tras otro. Para esto, se proporciona un depurador de línea de comandos añadiendo ``-d``. Funciona tanto para ejecutar el juego como para una escena simple.

source: Exporting
es: Exportar

source: Exporting the project from the command line is also supported. This is especially useful for continuous integration setups. The version of Godot that is headless (server build, no video) is ideal for this.
es: También se puede exportar el proyecto desde la línea de comandos. Esto es especialmente útil para configuraciones de integración continua. La versión de Godot que es headless (server build, no video) es ideal para esto.

source: The preset name must match the name of an export preset defined in the project's ``export_presets.cfg`` file. If the preset name contains spaces or special characters (such as "Windows Desktop"), it must be surrounded with quotes.
es: El nombre del preset debe coincidir con el nombre de un preset de exportación definido en el archivo `` export_presets.cfg `` del proyecto. Si el nombre predeterminado contiene espacios o caracteres especiales (como "Escritorio de Windows"), debe estar entre comillas.

source: To export a debug version of the game, use the ``--export-debug`` switch instead of ``--export``. Their parameters and usage are the same.
es: Para exportar una versión de depuración del juego, utiliza la opción ``--export-debug`` en lugar de ``--export``. Sus parámetros y uso son los mismos.

source: To export only a PCK file, use the ``--export-pack`` option followed by the preset name and output path, with the file extension, instead of ``--export``. The output path extension determines the package's format, either PCK or ZIP.
es: Para exportar sólo un archivo PCK, utilice la opción ``--export-pack`` seguida del nombre y la ruta de salida preestablecidos, con la extensión del archivo, en lugar de ``--export``. La extensión de la ruta de salida determina el formato del paquete, ya sea PCK o ZIP.

source: When specifying a relative path as the path for `--export`, `--export-debug` or `--export-pack`, the path will be relative to the directory containing the ``project.godot`` file, **not** relative to the current working directory.
es: Al especificar una ruta relativa como ruta para `--export`,` --export-debug` o `--export-pack`, la ruta será relativa al directorio que contiene el archivo` `project.godot``, ** no ** relativo al directorio de trabajo actual.

source: Running a script
es: Ejecutar un script

source: It is possible to run a simple ``.gd`` script from the command line. This feature is especially useful in large projects, e.g. for batch conversion of assets or custom import/export.
es: Es posible ejecutar un script ``.gd`` desde línea de comandos. Esta función es especialmente útil en proyectos de gran envergadura, para la conversión por lotes de recursos o la importación/exportación personalizada.

source: The script must inherit from ``SceneTree`` or ``MainLoop``.
es: El script debe heredar de ``SceneTree`` o ``MainLoop``.

source: Here is a simple ``sayhello.gd`` example of how it works:
es: He aquí un ejemplo simple del funcionamiento de ``sayhello.gd`` :

source: And how to run it:
es: Y cómo ejecutarlo:

source: If no ``project.godot`` exists at the path, current path is assumed to be the current working directory (unless ``--path`` is specified).
es: Si ``project.godot`` no existe en la ruta, se asume que la ruta actual es el directorio de trabajo a utilizar (a menos que se especifique ``--path``).

source: The first line of ``sayhello.gd`` above is commonly referred to as a *shebang*. If the Godot binary is in your ``PATH`` as ``godot``, it allows you to run the script as follows in modern Linux distributions, as well as macOS:
es: La primera línea de ``sayhello.gd`` de arriba se conoce comúnmente como un *shebang*. Si el binario Godot está en tu ``path`` como ``Godot``, te permite ejecutar el script como sigue en las modernas distribuciones de Linux, así como en las MacOS:

source: If the above doesn't work in your current version of Linux or macOS, you can always have the shebang run Godot straight from where it is located as follows:
es: Si lo anterior no funciona en su versión actual de Linux o MacOS, siempre puede hacer que el shebang ejecute Godot directamente desde donde se encuentra, de la siguiente manera:
