Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/editor/using_the_web_editor.po
Languages: fr, ru

source: Using the Web editor
fr: Utilisation de l’éditeur Web
ru: Использование веб-редактора

source: Since Godot 3.3, there is a `Web editor <https://editor.godotengine.org/>`__ you can use to work on new or existing projects.
fr: Depuis la version 3.3 de Godot, il y a un éditeur web `éditeur web <https://editor.godotengine.org/>` pour travailler sur des projets nouveaux ou existants.
ru: Начиная с Godot 3.3, существует `Веб-редактор <https://editor.godotengine.org/>` __, который вы можете использовать для работы над новыми или существующими проектами.

source: The web editor is in a preliminary stage. While its feature set may be sufficient for educational purposes, it is currently **not recommended for production work**. See :ref:`doc_using_the_web_editor_limitations` below.
fr: Cet éditeur web est dans un état préliminaire. Même si ses fonctionnalités peuvent être suffisante pour un but éducatif, il n'est actuellement **pas recommandé pour travailler en production**. Voir :ref:`doc_using_the_web_editor_limitations` ci dessous.
ru: Веб-редактор находится на предварительной стадии. Хотя его набор функций может быть достаточным для образовательных целей, в настоящее время он **не рекомендуется для производственной работы**. Смотрите: ref: `doc_using_the_web_editor_limitations` ниже.

source: Browser support
fr: Support des navigateurs
ru: Поддержка браузерами

source: The Web editor requires support for WebAssembly's SharedArrayBuffer. This is in turn required to support threading in the browser. The following desktop browsers support WebAssembly threading and can therefore run the web editor:
fr: L'éditeur en ligne a besoin de supporter le SharedArrayBuffer de WebAssembly (littéralement : la liste de mémoire partagé du langage assembleur pour le web). Ceci est en effet nécessaire pour pouvoir supporter de multiple fil d’exécution (threading) sur le navigateur. Les navigateurs de bureau suivants supportent le l'utilisation de multiple fil d’exécution de WebAssembly et peuvent donc lancer l'éditeur web :
ru: Веб-редактор требует поддержки SharedArrayBuffer WebAssembly. Это, в свою очередь, необходимо для поддержки потоковой передачи в браузере. Следующие настольные браузеры поддерживают потоки WebAssembly и поэтому могут запускать веб-редактор:

source: Chrome 68 or later
fr: Chrome 68 ou version ultérieure
ru: Chrome 68 или позднее

source: Firefox 79 or later
fr: Firefox 79 ou version ultérieure
ru: Firefox 79 или позднее

source: Edge 79 or later
fr: Edge 79 ou version ultérieure
ru: Edge 79 или позднее

source: Opera and Safari are not supported yet. Safari may work in the future once proper threading support is added.
fr: Opera et Safari ne sont actuellement pas supporté. Safari pourra fonctionner à l'avenir une fois que la prise en charge des threads sera ajoutée.
ru: Opera и Safari еще не поддерживаются. Safari может работать в будущем после добавления надлежащей поддержки потоковой передачи.

source: **Mobile browsers are currently not supported.**
fr: **Les navigateurs mobiles ne sont actuellement pas pris en charge.**
ru: **Мобильные браузеры в настоящее время не поддерживаются.**

source: The web editor supports both the GLES3 and GLES2 renderers, although GLES2 is recommended for better performance and compatibility with old/low-end hardware.
fr: L'éditeur Web prend en charge les moteurs de rendu GLES3 et GLES2, bien que GLES2 soit recommandé pour de meilleures performances et une meilleure compatibilité avec le matériel ancien / bas de gamme.
ru: Веб-редактор поддерживает как рендереры GLES3, так и GLES2, однакоGLES2 рекомендуется для лучшей производительности и совместимости со старым/бюджетным оборудованием.

source: If you use Linux, due to `poor Firefox WebGL performance <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>`__, it's recommended to use a Chromium-based browser instead of Firefox.
fr: Si vous utilisez Linux, en raison de `mauvaises performances de Firefox WebGL <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>` __, il est recommandé d'utiliser un navigateur basé sur Chromium au lieu de Firefox.
ru: Если вы используете Linux, из-за `низкой производительности Firefox WebGL <https://bugzilla.mozilla.org/show_bug.cgi?id=1010527>` __ рекомендуется использовать браузер на основе Chromium вместо Firefox.

source: Limitations
fr: Limites
ru: Ограничения

source: Due to limitations on the Godot or Web platform side, the following features are currently missing:
fr: En raison de limitations du côté de la plateforme Godot ou Web, les fonctionnalités suivantes sont actuellement manquantes :
ru: Из-за ограничений на стороне Godot или веб-платформы в настоящее время отсутствуют следующие функции:

source: No C#/Mono support.
fr: Pas de support C#/Mono.
ru: C#/Mono не поддерживается.

source: No GDNative support.
fr: GDNative non supporté.
ru: Нет поддержки GDNative.

source: No debugging support. This means GDScript debugging/profiling, live scene editing, the Remote Scene tree dock and other features that rely on the debugger protocol will not work.
ru: Нет поддержки дебаггинга. Это значит что отладка/профилирование, редактор сцен реального времени, док управление удаленным деревом и другие функции в GDScript которые связаны с отладчиком не будут работать.

source: No project exporting. As a workaround, you can download the project source using **Project > Tools > Download Project Source** and export it using a `native version of the Godot editor <https://godotengine.org/download>`__.
fr: Aucun projet d'exportation. Pour contourner ce problème, vous pouvez télécharger la source du projet en utilisant **Project > Tools > Download Project Source** et l'exporter en utilisant une `version native de l'éditeur Godot <https://godotengine.org/download>`__.
ru: Нет экспорта проекта. В качестве обходного пути вы можете загрузить исходный код проекта с помощью **Проект > Инструменты > Загрузить исходный код проекта** и экспортировать его с помощью `собственной версии редактора Godot <https://godotengine.org/download>` __.

source: The editor won't warn you when closing the tab with unsaved changes.
fr: L'éditeur ne vous avertira pas lors de la fermeture de l'onglet avec des modifications non enregistrées.
ru: Редактор не предупредит вас при закрытии вкладки с несохраненными изменениями.

source: No lightmap baking support. You can still use existing lightmaps if they were baked with a native version of the Godot editor (e.g. by importing an existing project).
fr: Pas de support pour le baking des lightmaps. Vous pouvez toujours utiliser les lightmaps existantes si elles ont été créées avec une version native de l'éditeur Godot (par exemple en important un projet existant).
ru: Нет поддержки запекания карты освещения. Вы по-прежнему можете использовать существующие карты освещения, если они были запечены с помощью собственной версии редактора Godot (например, путем импорта существующего проекта).

source: The following features are unlikely to be supported due to inherent limitations of the Web platform:
fr: Il est peu probable que les fonctionnalités suivantes soient prises en charge en raison des limitations inhérentes à la plate-forme Web :
ru: Следующие функции вряд ли будут поддерживаться из-за ограничений, присущих веб-платформе:

source: No support for external script editors.
fr: Editeurs de scripts externes non-supporté.
ru: Внешние редакторы сценариев не поддерживаются.

source: No support for Android one-click deploy.
fr: Le déploiement en un clic d'Android n'est pas pris en charge.
ru: Развёртывание в один клик для Android не поддерживается.

source: See the `list of open issues on GitHub related to the web editor <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Ahtml5+label%3Atopic%3Aeditor>`__ for a list of known bugs.
fr: Voir la `liste des issues ouvertes sur GitHub liées à l'éditeur web <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Ahtml5+label%3Atopic%3Aeditor>`__ pour une liste des bogues connus.
ru: Посмотрите `список нерешенных проблем на GitHub связанных с веб-редактором <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Aplatform%3Ahtml5+label%3Atopic%3Aeditor>`__ для получения списка известных ошибок.

source: Importing a project
fr: Importation d'un projet
ru: Импортирование проекта

source: To import an existing project, the current process is as follows:
fr: Pour importer un projet existant, la procédure actuelle est la suivante :
ru: Чтобы импортировать существующий проект, текущий процесс выглядит следующим образом:

source: Specify a ZIP file to preload on the HTML5 filesystem using the **Preload project ZIP** input.
fr: Spécifiez un fichier ZIP à précharger sur le système de fichiers HTML5 à l'aide de l'entrée **Préchargement du projet ZIP**.
ru: Укажите файл ZIP для предварительной загрузки в файловую систему HTML5 с помощью ввода **Предварительная загрузка ZIP проекта**.

source: Run the editor by clicking **Start Godot editor**. The Godot project manager should appear after 10-20 seconds. On slower machines or connections, loading may take up to a minute.
fr: Lancez l'éditeur en cliquant sur **Start Godot editor** (Démarrer l'éditeur Godot). Le gestionnaire de projet Godot devrait apparaître après 10-20 secondes. Sur des machines ou des connexions plus lentes, le chargement peut prendre jusqu'à une minute.
ru: Запустите редактор, нажав **Запустить редактор Godot**. Менеджер проекта Godot должен появиться через 10-20 секунд. На более медленных машинах или подключениях загрузка может занять до минуты.

source: In the dialog that appears at the middle of the window, specify a name for the folder to create then click the **Create Folder** button (it doesn't have to match the ZIP archive's name).
fr: Dans la boîte de dialogue qui apparaît au milieu de la fenêtre, indiquez un nom pour le dossier à créer puis cliquez sur le bouton **Create Folder** (il n'est pas nécessaire qu'il corresponde au nom de l'archive ZIP).
ru: В диалоговом окне, которое появляется в середине окна, укажите имя для создаваемой папки, затем нажмите кнопку **Создать папку** (она не обязательно должна совпадать с именем ZIP-архива).

source: Click **Install & Edit** and the project will open in the editor.
fr: Cliquez sur **Installer & Éditer** et le projet s'ouvrira dans l'éditeur.
ru: Нажмите **Установить и изменить**, и проект откроется в редакторе.

source: It's important to place the project folder somewhere in ``/home/web_user/``. If your project folder is placed outside ``/home/web_user/``, you will lose your project when closing the editor!
fr: Il est important de placer le dossier du projet quelque part dans ``/home/web_user/``. Si votre dossier de projet est placé en dehors de ``/home/web_user/``, vous perdrez votre projet lors de la fermeture de l'éditeur !
ru: Важно разместить папку проекта где-нибудь в ``/home/web_user/``. Если папка вашего проекта находится вне ``/home/web_user/``, вы потеряете свой проект при закрытии редактора!

source: When you follow the steps described above, the project folder will always be located in ``/home/web_user/projects``, keeping it safe.
fr: Lorsque vous suivez les étapes décrites ci-dessus, le dossier du projet sera toujours situé dans ``/home/web_user/projects``, le gardant en sécurité.
ru: При следование шагам, описанным выше, папка проекта всегда будет находиться в ``/home/web_user/projects``, что сохранит ее безопасность.

source: Editing and running a project
fr: Éditer et exécuter un projet
ru: Редактирование и запуск проекта

source: Unlike the native version of Godot, the web editor is constrained to a single window. Therefore, it cannot open a new window when running the project. Instead, when you run the project by clicking the Run button or pressing :kbd:`F5`, it will appear to "replace" the editor window.
fr: Contrairement à la version native de Godot, l'éditeur web est limité à une seule fenêtre. Par conséquent, il ne peut pas ouvrir une nouvelle fenêtre lors de l'exécution du projet. Au lieu de cela, lorsque vous exécutez le projet en cliquant sur le bouton Run ou en appuyant sur :kbd:`F5`, il apparaîtra pour "remplacer" la fenêtre de l'éditeur.
ru: В отличие от родной версии Godot, веб-редактор ограничен одним окном. Следовательно, он не может открыть новое окно при запуске проекта. Вместо этого, когда вы запускаете проект, щелкнув кнопку «Выполнить» или нажав: kbd:`F5`, он появится, заменив окна редактора.

source: The web editor offers an alternative way to deal with the editor and game windows (which are now "tabs"). You can switch between the **Editor** and **Game** tabs using the buttons on the top. You can also close the running game or editor by clicking the **×** button next to those tabs.
fr: L'éditeur web offre une autre façon de gérer les fenêtres de l'éditeur et du jeu (qui sont maintenant des "onglets"). Vous pouvez basculer entre les onglets **Éditeur** et **Jeu** à l'aide des boutons situés en haut. Vous pouvez également fermer le jeu ou l'éditeur en cours en cliquant sur le bouton **×** à côté de ces onglets.
ru: Веб-редактор предлагает альтернативный способ работы с окнами редактора и игры (которые теперь являются «вкладками»). Вы можете переключаться между вкладками **Редактор** и **Игра** с помощью кнопок вверху. Вы также можете закрыть запущенную игру или редактор, нажав кнопку **×** рядом с этими вкладками.

source: Where are my project files?
fr: Où sont mes fichiers de projet ?
ru: Где мои файлы проекта?

source: Due to browser security limitations, the editor will save the project files to the browser's IndexedDB storage. This storage isn't accessible as a regular folder on your machine, but is abstracted away in a database.
fr: En raison des limitations de sécurité du navigateur, l'éditeur enregistre les fichiers du projet dans le stockage IndexedDB du navigateur. Ce stockage n'est pas accessible comme un dossier normal sur votre machine, mais est abstrait dans une base de données.
ru: Из-за ограничений безопасности браузера редактор сохранит файлы проекта в хранилище IndexedDB браузера. Это хранилище недоступно как обычная папка на вашем компьютере, но оно абстрагируется в базе данных.

source: You can download the project files as a ZIP archive by using **Project > Tools > Download Project Source**. This can be used to export the project using a `native Godot editor <https://godotengine.org/download>`__, since exporting from the web editor isn't supported yet.
fr: Vous pouvez télécharger les fichiers du projet sous forme d'archive ZIP en utilisant **Projet > Outils > Télécharger la source du projet**. Ceci peut être utilisé pour exporter le projet en utilisant un `éditeur Godot natif <https://godotengine.org/download>`__, puisque l'exportation depuis l'éditeur web n'est pas encore supportée.
ru: Вы можете загрузить файлы проекта в виде ZIP-архива, используя **Проект > Инструменты > Загрузить исходный код проекта**. Это можно использовать для экспорта проекта с помощью `родного редактора Godot <https://godotengine.org/download>` __, поскольку экспорт из веб-редактора еще не поддерживается.

source: In the future, it may be possible to use the `HTML5 FileSystem API <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ to store the project files on the user's filesystem as the native editor would do. However, this isn't implemented yet.
fr: Dans le futur, il sera peut-être possible d'utiliser l'API `Système de fichiers HTML5 <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ pour stocker les fichiers du projet sur le système de fichiers de l'utilisateur comme le ferait l'éditeur natif. Cependant, ceci n'est pas encore implémenté.
ru: В будущем можно будет использовать `API файловой системы HTML5 <https://developer.mozilla.org/en-US/docs/Web/API/FileSystem>`__ для хранения файлов проекта в файловой системе пользователя как это делал бы родной редактор. Однако это еще не реализовано.
