Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/debug/overview_of_debugging_tools.po
Languages: es, fr

source: Overview of debugging tools
es: Resumen de herramientas de depuración
fr: Aperçu des outils de débogage

source: This guide will give you an overview of the available debugging tools in the engine.
es: Esta guía te proporcionará una descripción general de las herramientas de depuración disponibles en el motor.
fr: Ce guide vous donnera un aperçu des outils de débogage disponibles dans le moteur.

source: Godot comes with a powerful debugger and profilers to track down bugs, inspect your game at runtime, monitor essential metrics, and measure performances. It also offers options to visualize collision boxes and navigation polygons in the running game.
es: Godot viene con un potente depurador y perfiladores para rastrear errores, inspeccionar tu juego en tiempo de ejecución, monitorear métricas esenciales y medir el rendimiento. También ofrece opciones para visualizar cajas de colisión y polígonos de navegación en el juego en ejecución.
fr: Godot est doté d'un puissant débogueur et de profileurs qui permettent de repérer les bogues, d'inspecter votre jeu à l'exécution, de surveiller les paramètres essentiels et de mesurer les performances. Il offre également des options permettant de visualiser les boîtes de collision et les polygones de navigation dans le jeu en cours d'exécution.

source: Finally, you have options to debug the game running on a remote device and to reload changes to your scenes or your code while the game is running.
es: Finalmente, tienes opciones para depurar el juego que se está ejecutando en un dispositivo remoto y para recargar cambios en tus escenas o tu código mientras el juego está en ejecución.
fr: Enfin, vous avez la possibilité de déboguer le jeu en cours d'exécution sur un appareil distant et de recharger les modifications apportées à vos scènes ou à votre code pendant le déroulement du jeu.

source: Debugger Panel
es: Panel del Depurador
fr: Panneau de débogage

source: Many of Godot's debugging tools are part of the Debugger panel, which you can find information about in :ref:`doc_debugger_panel`.
es: Muchas de las herramientas de depuración de Godot forman parte del panel de depuración, sobre el cual puedes encontrar información en :ref:`doc_debugger_panel`.
fr: De nombreux outils de débogage de Godot font partie du panneau de débogage, sur lequel vous pouvez trouver des informations dans :ref:`doc_debugger_panel`.

source: Debug menu options
es: Menú de opciones de depuración
fr: Options du menu de débogage

source: There are a few common debug options you can toggle on or off when running your game in the editor, which can help you in debugging your game.
es: Existen algunas opciones de depuración comunes que puedes activar o desactivar mientras ejecutas tu juego en el editor, las cuales pueden ayudarte en la depuración de tu juego.
fr: Il existe quelques options de débogage courantes que vous pouvez activer ou désactiver lorsque vous exécutez votre jeu dans l'éditeur, ce qui peut vous aider à déboguer votre jeu.

source: You can find these options in the **Debug** editor menu.
es: Puedes encontrar estas opciones en el menú **Depuración** del editor.
fr: Vous pouvez trouver ces options dans le menu de l'éditeur **Debug**.

source: Here are the descriptions of the options:
es: Aquí están las descripciones de las opciones:
fr: Voici les descriptions des options :

source: Deploy with Remote Debug
es: Exportar con Depuración Remota
fr: Déployer avec le débogage distant

source: When exporting and deploying, the resulting executable will attempt to connect to the IP of your computer for debugging.
es: Al exportar y publicar, el ejecutable resultante intentará conectarse a la IP de tu computadora para ser depurado.
fr: Lors de l'exportation et du déploiement, l'exécutable résultant tentera de se connecter à l'IP de votre ordinateur pour le débogage.

source: Small Deploy with Network FS
es: Exportación Mini con Recursos en Red
fr: Déploiement minime avec système de fichier réseau

source: This option speeds up testing for games with a large footprint on remote devices.
es: Esta opción acelera las pruebas para juegos con una gran huella en dispositivos remotos.
fr: Cette option accélère les tests pour les jeux avec une grande empreinte sur les appareils distants.

source: When **Small Deploy with Network FS** is on, instead of exporting the full game, deploying the game builds a minimal executable. The editor then provides files from the project over the network.
es: Cuando **Small Deploy with Network FS** está activado, en lugar de exportar el juego completo, el despliegue del juego construye un ejecutable mínimo. Luego, el editor proporciona archivos del proyecto a través de la red.
fr: Lorsque **Small Deploy with Network FS** est activé, au lieu d'exporter le jeu complet, le déploiement du jeu crée un exécutable minimal. L'éditeur fournit ensuite les fichiers du projet sur le réseau.

source: Also, on Android, the game is deployed using the USB cable to speed up deployment.
es: Además, en Android, el juego se despliega utilizando el cable USB para acelerar el proceso de despliegue.
fr: De plus, sur Android, le jeu est déployé à l'aide du câble USB pour accélérer le déploiement.

source: Visible Collision Shapes
es: Ver Formas de Colisión
fr: Formes de collision visibles

source: This option makes collision shapes and raycast nodes visible in the running game.
es: Esta opción hace que las formas de colisión y los nodos (raycast) sean visibles en el juego mientras se está ejecutando.
fr: Cette option rend visibles les formes de collision et les nœuds de raycast dans le jeu en cours d’exécution.

source: Visible Navigation
es: Navegación Visible
fr: Navigation visible

source: Navigation meshes and polygons will be visible on the running game.
es: Las mallas de navegación y los polígonos serán visibles en el juego mientras se está ejecutando.
fr: Les maillages de navigation et les polygones seront visibles sur le jeu en cours d’exécution.

source: Sync Scene Changes
es: Sincronizar cambios de escena
fr: Synchroniser les modifications des scènes

source: With this option, any change you make to a scene in the editor at runtime appears instantly. When used remotely on a device, this is more efficient with the network filesystem.
es: Con esta opción, cualquier cambio que realices en una escena en el editor durante la ejecución del juego aparecerá instantáneamente. Cuando se utiliza de forma remota en un dispositivo, esto es más eficiente con el sistema de archivos de red.
fr: Avec cette option, toute modification apportée à une scène dans l'éditeur au moment de l'exécution apparaît instantanément. Lorsqu'il est utilisé à distance sur un appareil, cela est plus efficace avec le système de fichiers réseau.

source: Sync Script Changes
es: Sincronizar Cambios en Scripts
fr: Synchroniser les modifications des scripts

source: Any script that is saved will be reloaded on the running game. When used remotely on a device, this is more efficient with the network filesystem.
es: Cualquier script que se guarde será recargado en el juego en ejecución. Cuando se utiliza de forma remota en un dispositivo, esto es más eficiente con el sistema de archivos de red.
fr: Tout script sauvegardé sera rechargé sur le jeu en cours d’exécution. Lorsqu'il est utilisé à distance sur un appareil, ce système est plus efficace avec le système de fichiers du réseau.

source: Script editor debug tools and options
es: Herramientas y opciones de depuración del editor de scripts
fr: Outils et options de débogage de l'éditeur de script

source: The script editor has its own set of debug tools for use with breakpoints and two options. The breakpoint tools can also be found in the **Debugger** tab of the debugger.
es: El editor de scripts tiene su propio conjunto de herramientas de depuración para usar con puntos de interrupción y dos opciones. Las herramientas de puntos de interrupción también se pueden encontrar en la pestaña **Depurador** del depurador.
fr: L'éditeur de script possède son propre ensemble d'outils de débogage à utiliser avec les points d'arrêt(breakpoints) et deux options. Les outils de points d'arrêt se trouvent également dans l'onglet **Debugger** du débogueur.

source: The **Break** button causes a break in the script like a breakpoint would. **Continue** makes the game continue after pausing at a breakpoint. **Step Over** goes to the next line of code, and **Step Into** goes into a function if possible. Otherwise, it does the same thing as **Step Over**.
es: El botón **Interrumpir** causa una pausa en el script, similar a un punto de interrupción. **Continuar** permite que el juego continúe después de pausar en un punto de interrupción. **Paso Siguiente** va a la siguiente línea de código, y **Entrar en** ingresa a una función si es posible. De lo contrario, hace lo mismo que **Paso Siguiente**.
fr: Le bouton **Break** provoque une rupture dans le script comme le ferait un point d'arrêt. Le bouton **Continue** permet de continuer le jeu après une pause à un point d'arrêt. **Step Over** passe à la ligne de code suivante, et **Step Into** passe dans une fonction si possible. Sinon, il fait la même chose que **Step Over**.

source: Debug project settings
es: Configuración de depuración en el proyecto
fr: Paramètres de débogage du projet

source: In the project settings, there is a **Debug** category with three subcategories which control different things.
es: En la configuración del proyecto, hay una categoría **Depuración** con tres subcategorías que controlan diferentes aspectos.
fr: Dans les paramètres du projet, il y a une catégorie **Debug** avec trois sous-catégories qui contrôlent différentes choses.

source: Settings
es: Ajustes
fr: Paramètres

source: These are some general settings such as printing the current FPS to the **Output** panel, the maximum amount of functions when profiling and others.
es: Estas son algunas configuraciones generales, como imprimir el FPS actual en el panel de **Salida**, el número máximo de funciones al perfilar y otras.
fr: Il s'agit de quelques paramètres généraux tels que l'impression du FPS actuel sur le panneau **Output**, le nombre maximum de fonctions lors du profilage et autres.

source: These settings allow you to toggle specific GDScript warnings, such as for unused variables. You can also turn off warnings completely.
es: Estas configuraciones te permiten activar o desactivar advertencias específicas de GDScript, como las relacionadas con variables no utilizadas. También puedes desactivar completamente las advertencias.
fr: Ces paramètres vous permettent d'activer/désactiver des avertissements GDScript spécifiques, par exemple pour les variables non utilisées. Vous pouvez également désactiver complètement les avertissements.

source: Shapes
es: Formas
fr: Formes

source: Shapes are where you can adjust the color of shapes that only appear for debugging purposes, such as collision and navigation shapes.
es: Las formas son donde puedes ajustar el color de las formas que solo aparecen con fines de depuración, como las formas de colisión y navegación.
fr: Les formes permettent d'ajuster la couleur des formes qui n'apparaissent qu'à des fins de débogage, telles que les formes de collision et de navigation.

source: Remote in scene dock
es: Remoto en el panel de escenas
fr: Remote dans le dock de scène

source: When running a game in the editor two options appear at the top of the **Scene** dock, **Remote** and **Local**. While using **Remote** you can inspect or change the nodes' parameters in the running project.
es: Al ejecutar el juego, en el editor aparecerán dos opciones en la parte superior del panel **Escenas**, **Remoto** y **Local**. Mientras uses ``Remoto`` puedes inspeccionar o cambiar los parámetros de los nodos del juego en ejecución.
fr: Lorsque vous lancez un jeu dans l'éditeur, deux options apparaissent en haut du dock **Scene**, **Remote** et **Local**. En utilisant **Remote**, vous pouvez inspecter ou modifier les paramètres des nœuds dans le projet en cours d'exécution.

source: Some editor settings related to debugging can be found inside the **Editor Settings**, under the **Network > Debug** and **Debugger** sections.
es: Algunas configuraciones del editor relacionadas con la depuración se pueden encontrar dentro de **Configuración del Editor**, en las secciones de **Red > Depuración** y **Depurador**.
fr: Certains paramètres de l'éditeur relatifs au débogage se trouvent dans les **Paramètres de l'éditeur**, sous les sections **Network > Debug** et **Debugger**.

source: Translation status
es: Estado de traducción
fr: État de la traduction
