Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/workflow/bug_triage_guidelines.po
Languages: fr, zh_cn

source: Bug triage guidelines
fr: Lignes directrices pour le triage des bogues
zh_cn: Bug 分类规范

source: This page describes the typical workflow of the bug triage team aka bugsquad when handling issues and pull requests on Godot's `GitHub repository <https://github.com/godotengine/godot>`__. It is bound to evolve together with the bugsquad, so do not hesitate to propose modifications to the following guidelines.
fr: Cette page décrit le flux de travail typique de l'équipe de triage des bogues alias bugsquad lors de la gestion des problèmes et des pull requests sur le dépôt `GitHub <https://github.com/godotengine/godot>`__ de Godot. Elle est appelée à évoluer avec le bugsquad, n'hésitez donc pas à proposer des modifications aux directives suivantes.
zh_cn: 本页面描述了 Bug 分类团队即 bugsquad（Bug 小队）在处理 Godot `GitHub <https://github.com/godotengine/godot>`_ 仓库的 Issue 和 Pull Request 时的典型工作流程。它一定会与 bugsquad 一起发展，所以请对下面的规范提出修改意见，不要犹豫。

source: Issues management
fr: Gestion des Issues
zh_cn: 问题管理

source: GitHub proposes various features to manage issues:
fr: GitHub propose différentes fonctionnalités pour gérer les issues :
zh_cn: GitHub提出了各种功能来管理问题:

source: Set one or several labels from a predefined list
fr: Définir un ou plusieurs labels à partir d'une liste prédéfinie
zh_cn: 从预定义列表中设置一个或多个标签

source: Set one milestone from a predefined list
fr: Poser un "milestone" à partir d'une liste prédéfinie
zh_cn: 从预定义列表中设置一个里程碑

source: Keep track of the issue in the project dashboard
fr: Suivez l'évolution de l'issue dans le tableau de bord du projet
zh_cn: 在项目仪表板中跟踪问题

source: Define one contributor as "assignee" among the Godot engine organization members
fr: Définir un contributeur comme "assignee" parmi les membres de l'organisation du moteur Godot
zh_cn: 在 Godot 引擎组织成员中定义一个贡献者作为“担当者”

source: As the Godot engine organization on GitHub currently has a restricted number of contributors, we do not use assignees extensively for now. All contributors are welcome to take on any issue, if relevant after mentioning it on the issue ticket and/or discussing the best way to resolve it with other developers.
fr: Comme l'organisation du moteur Godot sur GitHub a actuellement un nombre restreint de contributeurs, nous n'utilisons pas beaucoup de cessionnaires pour l'instant. Tous les contributeurs sont les bienvenus pour prendre en charge tout problème, le cas échéant après l'avoir mentionné sur le ticket de problème et/ou avoir discuté de la meilleure façon de le résoudre avec d'autres développeurs.
zh_cn: 由于GitHub上的Godot引擎组织目前的贡献者数量有限, 我们暂时不会广泛使用受托者. 欢迎所有贡献者讨论任何问题, 如果在问题单上提及和/或讨论, 是与其他开发人员解决此问题的最佳方式.

source: For the time being, we do not use the project dashboard feature either.
fr: Pour l'instant, nous n'utilisons pas non plus la fonction de tableau de bord du projet.
zh_cn: 目前，我们也不使用项目仪表板（Dashboard）功能。

source: As far as possible, we try to assign labels (and milestones, when relevant) to both issues and pull requests.
fr: Dans la mesure du possible, nous essayons d'attribuer des étiquettes (et des "milestones" le cas échéant) aux deux questions et aux demandes de retrait.
zh_cn: 我们尽可能尝试为问题和拉取请求分配标签(和相关的里程碑).

source: Labels
zh_cn: 标签

source: The following labels are currently defined in the Godot repository:
fr: Les labels suivants sont actuellement définis dans le dépôt Godot :
zh_cn: 目前在Godot仓库中定义了以下标签:

source: **Categories:**
fr: **Catégories :**
zh_cn: **分类:**

source: *Archived*: either a duplicate of another issue, or invalid. Such an issue would also be closed.
fr: *Archived* : soit un doublon d'un autre problème, soit n'est pas valable. Une telle issue serait également fermé.
zh_cn: *Archived*: 是另一个问题的副本, 或无效. 这样的问题也将被关闭.

source: *Breaks compat*: describes something that can only be fixed by breaking compatibility with existing projects.
fr: *Breaks compat* : décris quelque chose qui ne peut être corrigé qu'en n'étant plus compatible avec les projets existants.
zh_cn: *Breaks compat*\ ：用于描述需要破坏已有项目兼容性才能修复的内容。

source: *Bug*: describes something that is not working properly.
fr: *Bug* : décrit quelque chose qui ne fonctionne pas correctement.
zh_cn: *Bug*: 描述无法正常工作的内容.

source: *Cherrypick*: describes something that can be backported to a stable branch after being merged in the ``master`` branch.
fr: *Cherrypick* : décris quelque chose qui peut être repris de la branche ``master`` (principale) pour être intégrée dans la branche stable actuelle.
zh_cn: *Cherrypick*\ ：用于描述合并入 ``master`` 分支后还可以移植回稳定分支的内容。

source: *Confirmed*: has been confirmed by at least one other contributor than the bug reporter (typically for *Bug* reports). The purpose of this label is to let developers know which issues are still reproducible when they want to select what to work on. It is therefore a good practice to add in a comment on what platform and what version or commit of Godot the issue could be reproduced; if a developer looks at the issue one year later, the *Confirmed* label may not be relevant anymore.
fr: *Confirmed* : a été confirmée par au moins un autre contributeur que le rapporteur de bogue (généralement pour les rapports de *bogue*). L'objectif de ce label est de faire savoir aux développeurs quels problèmes sont encore reproductibles lorsqu'ils veulent choisir sur quoi travailler. C'est donc une bonne pratique que d'ajouter un commentaire sur la plate-forme et la version ou le commit de Godot sur lesquels le problème pourrait être reproduit ; si un développeur examine le problème un an plus tard, le label *Confirmed* peut ne plus être pertinent.
zh_cn: *Confirmed*: 已由至少一个其他贡献者而不是错误报告者(通常用于 *Bug* 报告)确认. 该标签的目的是让开发人员知道当他们想要选择要解决的问题时仍然可以重现的问题. 因此, 在一个评论中添加评论: 可以再现该问题的是什么平台, 什么版本或Godot的提交是一个好的做法；如果开发人员在一年后查看该问题, 则 *Confirmed* 标签可能不再相关.

source: *Crash:* describes a bug that causes the engine to crash. This label is only used for "hard" crashes, not freezes.
fr: *Crash* : decris un bogue faisant planter le moteur de jeu. N'est utilisé que quand l'application quitte inopinément, et pas quand elle ne fait que se figer.
zh_cn: *Crash：*\ 用于描述导致引擎崩溃的问题。这个标签仅适用于“硬”崩溃，卡死不算。

source: *Discussion*: the issue is not consensual and needs further discussion to define what exactly should be done to address the topic.
fr: *Discussion* : la question n'est pas consensuelle et nécessite une discussion plus approfondie afin de définir ce qui doit être fait exactement pour traiter le sujet.
zh_cn: *Discussion*: 这个问题不是共识, 需要进一步讨论以定义解决该主题的确切方法.

source: *Documentation*: issue related to the documentation. Mainly to request enhancements in the API documentation. Issues related to the ReadTheDocs documentation should be filed on the `godot-docs <https://github.com/godotengine/godot-docs>`_ repository.
fr: *Documentation* : question liée à la documentation. Principalement pour demander des améliorations dans la documentation de l'API. Les problèmes liés à la documentation de ReadTheDocs doivent être classés dans le dépôt `godot-docs <https://github.com/godotengine/godot-docs>`_.
zh_cn: *Documentation*: 与文档相关的问题. 主要是要求改进API文档. 与ReadTheDocs文档相关的问题应该在 `godot-docs <https://github.com/godotengine/godot-docs>`_ 储存库上提交.

source: *Enhancement*: describes a proposed enhancement to an existing functionality.
fr: *Enhancement* : décrit une proposition d'amélioration d'une fonctionnalité existante.
zh_cn: *Enhancement*: 描述对现有功能的建议增强.

source: *Feature proposal*: describes a wish for a new feature to be implemented. Note that the main Godot repository no longer accepts feature requests. Please use `godot-proposals <https://github.com/godotengine/godot-proposals>`__ instead.
fr: *Feature proposal* : décrit un souhait de mise en œuvre d'une nouvelle fonctionnalité. Notez que le dépôt principal de Godot n'accepte plus les demandes de fonctionnalités. Veuillez utiliser `godot-proposals <https://github.com/godotengine/godot-proposals>`__ à la place.
zh_cn: *Feature proposal*\ ：用于描述实现新功能的愿望。请注意 Godot 主仓库不再接受功能请求。请换用 `godot-proposals <https://github.com/godotengine/godot-proposals>`__\ 。

source: *For PR meeting*: the issue needs to be discussed in a pull request meeting. These meetings are public and are held on the `Godot Contributors Chat <https://chat.godotengine.org/>`_.
fr: *For PR meeting* : le problème doit être discuté dans une réunion de pull request. Ces réunions sont publiques et se tiennent sur le `Godot Contributors Chat <https://chat.godotengine.org/>`_.
zh_cn: *For PR meeting*\ ：该问题需要在拉取请求会议中进行讨论。会议是公开的，在 `Godot 贡献者聊天 <https://chat.godotengine.org/>`_\ 中举行。

source: *High priority:* the issue is particularly important as it can prevent people from releasing their projects or cause data loss.
fr: *High priority* : ce problème a une _haut priorité_ car elle peut empêcher de publier des projets ou la perte de données.
zh_cn: *High priority：*\ 该问题非常重要，可能导致人们无法发布他们的项目或造成数据丢失。

source: *Needs testing*: the issue/pull request could not be completely tested and thus need further testing. This can mean that it needs to be tested on different hardware/software configurations or even that the steps to reproduce are not certain.
fr: *Needs testing* : l'issue ou la Pull Request n'a pas pu être complètement testée et doit donc être soumise à des tests supplémentaires. Cela peut signifier qu'elle doit être testée sur différentes configurations matérielles/logicielles ou même que les étapes à reproduire ne sont pas certaines.
zh_cn: *Needs testing*: 问题/拉取请求无法完全测试, 因此需要进一步测试. 这可能意味着需要在不同的硬件/软件配置上进行测试, 或者甚至重现的步骤不确定.

source: *Needs work*: the pull request needs additional work before it can be merged.
fr: *Needs work* : la pull request nécessite un travail supplémentaire avant de pouvoir être fusionnée.
zh_cn: *Needs work*\ ：拉取请求需要额外处理才能进行合并。

source: *Performance*: issues that directly impact engine or editor performance. Can also be used for pull requests that improve performance or add low-end-friendly options. Should not be coupled with *Usability*.
fr: *Performance* : problèmes qui ont un impact direct sur les performances du moteur ou de l'éditeur. Peut également être utilisé pour les demandes de pull qui améliorent les performances ou ajoutent des options conviviales pour le bas de gamme. Ne devrait pas être couplé avec *Usability*.
zh_cn: *Performance*: 直接影响引擎或编辑器性能的问题。也可用于改善性能或增加低端友好选项的拉取请求。不应与 *Usability* 可用性结合在一起。

source: *Regression*: the bug appeared after a stable release not exhibiting the bug was released.
fr: *Régression* : le bug est apparu après la publication d'une version stable ne présentant pas de bug.
zh_cn: *Regression*: 在没有表现出该错误的稳定版本发布之后，该错误出现。

source: *Salvageable*: the pull request can't be merged due to design issues or merge conflicts and its author is not active anymore. However, it can still be picked up by an external contributor to bring it to a mergeable state. To do so, you need to open a new pull request based on the original pull request.
fr: *Salvageable* : la *pull request* ne peut pas être fusionnée en raison de problèmes de conception ou de conflits de fusion et son auteur n'est plus actif. Cependant, elle peut toujours être reprise par un contributeur externe pour la rendre fusionnable. Pour ce faire, vous devez ouvrir une nouvelle demande de *pull request* basée sur la demande originale.
zh_cn: *Salvageable*: 由于设计问题或合并冲突，该拉动请求不能被合并，其作者也不再活跃。然而，它仍然可以被一个外部贡献者拾取，以使其达到可合并状态。为此，你需要基于原始拉取请求打开一个新的拉取请求。

source: *Tracker*: issue used to track other issues (like all issues related to the plugin system).
fr: *Tracker* : issue utilisé pour suivre d'autres problèmes (comme tous les problèmes liés au système de plugin).
zh_cn: *Tracker*: 用于跟踪其他问题的问题(例如与插件系统相关的所有问题).

source: *Usability*: issues that directly impact user usability. Should not be coupled with *Performance*.
fr: *Utilisabilité* : questions qui ont un impact direct sur la convivialité pour l'utilisateur. Ne devrait pas être couplé avec *Performance*.
zh_cn: *Usability*: 直接影响用户可用性的问题。不应与 *Performance* 相结合。

source: **Topics:**
zh_cn: **话题:**

source: *2D*: relates to 2D-specific issues. Should be coupled with one of the labels below, and should not be coupled with *3D*.
fr: *2D* : concerne les questions spécifiques à la 2D. Doit être couplé avec l'une des étiquettes ci-dessous, et ne doit pas être couplé avec *3D*.
zh_cn: *2D*: 涉及 2D 特定问题。应该与下面的某个标签组合使用，而不应该与 *3D* 组合。

source: *3D*: relates to 3D-specific issues. Should be coupled with one of the labels below, and should not be coupled with *2D*.
fr: *3D* : concerne les questions spécifiques à la 3D. Doit être associé à l'une des étiquettes ci-dessous, et ne doit pas être associé à *2D*.
zh_cn: *3D*: 涉及 3D 特定问题。应该与下面的某个标签组合使用，而不应该与 *2D* 组合。

source: *Assetlib*: relates to issues with the asset library.
fr: *Assetlib* : concerne les questions relatives à la bibliothèque d'asset.
zh_cn: *Assetlib*: 与在线资源库的问题有关.

source: *Audio*: relates to the audio features (low and high level).
fr: *Audio* : concerne les fonctions audio (haut et bas niveau).
zh_cn: *Audio*: 与音频功能(低级别和高级别)有关.

source: *Buildsystem*: relates to building issues, either linked to the SCons buildsystem or to compiler peculiarities.
fr: *Buildsystem* : concerne les problèmes de compilation, soit liés au système de compilation SCons, soit aux particularités du compilateur.
zh_cn: *Buildsystem*: 与构建问题有关, 可以链接到SCons构建系统或编译器特性.

source: *Codestyle*: relates to the programming style used within the codebase.
fr: *Codestyle* : concerne le style de programmation utilisé dans la base de code.
zh_cn: *Codestyle*\ ：与代码库所使用的编程风格有关。

source: *Editor*: relates to issues in the editor (mainly UI).
fr: *Editor* : concerne les issues de l'éditeur (principalement l'interface utilisateur).
zh_cn: *Editor*: 与编辑器中的问题(主要是UI)有关.

source: *GDScript*: relates to GDScript.
fr: *GDScript* : se rapporte au GDScript.
zh_cn: *GDScript*: 与GDScript有关.

source: *Import*: relates to the resource import system.
fr: *Import* : concerne le système d'importation des ressources.
zh_cn: *Import*\ ：与资源导入系统有关。

source: *Navigation*: relates to the navigation system (including A* and navmeshes).
fr: *Navigation* : concerne le système de navigation (comme A* et les navmesh).
zh_cn: *Navigation*\ ：与导航系统（包括 A* 和导航网格）有关。

source: *Physics*: relates to the physics engine (2D/3D).
fr: *Physics* : concerne le moteur physique (2D/3D).
zh_cn: *Physics*\ ：与物理引擎（2D/3D）有关。

source: *Plugin*: relates to problems encountered while writing plugins.
fr: *Plugin* : concerne les problèmes rencontrés lors de l'écriture de plugins.
zh_cn: *Plugin*\ ：与编写插件时遇到的问题有关。

source: *Porting*: relates to some specific platforms or exporting projects.
fr: *Porting* : concerne certaines plateformes spécifiques ou projets d'exportation.
zh_cn: *Porting*\ ：与某些特定平台或导出项目有关。

source: *Rendering*: relates to the 2D and 3D rendering engines.
fr: *Rendering* : concerne les moteurs de rendu 2D et 3D.
zh_cn: *Rendering*\ ：与 2D 和 3D 渲染引擎有关。

source: *Shaders*: relates to the Godot shader language or visual shaders.
fr: *Shaders* : concerne le langage de shader de Godot, ou les shaders visuels.
zh_cn: *Shaders*\ ：与 Godot 着色器语言或可视化着色器有关。

source: *Tests*: relates to unit tests.
fr: *Tests* : concerne les tests unitaires.
zh_cn: *Tests*\ ：与单元测试有关。

source: *Thirdparty*: relates to third-party libraries used in Godot.
fr: *Thirdparty* : concerne les bibliothèques tiers dans Godot.
zh_cn: *Thirdparty*\ ：与 Godot 所使用的第三方库有关。

source: *XR*: relates to Augmented Reality or Virtual Reality.
fr: *XR* : concerne la Réalité Augmentée (AR) ou la Réalité Virtuelle (VR).
zh_cn: *XR*\ ：与增强现实（AR）或虚拟现实（VR）有关。

source: Issues would typically correspond to only one topic, though it's not unthinkable to see issues that fit two bills. The general idea is that there will be specialized contributors teams behind all topics, so they can focus on the issues labelled with their team's topic.
fr: Les Issues ne correspondent généralement qu'à un seul sujet, bien qu'il ne soit pas impensable d'en voir qui puissent concerner deux sujets. L'idée est qu'il y aura des équipes de contributeurs spécialisés derrière tous les sujets, afin qu'ils puissent se concentrer sur les questions étiquetées avec le sujet de leur équipe.
zh_cn: 问题通常只对应一个主题, 但看到符合两个主题的问题并不是不可想象的. 一般的想法是, 将有专门的贡献者团队支持所有主题, 因此他们可以专注于标记为团队主题的问题.

source: **Platforms:**
fr: **Plateformes :**
zh_cn: **平台：**

source: By default, it is assumed that a given issue applies to all platforms. If one of the platform labels is used, it is then exclusive and the previous assumption doesn't stand anymore (so if it's a bug on e.g. Android and Linux exclusively, select those two platforms).
fr: Par défaut, on suppose qu'une issue donnée s'applique à toutes les plateformes. Si l'une des étiquettes de plate-forme est utilisée, elle est alors exclusive et l'hypothèse précédente ne tient plus (donc si c'est un bug sur par exemple Android et Linux exclusivement, sélectionnez ces deux plates-formes).
zh_cn: 默认情况下, 假定给定的问题适用于所有平台. 如果使用其中一个平台标签, 则它不是通用的, 之前的假设不再适用(因此, 如果它是例如Android和Linux上的错误, 请选择这两个平台).

source: Documentation labels
fr: Labels de documentation
zh_cn: 文档标签

source: In the `documentation repository <https://github.com/godotengine/godot-docs>`__, we use the following labels:
fr: Dans le `documentation repository <https://github.com/godotengine/godot-docs>`__, nous utilisons les étiquettes suivantes :
zh_cn: 在\ `文档仓库 <https://github.com/godotengine/godot-docs>`__\ 中，我们使用如下标签：

source: *Bug*: Incorrect information in an existing page. Not to be used for *missing* information.
fr: *Bug* : Information incorrecte dans une page existante. Ne doit pas être utilisé pour les informations *manquantes*.
zh_cn: *Bug*\ ：现有页面中的错误信息。请勿对\ *缺失*\ 信息使用。

source: *Enhancememnt*: new information to be added in an existing page.
fr: *Enhancememnt* : nouvelle information à ajouter dans une page existante.
zh_cn: *Enhancememnt*\ ：为现有页面加入新信息。

source: *Class reference*: the issue is about the class reference, not a documentation page.
fr: *Class reference* : le problème concerne la référence de la classe, et non une page de documentation.
zh_cn: *Class reference*\ ：类参考的问题，非文档页面。

source: Milestones
fr: Étapes
zh_cn: 里程碑

source: `Milestones <https://github.com/godotengine/godot/milestones>`_ correspond to planned future versions of Godot for which there is an existing roadmap. Issues that fit in the said roadmap should be filed under the corresponding milestone; if they don't correspond to any current roadmap, they should be left without milestone. As a rule of thumb, an issue corresponds to a given milestone if it concerns a feature that is new in the milestone, or a critical bug that can't be accepted in any future stable release, or anything that Juan wants to work on right now. :)
fr: Les `Milestones (Jalon) <https://github.com/godotengine/godot/milestones>`_ correspondent aux futures versions de Godot prévues pour lesquelles il existe une feuille de route. Les questions qui s'inscrivent dans ladite feuille de route doivent être classées dans la milestone correspondante ; si elles ne correspondent à aucune feuille de route actuelle, elles doivent être laissées hors de toute milestone. En règle générale, un problème correspond à une milestone donnée s'il concerne une nouvelle fonctionnalité de la milestone, ou un bogue critique qui ne peut être accepté dans une future version stable, ou tout ce sur quoi Juan veut travailler maintenant :)
zh_cn: `里程碑 <https://github.com/godotengine/godot/milestones>`_ 对应于已有路线图的Godot未来计划版本. 符合上述路线图的问题应归入相应的里程碑下；如果它们不符合任何现有的路线图, 则应将其放在没有里程碑的地方. 根据经验, 如果一个问题涉及到一个里程碑中的新功能, 或者一个不能在未来稳定版本中被接受的关键错误, 或者任何Juan现在想做的事情, 那么它就对应于一个特定的里程碑.)

source: Contributors are free to pick issues regardless of their assigned milestone; if a fix is proposed for a bug that was not deemed urgent and thus without milestone, it would likely still be very welcome.
fr: Les contributeurs sont libres de choisir les problèmes indépendamment du jalon qui leur est attribué ; si une correction est proposée pour un bogue qui n'a pas été jugé urgent et donc sans milestone, elle sera probablement toujours la bienvenue.
zh_cn: 无论指定的里程碑如何, 贡献者都可以自由选择问题；如果针对一个不被认为是紧急的错误提出修复, 因此没有里程碑, 那么它可能仍然非常受欢迎.

source: Translation status
fr: État de la traduction
zh_cn: 翻译状态
