Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/vr/openxr/deploy_on_quest.po
Languages: es, fr, zh_cn

source: Deploying on Quest
es: Desplegando en Quest
fr: Déployer sur Quest
zh_cn: 在 Quest 上部署

source: The OpenXR plugin makes developing for Android seamless with developing desktop XR experiences. Note that many Android based devices are very constrained performance-wise. Therefore, **we highly recommend using the GLES2 renderer.**
es: El complemento de OpenXR facilita el desarrollo para Android de manera fluida con el desarrollo de experiencias XR de escritorio. Ten en cuenta que muchos dispositivos basados en Android tienen limitaciones de rendimiento. Por lo tanto, **recomendamos encarecidamente utilizar el renderizador GLES2.**
fr: Le plugin OpenXR rend le développement pour Android transparent avec le développement d'expériences XR de bureau. Notez que de nombreux appareils basés sur Android sont très limités en termes de performances. Par conséquent, **nous recommandons vivement d'utiliser le moteur de rendu GLES2.**
zh_cn: OpenXR 插件让 Android XR 开发能够与桌面 XR 开发的体验一致。请注意，许多基于 Android 的设备在性能方面十分受限。因此，\ **我们强烈推荐使用 GLES2 渲染器。**

source: Currently, the only Android-based device supported is the Meta Quest. As Khronos is finalizing the official Android support for OpenXR, we will be able to offer further support soon.
es: Actualmente, el único dispositivo basado en Android compatible es el Meta Quest. A medida que Khronos finalice el soporte oficial de OpenXR para Android, pronto podremos ofrecer un mayor soporte.
fr: Actuellement, le seul appareil Android pris en charge est le Meta Quest. Khronos étant en train de finaliser le support officiel d'Android pour OpenXR, nous serons bientôt en mesure d'offrir un support supplémentaire.
zh_cn: 目前，Meta Quest 是唯一支持的基于 Android 的设备。Khronos 正在对 OpenXR 的官方 Android 支持进行收尾，我们很快就能够提供更多支持了。

source: As with any other Android device, please follow `the instructions in the official Godot documentation for deploying to Android <https://docs.godotengine.org/en/stable/getting_started/workflow/export/exporting_for_android.html#doc-exporting-for-android>`__.
es: Al igual que con cualquier otro dispositivo Android, sigue las instrucciones en la `documentación oficial de Godot para implementar en Android <https://docs.godotengine.org/en/stable/getting_started/workflow/export/exporting_for_android.html#doc-exporting-for-android>`__.
fr: Comme pour tout autre appareil Android, veuillez suivre `les instructions de la documentation officielle de Godot pour le déploiement sur Android <https://docs.godotengine.org/en/stable/getting_started/workflow/export/exporting_for_android.html#doc-exporting-for-android>`__.
zh_cn: 和任何其他 Android 设备一样，请按照 `Godot 官方文档中关于部署到 Android 的说明 <https://docs.godotengine.org/en/stable/getting_started/workflow/export/exporting_for_android.html#doc-exporting-for-android>`__\ 操作。

source: Enable developer mode on the Quest
es: Habilitar el modo de desarrollador en la Quest
fr: Activer le mode développeur sur le Quest
zh_cn: 在 Quest 上启用开发者模式

source: You can only deploy games to the Meta Quest if developer mode is enabled. You can do this from the Oculus support application installed on your phone. Please `follow the instructions on the Oculus developer site <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`__.
es: Solo puedes implementar juegos en el Meta Quest si el modo de desarrollador está habilitado. Puedes hacer esto desde la aplicación de soporte de Oculus instalada en tu teléfono. Por favor, `sigue las instrucciones en el sitio web de desarrolladores de Oculus <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`__.
fr: Vous ne pouvez déployer des jeux sur le Meta Quest que si le mode développeur est activé. Vous pouvez le faire à partir de l'application d'assistance Oculus installée sur votre téléphone. Veuillez `suivre les instructions sur le site du développeur Oculus <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`__.
zh_cn: 只有开启开发者模式，才能够向 Meta Quest 部署游戏。这个模式可以使用手机上安装的 Oculus 支持应用开启。请\ `按照 Oculus 开发者网站上的说明操作 <https://developer.oculus.com/documentation/native/android/mobile-device-setup/>`__\ 。

source: Setting up the export template
es: Configurando la plantilla de exportación
fr: Configurer des modèles d'exportation
zh_cn: 设置导出模板

source: The instruction in the official Godot documentation already has you configuring an export template in Godot. However, a few extra settings are needed for XR deployment.
es: Las instrucciones en la documentación oficial de Godot ya te guían para configurar una plantilla de exportación en Godot. Sin embargo, se necesitan algunas configuraciones adicionales para implementar XR.
fr: L'instruction dans la documentation officielle de Godot vous fait déjà configurer un modèle d'exportation dans Godot. Cependant, quelques paramètres supplémentaires sont nécessaires pour le déploiement XR.
zh_cn: Godot 官方文档中的说明已经解释过如何在 Godot 中配置导出模板了。不过，XR 部署还需要一些额外的设置。

source: Open the export settings again by opening the **Project > Export...** menu and select the Android export template you created. If you haven't created it yet, do so now by pressing **Add...** and selecting **Android**.
es: Abre nuevamente la configuración de exportación haciendo clic en el menú **Proyecto > Exportar...** y selecciona la plantilla de exportación de Android que creaste. Si aún no la has creado, hazlo ahora presionando **Agregar...** y seleccionando **Android**.
fr: Ouvrez à nouveau les paramètres d'exportation en ouvrant le menu **Projet > Exporter...** et sélectionnez le modèle d'exportation Android que vous avez créé. Si vous ne l'avez pas encore créé, faites-le maintenant en appuyant sur **Ajouter...** et en sélectionnant **Android**.
zh_cn: 使用\ **项目 > 导出...** 菜单再次打开导出设置，选中你创建的 Android 导出模板。如果你还没有创建，请点击\ **添加...** 并选择 **Android**\ 。

source: Scroll down to the **Xr Features** section. Here, the important setting is the **Xr Mode** which should be set to **OpenXR**. Note that the other options shown here should be set according to your project's needs.
es: Desplázate hacia abajo hasta la sección **Xr Features**. Aquí, la configuración importante es el **Modo Xr**, que debe establecerse en **OpenXR**. Ten en cuenta que las otras opciones que se muestran aquí deben configurarse según las necesidades de tu proyecto.
fr: Faites défiler vers le bas jusqu'à la section **Fonctionnalités Xr**. Ici, le paramètre important est le **Xr Mode** qui doit être réglé sur **OpenXR**. Notez que les autres options présentées ici doivent être définies en fonction des besoins de votre projet.
zh_cn: 滚动到 **Xr Features**\ （XR 特性）部分。这里的 **Xr Mode**\ （XR 模式）设置非常重要。请注意，这里的其他选项应该根据项目的实际需求设置。

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
