Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/vr/openxr/index.po
Languages: es, fr, zh_cn

source: OpenXR plugin
es: Plugins de OpenXR
fr: Plugin OpenXR
zh_cn: OpenXR 插件

source: Welcome to the Godot OpenXR documentation!
es: ¡Bienvenido a la documentación de Godot OpenXR!
fr: Bienvenue dans la documentation de Godot OpenXR !
zh_cn: 欢迎来到 Godot OpenXR 文档！

source: Introduction
es: Introducción
zh_cn: 前言

source: This is the documentation for the `Godot OpenXR plugin <https://github.com/GodotVR/godot_openxr>`__.
es: Esta es la documentación para el complemento `Godot OpenXR <https://github.com/GodotVR/godot_openxr>`__.
fr: Ceci est la documentation du `plugin OpenXR Godot <https://github.com/GodotVR/godot_openxr>`__.
zh_cn: 这是 `Godot OpenXR 插件 <https://github.com/GodotVR/godot_openxr>`__\ 的文档。

source: The plugin is supported on Godot 3.4 and later. However, it does **not** support the upcoming Godot 4.0 release.
es: El complemento es compatible con Godot 3.4 y versiones posteriores. Sin embargo, **no** es compatible con la próxima versión Godot 4.0.
fr: Le plugin est supporté sur Godot 3.4 et plus. Cependant, il ne supporte **pas** la prochaine version Godot 4.0.
zh_cn: 本插件支持 Godot 3.4 及后续版本。但是\ **不支持**\ 即将到来的 Godot 4.0 版本。

source: Getting started
es: Primeros pasos
fr: Prise en main
zh_cn: 入门

source: To start a new project that supports OpenXR, start by opening up the Godot editor and creating a new project.
es: Para comenzar un nuevo proyecto que admita OpenXR, comienza abriendo el editor de Godot y creando un nuevo proyecto.
fr: Pour démarrer un nouveau projet qui prend en charge OpenXR, commencez par ouvrir l'éditeur Godot et créez un nouveau projet.
zh_cn: 要开始一个支持 OpenXR 的全新项目，请首先打开 Godot 编辑器，新建一个项目。

source: Copy the plugin into this new project in the subfolder ``addons/godot_openxr/`` using your operating system's file manager. It is important that the plugin is placed in this **exact** location in your project folder.
es: Copia el complemento en este nuevo proyecto en la subcarpeta ``addons/godot_openxr/`` utilizando el administrador de archivos de tu sistema operativo. Es importante que el complemento se coloque en esta ubicación **exacta** dentro de la carpeta de tu proyecto.
fr: Copiez le plugin dans ce nouveau projet dans le sous-dossier ``addons/godot_openxr/`` en utilisant le gestionnaire de fichiers de votre système d’exploitation. Il est important que le plugin soit placé à cet emplacement **exact** dans votre dossier de projet.
zh_cn: 使用操作系统文件管理器将插件的 ``addons/godot_openxr/`` 子目录复制进这个新项目。请务必将插件放置在你的项目中的这个\ **确切**\ 位置。

source: Back in Godot, create a new 3D scene and press the **Instance Child Scene** button (represented by a chain link icon) in the scene tree dock. Select the ``addons/godot_openxr/scenes/first_person_controller_vr.tscn`` subscene and add it to your scene. Right-click the added node and select **Editable Children** to gain access to some of the nodes in this subscene:
es: De regreso en Godot, crea una nueva escena 3D y presiona el botón **Instanciar Escena Hija** (representado por un icono de cadena) en el dock del árbol de escenas. Selecciona la subescena ``addons/godot_openxr/scenes/first_person_controller_vr.tscn`` y agrégala a tu escena. Haz clic derecho en el nodo agregado y selecciona **Niños Editables** para acceder a algunos de los nodos en esta subescena:
fr: De retour dans Godot, créez une nouvelle scène 3D et appuyez sur le bouton **Instance Child Scene** (représenté par une icône de maillon de chaîne) dans le dock de l'arbre de scène. Sélectionnez la sous-scène ``addons/godot_openxr/scenes/first_person_controller_vr.tscn`` et ajoutez-la à votre scène. Faites un clic droit sur le nœud ajouté et sélectionnez **Editable Children** pour avoir accès à certains des nœuds de cette sous-scène :
zh_cn: 回到 Godot 中，新建一个 3D 场景，点击场景树面板中的\ **实例化子场景**\ 按钮（由链条图标表示）。选择 ``addons/godot_openxr/scenes/first_person_controller_vr.tscn`` 子场景，将其加入你的场景。右键点击加入的节点，选择\ **子节点可编辑**\ ，这样就能够访问这个子场景中的一些节点了：

source: This is the bare minimum you need. However, for good measure, we suggest adding a DirectionalLight node and a few MeshInstance nodes so you have something to see. If you add those to the hand nodes, you can visualize where your controllers are tracking.
es: Esto es lo mínimo que necesitas. Sin embargo, como medida adicional, te sugerimos agregar un nodo DirectionalLight y algunos nodos MeshInstance para que haya algo que ver. Si agregas esos nodos a los nodos de las manos, podrás visualizar dónde se están rastreando tus controladores.
fr: C'est le strict minimum dont vous avez besoin. Cependant, pour faire bonne mesure, nous vous suggérons d'ajouter un nœud DirectionalLight et quelques nœuds MeshInstance pour avoir quelque chose à voir. Si vous les ajoutez aux nœuds de main, vous pouvez visualiser où vos manettes sont suivis.
zh_cn: 这就是最低限度的需求了。不过除此之外，我们还建议添加一个 DirectionalLight 节点和一些 MeshInstance 节点，这样你就可以有东西看。如果你把它们添加到手部节点下，就可以显示出你的控制器所跟踪的位置了。

source: Your scene should now look something like this:
es: Tu escena debería verse algo así:
fr: Votre scène devrait maintenant ressembler à ceci :
zh_cn: 你的场景现在应该看上去类似这样：

source: Now you can press the **Run** button in the top-right corner of the editor to start your project and you should be able to look around.
es: Ahora puedes presionar el botón **Ejecutar** en la esquina superior derecha del editor para iniciar tu proyecto y deberías poder mirar alrededor.
fr: Vous pouvez maintenant appuyer sur le bouton **Run** dans le coin supérieur droit de l'éditeur pour lancer votre projet et vous devriez pouvoir regarder autour de vous.
zh_cn: 现在你可以点击编辑器右上角的\ **运行**\ 按钮，启动项目，然后就应该能够环顾四周了。

source: Next steps
es: Siguientes pasos
fr: La suite
zh_cn: 下一步

source: To turn this simple scene into a proper game, the sky is the limit. Below, there are a few more topics specific to this plugin. However, the following resources are a good place to continue:
es: Para convertir esta escena sencilla en un juego adecuado, el cielo es el límite. A continuación, hay algunos temas adicionales específicos de este complemento. Sin embargo, los siguientes recursos son un buen punto para continuar:
fr: Pour transformer cette simple scène en un véritable jeu, le ciel est la limite. Vous trouverez ci-dessous quelques autres sujets spécifiques à ce plugin. Toutefois, les ressources suivantes constituent un bon point de départ :
zh_cn: 要把这个简单的场景变成正经的游戏，是没有上限的。下面还有一些针对这个插件的更多话题。不过，通过以下资源继续下去也是不错的：

source: :ref:`VR starter tutorial <doc_vr_starter_tutorial_part_one>` in the official documentation may focus on OpenVR, but almost everything there applies to OpenXR as well.
es: El :ref:`tutorial de inicio de VR <doc_vr_starter_tutorial_part_one>` en la documentación oficial puede centrarse en OpenVR, pero casi todo lo que se menciona también se aplica a OpenXR.
fr: :ref:`Le tutoriel de démarrage VR <doc_vr_starter_tutorial_part_one>` dans la documentation officielle se concentrer sur OpenVR, mais presque tout ce qui y figure s'applique également à OpenXR.
zh_cn: 官方文档中的 :ref:`VR 入门教程 <doc_vr_starter_tutorial_part_one>`\ 可能是围绕 OpenVR 的，但几乎所有内容都同样适用于 OpenXR。

source: `Godot XR tools <https://github.com/GodotVR/godot-xr-tools>`__ is a plugin that contains a set of handy sub scene to quickly implement locomotion, object interaction and UI elements in your XR experience.
es: `Godot XR tools <https://github.com/GodotVR/godot-xr-tools>`__ es un complemento que contiene un conjunto de subescenas prácticas para implementar rápidamente locomoción, interacción con objetos y elementos de interfaz de usuario en tu experiencia de XR.
fr: `Godot XR tools <https://github.com/GodotVR/godot-xr-tools>`__ est un plugin qui contient un ensemble de sous-scènes pratiques pour implémenter rapidement la locomotion, l'interaction avec les objets et les éléments d'UI dans votre expérience VR.
zh_cn: `Godot XR 工具 <https://github.com/GodotVR/godot-xr-tools>`__\ 是一个包含了若干实用子场景的插件，可以用来快速实现移动、对象交互、UI 元素等 XR 体验。

source: Please check the `Godot Engine community page <https://godotengine.org/community>`__ to find help from other Godot developers. The ``#xr`` channel on the Godot Discord has become a vibrant Godot XR community.
es: Por favor, visita la página de la comunidad de `Godot Engine <https://godotengine.org/community>`__ para encontrar ayuda de otros desarrolladores de Godot. El canal ``#xr`` en el Discord de Godot se ha convertido en una comunidad vibrante de Godot XR.
fr: Veuillez consulter la `page de la communauté du moteur Godot <https://godotengine.org/community>`__ pour trouver de l'aide auprès d'autres développeurs Godot. Le ``#xr`` canal sur le Godot Discord est devenu une communauté Godot XR dynamique.
zh_cn: 要寻求其他 Godot 开发者的帮助，请查看 `Godot 引擎社区页面 <https://godotengine.org/community>`__\ 。Godot Discord 的 ``#xr`` 频道已经是一个非常活跃的 Godot XR 社区。

source: Plugin features
es: Características del plugin
fr: Fonctionnalités du plugin
zh_cn: 插件特性

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
