Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_macos.po
Languages: es, fr, pt_br

source: Enable if you need to use the camera, if it's enabled you should also provide usage message in the `privacy/camera_usage_description` option.
es: Habilita esta opción si necesitas utilizar la cámara. Si está habilitada, también debes proporcionar un mensaje de uso en la opción `privacy/camera_usage_description`.
fr: Activez si vous avez besoin d'utiliser la caméra, si c'est activé, vous devez également fournir un message d'utilisation dans l'option `privacy/camera_usage_description`.

source: Location
es: Localización
fr: Localisation
pt_br: Localização

source: Enable if you need to use location information from Location Services, if it's enabled you should also provide usage message in the `privacy/location_usage_description` option.
es: Habilita esta opción si necesitas utilizar la información de ubicación de los Servicios de ubicación (Location Services). Si está habilitada, también debes proporcionar un mensaje de uso en la opción `privacy/location_usage_description`.
fr: Activez cette option si vous avez besoin d'utiliser les informations de localisation des services de localisation. Si elle est activée, vous devez également fournir un message d'utilisation dans l'option `privacy/location_usage_description`.
pt_br: Habilite se você precisar usar as informações de localização dos Serviços de Localização, se estiver habilitado, você também deve fornecer a mensagem de uso na opção `privacy/location_usage_description`.

source: Address Book
es: Libro de Direcciones
fr: Carnet d'Adresses
pt_br: Contatos

source: [4]_ Enable to allow access contacts in the user's address book, if it's enabled you should also provide usage message in the `privacy/address_book_usage_description` option.
es: [4]_Habilitar para permitir el acceso a los contactos en la libreta de direcciones del usuario. Si está habilitado, también debes proporcionar un mensaje de uso en la opción `privacy/address_book_usage_description`.
pt_br: [4]_ Habilitar para permitir acessar contatos no livro de endereços do usuário, se ele estiver habilitado, você também deve fornecer a mensagem de uso na opção `privacy/address_book_usage_description`.

source: Calendars
es: Calendarios
fr: Calendrier
pt_br: Calendários

source: [4]_ Enable to allow access to the user's calendar, if it's enabled you should also provide usage message in the `privacy/calendar_usage_description` option.
es: [4]_ Habilitar para permitir el acceso al calendario del usuario, si está habilitado, también debes proporcionar un mensaje de uso en la opción `privacy/calendar_usage_description`.
pt_br: [4]_ Habilite para permitir o acesso ao calendário do usuário, se estiver ativado, você também deverá fornecer a mensagem de uso na opção `privacy/calendar_usage_description`.

source: Photo Library
es: Biblioteca de Fotos
fr: Bibliothèque photos
pt_br: Biblioteca de Fotos

source: [4]_ Enable to allow access to the user's Photos library, if it's enabled you should also provide usage message in the `privacy/photos_library_usage_description` option.
es: [4]_ Habilitar para permitir el acceso a la biblioteca de fotos del usuario. Si está habilitado, también debes proporcionar un mensaje de uso en la opción `privacy/photos_library_usage_description`.

source: Apple Events
es: Eventos de Apple
fr: Événements Apple
pt_br: Eventos Apple

source: [4]_ Enable to allow app to send Apple events to other apps.
es: [4]_ Habilitar para permitir que la aplicación envíe eventos de Apple a otras aplicaciones.
pt_br: [4]_ Habilite para permitir que o aplicativo envie eventos da Apple para outros aplicativos.

source: Debugging
es: Depuración
fr: Débogage
pt_br: Depuração

source: [5]_ You can temporarily enable this entitlement to use native debugger (GDB, LLDB) with the exported app. This entitlement should be disabled for production export.
es: [5]_ Puedes habilitar temporalmente este privilegio para utilizar un depurador nativo (GDB, LLDB) con la aplicación exportada. Este privilegio debería desactivarse para la exportación de producción.

source: The ``Allow JIT Code Execution``, ``Allow Unsigned Executable Memory`` and ``Allow DYLD Environment Variables`` entitlements are always enabled for the Godot Mono exports, and are not visible in the export options.
es: Los privilegios de ``Allow JIT Code Execution``, ``Allow Unsigned Executable Memory`` y ``Allow DYLD Environment Variables`` están siempre habilitados para las exportaciones de Godot Mono y no son visibles en las opciones de exportación.
fr: Les droits ``Autoriser l'exécution de code JIT``, ``Autoriser la mémoire exécutable non signée`` et ``Autoriser les variables d'environnement DYLD`` sont toujours activés pour les exportations Godot Mono et ne sont pas visibles dans les options d'exportation.

source: These features aren't supported by Godot out of the box, enable them only if you are using add-ons which require them.
es: Estas características no son compatibles de forma predeterminada en Godot, así que habilítalas solo si estás utilizando complementos que las requieran.
fr: Ces fonctions ne sont pas prises en charge de base par Godot, ne les activez que si vous utilisez des modules complémentaires qui les nécessitent.

source: To notarize an app, you must disable the ``Debugging`` entitlement.
es: Para notarizar una aplicación, debes desactivar el privilegio ``Debugging``.
fr: Pour authentifier une application, vous devez désactiver le droit ``Debugging``.

source: App Sandbox Entitlement
es: Privilegio de la Caja de Arena de la Aplicación
fr: Certificat de bac à sable (Sandbox)

source: The App Sandbox restricts access to user data, networking and devices. Sandboxed apps can't access most of the file system, can't use custom file dialogs and execute binaries (using ``OS.execute`` and ``OS.create_process``) outside the ``.app`` bundle. See `App Sandbox <https://developer.apple.com/documentation/security/app_sandbox?language=objc>`__ for more info.
es: La "Caja de Arena de la Aplicación" restringe el acceso a los datos del usuario, la red y los dispositivos. Las aplicaciones en un entorno de caja de arena no pueden acceder a la mayoría del sistema de archivos, no pueden utilizar cuadros de diálogo personalizados para archivos y no pueden ejecutar binarios (usando ``OS.execute`` y ``OS.create_process``) fuera del paquete ``.app``. Consulta `App Sandbox <https://developer.apple.com/documentation/security/app_sandbox?language=objc>`__ para obtener más información.
fr: L'App Sandbox restreint l'accès aux données, au réseau et aux périphériques de l'utilisateur. Les apps sandboxées ne peuvent pas accéder à la plupart du système de fichiers, ne peuvent pas utiliser les dialogues de fichiers personnalisés et exécuter des binaires (en utilisant ``OS.execute`` et ``OS.create_process``) en dehors du bundle ``.app``. Voir `App Sandbox <https://developer.apple.com/documentation/security/app_sandbox?language=objc>`__ pour plus d'informations.

source: To distribute an app through the App Store, you must enable the App Sandbox.
es: Para distribuir una aplicación a través de la App Store, debes habilitar la Caja de Arena de la Aplicación (App Sandbox).
fr: Pour distribuer une application via l'App Store, vous devez activer l'App Sandbox.

source: Enabled
es: Activar
fr: Activé
pt_br: Habilitado

source: Enables App Sandbox.
es: Habilita App Sandbox (Caja de arena de la aplicación).
fr: Active l'App Sandbox.

source: Network Server
es: Servidor de Red
fr: Serveur réseau
pt_br: Servidor de Rede

source: Enable to allow app to listen for incoming network connections.
es: Habilitar para permitir que la aplicación escuche conexiones de red entrantes.
fr: Activez cette option pour permettre à l'application d'écouter les connexions réseau entrantes.

source: Network Client
es: Cliente de Red
fr: Client réseau
pt_br: Cliente de Rede

source: Enable to allow app to establish outgoing network connections.
es: Habilitar para permitir que la aplicación establezca conexiones de red salientes.
fr: Activez pour permettre à l'application d'établir des connexions réseau sortantes.

source: Device USB
es: Dispositivo USB
fr: Périphérique USB
pt_br: Dispositivo USB

source: Enable to allow app to interact with USB devices. This entitlement is required to use wired controllers.
es: Habilitar para permitir que la aplicación interactúe con dispositivos USB. Este privilegio es necesario para utilizar controladores con cable.
fr: Activer pour permettre à l'application d'interagir avec les périphériques USB. Ce droit est nécessaire pour utiliser des contrôleurs filaires.

source: Device Bluetooth
es: Dispositivo Bluetooth
fr: Périphérique Bluetooth
pt_br: Bluetooth do Dispositivo

source: Enable to allow app to interact with Bluetooth devices. This entitlement is required to use wireless controllers.
es: Habilitar para permitir que la aplicación interactúe con dispositivos Bluetooth. Este privilegio es necesario para utilizar controladores inalámbricos.
fr: Activer pour permettre à l'application d'interagir avec les périphériques Bluetooth. Ce droit est nécessaire pour utiliser les contrôleurs sans fil.

source: Files Downloads [6]_
es: Descarga de Archivos [6]_

source: Allows read or write access to the user's "Downloads" folder.
es: Permite acceso de lectura o escritura a la carpeta de 'Descargas' del usuario.
fr: Autorise l'accès en lecture et écriture au dossier « Téléchargements » de l'utilisateur.

source: Files Pictures [6]_
es: Archivo de Imágenes [6]_
pt_br: Arquivos de imagens [6]_

source: Allows read or write access to the user's "Pictures" folder.
es: Permite acceso de lectura o escritura a la carpeta de 'Imágenes' del usuario.
fr: Autorise l'accès en lecture et écriture au dossier « Photos » de l'utilisateur.

source: Files Music [6]_
es: Archivos de Música [6]_
pt_br: Arquivos de música [6]_

source: Allows read or write access to the user's "Music" folder.
es: Permite acceso de lectura o escritura a la carpeta de 'Música' del usuario.
fr: Autorise l'accès en lecture et écriture au dossier « Musique » de l'utilisateur.

source: Files Movies [6]_
es: Archivos de Video [6]_
pt_br: Arquivos Filmes [6]_

source: Allows read or write access to the user's "Movies" folder.
es: Permite acceso de lectura o escritura a la carpeta de 'Películas' del usuario.
fr: Autorise l'accès en lecture et écriture au dossier « Films » de l'utilisateur.

source: Files User Selected [6]_
es: Archivos de Usuario Seleccionados [6]_
pt_br: Arquivos selecionados pelo usuário [6]_

source: Allows read or write access to arbitrary folder. To gain access, a folder must be selected from the native file dialog by the user.
es: Permite acceso de lectura o escritura a una carpeta arbitraria. Para obtener acceso, la carpeta debe ser seleccionada por el usuario desde el cuadro de diálogo de archivos nativo.
fr: Permet l'accès en lecture ou en écriture à un dossier arbitraire. Pour obtenir cet accès, l'utilisateur doit sélectionner un dossier dans la boîte de dialogue du fichier natif.

source: Helper Executable
es: Ejecutable Auxiliar

source: List of helper executables to embedded to the app bundle. Sandboxed app are limited to execute only these executable.
es: Lista de ejecutables auxiliares a incrustar en el paquete de la aplicación. Las aplicaciones en un entorno de caja de arena solo pueden ejecutar estos ejecutables.
fr: Liste des exécutables d'aide à intégrer au paquet d'applications. Les applications sandboxées sont limitées à l'exécution de ces exécutables.

source: You can optionally provide usage messages for various folders in the `privacy/*_folder_usage_description` options.
es: Opcionalmente, puedes proporcionar mensajes de uso para varias carpetas en las opciones `privacy/*_folder_usage_description`.
fr: Vous pouvez éventuellement fournir des messages d'utilisation pour divers dossiers dans les options `privacy/*_folder_usage_description`.

source: You can override default entitlements by selecting custom entitlements file, in this case all other entitlement are ignored.
es: Puedes anular los privilegios predeterminados seleccionando un archivo de privilegios personalizado. En este caso, se ignorarán todos los demás privilegios.
fr: Vous pouvez remplacer les droits par défaut en sélectionnant le fichier des droits personnalisés. Dans ce cas, tous les autres droits sont ignorés.

source: Translation status
es: Estado de traducción
fr: État de la traduction
pt_br: Progresso da Tradução

source: Apple Team ID
pt_br: ID Apple Team
