Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_linux.po
Languages: de

source: Exporting for Linux
de: Exportieren für Linux

source: This page describes how to export a Godot project to Linux. If you're looking to compile editor or export template binaries from source instead, read :ref:`doc_compiling_for_linuxbsd`.
de: Diese Seite beschreibt, wie man ein Godot-Projekt nach Linux exportiert. Wenn Sie stattdessen Editor- oder Exportvorlagen-Binärdateien aus den Quellen kompilieren möchten, lesen Sie :ref:`doc_compiling_for_linuxbsd`.

source: The simplest way to distribute a game for PC is to copy the executable (``godot``), compress the folder and send it to someone else. However, this is often not desired.
de: Der einfachste Weg, ein Spiel für PC zu veröffentlichen, ist, die ausführbare Datei (``godot``) zu kopieren, den Ordner zu komprimieren und an jemand anderen zu schicken. Dies ist jedoch oft nicht erwünscht.

source: Godot offers a more elegant approach for PC distribution when using the export system. When exporting for Linux, the exporter takes all the project files and creates a ``data.pck`` file. This file is bundled with a specially optimized binary that is smaller, faster and does not contain the editor and debugger.
de: Godot bietet einen eleganteren Ansatz für die PC-Veröffentlichung, wenn das Exportsystem verwendet wird. Beim Export für Linux nimmt der Exporter alle Projektdateien und erstellt eine ``data.pck``-Datei. Diese Datei wird mit einer speziell optimierten Binärdatei gebündelt, die kleiner und schneller ist und nicht den Editor und Debugger enthält.

source: Environment variables
de: Umgebungsvariablen

source: You can use the following environment variables to set export options outside of the editor. During the export process, these override the values that you set in the export menu.
de: Sie können die folgenden Umgebungsvariablen verwenden, um Exportoptionen außerhalb des Editors festzulegen. Während des Exportvorgangs überschreiben diese die Werte, die Sie im Exportmenü festgelegt haben.

source: Linux export environment variables
de: Umgebungsvariablen für Linux-Export

source: Environment variable
de: Umgebungsvariable

source: Encryption / Encryption Key
de: Verschlüsselung / Verschlüsselungsschlüssel

source: Translation status
de: Übersetzungsstatus
