Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_uwp.po
Languages: de, es, fr, pt_br, ru, zh_tw

source: Exporting for Universal Windows Platform
de: Exportieren für die universelle Windows-Plattform
es: Exportación para Windows Universal Platform
fr: Exportation pour la plateforme Windows universelle (UWP)
pt_br: Exportando para a Plataforma Universal do Windows
ru: Экспорт для универсальной платформы Windows
zh_tw: 為通用 Windows 平台(UWP) 匯出

source: This page describes how to export a Godot project to UWP. If you're looking to compile export template binaries from source instead, read :ref:`doc_compiling_for_uwp`.
es: Esta página describe cómo exportar un proyecto de Godot a UWP (Plataforma Universal de Windows). Si estás buscando compilar las plantillas de exportación desde el código fuente, lee :ref:`doc_compiling_for_uwp`.
fr: Cette page explique comment exporter un projet Godot vers UWP. Si vous cherchez à exporter les binaires des modèles depuis le code source, voyez plutôt :ref:`doc_compiling_for_uwp`.

source: There's no extra requirement to export an ``.appx`` package that can be installed as a Windows App or submitted to the Windows Store. Exporting UWP packages also works from any platform, not only from Windows.
de: Es gibt keine zusätzliche Anforderung, ein ``.appx`` Paket zu exportieren, das als Windows-Anwendung installiert oder an den Windows-Store übermittelt werden kann. Der Export von UWP-Paketen funktioniert auch von jeder Plattform aus, nicht nur von Windows aus.
es: No hay ningún requisito adicional para exportar un paquete ``.appx`` que pueda instalarse como una aplicación de Windows o enviarse a la tienda de Windows. La exportación de paquetes UWP también funciona desde cualquier plataforma, no sólo desde Windows.
fr: Il n'y a pas d'exigence supplémentaire pour exporter un paquet ``.appx`` qui peut être installé en tant qu'application Windows ou soumis au magasin Windows. L'exportation de paquets UWP fonctionne également à partir de n'importe quelle plateforme, pas seulement à partir de Windows.
pt_br: Não há nenhum requisito extra para exportar um pacote ``.appx`` que pode ser instalado como um aplicativo do Windows ou enviado para a Loja do Windows. A exportação de pacotes UWP também funciona a partir de qualquer plataforma, não apenas do Windows.
ru: Нет никаких дополнительных требований для экспорта пакета ``.appx``, который можно установить как приложение Windows или отправить в Магазин Windows. Экспорт пакетов UWP также работает с любой платформы, а не только из Windows.
zh_tw: 要匯出能作為 Windows 應用程式安裝或送到 Windows 市集上的 ``.appx`` 套件沒有額外的需求。匯出的 UWP 套件也可以在任何平台上使用，不僅限於 Windows。

source: However, if you want to install and run the app, you need to sign it with a trusted signature. Godot supports automatic signing of packages with external tools.
de: Wenn Sie die Anwendung jedoch installieren und ausführen möchten, müssen Sie sie mit einer vertrauenswürdigen Signatur signieren. Godot unterstützt das automatische Signieren von Paketen mit externen Werkzeugen.
es: Sin embargo, si quieres instalar y ejecutar la aplicación, debes firmarla con una firma de seguridad. Godot soporta la firma automática de paquetes con herramientas externas.
fr: Cependant, si vous voulez installer et exécuter l'application, vous devez la signer avec une signature de confiance. Godot supporte la signature de paquets, avec des outils externes.
pt_br: No entanto, se você quiser instalar e executar o aplicativo, você precisa assiná-lo com uma assinatura confiável. Atualmente, o Godot não suporta a assinatura de pacotes, então você precisa usar ferramentas externas para fazer isso.
ru: Однако, если вы хотите установить и запустить приложение, вам необходимо подписать его доверенной подписью. Godot поддерживает автоматическое подписание пакетов с помощью внешних инструментов.
zh_tw: 但，若要安裝或執行應用程式，則必須使用信任的簽章來簽署套件。Godot 支援以外部工具來自動簽署套件。

source: Also, make sure the Publisher Name you set when exporting the package matches the name used on the certificate.
de: Stellen Sie außerdem sicher, dass der Publishername, den Sie beim Exportieren des Pakets festlegen, mit dem im Zertifikat verwendeten Namen übereinstimmt.
es: Además, asegúrate de que el Nombre del Publisher que configuraste al exportar el paquete coincide con el nombre utilizado en el certificado.
fr: Assurez-vous également que le nom de l'éditeur que vous avez défini lors de l'exportation du paquet correspond au nom utilisé sur le certificat.
pt_br: Além disso, certifique-se de que o Nome de Publicador que você definiu ao exportar o pacote corresponde ao nome usado no certificado.
ru: Также убедитесь, что имя издателя, которое вы установили при экспорте пакета, совпадает с именем, используемым в сертификате.
zh_tw: 另外，也請確保匯出套件時的 Publisher Name (發行者名稱) 與憑證中使用的名稱相同。

source: Limitations on Xbox One
de: Einschränkungen für Xbox One
es: Limitaciones en Xbox One
fr: Limitations sur Xbox One
pt_br: Limitações no Xbox One
ru: Ограничения на Xbox One
zh_tw: Xbox One 的限制

source: As described in the `UWP documentation <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__:
de: Wie in der `UWP-Dokumentation <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__ beschrieben:
es: Como se describe en la `documentación UWP <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__:
fr: Comme décrit dans la `documentation d'UWP <https://docs.microsoft.com/fr-fr/windows/uwp/xbox-apps/system-resource-allocation>`__ :
pt_br: Como descrito na `documentação do UWP <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__:
ru: Как описано в `документации UWP <https://docs.microsoft.com/en-us/windows/uwp/xbox-apps/system-resource-allocation>`__:
zh_tw: 與 `UWP 文件 <https://docs.microsoft.com/zh-tw/windows/uwp/xbox-apps/system-resource-allocation>`__ 中說明的一樣：

source: Submitted as an "App"
de: Eingereicht als "App"
es: Enviado como una "App"
fr: Soumis en tant qu'"Application"
pt_br: Enviado como um "App"
ru: Submitted as an "App" (отправлено как приложение)
zh_tw: 作為「App」提交

source: available memory is 1GB
de: der verfügbare Speicher beträgt 1 GB
es: la memoria disponible es de 1 GB
fr: la mémoire disponible est de 1 Go
pt_br: memória disponível é de 1GB
ru: доступная память 1GB
zh_tw: 可用記憶體為 1GB

source: share of 2-4 CPU cores
de: Teilen von 2-4 CPU-Kernen
es: compartir de 2-4 núcleos de CPU
fr: partage de 2-4 cœurs CPU
pt_br: compartilhamento de 2-4 núcleos de CPU
ru: доля 2-4 ядер процессора
zh_tw: 共用 2 至 4 個 CPU 核心

source: shared access of GPU power (45%)
de: gemeinsamer Zugriff auf GPU-Leistung (45%)
es: acceso compartido a la potencia de la GPU (45%)
fr: accès partagé à la puissance du GPU (45%)
pt_br: acesso compartilhado de energia da GPU (45%)
ru: общий доступ к мощности GPU (45%)
zh_tw: 共享 GPU 能力的存取 (45%)

source: Submitted as a "Game" (through `Xbox Live Creators Program <https://www.xbox.com/en-US/developers/creators-program>`__)
de: Eingereicht als "Game" (über das `Xbox Live Creators Program <https://www.xbox.com/en-US/developers/creators-program>`__)
es: Enviado como un "Juego" (a través del `Programa de Creadores de Xbox Live <https://www.xbox.com/en-US/developers/creators-program>`__)
fr: Soumis en tant que "Jeu" (par l'intermédiaire du `Xbox Live Creators Program <https://www.xbox.com/en-US/developers/creators-program>`__)
pt_br: Enviado como um "Jogo" (através do `Programa de Criadores do Xbox Live <https://www.xbox.com/pt-BR/developers/creators-program>`__)
ru: Отправлено как "Game" (через `Xbox Live Creators Program <https://www.xbox.com/en-US/developers/creators-program>`__)
zh_tw: 作為「遊戲」提交 (通過 `Xbox Live 創作者計劃 <https://www.xbox.com/zh-tw/developers/creators-program>`__ )

source: available memory is 5GB
de: der verfügbare Speicher beträgt 5 GB
es: la memoria disponible es de 5 GB
fr: la mémoire disponible est de 5 Go
pt_br: memória disponível é de 5GB
ru: доступная память 5GB
zh_tw: 可用記憶體為 5GB

source: 4 exclusive CPU cores and 2 shared CPU cores
de: 4 exklusive CPU-Kerne und 2 gemeinsam genutzte CPU-Kerne
es: 4 núcleos de CPU exclusivos y 2 núcleos de CPU compartidos
fr: 4 cœurs CPU exclusifs et 2 cœurs CPU partagés
pt_br: 4 núcleos de CPU exclusivos e 2 núcleos de CPU compartilhados
ru: 4 эксклюзивных ядра ЦП и 2 общих ядра ЦП
zh_tw: 4 個專屬 CPU 核心與 2 個共用 CPU 核心

source: exclusive access to GPU power (100%)
de: exklusiver Zugang zu GPU-Leistung (100%)
es: acceso exclusivo a la potencia de la GPU (100%)
fr: accès exclusif à la puissance du GPU (100%)
pt_br: acesso exclusivo à energia da GPU (100%)
ru: эксклюзивный доступ к мощности GPU (100%)
zh_tw: 獨佔存取 GPU 能力 (100%)

source: Exceeding these memory limitations will cause allocation failures and the application will crash.
de: Das Überschreiten dieser Speicherbeschränkungen führt zu Zuweisungsfehlern und zum Absturz der Anwendung.
es: Si se superan estas limitaciones de memoria, se producirán fallos de asignación y la aplicación se bloqueará.
fr: Le dépassement de ces limites de mémoire entraînera des échecs d'allocation et l'application plantera.
pt_br: Exceder estas limitações de memória irá causar falhas de alocação e o aplicativo irá crashar.
ru: Превышение этих ограничений памяти приведет к сбоям выделения и аварийному завершению работы приложения.
zh_tw: 超過記憶體限制會導致配置失敗，並造成應用程式當機。

source: Creating a signing certificate
de: Erstellen eines Signatur-Zertifikats
es: Creación de un certificado de firma
fr: Création d'un certificat de signature
pt_br: Criando um certificado de assinatura
ru: Создание сертификата подписи
zh_tw: 建立簽署憑證

source: This requires the ``MakeCert.exe`` and ``Pvk2Pfx.exe`` tools, which come with the Windows SDK. If you use Visual Studio, you can open one of its Developer Prompts, since it comes with these tools and they can be located in the path.
de: Dies erfordert die Tools ``MakeCert.exe`` und ``Pvk2Pfx.exe``, die mit dem Windows SDK geliefert werden. Wenn Sie Visual Studio verwenden, können Sie eine der zugehörigen Entwickler-Eingabeaufforderungen öffnen, da diese Tools im Lieferumfang enthalten sind und sich im Pfad befinden.
es: Esto requiere las herramientas ``MakeCert.exe`` y ``Pvk2Pfx.exe``, que vienen con el SDK de Windows. Si usas Visual Studio, puedes abrir uno de sus Developer Prompts, ya que viene con estas herramientas y pueden estar ubicadas en la ruta.
fr: Cela nécessite les outils ``MakeCert.exe`` et ``Pvk2Pfx.exe``, qui sont fournis avec le SDK de Windows. Si vous utilisez Visual Studio, vous pouvez ouvrir l'une de ses invites de développement, puisqu'elle est livrée avec ces outils et qu'ils peuvent être situés dans le chemin d'accès.
pt_br: Isso requer as ferramentas ``MakeCert.exe`` e ``Pvk2Pfx.exe``, que vêm com o Windows SDK. Se você usa Visual Studio, você pode abrir um de seus Developer Prompts, pois ele vem com essas ferramentas e elas podem ser localizadas no caminho.
ru: Для этого требуются инструменты ``MakeCert.exe`` и ``Pvk2Pfx.exe``, которые поставляются с Windows SDK. Если вы используете Visual Studio, вы можете открыть одну из ее подсказок разработчика, поскольку она поставляется с этими инструментами, и они могут быть расположены в пути.
zh_tw: 本步驟必須要有 Windows SDK 中附帶的 ``MakeCert.exe`` 與 ``Pvk2Pfx.exe`` 工具。若使用 Visual Studio，則可以打開其中一個「開發人員命令提示字元」，因為提示字元有附帶這些工具，且放在提示字元的路徑中。

source: You can get more detailed instructions from `Microsoft's documentation <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__.
de: Ausführlichere Anweisungen können Sie der `Microsoft Dokumentation <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__ entnehmen.
es: Puedes obtener instrucciones más detalladas en `Microsoft's documentation <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__.
fr: Vous pouvez obtenir des instructions plus détaillées à partir de `Microsoft's documentation <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__.
pt_br: Você pode obter instruções mais detalhadas na `documentação da Microsoft <https://msdn.microsoft.com/pt-br/library/windows/desktop/jj835832(v=vs.85).aspx>`__.
ru: Вы можете получить более подробные инструкции в `документации Microsoft <https://msdn.microsoft.com/en-us/library/windows/desktop/jj835832(v=vs.85).aspx>`__.
zh_tw: 詳細的步驟可以參考 `Microsoft 的文件 (英文) <https://msdn.microsoft.com/zh-tw/library/windows/desktop/jj835832(v=vs.85).aspx>`__ 。

source: First, run ``MakeCert`` to create a private key::
de: Führen Sie zunächst ``MakeCert`` aus, um einen privaten Schlüssel zu erzeugen:
es: Primero, ejecuta ``MakeCert`` para crear una clave privada:
fr: Premièrement, lancez ``MakeCert`` pour créer une clé privée :
pt_br: Primeiro, execute o ``MakeCert`` para criar uma chave privada::
ru: Сначала запустите``MakeCert``, чтобы создать закрытый ключ:
zh_tw: 首先，請執行 ``MakeCert`` 以建立私鑰：

source: Where ``publisherName`` matches the Publisher Name of your package and ``expirationDate`` is in the ``mm/dd/yyyy`` format.
de: Wobei ``publisherName`` mit dem Publishernamen Ihres Pakets übereinstimmt und ``expirationDate`` im Format ``mm/dd/yyyy`` ist.
es: Donde dice ``publisherName`` coincide con el nombre del editor de su paquete y ``expirationDate`` está en el formato ``mm/dd/yyyy``.
fr: Où ``publisherName`` correspond au nom de l'éditeur (entreprise ou individu) de votre paquet et où ``expirationDate`` est dans le format ``mm/jj/aaaa``.
pt_br: Onde ``publisherName`` corresponde ao Nome de Publicador do seu pacote e ``expirationDate`` está no formato ``mm/dd/aaaa``.
ru: Где ``publisherName`` совпадает с именем издателя вашего пакета, а ``expirationDate``имеет формат ``mm/dd/yyyy``.
zh_tw: 其中 ``publisherName`` 必須與套件中的 Publisher Name (發佈者名稱) 相同，而 ``expirationDate`` 為 ``mm/dd/yyyy`` 格式。

source: Next, create a Personal Information Exchange (.pfx) file using ``Pvk2Pfx.exe``::
de: Als nächstes erstelle eine Personal Information Exchange (.pfx)-Datei (.pfx) mit ``Pvk2Pfx.exe``:
es: A continuación, crea un archivo de Intercambio de Información Personal (.pfx) usando ``Pvk2Pfx.exe``:
fr: Ensuite, créez un fichier d'échange de renseignements personnels (.pfx) en utilisant ``Pvk2Pfx.exe`` :
pt_br: Em seguida, crie um arquivo de Troca de Informações Pessoais (.pfx) usando ``Pvk2Pfx.exe``::
ru: Затем, создайте файл обмена личной информацией (.pfx), используя ``Pvk2Pfx.exe``::
zh_tw: 接著，通過 ``Pvk2Pfx.exe`` 來建立個人資訊交換檔 (.pfs)：

source: If you don't specify a password with ``/po`` argument, the PFX will have the same password as the private key.
de: Wenn Sie kein Passwort mit dem Argument ``/po`` angeben, hat der PFX das gleiche Passwort wie der private Schlüssel.
es: Si no se especifica una contraseña con el argumento ``/po``, el PFX tendrá la misma contraseña que la clave privada.
fr: Si vous ne spécifiez pas de mot de passe avec l'argument ``/po``, le PFX aura le même mot de passe que la clé privée.
pt_br: Se você não especificar uma senha com o argumento ``/po``, o PFX terá a mesma senha da chave privada.
ru: Если вы не укажете пароль с аргументом ``/po``, PFX будет иметь тот же пароль, что и закрытый ключ.
zh_tw: 若未以 ``/po`` 引數來指定密碼，則 PFX 會使用與與私鑰相同的密碼。

source: You will also need to trust this certificate in order to be able to install your app. Open the Command Prompt as Administrator and run the following command::
de: Sie müssen diesem Zertifikat ebenfalls vertrauen, um Ihre Anwendung installieren zu können. Öffnen Sie die Eingabeaufforderung als Administrator und führen Sie den folgenden Befehl aus:
es: También tendrás que confiar en este certificado para poder instalar tu aplicación. Abre el Símbolo del sistema como Administrador y ejecuta el siguiente comando:
fr: Vous devrez également faire confiance à ce certificat afin de pouvoir installer votre application. Ouvrez l'invite de commandes en tant qu'administrateur et exécutez la commande suivante :
pt_br: Você também precisará confiar neste certificado para poder instalar seu aplicativo. Abra o Prompt de Comando como Administrador e execute o seguinte comando::
ru: Вам также нужно будет доверять этому сертификату, чтобы иметь возможность установить свое приложение. Откройте командную строку от имени администратора и выполните следующую команду:
zh_tw: 此外，也必須信任該憑證才可安裝應用程式。以管理員身份執行 [命令提示字元]，並執行下列指令：

source: Setting up automatic signing
de: Automatische Signatur einrichten
es: Configurando la firma automática
fr: Mettre en place la signature automatique
pt_br: Configurando a assinatura automática
ru: Установка автоматического подписывания
zh_tw: 設定自動簽署

source: To setup automatic signing on export you need to go to Editor Settings > Export > Uwp. From there you need to click on the folder for ``Signtool``, and navigate to the ``SignTool.exe`` file on your computer.
de: Um die automatische Signierung beim Export einzurichten, müssen Sie zu Editoreinstellungen > Export > Uwp gehen. Von dort aus müssen Sie auf den Ordner für ``Signtool`` klicken und zu der Datei ``SignTool.exe`` auf Ihrem Computer navigieren.
es: Para configurar la firma automática al exportar deberás ir a Configuración del editor > Export > Uwp. Allí deberás hacer clic en la carpeta para ``Signtool`` y navegar hasta el archivo ``SignTool.exe`` en tu computadora.
fr: Pour configurer la signature automatique à l'exportation, vous devez aller dans les Editor Settings > Export > Uwp. De là, vous devez cliquer sur le dossier ``Signtool``, et naviguer jusqu'au fichier ``SignTool.exe`` sur votre ordinateur.
pt_br: Para configurar a assinatura automática na exportação, você precisa ir para Configurações do Editor > Exportar > Uwp. A partir daí, você precisa clicar na pasta para ``Signtool`` e navegar até o arquivo ``SignTool.exe`` em seu computador.
ru: Чтобы настроить автоматическое подписание при экспорте, вам нужно перейти в Editor Settings > Export > Uwp (Настройки редактора>Экспорт>Uwp). Оттуда вам нужно щёлкнуть папку для ``Signtool`` и перейти к файлу ``SignTool.exe`` на вашем компьютере.
zh_tw: 要設定匯出時自動簽署，請前往 [編輯器設定] > [Export] > [Uwp]。在此處請點擊 ``Signtool`` 的資料夾，並選擇電腦中的 ``SignTool.exe`` 檔案。

source: After setting that up close the editor settings, go to Project > Export, and select the UWP preset. Under the ``Signing`` options click on the folder next to ``Certificate`` and go to the certificate file. Then enter the pfxPassword in the password field.
de: Nachdem Sie dies eingerichtet haben, schließen Sie die Editoreinstellungen, gehen zu Projekt > Exportieren und wählen die UWP-Voreinstellung. Unter den Optionen ``Signing`` klicken Sie auf den Ordner neben ``Certificate`` und gehen zu der Zertifikatsdatei. Geben Sie dann das pfxPassword in das Passwortfeld ein.
es: Después de configurar eso, cierra los ajustes del editor, ve a Proyecto > Exportar, y selecciona el preset UWP. Dentro de opciones de ``Signing`` haz clic en la carpeta junto a ``Certificate`` y ve hasta el archivo de certificado. Luego entra el pfxPassword en el campo password.
fr: Après avoir configuré cela, fermez les paramètres de l'éditeur, allez à Project > Export, et sélectionnez le préréglage UWP. Sous les options ``Signing``, cliquez sur le dossier à côté de ``Certificate`` et allez au fichier de certificat. Ensuite, entrez le pfxPassword dans le champ du mot de passe.
pt_br: Depois de definir isso, feche as configurações do editor, vá para Projeto > Exportar e selecione a predefinição UWP. Nas opções de ``Signing``, clique na pasta ao lado de ``Certificate`` e vá para o arquivo do certificado. Em seguida, insira a pfxPassword no campo de senha.
ru: После настройки закройте настройки редактора, перейдите в Project > Export (Проект > Экспорт) и выберите предустановку UWP. В параметрах ``Signing`` (Подписание) щёлкните папку рядом с ``Certificate`` (Сертификат) и перейдите к файлу сертификата. Затем введите *pfxPassword* в поле пароля.
zh_tw: 設定完成後請關閉編輯器設定，並前往 [專案] > [匯出]，接著選擇 UWP 預設設定。在 ``Signine`` 選項下，點擊 ``Certificate`` 旁的資料夾，並選擇憑證檔。接著在密碼欄位中輸入 pfsPassword。

source: Your project will now be automatically signed on export.
de: Ihr Projekt wird nun beim Export automatisch signiert.
es: Ahora tu proyecto se firmará automáticamente al exportar.
fr: Votre projet sera désormais automatiquement signé à l'exportation.
pt_br: Seu projeto agora será assinado automaticamente na exportação.
ru: Теперь ваш проект будет автоматически подписан при экспорте.
zh_tw: 接著專案應該會在匯出時自動簽署了。

source: If you want to sign an exported app manually run ``SignTool.exe`` and use the following command.
de: Wenn Sie eine exportierte Anwendung manuell signieren möchten, führen Sie ``SignTool.exe`` aus und verwenden den folgenden Befehl.
es: Si quieres firmar una aplicación exportada manualmente, ejecuta ``SignTool.exe`` y usa el siguiente comando.
fr: Si vous voulez signer une application exportée manuellement, lancez ``SignTool.exe`` et utilisez la commande suivante.
pt_br: Se você deseja assinar um aplicativo exportado manualmente, execute ``SignTool.exe`` e use o seguinte comando.
ru: Если вы хотите подписать экспортированное приложение вручную, запустите ``SignTool.exe`` и используйте следующую команду.
zh_tw: 若想手動以 ``SignTool.exe`` 簽署匯出的應用程式，請執行下列指令。

source: Installing the package
de: Paket installieren
es: Instalando el paquete
fr: Installation du paquetage
pt_br: Instalando o pacote
ru: Установка пакета
zh_tw: 安裝套件

source: As of the Windows 10 Anniversary Update, you are able to install packages simply by double clicking the ``.appx`` file from Windows Explorer.
de: Ab dem Windows 10 Anniversary Update können Sie Pakete installieren, indem Sie einfach im Windows Explorer auf die Datei ``.appx`` doppelklicken.
es: A partir de la Actualización Windows 10 Anniversary, es posible instalar paquetes simplemente haciendo doble clic en el archivo ``.appx`` desde el Explorador de Windows.
fr: A partir de la mise à jour anniversaire de Windows 10, vous pouvez installer des paquets simplement en double-cliquant sur le fichier ``.appx`` à partir de l'Explorateur Windows.
pt_br: No caso do Windows 10 Anniversary Update, você é capaz de instalar pacotes simplesmente dando dois cliques no arquivo ``.appx`` do Windows Explorer.
ru: Начиная с обновления Windows 10 Anniversary Update, вы можете устанавливать пакеты, просто дважды щелкнув по файлу ``.appx`` из проводника Windows.
zh_tw: 自 Windows 10 年度更新版起，只需要在 Windows 檔案總管點兩下 ``.appx`` 檔案即可安裝套件。

source: It's also possible to install by using the ``Add-AppxPackage`` PowerShell cmdlet.
de: Die Installation kann auch mit dem PowerShell-Cmdlet ``Add-AppxPackage`` durchgeführt werden.
es: También es posible instalarlo usando el cmdlet de PowerShell ``Add-AppxPackage``.
fr: Il est également possible de l'installer en utilisant la commande raccourcie PowerShell ``Add-AppxPackage``.
pt_br: Também é possível instalar usando o cmdlet ``Add-AppxPackage`` do PowerShell.
ru: Также можно установить с помощью командлета PowerShell ``Add-AppxPackage``.
zh_tw: 另外，也可以使用 ``Add-AppxPackage`` PowerShell cmdlet 來安裝套件。
