Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_macos.po
Languages: es, fr, pt_br

source: Exporting for macOS
es: Exportando para macOS
fr: Exportation de macOS
pt_br: Exportando para macOS

source: This page describes how to export a Godot project to macOS. If you're looking to compile editor or export template binaries from source instead, read :ref:`doc_compiling_for_osx`.
es: Esta página describe cómo exportar un proyecto de Godot a macOS. Si estás buscando compilar binarios del editor o plantillas de exportación desde el código fuente, lee :ref:`doc_compiling_for_osx`.
fr: Cette page explique comment exporter un projet Godot vers macOS. Si vous cherchez à compiler l’éditeur ou les binaires du modèle d'exportation depuis le code source, voyez plutôt :ref:`doc_compiling_for_osx`.

source: macOS apps are exported as an ``.app`` bundle, a folder with a specific structure which stores the executable, libraries and all the project files. This bundle can be exported as is, packed in a ZIP archive or DMG disk image (only supported when exporting from a computer running macOS).
es: Las aplicaciones de macOS se exportan como un paquete ``.app``, que es una carpeta con una estructura específica que almacena el ejecutable, las bibliotecas y todos los archivos del proyecto. Este paquete se puede exportar tal cual, empaquetado en un archivo ZIP o imagen de disco DMG (solo compatible al exportar desde una computadora que ejecuta macOS).
pt_br: os aplicativos do macOS são exportados como um pacote ``.app``, uma pasta com uma estrutura específica que armazena o executável, bibliotecas e todos os arquivos do projeto. Este pacote pode ser exportado como é, embalado em um arquivo ZIP ou imagem de disco DMG (somente suportado ao exportar de um computador executando o macOS).

source: Requirements
es: Requerimientos
fr: Pré-requis
pt_br: Requisitos

source: To enable code signing with Apple Developer ID and notarization, you must export from a computer running macOS with Xcode command line tools installed.
es: Para habilitar la firma de código con Apple Developer ID y la notarización, debes exportar desde una computadora que ejecute macOS con las herramientas de línea de comandos de Xcode instaladas.
pt_br: Para habilitar a assinatura do código com o ID do Desenvolvedor Apple e a autenticação, você deve exportar de um computador rodando MacOS com as ferramentas de linha de comando Xcode instaladas.

source: Ad-hoc code signing is supported on all platforms, without additional tools.
es: La firma de código ad-hoc es compatible en todas las plataformas sin necesidad de herramientas adicionales.
fr: La signature de code ad hoc est prise en charge sur toutes les plateformes, sans outils supplémentaires.
pt_br: A assinatura de código ad-hoc é suportada em todas as plataformas, sem ferramentas adicionais.

source: Download the Godot export templates. Use the Godot menu: ``Editor > Manage Export Templates``.
es: Descarga las plantillas de exportación de Godot. Usa el menu de Godot: ``Editor > Manage Export Templates``.
fr: Téléchargez les modèles d'exportation Godot. Utilisez le menu Godot : ``Editor > Manage Export Templates``.
pt_br: Baixe os modelos de exportação Godot. Use o menu Godot: ``Editor > Gerenciar modelos de exportação``.

source: A valid and unique ``Bundle identifier`` should be set in the ``Application`` section of the export options.
es: Se debe establecer un ``identificador de paquete`` válido y único en la sección ``Application`` de las opciones de exportación.
fr: Un ``Bundle identifier`` valide et unique doit être défini dans la section ``Application`` des options d'exportation.

source: Projects exported without code signing and notarization will be blocked by Gatekeeper if they are downloaded from unknown sources, see the :ref:`Running Godot apps on macOS <doc_running_on_macos>` page for more information.
es: Los proyectos exportados sin firma de código y notarización serán bloqueados por Gatekeeper si se descargan desde fuentes desconocidas. Consulta la página :ref:`Running Godot apps on macOS <doc_running_on_macos>` para obtener más información.
fr: Les projets exportés sans signature de code et sans notarisation seront bloqués par Gatekeeper s'ils sont téléchargés à partir de sources inconnues, voir la page :ref:`Running Godot apps on macOS <doc_running_on_macos>` pour plus d'informations.

source: Code signing and notarization
es: Firma de código y notarización
fr: Signature et notarisation du code
pt_br: Assinatura de código e notarização

source: By default, macOS will run only applications that are signed and notarized. If you use any other signing configuration, see :ref:`Running Godot apps on macOS <doc_running_on_macos>` for workarounds.
es: De forma predeterminada, macOS solo ejecutará aplicaciones que estén firmadas y notarizadas. Si utilizas alguna otra configuración de firma, consulta :ref:`Running Godot apps on macOS <doc_running_on_macos>` para conocer soluciones alternativas.

source: To notarize an app, you **must** have a valid `Apple Developer ID Certificate <https://developer.apple.com/>`__.
es: Para notarizar una aplicación, **debes** tener un certificado válido de `Apple Developer ID <https://developer.apple.com/>`__.
pt_br: Para autenticar um aplicativo, você **deve** ter um `Certificado de identificação de desenvolvedor da Apple <https://developer.apple.com/>`__ válido.

source: If you have an Apple Developer ID Certificate
es: Si tienes un certificado válido de Apple Developer ID
fr: Si vous avez un Apple Developer ID Certificate
pt_br: Se você tiver um certificado de ID de desenvolvedor da Apple

source: Export your project from a computer running macOS with Xcode command line tools installed.
es: Exporta tu proyecto desde una computadora que ejecute macOS y tenga instaladas las herramientas de línea de comandos de Xcode.
pt_br: Exporte seu projeto de um computador rodando MacOS com as ferramentas de linha de comando Xcode instaladas.

source: Enable ``Code Signing``, ``Notarization``, ``Hardened Runtime`` and ``Timestamp`` and disable the ``Debug`` entitlement.
es: Habilita la ``Firma de código`` (Code Signing), la ``Notarización`` (Notarization), el ``Entorno de ejecución reforzado`` (Hardened Runtime) y la ``Marca de tiempo`` (Timestamp), y deshabilita el permiso de ``Depuración`` (Debug).
fr: Activez ``Code Signing``, ``Notarization``, ``Hardened Runtime`` et ``Timestamp`` et désactiver le droit ``Debug``.

source: Provide valid Apple ID credentials and certificate identity.
es: Proporciona las credenciales válidas de tu Apple ID y la identidad del certificado.
fr: Fournissez des informations d'identification Apple ID et une identité de certificat valides.
pt_br: Forneça credenciais de ID Apple válidas e identidade de certificado.

source: If ``Notarization`` is enabled, Godot will automatically upload the exported project for notarization.
es: Si la opción de ``Notarización`` está habilitada, Godot subirá automáticamente el proyecto exportado para su notarización.
fr: Si ``Notarization`` est activé, Godot téléchargera automatiquement le projet exporté pour la notarisation.
pt_br: Se ``Notarization`` estiver ativado, o Godot carregará automaticamente o projeto exportado para notarização.

source: You can use the ``xcrun notarytool history`` command to check notarization status and use the ``xcrun notarytool log {ID}`` command to download the notarization log.
es: Puedes utilizar el comando ``xcrun notarytool history`` para verificar el estado de la notarización y el comando ``xcrun notarytool log {ID}`` para descargar el registro de notarización.
fr: Vous pouvez utiliser la commande ``xcrun notarytool history`` pour vérifier l'état de la notarisation et utiliser la commande ``xcrun notarytool log {ID}`` pour télécharger le journal de notarisation.
pt_br: Você pode usar o comando ``xcrun notarytool history`` para verificar o status da notarização e usar o comando ``xcrun notarytool log {ID}`` para baixar o log de notarização .

source: If you encounter notarization issues, see `Resolving common notarization issues <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/resolving_common_notarization_issues>`__ for more info.
es: Si encuentras problemas de notarización, consulta `Resolución de problemas comunes de notarización <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/resolving_common_notarization_issues>`__ para obtener más información.
fr: Si vous rencontrez des problèmes de notarisation, consultez `Résolution des problèmes courants de notarisation <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/resolving_common_notarization_issues>`__ pour plus d'informations.
pt_br: Se você encontrar problemas de notarização, consulte `Resolvendo problemas comuns de notarização <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/reresolution_common_notarization_issues>`__ para obter mais informações.

source: After notarization is completed, `staple the ticket <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/customizing_the_notarization_workflow>`__ to the exported project.
es: Después de que se haya completado la notarización, "grapa el ticket" (staple the ticket) al proyecto exportado. Puedes encontrar más información sobre cómo hacerlo en `Agregando el ticket de notarización a tu proyecto exportado <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/customizing_the_notarization_workflow>`__.
fr: Une fois la notarisation terminée, `attachez le ticket <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/customizing_the_notarization_workflow>`__ au projet exporté.
pt_br: Após a conclusão da notarização, `apresente o ticket <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution/customizing_the_notarization_workflow>`__ no projeto exportado.

source: If you do not have an Apple Developer ID Certificate
es: Si no tienes un certificado de Apple Developer ID
fr: Si vous ne disposez pas d'un Apple Developer ID Certificate
pt_br: Se você não tiver um certificado de ID de desenvolvedor da Apple

source: Keep ``Code Signing`` enabled and leave the ``Identity`` option empty (when exporting from a computer running macOS, on other platforms this option is hidden). In this case Godot will use a ad-hoc signature, which will make running an exported app easier for the end users, see the :ref:`Running Godot apps on macOS <doc_running_on_macos>` page for more information.
es: Mantén habilitada la opción de ``Firma de código`` (Code Signing) y deja vacía la opción de ``Identidad`` (cuando se exporta desde una computadora que ejecuta macOS, en otras plataformas esta opción está oculta). En este caso, Godot utilizará una firma ad-hoc, lo que facilitará la ejecución de la aplicación exportada para los usuarios finales. Consulta la página :ref:`Running Godot apps on macOS <doc_running_on_macos>` para obtener más información.
pt_br: Mantenha ``Code Signing`` habilitado e deixe a opção ``Identity`` vazia (ao exportar de um computador rodando macOS, em outras plataformas esta opção fica oculta). Nesse caso, Godot usará uma assinatura ad-hoc, que facilitará a execução de um aplicativo exportado para os usuários finais, consulte a página :ref:`Executando aplicativos Godot no macOS <doc_running_on_macos>` para obter mais informações.

source: Signing Options
es: Opciones de firmado
fr: Options de signature
pt_br: Opções de Assinatura

source: Option
es: Opcion
pt_br: Opção

source: Description
es: Descripción
pt_br: Descrição

source: Enable
es: Activar
fr: Activer
pt_br: Habilitar

source: Enables code signing.
es: Habilita el firmado de código.
fr: Active la signature du code.
pt_br: Habilita a assinatura de código.

source: Identity
es: Identidad
fr: Identité
pt_br: Identidade

source: The "Full Name" or "Common Name" of the signing identity, store in the macOS keychain. [1]_ [2]_
es: El "Nombre completo" o "Nombre común" de la identidad de firma, almacenada en el llavero de macOS. [1]_ [2]_
pt_br: O "Nome completo" ou "Nome comum" da identidade de assinatura, armazene nas chaves do macOS. [1]_ [2]_

source: Timestamp
es: Sello de tiempo
fr: Horodatage
pt_br: Registro do Tempo

source: Requests a timestamp server to authenticate the time of signing. Required for notarization. [2]_
es: Solicita a un servidor de marca de tiempo que autentique el momento de la firma. Requerido para la notarización. [2]_
fr: Demande à un serveur d'horodatage d'authentifier l'heure de la signature. Requis pour la notarisation. [2]
pt_br: Solicita um servidor de carimbo de data/hora para autenticar a hora da assinatura. Necessário para notarização. [2]_

source: Hardened Runtime
es: Entorno de ejecución fortificado
fr: Environnement d'exécution Renforcé
pt_br: Tempo de execução reforçado

source: Enables "Hardened Runtime". Required for notarization. [2]_
es: Activa el "Entorno de ejecución fortificado". Requerido para la notarización. [2]_
fr: Active le "Hardened Runtime". Requis pour la notarisation. [2]
pt_br: Ativa o "Hardened Runtime". Necessário para notarização. [2]_

source: Replace Existing Signature
es: Reemplazar Firma Existente
fr: Remplacer la signature existante
pt_br: Substituir Assinatura Existente

source: Replaces existing signatures of the GDNative libraries and embedded helper executables.
es: Reemplaza las firmas existentes de las bibliotecas GDNative y los ejecutables auxiliares incrustados.
fr: Remplace les signatures existantes des bibliothèques GDNative et des exécutables utilitaires intégrés.
pt_br: Substitui as assinaturas existentes das bibliotecas GDNative e executáveis auxiliares integrados.

source: To notarize an app, you must enable the ``Hardened Runtime`` and ``Timestamp``.
es: Para notarizar una aplicación, debes habilitar el ``Entorno de ejecución fortificado`` y la ``Marca de tiempo``.
fr: Pour authentifier une application, vous devez activer les fonctions ``Hardened Runtime`` et ``Timestamp``.
pt_br: Para autenticar um aplicativo, você deve habilitar o ``Hardened Runtime`` e ``Timestamp``.

source: The ``Hardened Runtime`` and ``Timestamp`` options are incompatible with ad-hoc signing and will be ignored.
es: Las opciones ``Entorno de ejecución fortificado`` y ``Marca de tiempo`` no son compatibles con la firma ad-hoc y serán ignoradas.
fr: Les options ``Hardened Runtime`` et ``Timestamp`` sont incompatibles avec la signature ad-hoc et seront ignorées.

source: Leave ``Identity`` option empty to use ad-hoc signature.
es: Deja vacía la opción de ``Identidad`` para utilizar la firma ad-hoc.
fr: Laissez l'option ``Identity`` vide pour utiliser une signature ad-hoc.
pt_br: Deixe a opção ``Identity`` vazia para usar a assinatura ad-hoc.

source: This option is visible only when exporting from a computer running macOS.
es: Esta opción solo es visible al exportar desde una computadora con macOS.
fr: Cette option est visible uniquement lors de l'exportation à partir d'un ordinateur fonctionnant sous macOS.
pt_br: Esta opção é visível apenas ao exportar de um computador executando o macOS.

source: Notarization Options
es: Opciones de Notorización
fr: Options de notarisation
pt_br: Opções de Notarização

source: Enables automatic upload for notarization.
es: Activa la carga automática para la notarización.
fr: Active le téléchargement automatique pour la notarisation.
pt_br: Permite upload automático para notarização.

source: Apple ID Name
es: Nombre de Apple ID
fr: Nom Apple ID
pt_br: Nome Apple ID

source: Apple ID account name (email address)
es: Nombre de cuenta de Apple ID (dirección de correo electrónico)
fr: Nom du compte Apple ID (adresse e-mail)
pt_br: Nome da conta Apple ID (endereço de e-mail)

source: Apple ID Password
es: Contraseña Apple ID
fr: Mot de passe Apple ID
pt_br: Senha Apple ID

source: Apple ID app-specific password. See `Using app-specific passwords <https://support.apple.com/en-us/HT204397>`__ to enable two-factor authentication and create app password.
es: Contraseña específica de la aplicación para Apple ID. Consulta `Uso de contraseñas específicas de la aplicación <https://support.apple.com/en-us/HT204397>`__ para habilitar la autenticación de dos factores y crear una contraseña de aplicación.
fr: Mot de passe spécifique à l'application Apple ID. Voir `Utilisation de mots de passe pour application <https://support.apple.com/fr-fr/HT204397>`__ pour activer l'authentification à deux facteurs et créer un mot de passe d'application.
pt_br: Senha específica do aplicativo Apple ID. Consulte `Usando senhas específicas do aplicativo <https://support.apple.com/en-us/HT204397>`__ para habilitar a autenticação de dois fatores e criar a senha do aplicativo.

source: Team ID, if your Apple ID belongs to multiple teams
es: Team ID, si tu Apple ID pertenece a múltiples equipos
pt_br: ID da equipe, se o seu Apple ID pertencer a várias equipes

source: See `Notarizing macOS Software Before Distribution <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution?language=objc>`__ for more info.
es: Consulta `Notarizing macOS Software Before Distribution <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution?language=objc>`__ para obtener más información.
fr: Voir `Notarisation des logiciels macOS avant distribution <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution?language=objc>`__ pour plus d'informations.
pt_br: Consulte `Notarizing macOS Software Before Distribution <https://developer.apple.com/documentation/security/notarizing_macos_software_before_distribution?language=objc>`__ para obter mais informações.

source: Notarization is supported when exporting from a computer running macOS, these options are hidden on other platforms.
es: La notarización es compatible al exportar desde una computadora con macOS, estas opciones están ocultas en otras plataformas.
fr: La notarisation est prise en charge lors de l'exportation à partir d'un ordinateur fonctionnant sous macOS, ces options sont masquées sur les autres plateformes.
pt_br: Notarização é suportada ao exportar de um computador executando o macOS, essas opções estão ocultas em outras plataformas.

source: Entitlements
es: Privilegios
fr: Permissions
pt_br: Direitos

source: Hardened Runtime Entitlements
es: Privilegios de Ejecución Reforzada
fr: Droits d'exécution renforcés

source: Hardened Runtime entitlements manage security options and resource access policy. See `Hardened Runtime <https://developer.apple.com/documentation/security/hardened_runtime?language=objc>`__ for more info.
es: Los "Privilegios de Ejecución Reforzada" (Hardened Runtime entitlements) administran las opciones de seguridad y la política de acceso a recursos. Consulta `Hardened Runtime <https://developer.apple.com/documentation/security/hardened_runtime?language=objc>`__ para obtener más información al respecto.
fr: Les droits Hardened Runtime gèrent les options de sécurité et la politique d'accès aux ressources. Voir `Hardened Runtime <https://developer.apple.com/documentation/security/hardened_runtime?language=objc>`__ pour plus d'informations.

source: Entitlement
es: privilegio
fr: Droit

source: Allow JIT Code Execution [3]_
es: Permitir la ejecución de código JIT [3]_
pt_br: Permitir a execução de código JIT [3]_

source: Allows creating writable and executable memory for JIT code. If you are using add-ons with dynamic or self-modifying native code, enable them according to the add-on documentation.
es: Permite crear memoria escribible y ejecutable para el código JIT. Si estás utilizando complementos con código nativo dinámico o auto-modificable, habilítalos según la documentación del complemento.
fr: Permet de créer une mémoire inscriptible et exécutable pour le code JIT. Si vous utilisez des modules complémentaires avec du code natif dynamique ou auto-modifiant, activez-les conformément à la documentation du module complémentaire.

source: Allow Unsigned Executable Memory [3]_
es: Permitir memoria ejecutable no firmada [3]_

source: Allows creating writable and executable memory without JIT restrictions. If you are using add-ons with dynamic or self-modifying native code, enable them according to the add-on documentation.
es: "Permitir memoria ejecutable no firmada" permite crear memoria escribible y ejecutable sin restricciones de JIT. Si estás utilizando complementos con código nativo dinámico o auto-modificable, habilítalos según la documentación del complemento.
fr: Permet de créer une mémoire inscriptible et exécutable sans restrictions JIT. Si vous utilisez des modules complémentaires avec du code natif dynamique ou auto-modifiant, activez-les conformément à la documentation du module complémentaire.

source: Allow DYLD Environment Variables [3]_
es: Permite variables de entorno DYLD [3]_
pt_br: Permitir variáveis de ambiente DYLD [3]_

source: Allows app to uss dynamic linker environment variables to inject code. f you are using add-ons with dynamic or self-modifying native code, enable them according to the add-on documentation.
es: Permitir que la aplicación utilice variables de entorno del enlazador dinámico para inyectar código. Si estás utilizando complementos con código nativo dinámico o auto-modificable, habilítalos según la documentación del complemento.
fr: Permet à l'application d'utiliser les variables d'environnement du linker dynamique pour injecter du code. Si vous utilisez des modules complémentaires avec du code natif dynamique ou auto-modifiant, activez-les conformément à la documentation du module complémentaire.

source: Disable Library Validation
es: Desactivar la validación de bibliotecas
fr: Désactiver la validation des librairies
pt_br: Desativar Validação da Biblioteca

source: Allows app to load arbitrary libraries and frameworks. Enabled it if you are using GDNative add-ons and ad-hoc signature, or want to support user-provided external add-ons.
es: "Permitir que la aplicación cargue bibliotecas y frameworks arbitrarios". Actívalo si estás utilizando complementos GDNative y una firma ad hoc, o si deseas admitir complementos externos proporcionados por el usuario.
fr: Permet à l'application de charger des bibliothèques et des frameworks arbitraires. Activez-la si vous utilisez les modules complémentaires GDNative et la signature ad hoc, ou si vous souhaitez prendre en charge les modules complémentaires externes fournis par l'utilisateur.

source: Audio Input
es: Entrada de Audio
fr: Entrée Audio
pt_br: Entrada de Áudio

source: Enable if you need to use the microphone or other audio input sources, if it's enabled you should also provide usage message in the `privacy/microphone_usage_description` option.
es: Habilita esta opción si necesitas utilizar el micrófono u otras fuentes de entrada de audio. Si está habilitado, también debes proporcionar un mensaje de uso en la opción `privacy/microphone_usage_description`.
fr: Activez cette option si vous avez besoin d'utiliser le microphone ou d'autres sources d'entrée audio. Si elle est activée, vous devez également fournir un message d'utilisation dans l'option `privacy/microphone_usage_description`.

source: Camera
es: Cámara
fr: Caméra
pt_br: Câmera
