Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/export/exporting_for_uwp.po
Languages: de, es, fr, pt_br, ru, zh_tw

source: If you want to update your already installed app, you must update the version number on the new package or first uninstall the previous package.
de: Wenn Sie Ihre bereits installierte Anwendung aktualisieren möchten, müssen Sie die Versionsnummer auf dem neuen Paket aktualisieren oder zuerst das vorherige Paket deinstallieren.
es: Si quieres actualizar tu aplicación ya instalada, debes actualizar el número de versión en el nuevo paquete o primero desinstalar el paquete anterior.
fr: Si vous voulez mettre à jour une de vos applications déjà installées, vous devez mettre à jour son numéro de version sur le nouveau paquetage ou désinstaller préalablement le paquetage précédent.
pt_br: Se você quer atualizar seu aplicativo já instalado, você precisa atualizar o número de versão no novo pacote ou primeiro desinstalar o pacote anterior.
ru: Если вы хотите обновить уже установленное приложение, вы должны обновить номер версии в новом пакете или сначала удалить предыдущий пакет.
zh_tw: 若想更新已安裝的應用程式，則必須在新套件上更新版本編號或先解除安裝之前的套件。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
pt_br: Progresso da Tradução
ru: Translation status (статус перевода)
zh_tw: 翻譯狀態

source: SignTool sign /fd SHA256 /a /f MyKey.pfx /p pfxPassword package.appx
pt_br: SignTool sign /fd SHA256 /a /f MyKey.pfx /p pfxPassword pacote.appx
