Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/importing_audio_samples.po
Languages: de, es, fr, ko, pt_br, zh_cn

source: Importing audio samples
de: Audio-Samples importieren
es: Importar muestras de audio
fr: Importer des échantillons audio
ko: 오디오 샘플 가져오기
pt_br: Importando amostras de áudio
zh_cn: 导入音频采样

source: Supported files
de: Unterstützte Formate
es: Archivos soportados
fr: Fichiers pris en charge
ko: 지원되는 파일
pt_br: Arquivos suportados
zh_cn: 支持的文件

source: Godot provides three options to import your audio data: WAV, Ogg Vorbis and MP3.
de: Godot bietet drei Optionen für den Import Ihrer Audiodaten: WAV, Ogg Vorbis und MP3.
es: Godot ofrece tres opciones para importar sus datos de audio: WAV, Ogg Vorbis y MP3.
fr: Godot propose trois options pour importer vos données audio : WAV, Ogg Vorbis et MP3.
ko: Godot는 오디오 데이터를 가져오기 위해 세 가지 옵션을 제공합니다: WAV, OGG Vorbis 및 MP3.
pt_br: Godot fornece três opções para importar seus dados de áudio: WAV, Ogg Vorbis e MP3.
zh_cn: Godot 提供了三个选项来导入您的音频数据：WAV、Ogg Vorbis、MP3。

source: Each has different advantages.
de: Jeder hat unterschiedliche Vorteile.
es: Cada una tiene distintas ventajas.
fr: Chacun de ces formats a des avantages différents.
ko: 각각에는 서로 다른 장점이 있습니다.
pt_br: Cada um tem vantagens diferentes.
zh_cn: 他们各有优点。

source: WAV files use raw data or light compression (IMA-ADPCM). They are lightweight on the CPU to play back (hundreds of simultaneous voices in this format are fine). The downside is that they take up a lot of disk space.
de: WAV-Dateien verwenden Rohdaten oder eine leichte Komprimierung (IMA-ADPCM). Sie belasten die CPU bei der Wiedergabe nur wenig (Hunderte von gleichzeitigen Stimmen in diesem Format sind in Ordnung). Der Nachteil ist, dass sie sehr viel Speicherplatz benötigen.
es: Los archivos WAV usan datos sin formato o compresión ligera (IMA-ADPCM), requieren una pequeña cantidad de CPU para reproducirse (este formato es bueno para cientos de voces simultáneas), pero ocupan un espacio significativo.
fr: Les fichiers WAV utilisent des données brutes ou une compression légère (IMA-ADPCM). Ils sont légers à lire pour le CPU (des centaines de voix simultanées dans ce format conviennent). L'inconvénient est qu'ils prennent beaucoup d'espace disque.
ko: Wav 파일은 압축되지 않은 데이터나 가벼운 압축을 사용합니다 (IMA-ADPCM). 재생에 CPU를 거의 사용하지 않습니다. (수 백 개의 목소리가 이 포맷으로 재생되어도 문제가 없습니다), 하지만 큰 용량이 단점입니다.
pt_br: Arquivos WAV usam dados brutos ou compressão leve (IMA-ADPCM). Eles são leves na CPU para serem reproduzidos (centenas de vozes simultâneas neste formato são aceitáveis). A desvantagem é que eles ocupam muito espaço em disco.
zh_cn: WAV 文件使用原始数据或轻度压缩（IMA-ADPCM）。它们在 CPU 上的播放是轻量级的（这种格式的数百个同步声音都可以）。缺点是会占用大量的磁盘空间。

source: Ogg Vorbis files use a stronger compression that results in much smaller file size, but require significantly more processing power to play back.
de: Ogg Vorbis-Dateien verwenden eine stärkere Komprimierung, die zu einer viel kleineren Dateigröße führt, für die Wiedergabe jedoch erheblich mehr Rechenleistung benötigt.
es: Los archivos Ogg Vorbis usan una mayor compresión lo que resulta en un tamaño de archivo mucho más pequeño, pero requieren mucha más potencia de procesamiento para reproducirse.
fr: Les fichiers Ogg Vorbis utilisent une compression plus forte qui se traduit par une taille de fichier beaucoup plus petite, mais nécessitent beaucoup plus de puissance de traitement pour la lecture.
ko: Ogg Vorbis 파일은 높은 압축률로 압축해 사용해 파일의 용량이 작습니다. 하지만 재생에 CPU를 상당히 많이 사용합니다.
pt_br: Os arquivos Ogg Vorbis usam uma compressão mais forte que resulta em tamanho de arquivo muito menor, mas requerem significativamente mais poder de processamento para reprodução.
zh_cn: Ogg Vorbis 文件使用更强的压缩率，从而可以减小文件大小，但需要更多的处理能力才能播放。

source: MP3 files use better compression than WAV with IMA-ADPCM, but worse than Ogg Vorbis. This means that a MP3 file with roughly equal quality to Ogg Vorbis will be significantly larger. On the bright side, MP3 requires less CPU usage to play back compared to Ogg Vorbis. This makes MP3 useful for mobile and HTML5 projects where CPU resources are limited, especially when playing multiple compressed sounds at the same time (such as long ambient sounds).
de: MP3-Dateien verwenden eine bessere Kompression als WAV mit IMA-ADPCM, aber eine schlechtere als Ogg Vorbis. Das bedeutet, dass eine MP3-Datei mit etwa gleicher Qualität wie Ogg Vorbis deutlich größer ist. Positiv ist, dass MP3 im Vergleich zu Ogg Vorbis weniger CPU-Belastung bei der Wiedergabe benötigt. Dies macht MP3 nützlich für mobile und HTML5-Projekte, bei denen die CPU-Ressourcen begrenzt sind, insbesondere wenn mehrere komprimierte Sounds gleichzeitig abgespielt werden (z. B. lange Umgebungsgeräusche).
es: Los archivos MP3 utilizan una mejor compresión que WAV con IMA-ADPCM, pero peor que Ogg Vorbis. Esto significa que un archivo MP3 con una calidad aproximadamente igual a la de Ogg Vorbis será significativamente más grande. En el lado positivo, MP3 requiere menos uso de CPU para reproducirse en comparación con Ogg Vorbis. Esto hace que MP3 sea útil para proyectos mobile y HTML5 donde los recursos de la CPU son limitados, especialmente cuando se reproducen varios sonidos comprimidos al mismo tiempo (como sonidos ambientales largos).
fr: Les fichiers MP3 utilisent une meilleure compression que wav avec IMA-ADPCM, mais pire qu’Ogg Vorbis. Cela signifie qu’un fichier MP3 avec une qualité à peu près égale à Ogg Vorbis sera significativement plus grand. Sur le bon côté des choses, mp3 nécessite moins d’utilisation CPU pour jouer en arrière par rapport à Ogg Vorbis. Cela rend MP3 utile pour les projets mobiles et HTML5 où les ressources CPU sont limitées, en particulier lorsque vous jouez plusieurs sons compressés en même temps (tels que les sons ambiants longs).
ko: MP3 파일은 WAV의 IMA-ADPCM보다는 압축률이 높지만 Ogg Vorbis보다는 압축률이 작습니다. 따라서 MP3는 Ogg Vorbis보다 용량은 크면서 음질은 거의 비슷합니다. 하지만 MP3는 Ogg Vorbis보다 CPU를 더 적게 사용한다는 장점이 있습니다. 이 점 때문에 MP3는 CPU 자원이 한정되어 있는 모바일 및 HTML5 프로젝트에서 유용하며 이 점은 배경음처럼 압축된 오디오 여러개를 재생해야 할 때 더 두드러집니다.
pt_br: Arquivos MP3 usam uma compressão melhor que WAV com IMA-ADPCM, porém pior que Ogg Vorbis. Isto significa que um arquivo MP3 com qualidade aproximadamente igual ao Ogg Vorbis será significantemente maior. Pelo lado positivo, o MP3 requer menos uso de CPO para ser reproduzido comparado ao Ogg Vorbis. Isto torna o MP3 útil para projetos mobile e HTML5 onde os recursos da CPU são limitados, especialmente ao reproduzir vários sons comprimidos ao mesmo tempo (como sons ambientes longos).
zh_cn: MP3 文件使用 IMA-ADPCM 的压缩效果比 WAV 好，但比 Ogg Vorbis 差。这意味着, 一个与 Ogg Vorbis 质量大致相同的 MP3 文件将明显增大。从好的方面来看，与 Ogg Vorbis 相比，MP3 在播放时需要较少的 CPU 使用率。这使得 MP3 对于 CPU 资源有限的移动和 HTML5 项目非常有用，特别是在同时播放多个压缩声音时（如长的环境音）。

source: Here is a comparative chart.
de: Hier ist eine Vergleichstabelle.
es: Aquí hay una tabla comparativa.
fr: Voici un tableau comparatif.
ko: 장단점을 비교한 차트입니다.
pt_br: Aqui está uma tabela comparativa.
zh_cn: 这有一个比较图表.

source: 1 second of audio
de: 1 Sekunde Audio
es: 1 segundo de audio
fr: 1 seconde d'audio
pt_br: 1 segundo de áudio
zh_cn: 1秒的音频

source: WAV 24-bit, 96 kHz, stereo
fr: WAV 24 bits, 96 kHz, Stéréo
ko: WAV 24-bit, 96 kHz, 스테레오
pt_br: WAV 24 bits, 96 kHz, estéreo
zh_cn: WAV 24 bits,96 kHz, 立体声

source: 576 KB
fr: 576 Ko

source: WAV 16-bit, 44 kHz, mono
fr: WAV 16 bits, 44 kHz, Mono
ko: WAV 16-bit, 44 kHz, 모노
pt_br: WAV 16 bits, 44 kHz, mono
zh_cn: WAV 16-bit,44 kHz, 单声道

source: 88 KB
fr: 88 Ko

source: WAV 16-bit, IMA-ADPCM, mono
fr: WAV 16 bits, IMA-ADPCM, Mono
ko: WAV 16-bit, IMA-ADPCM, 모노
pt_br: WAV 16 bits, IMA-ADPCM, mono
zh_cn: WAV 16-bit,IMA-ADPCM, 单声道

source: 22 KB
fr: 22 Ko

source: MP3 192 Kb/s, stereo
fr: MP3 192 Kb/s, stéréo
ko: MP3 192 Kb/s, 스테레오
pt_br: MP3 192 Kb/s, estéreo
zh_cn: MP3 192 Kb/s, 立体声

source: Ogg Vorbis 128 Kb/s, stereo
fr: Ogg Vorbis 128 Kb/s, stéréo
ko: Ogg Vorbis 128 Kb/s, 스테레오
pt_br: Ogg Vorbis 128 Kb/s, estéreo
zh_cn: Ogg Vorbis 128 Kb/s, 立体声

source: 16 KB
fr: 16 Ko

source: Ogg Vorbis 96 Kb/s, stereo
fr: Ogg Vorbis 96 Kb/s, stéréo
pt_br: Ogg Vorbis 96 Kb/s, estéreo
zh_cn: Ogg Vorbis 96 Kb/s, 立体声

source: 12 KB
fr: 12 Ko

source: Consider using WAV for short and repetitive sound effects, and Ogg Vorbis for music, speech, and long sound effects.
de: Benutzen Sie WAV für kurze und sich wiederholende Sound Effekte und Ogg Vorbis für Musik, Sprache und lange Sound Effekte.
es: Considera usar WAV para efectos de sonido cortos y repetitivos, y OGG para música, voz y efectos de sonido largos.
fr: Envisagez d'utiliser WAV pour les effets sonores courts et répétitifs, et Ogg Vorbis pour la musique, la parole et les effets sonores longs.
ko: 짧고 여러 번 재생되는 음향 효과에는 WAV를 사용하고, 음악, 대사, 그리고 긴 음향 효과에는 OGG를 사용하는 것을 고려하십시오.
pt_br: Considere usar WAV para efeitos sonoros curtos e repetitivos, e Ogg Vorbis para músicas, vozes e efeitos sonoros longos.
zh_cn: 考虑将 WAV 用于短而重复的音效，而将 Ogg Vorbis 用于音乐、语音、长音效。

source: Best practices
de: Empfohlene Vorgehensweisen
es: Buenas prácticas
fr: Les meilleures pratiques
ko: 모범 사례
pt_br: Boas práticas
zh_cn: 最佳实践

source: Godot has an :ref:`extensive bus system <doc_audio_buses>` with built-in effects. This saves SFX artists the need to add reverb to the sound effects, reducing their size greatly and ensuring correct trimming. Say no to SFX with baked reverb!
de: Godot hat ein :ref:`umfangreiches Bussystem <doc_audio_buses>` mit eingebauten Effekten. Dies erspart Spezialeffekt-Künstlern das Hinzufügen von Hall (Reverb) zu den Soundeffekten, wodurch deren Größe stark reduziert und ein korrektes Trimmen gewährleistet wird. Sagen Sie nein zu Spezialeffekten mit gebranntem Hall!
es: Godot tiene un :ref:`extenso sistema de buses <doc_audio_buses>` con efectos incorporados. Esto ahorra a los artistas de SFX la necesidad de agregar reverberación a los efectos de sonido, reduciendo su tamaño en gran medida y asegurando un correcto recorte. ¡Di no a SFX con reverberación incorporada!
fr: Godot a un :ref:`système de bus étendu <doc_audio_buses>` avec effets intégrés. Cela évite aux artistes SFX d'avoir à ajouter de la réverbération aux effets sonores, ce qui réduit considérablement leur taille et assure un réglage correct. Dites non au SFX avec réverbération pré-calculée !
ko: Godot은 내장(built-in) 효과를 가진 :ref:`광역 버스 시스템 <doc_audio_buses>` 을 갖고 있습니다. 이걸로 SFX 아티스트가 음향 효과에 울림(reverb)을 추가하는 번거로움을 줄여주며, 파일 크기를 크게 줄이고 올바른 트리밍을 보장합니다. SFX에서 울림 베이킹은 이제 그만!
pt_br: O Godot tem um sistema de barramentos com efeitos integrados. Isto evita aos artistas de SFX a necessidade de adicionar reverberação aos efeitos sonoros, reduzindo consideravelmente o tamanho e garantindo um ajuste correto. Diga não aos SFX com reverberação pré-preparada!
zh_cn: Godot有一个带有内置效果的 :ref:`扩展总线系统 <doc_audio_buses>` . 这使 :abbr:`SFX(Sound Effects, 音效)` 艺术家无需在音效中添加混响, 从而大大减小了它们的尺寸并确保正确的修剪. 对使用混响烘焙的SFX说不！

source: As you can see above, sound effects become huge with reverb added.
de: Wie Sie oben sehen können, werden die Soundeffekte mit hinzugefügtem Hall riesig.
es: Como puedes ver arriba, los efectos de sonido se vuelven enormes cuando se agrega reverberación.
fr: Comme vous pouvez le voir ci-dessus, les effets sonores deviennent énormes avec la réverbération ajoutée.
ko: 위에서 볼 수 있듯이, reverb가 추가되면서 음향 효과는 거대해졌습니다.
pt_br: Como pode ser visto acima, efeitos sonoros podem se tornar enormes com a reverberação adicionada.
zh_cn: 正如你在上面看到的, 添加混响后音效会变得非常巨大.

source: Trimming
de: Trimmen/Beschneiden
es: Recortando
fr: Garniture
ko: 트리밍
pt_br: Aparar
zh_cn: 修剪

source: One issue that happens often is that the waveform is exported with long silences at the beginning and at the end. These are inserted by DAWs when saving to a waveform, increase their size unnecessarily and add latency to the moment they are played back.
de: Ein Problem, das häufig auftritt, ist, dass die Waveform mit langer Stille am Anfang und am Ende exportiert wird. Diese werden von den DAWs beim Speichern in eine Wellenform eingefügt, vergrößern diese unnötig und erhöhen die Latenzzeit im Moment der Wiedergabe.
es: Un problema que ocurre a menudo es que las formas de onda se exportan con largos silencios al principio y al final. Estos son insertados por los DAW (estación de trabajo de audio digital) cuando se guardan en una forma de onda, aumentan su tamaño innecesariamente y agregan latencia al momento en que se reproducen.
fr: Un problème qui se produit souvent est que la forme d'onde est exportée avec de longs silences au début et à la fin. Celles-ci sont insérées par les DAW lors de l'enregistrement sur une forme d'onde, augmentent inutilement leur taille et ajoutent une latence au moment de leur lecture.
ko: 종종 발생하는 문제로 파형을 내보낼 때 시작과 끝에 긴 묵음이 있는 것입니다. 이것은 파형을 저장할 때 DAW에 의해 삽입되며, 불필요하게 파일 크기를 키우면서 재생하는 순간 대기 시간이 추가됩니다.
pt_br: Um problema que acontece com frequência é que a forma de onda é exportada com longos silêncios no início e no fim. Elas são inseridas pelas DAWs ao salvar a forma de onda, aumentando seus tamanhos desnecessariamente e adicionando latência no momento em que são reproduzidas.
zh_cn: 经常发生的一个问题是, 在开始和结束时, 输出的波形长时间无声. 当保存到波形时, 它们由 :abbr:`DAW(Digital Audio Workstation, 数字音频工作站)` 插入, 非必要地增加了它们的大小, 并增加了播放时的延迟.

source: Importing as WAV with the **Trimming** option enabled solves this.
de: Der Import als WAV mit aktivierter Option **Trimming** löst dieses Problem.
es: La importación como WAV con la opción de **Trimming** habilitada resuelve esto.
fr: L'importation en WAV avec l'option **Trimming** activée résout ce problème.
ko: **Trimming** 설정이 활성화된 상태로 WAV 포맷으로 가져오면 해결됩니다.
pt_br: A importação de WAV com a opção **Trimming** ativada resolve este problema.
zh_cn: 在启用 **Trimming**\ （修剪）选项的情况下将其导入为 WAV，即可解决此问题。

source: Looping
de: Looping (Wiederhol-Schleife)
es: Bucleando
fr: Boucler
ko: 루핑(Looping)
zh_cn: 循环

source: Godot supports looping in the samples (tools such as Sound Forge or Audition can add loop points to WAV files). This is useful for sound effects, such as engines, machine guns etc. Ping-pong looping is also supported.
de: Godot unterstützt das Loopen der Samples (Tools wie Sound Forge oder Audition können Loop-Punkte zu WAV-Dateien hinzufügen). Dies ist nützlich für Soundeffekte, wie z.B. Motoren, Maschinengewehre usw. Ping-Pong-Looping wird ebenfalls unterstützt.
es: Godot soporta looping en las muestras de audio (herramientas como Sound Forge o Audition pueden añadir puntos de loop a los archivos WAV). Esto es útil para efectos de sonido como motores, ametralladoras, etc. También soporta ping-pong looping.
fr: Godot supporte le bouclage dans les échantillons (des outils tels que Sound Forge ou Audition peuvent ajouter des points de boucle aux fichiers WAV). Ceci est utile pour les effets sonores, tels que les moteurs, les mitrailleuses, etc. Le bouclage ping-pong est également supporté.
ko: Godot는 샘플에서의 반복을 지원합니다 (Sound Forge나 Audition같은 툴은 WAV 파일에 반복 포인트를 추가할 수 있습니다). 이것은 엔진, 기관총 같은 음향 효과에 유용합니다. 핑퐁 루핑 역시 지원합니다.
pt_br: O Godot suporta looping nas amostras (ferramentas como Sound Forge ou Audition podem adicionar pontos de loop a arquivos WAV). Isto é útil para efeitos sonoros como motores, metralhadoras, etc. Looping de ping-pong também é suportado.
zh_cn: Godot 支持采样中的循环（Sound Forge 或 Audition 等工具可以将循环点添加到 WAV 文件中）。这对如引擎、机枪等音效很有用。还支持乒乓循环。

source: As an alternative, the Import dock has a **Loop** option that enables looping for the entire sample when importing.
de: Als Alternative verfügt das Import-Dock über eine **Loop**-Option, die beim Importieren das Looping für das gesamte Sample aktiviert.
es: Como alternativa, el panel de importación tiene una opción de "Loop" que permite la repetición de la totalidad de la muestra al importar.
fr: Comme alternative, le dock d'importation dispose d'une option **Loop** qui permet de mettre en boucle l'échantillon entier lors de l'importation.
ko: 대안으로, 가져오기 독은 전체 샘플을 가져올 때 루프(loop)를 활성화할 수 있는 **Loop** 설정을 갖고 있습니다.
pt_br: Como alternativa, a dock de importação tem uma opção de **Loop** que ativa looping para o toda a amostra ao importar.
zh_cn: 另外，“导入”面板中有一个 **Loop**\ （循环）选项，可以在导入时为整个采样启用循环。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ko: 번역 상태
pt_br: Progresso da Tradução
zh_cn: 翻译状态

source: Format
es: Formato
ko: 형식
pt_br: Formato
zh_cn: 格式
