Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/assets_pipeline/import_process.po
Languages: cs, de, es, it, ja, ko, zh_tw

source: Import process
cs: Proces importu
de: Importvorgang
es: Proceso de importación
it: Processo d'importazione
ja: インポートプロセス
ko: 가져오기 과정
zh_tw: 匯入流程

source: Importing assets in Godot 3.0+
cs: Import zdrojů v Godotu 3.0+
de: Assets in Godot 3.0+ importieren
es: Importando recursos en Godot 3.0+
it: Importare gli asset in Godot 3.0+
ja: Godot 3.0+ でのアセットのインポート
ko: Godot 3.0+에서 애셋 가져오기
zh_tw: 於 Godot 3.0+ 匯入素材

source: Previously, importing assets in Godot 2.x required manual maintenance of a separate directory with source assets. Without doing this, it was impossible to specify how to convert and change import flags for textures, audio files, scenes, etc.
cs: Dříve vyžadoval import prostředků v systému Godot 2.x ruční správu samostatného adresáře se zdrojovými prostředky. Bez toho nebylo možné určit, jak konvertovat a měnit importní příznaky pro textury, zvukové soubory, scény atd.
de: Bisher war für den Import von Assets in Godot 2.x die manuelle Pflege eines separaten Verzeichnisses mit Quell-Assets erforderlich. Ohne dies war es unmöglich anzugeben, wie Importflags für Texturen, Audiodateien, Szenen usw. konvertiert und geändert werden sollen.
es: Previamente, importar recursos en Godot 2.x requería mantener una carpeta separada del directorio con los recursos originales. Sin hacer esto, era imposible especificar cómo convertir y cambiar banderas de texturas, audios, escenas, etc.
it: In precedenza,importare gli asset in Godot 2.x richiedeva il mantenimento di una cartella separata con gli asset originali. Se non si faceva, era impossibile specificare come convertire e cambiare i flag di importazione per texture, file audio, scene, eccetera.
ja: 以前、Godot 2.xでアセットをインポートするには、ソースアセットがある個別のディレクトリを手動でメンテナンスする必要がありました。これを行わないと、テクスチャ、オーディオファイル、シーンなどのインポートフラグを変換、および変更する方法を指定できませんでした。
ko: 이제까지는, Godot 2.x에서 애셋을 가져오려면 원본 애셋이 있는 별개의 디렉토리를 수동으로 유지보수해야 했습니다. 이렇게 하지 않으면, 텍스처, 오디오 파일, 씬 등을 위한 가져오기 플래그를 전환하고 변경하는 방식을 지정하는 일은 불가능했습니다.
zh_tw: 以前，在 Godot 2.x 版中匯入素材會需要手動管理保存原始素材的單獨目錄。若不這樣做，則無法指定如何轉換及修改紋理、音訊檔、場景的匯入旗標。

source: In Godot 3.0+, we use a more modern approach to importing: Simply drop your assets (image files, scenes, audio files, fonts, etc) directly in the project folder (copy them manually with your OS file explorer). Godot will automatically import these files internally and keep the imported resources hidden in a ``res://.import`` folder.
cs: V Godotu 3.0+ používáme modernější přístup k importu: Jednoduše vložte své prostředky (obrazové soubory, scény, zvukové soubory, písma atd.) přímo do složky projektu (zkopírujte je ručně pomocí průzkumníka souborů v operačním systému). Godot tyto soubory automaticky interně naimportuje a importované zdroje uchová skryté ve složce ``res://.import``.
es: En Godot 3.0+, utilizamos un enfoque más moderno para la importación: simplemente coloque sus activos (archivos de imagen, escenas, archivos de audio, fuentes, etc.) directamente en la carpeta del proyecto (cópielos manualmente con el explorador de archivos de su sistema operativo). Godot importará automáticamente estos archivos internamente y mantendrá los recursos importados ocultos en una carpeta ``res: //. Import``.
ko: Godot 3.0에서는, 가져오기에 더 현대적인 접근법을 사용합니다: 간단히 애셋(이미지 파일, 씬, 오디오 파일, 폰트 등)을 프로젝트 폴더에 직접 드롭합니다(OS 파일 탐색기로 애셋을 수동으로 복사합니다). Godot은 이 파일을 내부로 가져오며 가져온 리소스를 ``res://.import`` 폴더에 숨겨 놓습니다.

source: This means that when trying to access imported assets through code you need to use the :ref:`Resource Loader<class_ResourceLoader>` as it will automatically take into account where the internal files are saved. If you try and access an imported asset using the :ref:`File <class_File>` class it will work in the editor, but break in the exported project.
cs: To znamená, že při pokusu o přístup k importovaným prostředkům prostřednictvím kódu musíte použít :ref:`Resource Loader<class_ResourceLoader>`, protože automaticky zohledňuje, kde jsou interní soubory uloženy. Pokud se pokusíte přistupovat k importovanému prostředku pomocí třídy :ref:`Soubor <class_Filer>`, bude to fungovat v editoru, ale v exportovaném projektu ani náhodou.
de: Dies bedeutet, dass Sie beim Versuch über Code auf importierte Assets zuzugreifen, Folgendes verwenden müssen :ref:`Resource Loader <class_ResourceLoader>`, damit automatisch berücksichtigt wird wo die internen Dateien gespeichert werden. Wenn Sie versuchen mit der Klasse :ref:`File <class_File>` auf ein importiertes Asset zuzugreifen, funktioniert dies im Editor, unterbricht jedoch das exportierte Projekt.
es: Esto significa que cuando se intenta acceder a los activos importados a través del código, es necesario utilizar el :ref:`Resource Loader<class_ResourceLoader>` ya que tendrá en cuenta automáticamente dónde se guardan los archivos internos. Si intentas acceder a un activo importado mediante la clase :ref:`File <class_File>` funcionará en el editor, pero se romperá en el proyecto exportado.
ko: 따라서 가져온 애셋에 액세스하려면 저장된 내부 파일의 위치를 고려하도록 :ref:`Resource Loader<class_ResourceLoader>` 를 사용해야 합니다. 만약 :ref:`File <class_File>` 클래스로 가져온 애셋에 액세스 한다면 에디터에서는 작동하겠지만 내보낸 프로젝트에서는 작동하지 않습니다.
zh_tw: 這表示，要在程式碼中存取匯入的素材，就必須使用 :ref:`ResourceLoader<class_ResourceLoader>` ，因為 ResourceLoader 會自己處理要在內部將檔案存在哪裡。若使用 :ref:`File <class_File>` 來存取匯入的素材，則只能在編輯器中正常運作，而匯出的專案中則會出問題。

source: However, the :ref:`Resource Loader<class_ResourceLoader>` cannot access non imported files, only the :ref:`File <class_File>` class can.
cs: Třída :ref:`Resource Loader<class_ResourceLoader>` však nemá přístup k neimportovaným souborům, toho je schopna pouze třída :ref:`File <class_File>`` .
de: Die Ressource :ref:`Resource Loader <class_ResourceLoader>` kann auf nicht importierte Dateien jedoch nicht zugreifen, sondern nur die :ref:`File <class_File>` Klasse kann dies.
es: Sin embargo, el :ref:`Resource Loader<class_ResourceLoader>` no puede acceder a los archivos no importados, sólo la clase :ref:`File <class_File>` puede.
ko: 반면 :ref:`Resource Loader<class_ResourceLoader>`는 가져오지 않은 파일에는 액세스 할 수 없으므로 이 경우에는 :ref:`File <class_File>`클래스를 사용해야 합니다.
zh_tw: 然而，:ref:`ResourceLoader<class_ResourceLoader>` 無法存取非匯入的檔案，只有 :ref:`File <class_File>` 可以存取。

source: Changing import parameters
cs: Změna parametrů importu
de: Importparameter ändern
es: Cambiando parámetros de importación
it: Cambiare i parametri di importazione
ja: インポートパラメーターの変更
ko: 가져오기의 매개변수 변경하기
zh_tw: 更改匯入參數

source: To change the import parameters of an asset in Godot (again, keep in mind import parameters are only present in non-native Godot resource types) select the relevant resource in the filesystem dock:
cs: Chcete-li změnit parametry importu zdroje v systému Godot (opět mějte na paměti, že parametry importu jsou přítomny pouze pro nenativní typy zdrojů Godot), vyberte příslušný zdroj v doku souborového systému:
de: Um die Importparameter eines Assets in Godot zu ändern (beachten Sie auch hier, dass Importparameter nur in nicht nativen Godot-Ressourcentypen vorhanden sind), wählen Sie die entsprechende Ressource im Dock des Dateisystems aus:
es: Para cambiar los parámetros de importación de un activo en Godot (nuevamente, tenga en cuenta que los parámetros de importación solo están presentes en los tipos de recursos de Godot no nativos), seleccione el recurso relevante en la base del sistema de archivos:
ko: Godot에서 애셋의 가져오기 매개변수를 변경하는 것은 쉽습니다(다시 말하지만, 가져오기 매개변수는 오직 네이티브가 아닌 Godot 리소스 타입에만 있습니다). 파일 시스템 독에서 관련된 리소스를 선택합니다:
zh_tw: 若要在 Godot 中更改素材的匯入參數，於檔案系統 Dock 中選擇相應的資源即可 (但請記得只有非原生 Godot 資源類型有匯入參數)。：

source: Then, after adjusting the parameters, press "Reimport". These parameters will only be used for this asset and on future reimports.
cs: Po úpravě parametrů stiskněte tlačítko "Reimport". Tyto parametry budou použity pouze pro tento zdroj při všech dalších reimportech.
de: Drücken Sie dann nach dem Anpassen der Parameter "Reimport". Diese Parameter werden nur für dieses Asset und bei zukünftigen Reimporten verwendet.
es: A continuación, después de ajustar los parámetros, pulsa "Reimportar". Los parámetros utilizados serán sólo para este recurso y serán utilizados en futuras reimportaciones.
it: Quindi, dopo aver aggiustato i parametri, premi "Reimporta". Questi parametri verranno usati per l'asset e per future reimportazioni.
ja: 次に、パラメーターを調整した後、「再インポート(Reimport)」を押します。これらのパラメーターは、このアセットと今後の再インポートでのみ使用されます。
ko: 매개변수를 조정한 후에, "다시 가져오기"를 눌러줍니다. 매개변수는 이 애셋과 향후 다시 가져오기에만 사용될 것입니다.
zh_tw: 接著，調整參數後，按下 [重新匯入]。這些參數只對該素材或之後重新匯入時才有作用。

source: Changing the import parameters of several assets at the same time is also possible. Simply select all of them together in the resources dock and the exposed parameters will apply to all of them when reimporting.
cs: Je také možné změnit parametry importu několika zdrojů najednou. Stačí je v doku zdrojů všechny vybrat a změněné parametry se pro ně při opětovném importu použijí hromadně.
de: Es ist auch möglich, die Importparameter mehrerer Assets gleichzeitig zu ändern. Wählen Sie einfach alle zusammen im Ressourcendock aus, und die verfügbaren Parameter gelten beim erneuten Importieren für alle.
es: También es posible modificar los parámetros de importación de varios recursos al mismo tiempo. Simplemente selecciónalos a todos en el panel de recursos y los parámetros indicados se aplicarán a todos al reimportar.
it: Anche cambiare i parametri di import di vari asset allo stesso tempo è possibile. Semplicemente selezionali assieme nel pannello delle risorse e i parametri configurati verranno impostati a tutti i selezionati durante la reimportazione.
ja: 複数のアセットのインポートパラメーターを同時に変更することもできます。リソースドックでそれらをすべて一緒に選択するだけで、再インポート時に公開されたパラメータがそれらすべてに適用されます。
ko: 여러 애셋 가져오기 매개변수를 동시에 바꾸는 것도 가능합니다. 간단히 리소스 독에서 모두를 선택하고 다시 가져올 때 가져온 매개변수를 적용합니다.
zh_tw: 也可以同時更改多個素材的匯入參數。只需要在資源 Dock 中一次選擇所有要修改的資源，重新匯入時，參數將套用在這些資源上。

source: Reimporting multiple assets
cs: Opětovný import více položek
de: Mehrere Assets erneut importieren
es: Reimportar varios activos
ko: 여러 애셋들을 다시 가져오기
zh_tw: 重新匯入多個素材

source: While working on a project you may find that several assets need to have the same parameters changed, such as enabling mipmaps, but you only want those specific parameters changed. To do this, select every asset you want to reimport in the file system. In the import tab there will now be a checkbox to the left of every import parameter.
cs: Při práci na projektu můžete zjistit, že je třeba změnit stejné parametry u několika zdrojů, například povolit mipmapy, ale chcete změnit pouze tyto konkrétní parametry. Za tímto účelem vyberte v systému souborů každý zdroj, který chcete znovu importovat. Na kartě import se nyní vlevo od každého parametru importu objeví zaškrtávací políčko.
de: Während der Arbeit an einem Projekt müssen möglicherweise für mehrere Assets dieselben Parameter geändert werden, z.B. das Aktivieren von MipMaps. Es sollten jedoch nur diese spezifischen Parameter geändert werden. Wählen Sie dazu jedes Asset aus, das Sie erneut in das Dateisystem importieren möchten. Auf der Registerkarte "Importieren" befindet sich jetzt links neben jedem Importparameter ein Kontrollkästchen zum aktivieren.
es: Mientras se trabaja en un proyecto, es posible que se encuentre con que varios recursos necesitan que se cambien los mismos parámetros, como la habilitación de mipmaps, pero sólo se desea que se cambien esos parámetros específicos. Para ello, seleccione cada activo que desee reimportar en el sistema de archivos. En la pestaña de importación habrá ahora una casilla de verificación a la izquierda de cada parámetro de importación.
ko: 프로젝트에서 작업할 때 밉맵을 활성화 하는 등 여러 애셋이 같은 매개변수를 변경해야 하는 경우를 볼 수 있을 겁니다. 하지만 특정 매개변수만을 변경하고 싶은 경우, 파일시스템에서 다시 가져오고 싶은 파일을 모두 선택하십시오. 그러면 가져오기 탭의 모든 가져온 매개변수 좌측에 체크박스가 보일겁니다.
zh_tw: 在處理專案時，我們有時候會需要對多個素材上更改同一個參數，如開啟 Mipmap 等，通常這種情況只需要更改特定的幾個參數。為此，可以在檔案系統中選擇所有要重新匯入的素材，然後在匯入分頁中，每個匯入參數的左邊會出現一個勾選框。

source: Select the checkbox of the parameters you want to change on your imported assets, then change the parameters normally. Finally, click the reimport button and every selected asset will be reimported with only those parameters changed.
cs: Zaškrtněte políčko u parametrů, které chcete u importovaných zdrojů změnit, a poté parametry normálně změňte. Nakonec klikněte na tlačítko reimportovat a každý vybraný zdroj bude znovu importován pouze se změněnými parametry.
de: Aktivieren Sie das Kontrollkästchen der Parameter, die Sie für Ihre importierten Assets ändern möchten und ändern Sie die Parameter wie gehabt. Klicken Sie abschließend auf die Schaltfläche "Neu importieren". Jedes ausgewählte Asset wird erneut importiert, wobei nur die Parameter geändert werden.
es: Seleccione la casilla de verificación de los parámetros que desea modificar en sus activos importados, y luego cambie los parámetros normalmente. Finalmente, haga clic en el botón de reimportación y cada activo seleccionado será reimportado con sólo esos parámetros cambiados.
ko: 가져온 애셋에서 바꾸고 싶은 매개변수의 체크박스에 체크한 후 평상시처럼 매개변수를 변경하십시오. 이후 다시 가져오기 버튼을 누르면 선택된 애셋들이 체크된 매개변수의 값만 변경된 채 다시 가져와집니다.
zh_tw: 勾選匯入素材中要更改的參數，接著就照常更改參數即可。最後，選擇 [重新匯入] 按鈕，所有選擇的素材都只會套用這些參數的更改並重新匯入。

source: Automatic reimport
cs: Automatický reimport
de: Automatischer Reimport
es: Reimportación automática
it: Reimportazione automatica
ja: 自動再インポート
ko: 자동으로 다시 가져오기
zh_tw: 自動重新匯入

source: When the MD5 checksum of the source asset changes, Godot will perform an automatic reimport of it, applying the preset configured for that specific asset.
cs: Pokud se kontrolní součet MD5 položky zdroje změní, Godot provede jeho automatický reimport a použije předvolbu nakonfigurovanou pro daný zdroj.
de: Wenn sich die MD5-Prüfsumme des Quell-Assets ändert, führt Godot einen automatischen Reimport durch, wobei die für dieses bestimmte Asset konfigurierte Voreinstellung angewendet wird.
es: Cuando el checksum MD5 de un recurso de origen cambia, Godot realizará una reimportación automática del mismo, aplicando el preset configurado para ese recurso específico.
it: Quando il checksum MD5 dell'asset originale cambia, Godot lo reimporta automaticamente, applicando le configurazioni della preconfigurazione (o preset) per quell'asset specifico.
ja: ソースアセットのMD5チェックサムが変更されると、Godot はそのアセットの自動再インポートを実行し、その特定のアセットに設定されたプリセットを適用します。
ko: 원본 애셋의 MD5 체크섬이 바꿀 때, Godot는 튿정 애셋을 위해 구성된 프리셋을 적용하면서, 그것에 자동 다시 내보내기를 실행할 것입니다.
zh_tw: 若原始素材的 MD5 檢查碼發生變化時，Godot 會自動重新匯入該素材，並將預設設定套用至特定素材上。

source: Files generated
cs: Vygenerované soubory
de: Erzeugte Dateien
es: Archivos generados
it: File generati
ja: 生成されたファイル
ko: 생성된 파일
zh_tw: 產生的檔案

source: Importing will add an extra ``<asset>.import`` file, containing the import configuration. Make sure to commit these to your version control system!
cs: Při importu se přidá další soubor ``<asset>.import``, který obsahuje konfiguraci importu. Nezapomeňte jej promítnout do systému správy verzí!
es: Al importar se agregará un archivo adicional ``<asset>.import``, que contiene la configuración de importación ¡Asegúrate de enviarlos a tu sistema de control de versiones!
ko: 가져오기는 추가로 ``<asset>.import`` 파일을 생성하는데, 가져오기 구성이 거기에 들어있습니다. 이것을 버전 제어 시스템에 커밋하도록 하세요!

source: Additionally, extra assets will be preset in the hidden ``res://.import`` folder:
cs: Navíc budou ve skryté složce ``res://.import`` přednastaveny další zdroje:
de: Zusätzlich werden weitere Assets im versteckten Ordner ``res://.import`` voreingestellt:
es: Además, Los activos adicionales estarán preestablecidos en la carpeta oculta ``res: //. import``:

source: If any of the files present in this folder is erased (or the whole folder), the asset or assets will be reimported automatically. As such, committing this folder to the version control system is optional. It can shorten reimporting time when checking out on another computer, but it takes considerably more space and transfer time. Pick your poison!
cs: Pokud dojde k vymazání některého ze souborů v této složce (nebo celé složky), zdroj nebo zdroje budou automaticky reimportovány. Odeslání této složky do systému správy verzí je proto volitelné. Může zkrátit dobu opětovného importu při kontrole na jiném počítači, ale zabere podstatně více místa a času pro přenos. Vyberte si svoje!
de: Wenn eine der in diesem Ordner vorhandenen Dateien (oder der gesamte Ordner) gelöscht wird, wird das Asset (oder auch mehrere) automatisch wieder importiert. Daher ist die Übergabe dieses Ordners an das Versionskontrollsystem optional. Dies kann die Zeit für das erneute Importieren beim Auschecken auf einem anderen Computer verkürzen, benötigt jedoch erheblich mehr Speicherplatz und Übertragungszeit. Sie haben die Wahl zwischen beiden!
es: Si alguno de los archivos presentes en esta carpeta es borrado (o toda la carpeta), el recurso o recursos se reimportarán automáticamente. Como tal, la confirmación de esta carpeta al sistema de control de versiones es opcional. Puedes ahorrar tiempo en la reimportación al realizar el proceso en otra computadora, pero ocupa mucho más espacio y tiempo de transferencia. ¡Elige lo que más te convenga!
it: Se uno di questi file in questa cartella viene cancellato (o tutta la cartella), l'asset o gli asset verranno reimportati automaticamente. Di per se, è opzionale committare questa cartella nel sistema di controllo versione. Permette un tempo di reimport minore quando si fa il checkout da un altro computer, ma richiede più spazio e tempo di trasferimento. Scegli la tua pozione!
ja: このフォルダに存在するファイルのいずれか(またはフォルダ全体)が消去されると、アセットは自動的に再インポートされます。そのため、このフォルダをバージョン管理システムにコミットすることはオプションです。別のコンピューターでチェックアウトするときの再インポート時間を短縮できますが、かなり多くの領域と転送時間がかかります。あなたの好きな方法を選んで下さい(Pick your poison)！
zh_tw: 若刪除該資料夾中的檔案 (或整個資料夾)，則素材會被自動重新匯入。因此，不一定要將該資料夾簽入版本控制系統中。有該資料夾可加速在其他電腦上簽出專案後重新匯入的時間，但就需要更多空間與傳輸時間。可自行選擇！

source: Changing import resource type
cs: Změna typu importovaného zdroje
de: Importressourcentyp ändern
es: Cambiar el tipo de recurso importado
it: Cambiare il tipo della risorsa da importare
ja: インポートリソースの種類の変更
ko: 가져오기 리소스 타입 변경하기
zh_tw: 更改匯入資源類型

source: Some source assets can be imported as different types of resources. For this, select the relevant type of resource desired and press "Reimport":
cs: Některé zdrojové položky lze importovat jako různé typy zdrojů. Za tímto účelem vyberte příslušný typ požadovaného zdroje a stiskněte tlačítko "Reimport":
de: Einige Quellressourcen können auf verschiedene Arten von Ressourcen importiert werden. Wählen Sie dazu den gewünschten Ressourcentyp aus und klicken Sie auf "Reimportieren":
es: Algunos recursos de origen pueden importarse como diferentes tipos de recursos. Para ello, selecciona el tipo de recurso deseado y pulsa "Reimportar":
it: Alcuni asset possono essere importati come risorse di tipo differente. Per questo, seleziona il tipo desiderato e premi "Reimporta":
ja: 一部のソースアセットは、さまざまなタイプのリソースとしてインポートできます。このために、必要なリソースの種別を選択し、「再インポート」を押します:
ko: 일부 원본 애셋은 리소스의 다른 타입으로 가져올 수 있습니다. 이를 위해, 원하는 리소스의 관련된 타입을 선택하고 "다시 가져오기"를 누르세요:
zh_tw: 有些素材可以匯入為不同類型的資源。若要匯入為不同類型，選擇需要的資源類型並點擊 [重新匯入]：

source: Changing default import parameters
cs: Změna výchozích parametrů importu
de: Standard-Importparameter ändern
es: Cambiar los parámetros de importación por defecto
it: Cambiare i parametri di importazione standard
ja: デフォルトのインポートパラメーターの変更
ko: 디폴트 가져오기 매개변수 변경하기
zh_tw: 更改預設匯入參數

source: Different types of games might require different defaults. Changing the defaults per project can be achieved by using the "Preset.." Menu. Besides some resource types offering presets, the default setting can be saved and cleared too:
cs: Různé typy her mohou vyžadovat různá výchozí nastavení. Změnu výchozích nastavení pro jednotlivé projekty lze provést pomocí nabídky "Přednastavit..". Kromě toho, že některé typy zdrojů nabízejí vlastní předvolby, lze výchozí nastavení také uložit či smazat:
de: Verschiedene Arten von Spielen können unterschiedliche Vorgaben erfordern. Die Änderung der Voreinstellungen pro Projekt kann mit Hilfe des "Preset.."-Menüs erreicht werden. Neben einigen Ressourcentypen, die Voreinstellungen anbieten, kann die Voreinstellung auch gespeichert und gelöscht werden:
es: Diferentes tipos de juegos pueden requerir diferentes valores predeterminados. El cambio de los valores predeterminados por proyecto se puede lograr utilizando el botón "Preset..." del menú. Además hay algunos tipos de recursos que ofrecen configuraciones preestablecidas, la configuración por defecto también se puede guardar y borrar:
it: Giochi differenti possono richiedere diversi preconfigurazioni standard, anche detti preset. Cambiare questi parametri per progetto può essere fatto usando il menu "Preset..". Inoltre alcuni tipi di risorse offrono preset già fatti, che possono essere salvati ma anche cancellati:
ja: ゲームの種類によって、必要なデフォルトが異なる場合があります。プロジェクトごとにデフォルトを変更するには、「プリセット..」メニューを使用します。プリセットを提供する一部のリソースタイプのほかに、デフォルト設定を保存したり消去したりすることもできます:
ko: 다른 타입의 게임에는 다른 기본 값이 필요할 것입니다. 프로젝트마다 기본 값을 바꾸려면 "Preset.." 메뉴를 사용할 수 있습니다. 프리셋을 제공하는 일부 리소스 타입 밖에도, 기본 값 설정을 저장하고 지울 수도 있습니다:
zh_tw: 依據遊戲類型的不同可能需要不同預設值。可以使用 [預設設定...] 選單來設定各專案的預設值。除了某些預設提供的資源類型，也可以保存或清除預設設定：

source: Simplicity is key!
cs: Klíčem je jednoduchost!
de: Einfachheit ist der Schlüssel!
es: ¡La sencillez es la clave!
it: La semplicità è la chiave!
ja: シンプルさが鍵です!
ko: 단순함이 핵심입니다!
zh_tw: 簡單是關鍵！

source: This is a very simple workflow which should take very little time to get used to. It also enforces a more correct way to deal with resources.
cs: Jedná se o velmi jednoduchý pracovní postup, na se dá zvyknout velice rychle. Podporuje také korektnější způsob nakládání se zdroji.
de: Dies ist ein sehr einfacher Arbeitsablauf, an den man sich sehr schnell gewöhnt. Es erzwingt auch einen korrekteren Umgang mit Ressourcen.
es: Esto es un flujo de trabajo simple el cual tomará poco tiempo en acostumbrarse. También fuerza un modo mejor para tratar con recursos.
it: Questo è un semplice sistema che richiede poco tempo per abituarsi. Inoltre costringe a gestire le risorse nel modo più corretto.
ja: これは非常に単純なワークフローであり、慣れるまでにはほとんど時間がかかりません。また、より正確なリソースの処理方法も強制します。
ko: 이것은 매우 간단한 워크플로로 익숙해지는데 얼마 안 걸릴 것입니다. 그리고 리소스를 다루는데 더 정확한 방법을 유도합니다.
zh_tw: 這個工作流程很簡短，要習慣應該不需要花上太多時間。此外，本工作流程也能強制以更正確的方式來處理資源。

source: There are many types of assets available for import, so please continue reading to understand how to work with all of them!
cs: Pro import je k dispozici mnoho typů zdrojů, proto pokračujte ve čtení, abyste pochopili, jak se všemi pracovat!
de: Es gibt viele Arten von Nutzerinhalten die importiert werden können. Lesen Sie also weiter um zu verstehen, wie Sie mit allen arbeiten können!
es: Existen muchos tipos de recursos disponibles para importar, así que por favor continúa leyendo para entender cómo trabajar con todos ellos!
it: Ci sono vari tipi di asset disponibili per essere importati, quindi continua a leggere per capire come lavorare con essi!
ja: インポート可能なアセットの種類はたくさんありますので、そのすべてを操作する方法を理解するために読んでください!
ko: 많은 타입의 애셋을 가져오기로 이용할 수 있습니다, 따라서 이 모든 것들을 가지고 작업하는 방법을 이해하기 위해 계속 읽어주세요!
zh_tw: 也有許多可匯入的素材類型，請繼續閱讀以瞭解如何處理這些素材！

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
es: Estado de traducción
it: Stato della traduzione
ja: 翻訳ステータス
ko: 번역 상태
