Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/i18n/internationalizing_games.po
Languages: es, fr, ja, pt_br

source: Internationalizing games
es: Internacionalizando los juegos
fr: Internationaliser des jeux
ja: ゲームの国際化
pt_br: Internacionalizando jogos

source: Introduction
es: Introducción
ja: はじめに
pt_br: Introdução

source: Sería excelente que el mundo hablara solo un idioma (It would be great if the world spoke only one language). Unfortunately for us developers, that is not the case. While indie or niche games usually do not need localization, games targeting a more massive market often require localization. Godot offers many tools to make this process more straightforward, so this tutorial is more like a collection of tips and tricks.
es: Sería excelente que el mundo hablara solo un idioma. Desafortunadamente para nosotros los desarrolladores, ese no es el caso. Mientras que los juegos independientes o de nicho no suelen necesitar localización, los juegos dirigidos a un mercado más masivo a menudo requieren localización. Godot ofrece muchas herramientas para que este proceso sea más sencillo, por lo que este tutorial es más bien una colección de consejos y trucos.
fr: Sería excelente que el mundo hablara solo un idioma (Ce serait formidable si le monde ne parlait qu'une seule langue). Malheureusement pour nous, développeurs, ce n'est pas le cas. Alors que les jeux indépendants ou de niche n'ont généralement pas besoin d'être localisés, les jeux ciblant un marché plus massif nécessitent souvent une localisation. Godot offre de nombreux outils pour rendre ce processus plus simple, ce tutoriel est donc plutôt une collection de trucs et astuces.
ja: Sería excelente que el mundo hablara solo un idioma(世界が一つの言語しか話さなかったら素晴らしいことだ)。残念ながら、私たち開発者にとっては、そうではありません。インディーズのゲームやニッチなゲームは通常ローカライズを必要としませんが、より大規模な市場をターゲットにしたゲームは、多くの場合、ローカライズを必要とします。Godot は、このプロセスをより簡単にするための多くのツールを提供しています。このチュートリアルは、ヒントとコツを集めたようなものです。
pt_br: It would be great if the world spoke only one language (Seria ótimo se o mundo falasse um só idioma) Infelizmente para nós desenvolvedores, esse não é o caso. Enquanto jogos independentes ou de nicho normalmente não precisam de localização, jogos visando um mercado mais massivo muitas vezes requerem localização. O Godot oferece muitas ferramentas para fazer este processo mais direto, então este tutorial é mais como uma coleção de dicas e truques.

source: Localization is usually done by specific studios hired for the job and, despite the huge amount of software and file formats available for this, the most common way to do localization to this day is still with spreadsheets. The process of creating the spreadsheets and importing them is already covered in the :ref:`doc_importing_translations` tutorial, so this one could be seen more like a follow-up to that one.
es: La localización suele ser realizada por estudios específicos contratados para el trabajo y, a pesar de la gran cantidad de software y formatos de archivo disponibles para ello, la forma más común de realizar la localización hasta el día de hoy sigue siendo con hojas de cálculo. El proceso de crear las hojas de cálculo e importarlas ya está cubierto en el tutorial :ref:`doc_importing_translations`, por lo que éste podría verse más como una continuación del mismo.
fr: La localisation est généralement effectuée par des studios spécifiques engagés pour ce travail et, malgré l'énorme quantité de logiciels et de formats de fichiers disponibles pour cela, la façon la plus courante de faire de la localisation à ce jour est encore avec des feuilles de calcul. Le processus de création et d'importation des feuilles de calcul est déjà couvert dans le tutoriel :ref:`doc_importing_translations`, donc celui-ci pourrait être considéré comme sa suite.
ja: ローカライズは通常、仕事のために雇われた特定のスタジオによって行われ、このために利用可能なソフトウェアとファイル形式の膨大な量にもかかわらず、今日にローカライズを行う最も一般的な方法は、まだスプレッドシートです。スプレッドシートの作成とインポートのプロセスについては、\ :ref:`doc_importing_translations`\ チュートリアルですでに説明されています。
pt_br: A localização geralmente é feita por estúdios específicos contratados para a função e, apesar da enorme quantidade de softwares e formatos de arquivos disponíveis para isso, a forma mais comum de fazer localização até hoje ainda é com planilhas. O processo de criar as planilhas e importá-las já é abordado no tutorial :ref:`doc_importing_translations`, então este poderia ser visto mais como uma continuação daquele.

source: We will be using the official demo as an example; you can `download it from the Asset Library <https://godotengine.org/asset-library/asset/134>`_.
es: Usaremos la demo oficial como ejemplo, puedes `descargarla desde la Asset Library <https://godotengine.org/asset-library/asset/134>`_.
fr: Nous allons utiliser la démo officielle comme exemple ; vous pouvez la `télécharger depuis la bibliothèque d'assets <https://godotengine.org/asset-library/asset/134>`_.
ja: 公式デモを例に使用します。アセットライブラリからダウンロードできます。`download it from the Asset Library <https://godotengine.org/asset-library/asset/134>`_\ 。
pt_br: Utilizaremos a demonstração oficial como exemplo; você pode `baixá-la da Biblioteca de Assets <https://godotengine.org/asset-library/asset/134>`_.

source: Configuring the imported translation
es: Configuración de la traducción importada
fr: Configuration de la traduction importée
ja: インポートされた翻訳の構成
pt_br: Configurando a tradução importada

source: Translations can get updated and re-imported when they change, but they still have to be added to the project. This is done in **Project → Project Settings → Localization**:
es: Las traducciones pueden ser actualizadas y reimportadas cuando cambian, pero tienen que ser añadidas al proyecto. Esto se hace en **Proyecto → Ajustes del proyecto → Traducciones**:
fr: Les traductions peuvent être mises à jour et réimportées lorsqu'elles changent, mais elles doivent toujours être ajoutées au projet. Cela se fait dans **Projet → Paramètres du projet → Localisation** :
ja: 翻訳は変更時に更新および再インポートできますが、プロジェクトに追加する必要があります。これは **プロジェクト → プロジェクト設定 → ローカライズ** で行います:
pt_br: As traduções podem ser atualizadas e reimportadas quando são alteradas, mas ainda precisam ser adicionadas ao projeto. Isso é feito em **Projeto → Configurações do projeto → Localização**:

source: The above dialog is used to add or remove translations project-wide.
es: Este cuadro de diálogo permite añadir o eliminar traducciones en todo el proyecto.
fr: La boîte de dialogue ci-dessus permet d'ajouter ou de supprimer des traductions à l'échelle du projet.
ja: 上記のダイアログは、プロジェクト全体の翻訳を追加または削除するために使用されます。
pt_br: A caixa de diálogo acima é usada para adicionar ou remover traduções em todo o projeto.

source: Localizing resources
es: Localización de recursos
fr: Localisation des ressources
ja: リソースのローカライズ
pt_br: Localizando recursos

source: It is also possible to instruct Godot to use alternate versions of assets (resources) depending on the current language. The **Remaps** tab can be used for this:
es: También es posible indicar a Godot para que abra versiones alternativas de assets (recursos) dependiendo del idioma actual. Para ello existe la pestaña "Remapeos":
fr: Il est également possible de demander à Godot d'utiliser des versions alternatives des assets (ressources) selon la langue courante. L'onglet **Remaps** peut être utilisé pour cela :
ja: また、現在の言語に応じて、アセット(リソース)の代替バージョンを使用するようにGodotに指示することもできます。**Remaps**\ タブは、次の場合に使用できます:
pt_br: Também é possível instruir o Godot para usar versões alternativas de assets (recursos), dependendo do idioma atual. A aba **Remapeamentos*** pode ser usada para isso:

source: Select the resource to be remapped, then add some alternatives for each locale.
es: Selecciona el recurso a ser remapeado, y las alternativas para cada localización.
fr: Sélectionnez la ressource à remapper, puis ajoutez des alternatives pour chaque région.
ja: リマップするリソースを選択し、ロケールごとに代替手段を追加します。
pt_br: Selecione o recurso a ser remapeado e, em seguida, adicione algumas alternativas para cada locale.

source: Converting keys to text
es: Conversión de claves a texto
fr: Conversion de clés en texte
ja: キーをテキストに変換する
pt_br: Convertendo chaves em texto

source: Some controls, such as :ref:`Button <class_Button>` and :ref:`Label <class_Label>`, will automatically fetch a translation if their text matches a translation key. For example, if a label's text is "MAIN_SCREEN_GREETING1" and that key exists in the current translation, then the text will automatically be translated.
es: Algunos Control como :ref:`Button <class_Button>`, :ref:`Label <class_Label>`, etc. obtendrán automáticamente una traducción cada vez que se establezca una clave en lugar de un texto. Por ejemplo, si se asigna una etiqueta "MAIN_SCREEN_GREETING1" y existe una clave para diferentes idiomas en las traducciones, ésta se convertirá automáticamente.
fr: Certains contrôles, tels que :ref:`Button <class_Button>` et :ref:`Label <class_Label>`, vont automatiquement chercher une traduction si leur texte correspond à une clé de traduction. Par exemple, si le texte d'une étiquette est " MAIN_SCREEN_GREETING1 " et que cette clé existe dans la traduction actuelle, le texte sera automatiquement traduit.
ja: \ :ref:`Button <class_Button>`\ や\ :ref:`Label <class_Label>`\ などの一部のコントロールは、テキストが翻訳キーと一致する場合に自動的に翻訳を取得します。たとえば、ラベルのテキストが「MAIN_SCREEN_GREETING1」で、そのキーが現在の翻訳に存在する場合、テキストは自動的に翻訳されます。
pt_br: Alguns controles, como :ref:`Button <class_Button>` e :ref:`Label <class_Label>` irão automaticamente buscar uma tradução se o seu texto corresponder a uma chave de tradução. Por exemplo, se o texto de um rótulo for "MAIN_SCREEN_GREETING1" e essa chave existir na tradução atual, o texto será traduzido automaticamente.

source: This automatic translation behavior may be undesirable in certain cases. For instance, when using a Label to display a player's name, you most likely don't want the player's name to be translated if it matches a translation key. To disable automatic translation on a specific node, use :ref:`Object.set_message_translation<class_Object_method_set_message_translation>` and send a :ref:`Object.notification<class_Object_method_notification>` to update the translation::
es: Este comportamiento de traducción automática puede ser indeseable en ciertos casos. Por ejemplo, cuando usa una etiqueta para mostrar el nombre de un jugador, lo más probable es que no desee que el nombre del jugador se traduzca si coincide con una clave de traducción. Para deshabilitar la traducción automática en un nodo específico, use :ref:`Object.set_message_translation<class_Object_method_set_message_translation>` y envíe un :ref:`Object.notification<class_Object_method_notification>` para actualizar la traducción::
fr: Ce comportement de traduction automatique peut être indésirable dans certains cas. Par exemple, lorsque vous utilisez un Label pour afficher le nom d'un joueur, vous ne souhaitez probablement pas que le nom du joueur soit traduit s'il correspond à une clé de traduction. Pour désactiver la traduction automatique sur un nœud spécifique, utilisez :ref:`Object.set_message_translation<class_Object_method_set_message_translation>` et envoyez un :ref:`Object.notification<class_Object_method_notification>` pour mettre à jour la traduction :
pt_br: Esse comportamento de tradução automática pode ser indesejável em certos casos. Por exemplo, ao usar um rótulo para exibir o nome de um jogador, você provavelmente não deseja que o nome do jogador seja traduzido se corresponder a uma chave de tradução. Para desativar a tradução automática em um nó específico, use :ref:`Object.set_message_translation<class_Object_method_set_message_translation>` e envie um :ref:`Object.notification<class_Object_method_notification>` para atualizar a tradução::

source: For more complex UI nodes such as OptionButtons, you may have to use this instead::
es: Para nodos de interfaz de usuario más complejos, como OptionButtons, es posible que deba usar esto en su lugar::
fr: Pour les nœuds d'interface utilisateur plus complexes, tels que les boutons d'option, vous devrez peut-être utiliser ceci à la place :
pt_br: Para nós de interface do usuário mais complexos, como OptionButtons, talvez seja necessário usar isso:

source: In code, the :ref:`Object.tr() <class_Object_method_tr>` function can be used. This will just look up the text in the translations and convert it if found:
es: Para código, se puede utilizar la función :ref:`Object.tr() <class_Object_method_tr>`. Esto simplemente buscará el texto en las traducciones y lo convertirá si lo encuentra:
fr: Dans le code, la fonction :ref:`Object.tr() <class_Object_method_tr>` peut être utilisée. Cela va juste chercher le texte dans les traductions et le convertir s'il est trouvé :
ja: コードでは、\ :ref:`Object.tr() <class_Object_method_tr>` 関数を使用できます。これにより、翻訳のテキストが検索され、見つかった場合は変換されます:
pt_br: No código, a função :ref:`Object.tr() <class_Object_method_tr>` pode ser usada. Isso apenas pesquisará o texto nas traduções e o converterá se encontrado:

source: Making controls resizable
es: Redimensionar los controles
fr: Rendre les contrôles redimensionnables
ja: コントロールのサイズを変更可能にする
pt_br: Tornando os controles redimensionáveis

source: The same text in different languages can vary greatly in length. For this, make sure to read the tutorial on :ref:`doc_size_and_anchors`, as dynamically adjusting control sizes may help. :ref:`Container <class_Container>` can be useful, as well as the text wrapping options available in :ref:`Label <class_Label>`.
es: El mismo texto en diferentes idiomas puede variar mucho en longitud. Por este motivo, asegúrate de leer el tutorial sobre :ref:`doc_size_and_anchors`, ya que puede ser útil tener tamaños de control ajustados dinámicamente. `Ref:`Container <class_Container>`, así como las múltiples opciones en :ref:`Label <class_Label>` para el ajuste del texto.
fr: Le même texte dans différentes langues peut varier considérablement en longueur. Pour cela, assurez-vous de lire le tutoriel sur :ref:`doc_size_and_anchors`, car ajuster dynamiquement la taille des contrôles peut aider. :ref:`Container <class_Container>` peut être utile, ainsi que les options d'habillage de texte disponibles dans :ref:`Label <class_Label>`.
ja: 異なる言語で同じテキストの長さが大きく異なる場合があります。このためには、コントロール サイズを動的に調整すると役立つ可能性があるため、\ :ref:`doc_size_and_anchors` のチュートリアルを必ずお読みください。\ :ref:`Container <class_Container>` だけでなく、\ :ref:`Label <class_Label>` で使用できるテキストの折り返しオプションも便利です。
pt_br: O mesmo texto em diferentes idiomas pode variar muito em comprimento. Para isso, certifique-se de ler o tutorial em :ref:`doc_size_and_anchors`, pois ajustar dinamicamente os tamanhos de controle pode ajudar. :ref:`Container <class_Container>` pode ser útil, assim como as opções de quebra de texto disponíveis em :ref:`Label <class_Label>`.

source: Godot has a server handling low-level translation management called the :ref:`TranslationServer <class_TranslationServer>`. Translations can be added or removed during run-time; the current language can also be changed at run-time.
es: Godot dispone de un servidor para la gestión de traducciones de bajo nivel llamado :ref:`TranslationServer <class_TranslationServer>`. Las traducciones pueden agregarse o eliminarse durante el tiempo de ejecución, y también se puede cambiar el idioma actual.
fr: Godot a un serveur qui gère la traduction de bas niveau appelé :ref:`TranslationServer <class_TranslationServer>`. Les traductions peuvent être ajoutées ou supprimées pendant l'exécution ; la langue actuelle peut également être modifiée pendant l'exécution.
ja: Godot には、\ :ref:`TranslationServer <class_TranslationServer>` と呼ばれる低レベルの翻訳管理を処理するサーバーがあります。翻訳は、実行時に追加または削除できます。現在の言語は、実行時に変更することもできます。
pt_br: O Godot tem um servidor que lida com gerenciamento de tradução de baixo nível chamado :ref:`TranslationServer <class_TranslationServer>`. As traduções podem ser adicionadas ou removidas durante o tempo de execução; o idioma atual também pode ser alterado em tempo de execução.

source: Testing translations
es: Probando traducciones
fr: Tester les traductions
pt_br: Testando traduções

source: You may want to test a project's translation before releasing it. Godot provides two ways to do this.
es: Es posible que desees probar la traducción de un proyecto antes de lanzarlo. Godot ofrece dos formas de hacerlo.
fr: Vous souhaiterez tester les traductions d'un projet avant de le mettre en ligne. Godot propose deux façons de le faire.
pt_br: Você pode querer testar a tradução de um projeto antes de lançá-lo. Godot fornece duas maneiras de fazer isso.

source: First, in the Project Settings, under **Input Devices > Locale**, there is a **Test** property. Set this property to the locale code of the language you want to test. Godot will run the project with that locale when the project is run (either from the editor or when exported).
es: Primero, en la configuración del proyecto, en **Dispositivos de entrada > Localización**, hay una propiedad llamada **Test**. Configura esta propiedad con el código de idioma de la localización que deseas probar. Godot ejecutará el proyecto con esa localización cuando se ejecute el proyecto (ya sea desde el editor o al exportarlo).
fr: Tout d'abord, dans les Préférences du projet, sous **Périphériques d’entrée > Langue** se trouve la propriété **Test**. Insérez le code de la langue que vous souhaitez tester dans cette propriété. Lorsque Godot lancera le projet (depuis l’éditeur ou en l'exportant) ce dernier utilisera la langue choisie.
pt_br: Primeiro, em Configurações do Projeto, em **Input Devices > Locale**, há uma propriedade **Test**. Configure esta propriedade para o código de localidade do idioma que você deseja testar. Godot executará o projeto com essa localidade quando o projeto for executado (seja do editor ou quando exportado).

source: Keep in mind that since this is a project setting, it will show up in version control when it is set to a non-empty value. Therefore, it should be set back to an empty value before committing changes to version control.
es: Ten en cuenta que, dado que esta es una configuración del proyecto, aparecerá en el control de versiones cuando se establezca en un valor no vacío. Por lo tanto, debes asegurarte de restablecerlo a un valor vacío antes de realizar cambios y confirmarlos en el control de versiones.
fr: A noter qu’étant donne qu'il s'agit d'une préférence du projet, elle apparaîtra dans le système de contrôle de version lorsque non-vide. Pour cette raison, sa valeur doit être vidée avant de soumettre les changements au système de contrôle de version.
pt_br: Lembre-se de que, como essa é uma configuração do projeto, ela aparecerá no controle de versão quando for definida como um valor não vazio. Portanto, ele deve ser definido como um valor vazio antes de confirmar as alterações no controle de versão.

source: Translations can also be tested when running Godot from the command line. For example, to test a game in French, the following argument can be supplied:
es: El lenguaje puede ser probado cuando se ejecuta Godot desde la línea de comandos. Por ejemplo, para probar un juego en francés, se pueden proporcionar los siguientes argumentos:
fr: Les translations peuvent être testées en exécutant Godot depuis la ligne de commande. Par exemple, pour tester un jeu en français, l'argument suivant peut être fourni :
pt_br: O idioma pode ser testado ao executar o Godot a partir da linha de comando. Por exemplo, para testar um jogo em francês, o seguinte argumento pode ser fornecido:

source: Translating the project name
es: Traducir el nombre del proyecto
fr: Traduire le nom du projet
ja: プロジェクト名の翻訳
pt_br: Traduzindo o nome do projeto

source: The project name becomes the app name when exporting to different operating systems and platforms. To specify the project name in more than one language, create a new setting ``application/name`` in the **Project Settings** and append the locale identifier to it. For instance, for Spanish, this would be ``application/name_es``:
es: El nombre del proyecto se convierte en el nombre de la aplicación cuando se exporta a diferentes sistemas operativos y plataformas. Para especificar el nombre del proyecto en más de un idioma, crea un nuevo ajuste ``application/name`` en el diálogo de **Ajustes del Proyecto** y añádele el identificador de localización. Por ejemplo, para español, sería ``application/name_es``:
fr: Le nom du projet devient le nom de l'application lors de l'exportation vers différents systèmes d'exploitation et plateformes. Pour spécifier le nom du projet dans plus d'une langue, créez un nouveau paramètre ``application/name`` dans les **Paramètres du projet** et ajoutez-y l'identifiant régional. Par exemple, pour l'espagnol, ce serait ``application/name_es`` :
ja: 異なるオペレーティングシステムやプラットフォームにエクスポートするときに、プロジェクト名がアプリ名になります。複数の言語でプロジェクト名を指定するには、\ **プロジェクト設定** で新しい設定 ``application/name`` を作成し、ロケール識別子を追加します。たとえば、スペイン語の場合、これは ``application/name_es`` になります:
pt_br: O nome do projeto se torna o nome do aplicativo ao exportar para diferentes sistemas operacionais e plataformas. Para especificar o nome do projeto em mais de um idioma, crie uma nova configuração ``application/name`` nas **Configurações do projeto** e anexe o identificador do locale a ele. Por exemplo, para o espanhol, isto seria ``application/name_es``:

source: If you are unsure about the language code to use, refer to the :ref:`list of locale codes <doc_locales>`.
es: Si no está seguro del código de idioma a usar, consulte la :ref:`list of locale codes <doc_locales>`.
fr: Si vous n'êtes pas sûr du code de langue à utiliser, référez-vous à la :ref:`liste des codes de langue <doc_locales>`.
ja: 使用する言語コードが不明な場合は、\ :ref:`list of locale codes <doc_locales>` を参照して下さい。
pt_br: Se você não tem certeza sobre o código do idioma a ser usado, consulte a :ref:`lista de códigos de locale <doc_locales>`.

source: Translation status
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
pt_br: Progresso da Tradução

source: TranslationServer
ja: 翻訳サーバー
