Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_2d_game/07.finishing-up.po
Languages: ja, ru

source: Finishing up
ja: 仕上げ
ru: Завершающие штрихи

source: We have now completed all the functionality for our game. Below are some remaining steps to add a bit more "juice" to improve the game experience.
ja: これで、ゲームのすべての機能が完成しました。以下は、ゲーム体験を向上させるためにもう少し「精彩」を加えるための、いくつかの残りの手順です。
ru: На данный момент мы завершили всю функциональность для нашей игры. Ниже остаются некоторые шаги, слегка добавляющие "сока" и улучшающие игровой опыт.

source: Feel free to expand the gameplay with your own ideas.
ja: あなたのアイデアで、自由にゲーム性を拡張してください。
ru: Не стесняйтесь совершенствовать геймплей своими собственными идеями.

source: Background
ja: Background(背景)
ru: Фон

source: The default gray background is not very appealing, so let's change its color. One way to do this is to use a :ref:`ColorRect <class_ColorRect>` node. Make it the first node under ``Main`` so that it will be drawn behind the other nodes. ``ColorRect`` only has one property: ``Color``. Choose a color you like and select "Layout" -> "Anchors Preset" -> "Full Rect" either in the toolbar at the top of the viewport or in the inspector so that it covers the screen.
ru: Серый фон по умолчанию не очень привлекателен, так что давайте поменяем его цвет. Один из способов сделать это - использовать узел :ref:`ColorRect <class_ColorRect>`. Создайте его первым узлом под ``Main``, таким образом он будет прорисовываться за другими узлами. ``ColorRect`` имеет только одно свойство: ``Color``. Подберите цвет, который вам нравится, и выберите "Layout" -> "Anchors Preset" -> "Полный прямоугольник" либо на панели инструментов в верхней части окна просмотра, либо в инспекторе так, чтобы он закрывал экран.

source: You could also add a background image, if you have one, by using a ``TextureRect`` node instead.
ja: 背景画像がある場合は、代わりに ``TextureRect`` ノードを使用して、それを追加することもできます。
ru: Вы также можете добавить фоновое изображение, если у вас оно есть, используя вместо ``ColorRect`` узел ``TextureRect``.

source: Sound effects
ja: 効果音
ru: Звуковые эффекты

source: Sound and music can be the single most effective way to add appeal to the game experience. In your game's **art** folder, you have two sound files: "House In a Forest Loop.ogg" for background music, and "gameover.wav" for when the player loses.
ru: Звук и музыка могут быть одним из самых эффективных способов придания игровому процессу большей привлекательности. В папке ресурсов вашей игры есть два звуковых файла: "House In a Forest Loop.ogg" для фоновой музыки и "gameover.wav" для проигрыша игрока.

source: Add two :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` nodes as children of ``Main``. Name one of them ``Music`` and the other ``DeathSound``. On each one, click on the ``Stream`` property, select "Load", and choose the corresponding audio file.
ja: 2つの\ :ref:`AudioStreamPlayer <class_AudioStreamPlayer>`\ ノードを ``Main`` の子として追加します。その1つに ``Music`` 、もう1つに ``DeathSound`` と名前を付けます。各ファイルにて ``Stream`` プロパティをクリックし、「読み込み」を選択してから、対応するオーディオファイルを選択します。
ru: Добавьте два узла :ref:`AudioStreamPlayer <class_AudioStreamPlayer>` как дочерние для ``Main``. Назовите один из них ``Music``, а другой - ``DeathSound``. В каждом из них нажмите на свойство ``Stream``, выберите "Загрузить" и добавьте соответствующий звуковой файл.

source: All audio is automatically imported with the ``Loop`` setting disabled. If you want the music to loop seamlessly, click on the Stream file arrow, select ``Make Unique``, then click on the Stream file and check the ``Loop`` box.
ru: Весь звук автоматически импортируется при отключенном параметре ``Loop`` (зацикливание). Если вы хотите, чтобы музыка зациклилась, щелкните маленькую стрелку справа от параметра Stream, выберите ``Сделать уникальным``, затем нажмите на файл Stream и установите ``Loop`` (с англ. - зациклить).

source: To play the music, add ``$Music.play()`` in the ``new_game()`` function and ``$Music.stop()`` in the ``game_over()`` function.
ja: 音楽を再生するには、 ``new_game()`` 関数に ``$Music.play()`` を追加し、 ``game_over()`` 関数に ``$Music.stop()`` を追加します。
ru: Для воспроизведения музыки добавьте ``$Music.play()`` в функцию ``new_game()`` и ``$Music.stop()`` в функцию ``game_over()``.

source: Finally, add ``$DeathSound.play()`` in the ``game_over()`` function.
ja: 最後に、 ``game_over()`` 関数に ``$DeathSound.play()`` を追加します。
ru: Наконец, добавьте ``$DeathSound.play()`` в функцию ``game_over()``.

source: Keyboard shortcut
ja: キーボード ショートカット
ru: Сочетание клавиш

source: Since the game is played with keyboard controls, it would be convenient if we could also start the game by pressing a key on the keyboard. We can do this with the "Shortcut" property of the ``Button`` node.
ja: このゲームはキーボード コントロールにてプレイするので、キーボードのキーを押してゲームを開始できると便利です。それには ``Button`` ノードの「Shortcut」プロパティを使用すれば可能です。
ru: Поскольку в игру играют с помощью клавиш управления, было бы удобно, если бы мы могли начать игру, нажав клавишу на клавиатуре. Мы можем сделать это с помощью свойства "Shortcut" узла ``Button``.

source: In a previous lesson, we created four input actions to move the character. We will create a similar input action to map to the start button.
ja: 前回のレッスンでは、キャラクターを移動させるための4つの入力アクションを作成しました。同様の入力アクションを作成して、これをスタートボタンに対応させます。
ru: В предыдущем уроке мы создали четыре события ввода для перемещения персонажа. Мы создадим аналогичное событие ввода для привязки к кнопке "Старт".

source: Select "Project" -> "Project Settings" and then click on the "Input Map" tab. In the same way you created the movement input actions, create a new input action called ``start_game`` and add a key mapping for the :kbd:`Enter` key.
ja: 「プロジェクト」("Project") -> 「プロジェクト設定...」("Project Settings")を選択し、「インプットマップ」("Input Map")タブをクリックします。移動入力アクションを作成したのと同じ方法で、\ ``start_game``\ という新しい入力アクションを作成し、 :kbd:`Enter` キー用のキーマッピングを追加してください。
ru: Выберите "Проект" -> "Настройки проекта", а затем перейдите на вкладку "Список действий". Точно так же, как вы создавали события ввода для движения, создайте новое событие под названием ``start_game`` и добавьте в него клавишу :kbd:`Enter``.

source: Now would be a good time to add controller support if you have one available. Attach or pair your controller and then under each input action that you wish to add controller support for, click on the "+" button and press the corresponding button, d-pad, or stick direction that you want to map to the respective input action.
ru: Сейчас самое время добавить поддержку контроллера, если он у вас есть. Подключите контроллер, а затем под каждым действием ввода, для которого вы хотите добавить поддержку контроллера, нажмите кнопку "+" и нажмите соответствующую кнопку, крестовину или направление джойстика, которое вы хотите сопоставить с соответствующим действием ввода. .

source: In the ``HUD`` scene, select the ``StartButton`` and find its **Shortcut** property in the Inspector. Create a new :ref:`Shortcut <class_Shortcut>` resource by clicking within the box, open the **Events** array and add a new array element to it by clicking on **Array[InputEvent] (size 0)**.
ru: В сцене ``HUD`` выберите кнопку ``StartButton`` и найдите ее свойство Shortcut в инспекторе. Создайте новый ресурс :ref:`Shortcut <class_Shortcut>`, щелкнув внутри поля, откройте массив «Events» и добавьте к нему новый элемент массива, щелкнув **Array[InputEvent] (size 0)**.

source: Create a new :ref:`InputEventAction <class_InputEventAction>` and name it ``start_game``.
ru: Создайте новое :ref:`InputEventAction <class_InputEventAction>` и назовите его ``start_game``.

source: Now when the start button appears, you can either click it or press :kbd:`Enter` to start the game.
ja: スタートボタンが表示されたら、クリックするか、\ :kbd:`Enter` を押してゲームを開始します。
ru: Теперь, когда появляется кнопка запуска, вы можете либо нажать на неё, либо на клавишу :kbd:`Enter`, чтобы начать игру.

source: And with that, you completed your first 2D game in Godot.
ja: これで、Godotで最初の2Dゲームが完成しました。
ru: И на этом вы завершили свою первую 2D-игру в Godot.

source: You got to make a player-controlled character, enemies that spawn randomly around the game board, count the score, implement a game over and replay, user interface, sounds, and more. Congratulations!
ja: プレイヤーが操作するキャラクター、ゲームボードの周囲にランダムに出現する敵、スコアのカウント、ゲームオーバーやリプレイの実装、ユーザーインターフェース、サウンドなど、いろいろ作り込んできました。おめでとうございます!
ru: Вы сделали персонажа, управляемого игроком, врагов, случайно появляющихся на игровом поле, подсчёт очков, реализовали завершение и повтор игры, пользовательский интерфейс, звуки и многое другое. Поздравляем!

source: There's still much to learn, but you can take a moment to appreciate what you achieved.
ja: まだまだ学ぶべきことはたくさんありますが、達成したことを理解する時間を持ちましょう。
ru: Вам еще многому предстоит научиться, но вы можете воспользоваться моментом, чтобы оценить то, чего вы достигли.

source: And when you're ready, you can move on to :ref:`doc_your_first_3d_game` to learn to create a complete 3D game from scratch, in Godot.
ja: そして、準備ができたら :ref:`doc_your_first_3d_game` に進み、Godotでゼロから完全な3Dゲームを作ることを学びましょう。
ru: А когда вы будете готовы, вы сможете перейти к :ref:`doc_your_first_3d_game`, чтобы изучить создание полноценной 3D-игры с нуля в Godot.

source: Translation status
ja: 翻訳ステータス
ru: Статус перевода

source: The default gray background is not very appealing, so let's change its color. One way to do this is to use a :ref:`ColorRect <class_ColorRect>` node. Make it the first node under ``Main`` so that it will be drawn behind the other nodes. ``ColorRect`` only has one property: ``Color``. Choose a color you like and select "Layout" -> "Full Rect" so that it covers the screen.
ja: デフォルトのグレーの背景はあまり魅力的ではないので、色を変更してみましょう。これを行う 1 つの方法は、\ :ref:`ColorRect <class_ColorRect>` ノードを使用することです。他のノードの後ろに描画されるように、それを ``Main`` の下の最初のノードにします。 ``ColorRect`` には、 ``Color`` というプロパティのみがあります。好きな色を選択し、「レイアウト」→「Rect全面」を選べば、画面はそれで覆われます。

source: Sound and music can be the single most effective way to add appeal to the game experience. In your game assets folder, you have two sound files: "House In a Forest Loop.ogg" for background music, and "gameover.wav" for when the player loses.
ja: サウンドと音楽は、ゲーム体験に魅力を与えるには最上級に効果的な方法となりえます。ゲームのアセットフォルダには、BGMの ``House In a Forest Loop.ogg`` と、プレイヤーが負けたとき用の ``gameover.wav`` という2つのサウンドファイルがあります。

source: In the ``HUD`` scene, select the ``StartButton`` and find its *Shortcut* property in the Inspector. Select "New Shortcut" and click on the "Shortcut" item. A second *Shortcut* property will appear. Select "New InputEventAction" and click the new "InputEventAction". Finally, in the *Action* property, type the name ``start_game``.
ja: \ ``HUD``\ シーンで \ ``StartButton``\ を選択し、インスペクタでその \ *Shortcut*\ プロパティを見つけます。「新規 Shortcut」を選択し、その「Shortcut」項目をクリックします。 2番目の \ *Shortcut*\ プロパティが表示されます。「新規 InputEventAction」を選択し、新しい「InputEventAction」をクリックします。 最後に、 \ *Action*\ プロパティに \ ``start_game``\ という名前を入力します。
