Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/complying_with_licenses.po
Languages: de, es, ko, pl, pt_br, ru, uk, zh_cn

source: For third-party components used by the engine:
es: Para componentes de terceros usados por el motor:
zh_cn: 对于引擎使用的第三方部件：

source: For miscellaneous engine contributor information. You don't have to include these ones in your project, but they're listed here for reference:
es: PAra información miscelánea de contribuyentes del motor. No necesitas incluir estas en tu proyecto, pero están listadas aquí para referencia:
zh_cn: 对于各位引擎贡献者的信息。你不需要将他们包括在你的项目中，但这些信息将会列在这里提供参考：

source: Credits screen
de: Credits-Bildschirm
es: Pantalla de créditos
ko: 크레딧 화면
pl: Ekran autorów i napisów końcowych gry (Credits screen)
pt_br: Tela de créditos
ru: Титры
uk: Титри
zh_cn: 演职员表

source: Include the above license text somewhere in the credits screen. It can be at the bottom after showing the rest of the credits. Most large studios use this approach with open source licenses.
de: Fügen Sie den obigen Lizenztext irgendwo in den Credits-Bildschirm ein. Es kann unten sein, nachdem der Rest der Credits angezeigt wurde. Die meisten großen Studios verwenden diesen Ansatz mit Open Source-Lizenzen.
es: Incluya el texto de la licencia anterior en algún lugar de la pantalla de créditos. Puede estar en la parte inferior después de mostrar el resto de créditos. La mayoría de los grandes estudios utilizan este enfoque con licencias de código abierto.
ko: 크레딧 화면 어딘가에 위의 라이선스 문구를 포함하십시오. 나머지 크레딧들을 보여준 뒤 맨 아래에 표시할 수도 있습니다. 대부분의 대규모 스튜디오들은 오픈 소스 라이선스에 대해 이 접근 방식을 사용합니다.
pl: Umieść powyższy tekst licencji gdzieś na ekranie napisów końcowych. Może znajdować się na samym końcu, po ukazaniu się wszystkich ułożonych przez Ciebie napisów końcowych. Większość dużych studiów stosuje to podejście w przypadku licencji typu open-source.
pt_br: Inclua o texto de licença acima em algum lugar na tela de créditos. Pode ser na parte inferior após mostrar o resto dos créditos. A maioria dos estúdios grandes usam esta abordagem com licenças de código aberto.
ru: Добавьте вышесказанный текст лицензии в титры. Этот текст может находится внизу, после остальных титров. Большинство больших студий используют такой подход с open-source лицензиями .
uk: Включіть наведений вище текст ліцензії десь в титрах. Він може бути внизу після показу решти титрів. Більшість великих студій використовують такий підхід для ліцензій з відкритим кодом.
zh_cn: 在片头画面的某处加入上述许可文字. 它可以在显示其余的片头后的底部. 大多数大型工作室都使用这种方法来处理开放源码许可证.

source: Licenses screen
de: Lizenzbildschirm
es: Pantalla de licencias
ko: 라이선스 화면
pl: Ekran licencji
pt_br: Tela de licenças
ru: Экран лицензий
uk: Екран ліцензій
zh_cn: 许可证显示

source: Some games have a special menu (often in the settings) to display licenses. This menu is typically accessed with a button called **Third-party Licenses** or **Open Source Licenses**.
es: Algunos juegos tienen un menú especial (normalmente en los ajustes) para mostrar licencias. Este menú es típicamente accesible con un botón llamado **Licencias de Terceros** o **Licencias de Código Abierto**.
zh_cn: 有的游戏有一个特设的菜单（通常在设置里面）来显示许可证。这个菜单通常通过\ **第三方协议**\ 或者\ **开源协议**\ 按钮访问。

source: Output log
de: Ausgabeprotokoll
es: Registro de salida
ko: 출력 로그
pl: Dziennik na wyjściu aplikacji (output log)
pt_br: Registro de saída
ru: Лог вывода
uk: Лог виводу
zh_cn: 输出日志

source: Printing the licensing text using the :ref:`print() <class_@GlobalScope_method_print>` function may be enough on platforms where a global output log is readable. This is the case on desktop platforms, Android and HTML5 (but not iOS).
es: Escribir el texto de la licencia con la función :ref:`print() <class_@GlobalScope_method_print>` puede ser suficiente en plataformas donde se puede leer un registro de salida global. Este es el caso de las plataformas de escritorio, Android y HTML5 (pero no iOS).
uk: Виведення тексту ліцензії за допомогою функції :ref:`print() <class_@GlobalScope_method_print>` може бути достатнім на платформах, де можна прочитати глобальний журнал виведення. Це стосується десктопних платформ, Android та HTML5 (але не iOS).
zh_cn: 对于可以阅读全局输出日志的平台，将许可证文本使用 :ref:`print() <class_@GlobalScope_method_print>` 输出可能就足够了。适用于桌面平台、Android 和 HTML5（但不适用于 iOS）。

source: Accompanying file
de: Begleitdatei
es: Archivo adjunto
ko: 첨부 파일
pl: Załączony plik
pt_br: Arquivo anexo
ru: Сопутствующий файл
uk: Супровідний файл
zh_cn: 附带文件

source: If the game is distributed on desktop platforms, a file containing the license can be added to the software that is installed to the user PC.
de: Wenn das Spiel auf Desktop-Platformen verfügbar ist, kann der auf dem Benutzer-PC installierten Software eine Datei mit der Lizenz hinzugefügt werden.
es: Si el juego se distribuye en plataformas de escritorio, se puede agregar un archivo que contiene la licencia al software que está instalado en la PC del usuario.
ko: 게임이 데스크탑 플랫폼에서 배포되고 있는 경우, 라이선스를 포함한 파일을 사용자 PC에 설치되는 소프트웨어에 첨부할 수 있습니다.
pl: Jeżeli gra jest dystrybuowana na komputery stacjonarne, do oprogramowania instalowanego na komputerze użytkownika można dodać plik zawierający licencję.
pt_br: Se o jogo for distribuído em plataformas desktop, um arquivo contendo a licença pode ser adicionado ao software instalado no PC do usuário.
ru: Если игра распространяется на настольных платформах, файл с лицензией может быть включён в поставку ПО, устанавливаемую на пользовательский ПК.
uk: Якщо гра поширюється на настільних платформах, файл, що містить ліцензію, можна додати до програмного забезпечення, яке встановлюється на ПК користувача.
zh_cn: 如果游戏是在桌面平台上发行的，可以在安装到用户 PC 的软件中加入一个包含许可证的文件。

source: Printed manual
de: Gedrucktes Handbuch
es: Manual impreso
ko: 인쇄된 설명서
pl: Wydrukowana instrukcja
pt_br: Manual impresso
ru: Печатное руководство
uk: Друковане керівництво
zh_cn: 印刷手册

source: If the game includes printed manuals, license text can be included there.
de: Wenn das Spiel gedruckte Handbücher enthält, kann dort Lizenztext eingefügt werden.
es: Si el juego incluye manuales impresos, el texto de la licencia se puede incluir allí.
ko: 게임에 인쇄 매뉴얼이 있을 경우, 거기에 라이선스 문구를 포함할 수 있습니다.
pl: Jeśli gra zawiera drukowane instrukcje, można tam umieścić tekst licencji.
pt_br: Se o jogo incluir manuais impressos, o texto da licença pode ser incluído neles.
ru: Если игра включает печатное руководство, текст лицензии может быть включён туда.
uk: Якщо гра містить друковані посібники, туди можна додати текст ліцензії.
zh_cn: 如果游戏中包含印刷手册，可以在其中加入授权文本。

source: Link to the license
de: Ein Link zur Lizenz
es: Vincular la(s) licencia(s)
ko: 라이선스에 대한 링크
pl: Link do licencji
pt_br: Link para a licença
ru: Ссылка на лицензию
uk: Посилання на ліцензію
zh_cn: 许可证链接

source: The Godot Engine developers consider that a link to ``godotengine.org/license`` in your game documentation or credits would be an acceptable way to satisfy the license terms.
de: Die Godot-Engine-Entwickler halten einen Link zu ``godotengine.org/license`` in der Spieldokumentation oder in den Credits für eine akzeptable Möglichkeit, um die Lizenzbestimmungen zu erfüllen.
es: Los desarrolladores de Godot Engine consideran que un enlace a ``godotengine.org/license`` en la documentación o los créditos del juego sería una forma aceptable de cumplir con los términos de la licencia.
ko: Godot 엔진의 개발자들은 게임 문서나 크레딧에 ``godotengine.org/license`` 링크를 포함하는 것도 라이선스 조건을 충족할 수 있는 방법이라고 생각합니다.
pl: Twórcy Godot Engine uważają, że link do ``godotengine.org/license`` w dokumentacji gry lub napisach końcowych byłby akceptowalnym sposobem spełnienia warunków licencji.
pt_br: Os desenvolvedores do Godot Engine consideram que o link para ``godotengine.org/license`` na documentação ou créditos de seu jogo é uma maneira aceitável de satisfazer os termos da licença.
ru: Разработчики Godot Engine считают, что включение ссылки на ``godotengine.org/license ``в документации к вашей игре или титрах — допустимый путь для удовлетворения условий лицензии.
uk: Розробники Godot Engine вважають, що посилання на ``godotengine.org/license`` у вашій документації до гри, або в титрах, було б прийнятним способом задовольнити умови ліцензії.
zh_cn: Godot 引擎开发者认为，在你游戏的文档或者制作组信息中加入指向 ``godotengine.org/license`` 的链接就可以满足许可证的条款。

source: Third-party licenses
de: Lizenzen von Drittanbietern
es: Licencias de terceros
ko: 제삼자 라이선스
pl: Licencje firm trzecich
pt_br: Licenças de terceiros
ru: Сторонние лицензии
uk: Сторонні ліцензії
zh_cn: 第三方许可证

source: Godot itself contains software written by `third parties <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. Most of it does not require license inclusion, but some do. Make sure to do it if these are compiled in your Godot export template. If you're using the official export templates, all libraries are enabled. This means you need to provide attribution for all the libraries listed below.
de: Godot selbst enthält Software, die von Dritten <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt> geschrieben wurde. Das meiste davon erfordert keine Lizenzaufnahme, andere schon. Stellen Sie sicher dies zu tun, wenn Sie sie verwenden. Hier ist eine Liste, welche es benötigen.
es: El propio Godot contiene software escrito por `terceros <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>` _. La mayor parte no requiere la inclusión de una licencia, pero algunos sí. Asegúrese de hacerlo si están compilados en su plantilla de exportación de Godot. Si está utilizando las plantillas de exportación oficiales, todas las bibliotecas están habilitadas. Esto significa que debe proporcionar atribución para todas las bibliotecas que se enumeran a continuación.
ko: Godot 자체는 `서드파티 <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_가 작성한 소프트웨어를 포함하고 있습니다. 이 중 대부분은 라이선스 포함을 필요로하지 않지만 일부는 필요할 수 있습니다. Godot 내보내기 템플릿에 컴파일된 경우 이를 확실히 해야합니다. 공식 내보내기 템플릿을 사용하는 경우 모든 라이브러리가 활성화되므로 아래에 나열된 모든 라이브러리에 대한 저작자 표시를 해야합니다.
pl: Godot sam w sobie zawiera oprogramowanie napisane przez `strony trzecie <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. Większość z nich nie wymaga dołączenia licencji tego oprogramowania, ale niektóre tak. Pamiętaj, aby to zrobić, jeśli są one skompilowane w szablonie eksportu Godot. Jeśli używasz oficjalnych szablonów eksportu, wszystkie biblioteki są uwzględniane. Oznacza to, że musisz dołączyć licencję od wszystkich bibliotek wymienionych poniżej.
pt_br: O próprio Godot contém software escrito por `terceiros <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. A maioria não requer inclusão de licença, mas algumas exigem. Certifique-se de fazê-lo se estes forem compilados no seu modelo de exportação Godot. Se você estiver usando os modelos oficiais de exportação, todas as bibliotecas estão habilitadas. Isto significa que você precisa fornecer a atribuição para todas as bibliotecas listadas abaixo.
ru: Сам Godot содержит программы, написанные `третьими лицами <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. Большинство из них не требуют включения лицензии, но для некоторых это обязательно. Обязательно сделайте это, если они входят в ваш шаблон экспорта Godot. Если вы используете официальные шаблоны экспорта, все библиотеки включены. Это означает, что вам необходимо указать атрибуцию для всех библиотек, перечисленных ниже.
uk: Сам Godot містить програмне забезпечення, написане `сторонніми <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_. Більшість із них не вимагає включення ліцензії, але деякі потребують. Обов’язково зробіть це, якщо вони скомпільовані у вашому шаблоні експорту Godot. Якщо ви використовуєте офіційні шаблони експорту, усі бібліотеки ввімкнено. Це означає, що вам потрібно надати атрибуцію для всіх бібліотек, перерахованих нижче.
zh_cn: Godot本身包含 `第三方 <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ 编写的软件. 大多数软件不需要包含许可证, 但有些需要. 如果这些软件在你的Godot导出模板中被编译, 请确保这样做. 如果你使用的是官方的导出模板, 所有的库都会被启用. 这意味着你需要为下面列出的所有库提供归属.

source: Here's a list of libraries requiring attribution:
de: Hier ist eine Liste der Bibliotheken, die eine Zuordnung erfordern:
es: Aquí hay una lista de bibliotecas que requieren atribución:
ko: 다음은 속성 지정이 필요한 라이브러리 목록입니다:
pl: Oto lista bibliotek wymagających umieszczenia ich licencji:
pt_br: Eis uma lista de bibliotecas que requerem atribuição:
ru: Здесь перечислены библиотеки, требующие указания атрибуции:
uk: Ось список бібліотек, які потребують атрибуції:
zh_cn: 以下是需要归类的库的列表:

source: Godot uses `FreeType <https://www.freetype.org/>`_ to render fonts. Its license requires attribution, so the following text must be included together with the Godot license:
de: Godot nutzt `FreeType <https://www.freetype.org/>`_um Schriften zu rendern. Die FreeType-Lizenz erfordert eine namentliche Nennung, weshalb der folgende Text gemeinsam mit der Godot-Lizenz enthalten sein muss:
es: Godot usa `FreeType <https://www.freetype.org/>` _ para renderizar fuentes. Su licencia requiere atribución, por lo que el siguiente texto debe incluirse junto con la licencia de Godot:
ko: Godot은 글꼴을 렌더링하기 위해 `FreeType <https://www.freetype.org/>`_을 사용합니다. 해당 라이선스는 저작자 표시를 요구하므로, 다음 텍스트는 Godot 라이선스와 함께 포함되어야 합니다:
pl: Godot używa `FreeType <https://www.freetype.org/>`_ do renderowania krojów czcionek (fontów). Licencja wymaga uznania autorstwa, dlatego wraz z licencją Godota należy załączyć następujący tekst:
pt_br: O Godot usa `FreeType <https://www.freetype.org/>`_ para renderizar fontes. Sua licença requer atribuição, então o seguinte texto deve ser incluído junto com a licença do Godot:
ru: Godot использует `FreeType <https://www.freetype.org/>`_ для рендеринга шрифтов. Его лицензия требует атрибуции, поэтому следующий текст должен быть включён вместе с лицензией Godot:
uk: Godot використовує `FreeType <https://www.freetype.org/>`_ для вимальовування шрифтів. Його ліцензія вимагає вказівки авторства, тому разом із ліцензією Godot необхідно включити наступний текст:
zh_cn: Godot 使用 `FreeType <https://www.freetype.org/>`_ 来渲染字体。它的许可证要求注明出处，因此以下文本必须和 Godot 许可证一起加入：

source: Portions of this software are copyright © <year> The FreeType Project (www.freetype.org). All rights reserved.
de: Teile dieser Software sind urheberrechtlich geschütz: Copyright © <year>The FreeType Project (www.freetype.org). Alle Rechte vorbehalten.
es: Partes de este software tienen copyright © <año> The FreeType Project (www.freetype.org). Reservados todos los derechos.
ko: 본 소프트웨어의 일부는 저작권 © <year> The FreeType Project (www.freetype.org)에 속합니다. 무단 전재 금지.
pt_br: Porções deste software são copyright © <ano> The FreeType Project (www.freetype.org). Todos os direitos reservados.
ru: Части этого проекта защищены авторским правом © <year> Проект FreeType (www.freetype.org). Все права защищены.
uk: Частина цього програмного забезпечення є авторським правом © <year> The FreeType Project (www.freetype.org). Всі права захищені.
zh_cn: 本软件的部分内容的版权为 © <年份> The FreeType Project（www.freetype.org）。保留所有权利。

source: <year> should correspond to the value from the FreeType version used in your build. This information can be found in the editor by opening the **Help > About** dialog and going to the **Third-party Licenses** tab.
de: Beachte, dass <year> dem Wert der im Build genutzten FreeType-Version entsprechen sollte. Diese Information kann im Editor über das Öffnen des **Hilfe>Über Godot** Dialogs im **Drittpartei-Lizenzen** Reiter gefunden werden.
es: <año> debe corresponder al valor de la versión de FreeType utilizada en su compilación. Esta información puede encontrarse en el editor abriendo el cuadro de diálogo **Ayuda > Acerca de** y yendo a la pestaña **Licencias de terceros**.
ko: <year>는 빌드에 사용된 FreeType 버전의 값과 일치해야 합니다. 이 정보는 **도움말 > 정보** 대화상자를 열고 **서드 파티 라이센스** 탭으로 이동하여 편집기에서 찾을 수 있습니다.
pl: <year> (rok) powinien zgadzać się z wartością widoczną w bibliotece FreeType umieszczonej w Twojej kompilacji projektu. Informacje te znajdziesz w edytorze otwierając okno dialogowe **Pomoc > Informacje** i przechodząc do zakładki **Licencje innych firm**.
pt_br: <ano> deve corresponder ao valor da versão do FreeType usada na compilação. Esta informação pode ser encontrada no editor ao abrir o diálogo **Ajuda > Sobre** na aba **Licenças de Terceiros**.
ru: <year> должен соответствовать FreeType версии используемой в вашей сборке. Эта информация может быть найдена в редакторе с помощью открытия меню **Справка>О Godot** и вкладки **Сторонние лицензии**.
uk: Зверніть увагу, що <year> має відповідати значенню для версії FreeType, що використовується у вашій збірці. Цю інформацію можна знайти в меню редактора **Довідка > Про Godot** на вкладці **Ліцензування сторонніх компонентів**.
zh_cn: 注意 <年份> 的取值应当与你所使用的构建中 FreeType 的版本对应。该信息可以在编辑器中查看：打开\ **帮助 > 关于**\ 对话框，切换到\ **第三方许可证**\ 选项卡。

source: Godot includes the `ENet <http://enet.bespin.org/>`_ library to handle high-level multiplayer. ENet has similar licensing terms as Godot:
de: Wenn es sich bei dem erstellten Projekt um ein Multiplayer-Spiel handelt, das den Treiber `ENet <http://enet.bespin.org/>`_ verwendet, hat ENet ähnliche Lizenzbedingungen wie Godot:
es: Godot incluye la biblioteca `ENet <http://enet.bespin.org/>` _ para manejar multijugador de alto nivel. ENet tiene términos de licencia similares a los de Godot:
ko: Godot은 고급 멀티 플레이어를 제어하기 위해`ENet <http://enet.bespin.org/>`_ . 라이브러리를 포함합니다. ENet 은 Godot과 흡사한 라이선스 조약을 가지고 있습니다:
pt_br: Godot inclui a `biblioteca ENet <http://enet.bespin.org/>`_ para lidar com multiplayer de alto nível. A ENet possui termos de licenciamento similares aos do Godot:
ru: Godot включает библиотеку `ENet <http://enet.bespin.org/>`_ для высокоуровневой обработки мультиплеера. У ENet похожие на Godot условия лицензирования:
uk: Godot включає бібліотеку `ENet <http://enet.bespin.org/>`_ для високорівневої обробки мультимедіа. ENet має схожі до Godot умову ліцензування:
zh_cn: Godot包括 `ENet <http://enet.bespin.org/>`_ 库来处理高级多人游戏.ENet的许可条款与Godot类似:

source: Copyright (c) 2002-2020 Lee Salzman
es: Derechos de autor (c) 2002-2020 Lee Salzman
ko: 저작권 (c) 2002-2020 Lee Salzman
pt_br: Direitos autorais (c) 2002-2020 Lee Salzman
ru: Авторские права принадлежат Ли Зальцман, 2002-2020
uk: Авторське право (с) 2002-2020 Лі Зальцман
zh_cn: 版权所有 (c) 2002-2016 Lee Salzman

source: If the project is exported with Godot 3.1 or later, it includes `mbed TLS <https://tls.mbed.org>`_. The Apache license needs to be complied to by including the following text:
de: Wenn das Projekt mit Godot 3.1 oder höher exportiert wurde und SSL verwendet wird (normalerweise über HTTP-Anforderungen), muss die Apache-Lizenz `mbed TLS <https://tls.mbed.org>`_ mit dem folgenden Text erfüllt werden:
es: Si el proyecto se realiza con Godot 3.1 o superior y utiliza SSL (generalmente a través de solicitudes HTTP), la licencia `MBedTLS <https://tls.mbed.org>` -Apache debe cumplirse incluyendo el siguiente texto:
ko: Godot 3.1 이상으로 프로젝트를 내보낼 경우 `mbed TLS < https://tls.mbed.org >_`가 포함됩니다. Apache 라이센스는 다음 텍스트를 포함하여 준수해야 합니다:
pt_br: Se o projeto for exportado com Godot 3.1 ou posterior, incluirá o `MBedTLS <https://tls.mbed.org>`_ . A licença Apache precisará ser cumprida incluindo o seguinte texto:
ru: Если проект создан с использованием версий Godot 3.1 и выше, он использует`mbed TLS <https://tls.mbed.org>`_. The Apache лицензия должна быть исполнена включением следующего текста:
uk: Якщо проект створений з допомогою Godot 3.1 і вище то він використовує `mbed TLS <https://tls.mbed.org>`_. Ліцензія Apache вимагає включення наступного тексту:
zh_cn: 使用 Godot 3.1 或以上版本的项目包含了 `mbed TLS <https://tls.mbed.org>`_\ 。需要通过包含以下文本来遵守 `MBedTLS <https://tls.mbed.org>`_ Apache 许可证：

source: Copyright The Mbed TLS Contributors
es: Derechos de autor Los colaboradores de Mbed TLS
ko: 저작권 The Mbed TLS 기여자들
pt_br: Copyright dos contribuidores Mbed TLS
ru: Авторские права принадлежат участникам Mbed TLS
uk: Авторське право, співробітники The Mbed TLS
zh_cn: 版权所有 Mbed TLS 贡献者

source: Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at
de: Lizenziert unter der Apache-Lizenz, Version 2.0 (die "Lizenz"); Sie dürfen diese Datei nur in Übereinstimmung mit der Lizenz verwenden. Eine Kopie der Lizenz erhalten Sie unter
es: Con licencia de Apache License, Versión 2.0 (la "Licencia"); no puede utilizar este archivo excepto de conformidad con la Licencia. Puede obtener una copia de la licencia en
ko: Apache 라이선스 버전 2.0("The License")에 따라 라이선스가 부여되며, 라이선스를 준수하지 않으면 이 파일을 사용할 수 없습니다. 라이선스 사본은 다음 웹 사이트에서 얻을 수 있습니다.
pt_br: Licenciado sob a Licença Apache, Versão 2.0 (a "Licença"); você não pode usar este arquivo exceto em conformidade com a Licença. Você pode obter uma cópia da Licença em:
ru: Лицензируется на условиях Лицензии Apache, версия 2.0 (далее "Лицензия"); вы не можете использовать этот файл только тем и способами, которые описаны в Лицензии. Вы можете получить копию Лицензии по адресу
uk: Ліцензовано за ліцензією Apache, версія 2.0 ("Ліцензія"); ви не можете використовувати цей файл, крім як у відповідності з Ліцензією. Ви можете отримати копію ліцензії за адресою
zh_cn: 根据 Apache 许可证 2.0 版本（以下简称“许可证”）授权；你不得使用本文件，除非符合许可证的规定。你可以在以下地址获得许可证的副本

source: Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
de: Sofern nicht durch geltendes Recht vorgeschrieben oder schriftlich vereinbart, wird die Software, die unter dieser Lizenz vertrieben wird, IN DER VORLIEGENDEN FORM VERTRIEBEN, OHNE GARANTIEN ODER BEDINGUNGEN JEGLICHER ART, weder ausdrücklich noch impliziert. Näheres in der Lizenz für die sprachenrelevanten Genehmigungen und Limitierungen unter der Lizenz.
es: A menos que lo exija la ley aplicable o se acuerde por escrito, el software distribuido bajo la Licencia se distribuye "TAL CUAL", SIN GARANTÍAS NI CONDICIONES DE NINGÚN TIPO, ya sea expresa o implícita. Consulte la Licencia para conocer el idioma específico que rige los permisos y las limitaciones de la Licencia.
ko: 관련 법률에 의해 요구되거나 서면으로 동의되지 않는 한, 라이선스에 따라 배포되는 소프트웨어는 명시적 또는 묵시적으로 어떠한 종류의 보증이나 조건도 없이 "있는 그대로" 배포됩니다. 라이센스 아래의 권한 및 제한을 관리하는 특정 언어는 라이선스를 참조하십시오.
pt_br: A menos que exigido pela lei aplicável ou acordado por escrito, o software distribuído sob a Licença é distribuído "COMO ESTÁ", SEM GARANTIAS OU CONDIÇÕES DE QUALQUER TIPO, expressas ou implícitas. Consulte a Licença para as permissões e limitações que regem o idioma específico sob a Licença.
ru: За исключением случаев, предусмотренных действующим законодательством или оговоренных в письменном виде, программное обеспечение, распространяемое в рамках Лицензии, распространяется на условиях "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ И УСЛОВИЙ, явных или подразумеваемых. Конкретные формулировки, регулирующие разрешения и ограничения в рамках Лицензии, см. в Лицензии.
uk: Якщо це не вимагається чинним законодавством або не погоджено в письмовій формі, програмне забезпечення, що розповсюджується за Ліцензією, поширюється на ОСНОВІ «ЯК Є», БЕЗ БУДЬ-ЯКОГО ВИДУ ГАРАНТІЙ АБО УМОВ, явних або неявних. Перегляньте Ліцензію, щоб дізнатися про конкретну мову, яка регулює дозволи та обмеження Ліцензії.
zh_cn: 除非适用法律要求或书面同意, 否则根据许可证分发的软件是以 "原样" 为基础分发的, 没有任何形式的明示或暗示的保证或条件. 请参阅许可证中关于许可证下权限和限制的具体语言.
