Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/complying_with_licenses.po
Languages: de, es, ko, pl, pt_br, ru, uk, zh_cn

source: Complying with licenses
de: Einhaltung von Lizenzen
es: Cumplir con las licencias
ko: 라이센스 준수
pl: Zgodność z licencjami
pt_br: Conformidade com as licenças
ru: Соблюдение лицензионных требований
uk: Дотримання ліцензії
zh_cn: 遵守许可证

source: What are licenses?
de: Was sind Lizenzen?
es: ¿Qué son las licencias?
ko: 라이센스가 무엇입니까?
pl: Czym są licencje?
pt_br: O que são licenças?
ru: Что такое лицензии?
uk: Що таке ліцензія?
zh_cn: 什么是许可证？

source: Godot is created and distributed under the `MIT License <https://opensource.org/licenses/MIT>`_. It doesn't have a sole owner either, as every contributor that submits code to the project does it under this same license and keeps ownership of the contribution.
de: Godot wird unter der `MIT Lizenz <https://opensource.org/licenses/MIT>`_ erstellt und vertrieben. Es hat auch keinen alleinigen Eigentümer, da jeder Mitwirkende, der Code an das Projekt sendet, dies unter derselben Lizenz tut und das Eigentum an dem Beitrag behält.
es: Godot es creado y distribuido bajo la `Licencia MIT <https://opensource.org/licenses/MIT>`_. No tiene un único propietario, ya que cada colaborador que envía código al proyecto lo hace bajo esta misma licencia y conserva la propiedad de la contribución.
ko: Godot은 `MIT License <https://opensource.org/licenses/MIT>` 하에 제작되고 배포됩니다. 프로젝트에 코드를 제공하는 모든 기여자가 같은 라이선스 하에 기여하고 자신의 기여의 소유권을 유지하기 때문에 단독 소유자는 없습니다.
pl: Godot jest tworzony i rozpowszechniany na podstawie `Licencji MIT <https://opensource.org/licenses/MIT>`_. Nie ma też jedynego właściciela, ponieważ każdy autor zmian, który przesyła kod do projektu, robi to na tej samej licencji i zachowuje własność intelektualną swojego wkładu.
pt_br: O Godot é criado e distribuído sob a `Licença MIT <https://opensource.org/licenses/MIT>`_. Também não há um proprietário único, já que cada contribuidor que envia código ao projeto o faz sob esta mesma licença e mantém a posse da contribuição.
ru: Godot создан и распространяется по `MIT License <https://opensource.org/licenses/MIT>`_. У него нет единственного владельца, так как каждый автор, предоставляющий код в проект, делает это под той же лицензией и сохраняет право собственности на внесенный вклад.
uk: Godot створюється та розповсюджується під `ліцензією MIT <https://opensource.org/licenses/MIT>`_. Він також не має єдиного власника, оскільки кожен учасник, який подає код проекту, робить це за цією ж ліцензією і зберігає право власності на внесок.
zh_cn: Godot 是根据 `MIT License <https://opensource.org/licenses/MIT>`_ 创建并分发的。它也没有唯一的所有者，因为向该项目提交代码的每个贡献者都在相同的许可证下执行该代码，并保留贡献的所有权。

source: The license is the legal requirement for you (or your company) to use and distribute the software (and derivative projects, including games made with it). Your game or project can have a different license, but it still needs to comply with the original one.
de: Die Lizenz ist die gesetzliche Anforderung für Sie (oder Ihr Unternehmen), die Software (und abgeleitete Projekte, einschließlich der damit erstellten Spiele) zu verwenden und zu vertreiben. Ihr Spiel oder Projekt kann eine andere Lizenz haben, muss jedoch der ursprünglichen Lizenz entsprechen.
es: La licencia es el requerimiento legal para ti (o tu compañía) para usar y distribuir el software (y proyectos derivados, incluyendo juegos hechos con el mismo). Tu juego o proyecto puede tener una licencia diferente, pero aún debe cumplir con la original.
ko: 라이선스는 귀하(또는 귀하의 회사)가 소프트웨어(및 이를 사용한 게임을 포함한 파생 프로젝트)를 사용 및 배포하기 위한 법적 요구사항입니다. 게임 또는 프로젝트는 다른 라이선스를 가질 수 있으나, 이 경우에도 원래 라이선스는 준수해야 합니다.
pl: Licencja to wymóg prawny obowiązujący Ciebie (lub Twoją firmę) dotyczący używania i rozpowszechniania oprogramowania (oraz projektów pochodnych, w tym stworzonych przy użyciu Godot gier). Twoja gra lub projekt może mieć inną licencję, ale nadal musi zachować zgodność z oryginalną licencją.
pt_br: A licença é o requisito legal para que você (ou sua empresa) use e distribua o software (e projetos derivados, incluindo jogos feitos com ele). Seu jogo ou projeto pode ter uma licença diferente, mas ainda precisa cumprir com a original.
ru: Лицензия — это юридические требования к вам (или вашей компании) по использованию и распространению программного обеспечения (и производных проектов, в том числе игр, разработанных при помощи ПО). Ваша игра или проект могут иметь иную лицензию, но она должна быть совместима с изначальной.
uk: Ліцензія — це юридична вимога до вас (або вашої компанії) щодо використання та розповсюдження програмного забезпечення (і похідних проектів, включаючи ігри, створені з ним). Ваша гра, чи проект, можуть мати іншу ліцензію, але вона все одно має відповідати оригінальній.
zh_cn: 许可证是你（或你的公司）使用和分发软件（以及衍生项目，包括用它制作的游戏）的法律要求。你的游戏或项目可以具有不同的许可证，但仍需要遵守原始许可证。

source: This section covers compliance with licenses from a user perspective. If you are interested in licence compliance as a contributor, you can find guidelines :ref:`here <doc_best_practices_for_engine_contributors_license_compliance>`.
es: Esta sección cubre el cumplimiento con licencias desde una perspectiva de usuario. Si estás interesado en cumplimiento de licencias como un contribuyente, puedes encontrar las directivas :ref:`aquí <doc_best_practices_for_engine_contributors_license_compliance>`.
zh_cn: 本节从用户的角度介绍了许可证合规性。 如果你作为贡献者对许可证合规性感兴趣，可以在 :ref:`这里 <doc_best_practices_for_engine_contributors_license_compliance>` 找到指南说明。

source: In your project's credits screen, remember to also list third-party notices for assets you're using, such as textures, models, sounds, music and fonts.
de: Denken Sie daran in den Credits Ihres Projektes auch Dritte nennen, z. B. wenn Sie fremde Texturen, Modelle, Sound, Musik und Schriftarten benutzen.
es: En la pantalla de créditos de su proyecto, recuerde incluir también avisos de terceros para los activos que está utilizando, como texturas, modelos, sonidos, música y fuentes.
ko: 프로젝트의 크레딧 화면에는 텍스처, 모델, 사운드, 음악 및 폰트와 같은 사용 중인 애셋에 대한 서드 파티 공지사항도 함께 목록에 포함시켜야 합니다.
pl: Pamiętaj, aby na ekranie napisów końcowych (credits) umieścić informacje innych firm dotyczące używanych zasobów, takich jak tekstury, modele, dźwięki, muzyka i kroje czcionek (fonts).
pt_br: Na tela de créditos do seu projeto, lembre-se de listar também avisos de terceiros para os recursos que você está usando, como texturas, modelos, sons, músicas e fontes.
ru: Не забывай указывать в титрах использованные сторонние ресурсы, такие как текстуры, модели, звуки и шрифты.
uk: Також на екрані титрів вашого проекту не забудьте висвітлити повідомлення про сторонні використовувані активи, такі як текстури, моделі, звуки, музика та шрифти.
zh_cn: 在你的项目的致谢界面，请记得列出你所使用的纹理、模型、音效、音乐、字体等资产的第三方通告。

source: Free assets in particular often come with licenses that require attribution. Double-check their license before using those assets in a project.
de: Kostenlose Assets haben oftmals Lizenzen, welche die Erwähnung des Erstellers erfordern. Prüfen Sie bitte gründlich die Lizenzen solcher Assets, bevor diese in einem Projekt verwendet werden können.
es: Los activos gratuitos en particular a menudo vienen con licencias que requieren atribución. Verifique dos veces su licencia antes de usar esos recursos en un proyecto.
ko: 무료로 배포되는 애셋은 종종 저작자 표시를 필요로 하는 라이선스와 함께 제공됩니다. 프로젝트에서 해당 애셋을 사용하기 전에 라이선스를 다시 확인하는 것이 중요합니다.
pl: Bardzo często darmowe zasoby są dostarczane z licencjami wymagającymi załączenia. Przed użyciem tych zasobów w projekcie dokładnie sprawdź ich licencję.
pt_br: Os assets gratuitos, em particular, geralmente vêm com licenças que exigem atribuição. Verifique sua licença antes de usar esses recursos em um projeto.
ru: Бесплатные ресурсы зачастую имеют лицензии, что обязывают указание их использования. Проверяйте лицензии прежде чем использовать что-то в вашем проекте.
uk: Вільні активи, зокрема, часто поставляються з ліцензіями, які вимагають атрибуції. Двічі перевірте їх ліцензію, перш ніж використовувати ці активи в проекті.
zh_cn: 值得注意的是，免费资产的许可证经常要求署名。在项目中使用这些资产前，请仔细确认其许可证。

source: Requirements
de: Voraussetzungen
es: Requerimientos
ko: 요구사항
pl: Wymagania
pt_br: Requisitos
ru: Требования
uk: Вимоги
zh_cn: 需求

source: In the case of the MIT license, the only requirement is to include the license text somewhere in your game or derivative project.
de: Im Fall der MIT-Lizenz besteht die einzige Voraussetzung darin, den Lizenztext irgendwo in Ihr Spiel oder Ihr zugehöriges Projekt aufzunehmen.
es: En el caso de la licencia MIT, el único requisito es incluir el texto de la licencia en algún lugar de su juego o proyecto derivado.
ko: MIT 라이선스의 경우 유일한 요구 사항은 게임 또는 파생 프로젝트의 어딘가에 라이선스 문구를 포함하는 것입니다.
pl: W przypadku licencji MIT jedynym wymogiem jest umieszczenie tekstu licencji w dowolnym miejscu w grze lub innym projekcie pochodnym.
pt_br: No caso da licença MIT, o único requisito é incluir o texto da licença em algum lugar do seu jogo ou projeto derivado.
ru: В случае лицензии MIT ,единственным требованием является включение текста лицензии куда-нибудь в вашей игре или производном проекте.
uk: У випадку ліцензії MIT єдиною вимогою є включення тексту ліцензії десь у вашій грі, або похідному проекті.
zh_cn: 对于MIT许可证，唯一的要求是将许可证文本包含在你的游戏或衍生项目中。

source: This text reads as follows:
de: Dieser Text lautet wie folgt:
es: Este texto dice lo siguiente:
ko: 본 텍스트는 다음과 같습니다:
pl: Tekst ten brzmi następująco (tłumaczenie polskie dla wygody, proszę używać oryginalnej wersji angielskiej):
pt_br: O texto diz o seguinte:
ru: Этот текст гласит:
uk: Цей текст заявляє наступне:
zh_cn: 文本内容如下：

source: This game uses Godot Engine, available under the following license:
de: Dieses Spiel nutzt die Godot Engine, verfügbar unter folgender Lizenz:
es: Este juego utiliza Godot Engine, disponible bajo la siguiente licencia:
ko: 이 게임은 다음 라이선스로 제공되는 Godot 엔진을 사용합니다:
pl: Ta gra używa Godot Engine, dostępnego pod następującą licencją:
pt_br: Este jogo usa o Godot Engine, disponível sob a seguinte licença:
ru: В этой игре используется движок Godot Engine, доступный по следующей лицензии:
uk: Ця гра використовує Godot Engine, доступний за такою ліцензією:
zh_cn: 该游戏使用 Godot Engine，可通过以下许可获得：

source: Copyright (c) 2014-present Godot Engine contributors. Copyright (c) 2007-2014 Juan Linietsky, Ariel Manzur.
de: Copyright (c) 2014-heute Godot Engine Mitwirkende. Copyright (c) 2007-2014 Juan Linietsky, Ariel Manzur.
es: Copyright (c) 2014-presente Contribuyentes de Godot Engine. Copyright (c) 2007-2014 Juan Linietsky, Ariel Manzur.
ko: 저작권 (c) 2014-현재 Godot 엔진 기여자들. Copyright (c) 2007-2014 Juan Linietsky, Ariel Manzur.
pt_br: Direitos autorais (c) 2014-presente Godot Engine contribuidores. Direitos autorais (c) 2007-2014 Juan Linietsky, Ariel Manzur.
ru: Авторское право (c) с 2014 года по настоящее время, участники Godot Engine. Авторское право (c) 2007-2014 Juan Linietsky, Ariel Manzur.
uk: Захищено авторським правом (с) учасниками 2014-досьогодні. Захищено авторським правом (с) 2007-2014 Хуан Лінєтцькі, Аріель Манзур.
zh_cn: 版权所有 (c) 2014 至今 Godot 引擎贡献者。版权所有 (c) 2007-2014 Juan Linietsky、Ariel Manzur。

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
de: Hiermit wird jeder Person, die eine Kopie dieser Software und der zugehörigen Dokumentationsdateien (die "Software") erhält, kostenlos die Erlaubnis erteilt, uneingeschränkt mit der Software umzugehen, einschließlich die Rechte zur unbeschränkten Nutzung, zum Kopieren, Ändern, Zusammenführen , Veröffentlichung, Vertrieb, Unterlizenzierung und/oder Verkauf von Kopien der Software und die Erlaubnis von Personen, denen die Software zur Verfügung gestellt wird, unter folgenden Bedingungen:
es: Por la presente se otorga permiso, sin cargo, a cualquier persona que obtenga una copia de este software y los archivos de documentación asociados (el "Software"), para operar con el Software sin restricciones, incluyendo, entre otros, los derechos de uso, copia, modificación, fusión , publicar, distribuir, sublicenciar y / o vender copias del Software, y permitir que las personas a quienes se les proporcione el Software lo hagan, sujeto a las siguientes condiciones:
pl: Niniejszym udziela się bezpłatnego zezwolenia każdej osobie uzyskującej kopię tego oprogramowania i powiązanych plików dokumentacji („Oprogramowania”) na korzystanie z Oprogramowania bez ograniczeń, w tym bez ograniczeń prawa do używania, kopiowania, modyfikowania, łączenia, publikowania, rozpowszechniania, udzielania sublicencji i/lub sprzedawania kopii Oprogramowania oraz zezwala na to osobom, którym Oprogramowanie jest dostarczane, z zastrzeżeniem następujących warunków: (oryg: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:)
pt_br: É concedida permissão, gratuitamente, a qualquer pessoa que obtenha uma cópia deste software e arquivos de documentação associados (o "Software"), para negociar no Software sem restrições, incluindo sem limitação aos direitos de usar, copiar, modificar, fundir, publicar, distribuir, sublicenciar e/ou vender cópias do Software e permitir que as pessoas a quem o Software é fornecido o façam, sujeito às seguintes condições:
ru: Настоящим предоставляется бесплатное разрешение любому лицу, получившему копию этого программного обеспечения и связанных с ним файлов документации («Программное обеспечение»), работать с Программным обеспечением без ограничений, включая, помимо прочего, права на использование, копирование, изменение, слияние, публикацию, распространение, сублицензирование и/или продажу копий Программного обеспечения, а также разрешать лицам, которым предоставляется Программное обеспечение, делать это при соблюдении следующих условий:
uk: Цим дозволяється безкоштовно будь-якій особі, яка отримує копію цього програмного забезпечення та пов’язаних файлів документації (цього «Програмного забезпечення»), працювати з Програмним забезпеченням без обмежень, включаючи, без обмежень, права на використання, копіювання, зміну, злиття , публікування, розповсюдження, субліцензування та/або продавання копії Програмного забезпечення, а також дозволяти особам, яким надається Програмне забезпечення, робити це за наступних умов:
zh_cn: 特此免费授予任何获得本软件副本和相关文档文件（下称“软件”）的人不受限制地处置该软件的权利，包括不受限制地使用、复制、修改、合并、发布、分发、转授许可和/或出售该软件副本，以及再授权被配发了本软件的人如上的权利，须在下列条件下：

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
de: Der oben genannte Urheberrechts-Hinweis (Copyright) und dieser Erlaubnishinweis sind in allen Kopien oder wesentlichen Teilen der Software enthalten.
es: El aviso de copyright anterior y este aviso de permiso se incluirán en todas las copias o partes sustanciales del Software.
pl: Powyższa informacja o prawach autorskich i niniejsza informacja o pozwoleniu zostaną dołączone do wszystkich kopii lub istotnych części Oprogramowania. (oryg: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.)
pt_br: O aviso de direitos autorais acima e este aviso de permissão devem ser incluídos em todas as cópias ou porções substanciais do Software.
ru: Вышеуказанное уведомление об авторском праве и данное уведомление о разрешении должны быть включены во все копии или существенные части Программного обеспечения.
uk: Вищенаведене повідомлення про авторські права та це повідомлення про дозвіл будуть включені в усі копії або значні частини Програмного забезпечення.
zh_cn: 以上版权声明和本许可声明应包含在本软件的所有副本或大部分内容中。

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
de: DIE SOFTWARE WIRD "WIE BESEHEN" OHNE JEGLICHE AUSDRÜCKLICHE ODER STILLSCHWEIGENDE GEWÄHRLEISTUNG ZUR VERFÜGUNG GESTELLT, EINSCHLIESSLICH DER GEWÄHRLEISTUNG FÜR MARKTGÄNGIGKEIT, EIGNUNG FÜR EINEN BESTIMMTEN ZWECK UND NICHTVERLETZUNG. IN KEINEM FALL HAFTEN DIE AUTOREN ODER COPYRIGHT-INHABER FÜR JEGLICHE ANSPRÜCHE, SCHÄDEN ODER ANDERE HAFTUNGEN, OB VERTRAGS-, SCHADENERSATZ- ODER ANDERWEITIGE MASSNAHMEN HERVORGEHEND VON, AUS ODER IM ZUSAMMENHANG MIT DER SOFTWARE ODER DER NUTZUNG ODER ANDEREN ANGEBOTE SOFTWARE.
es: EL SOFTWARE SE PROPORCIONA "TAL CUAL", SIN GARANTÍA DE NINGÚN TIPO, EXPRESA O IMPLÍCITA, INCLUYENDO, PERO NO LIMITADO A, LAS GARANTÍAS DE COMERCIABILIDAD, APTITUD PARA UN PROPÓSITO PARTICULAR Y NO INFRACCIÓN. EN NINGÚN CASO LOS AUTORES O TITULARES DE LOS DERECHOS DE AUTOR SERÁN RESPONSABLES DE CUALQUIER RECLAMO, DAÑOS U OTRA RESPONSABILIDAD, YA SEA EN UNA ACCIÓN DE CONTRATO, AGRAVIO O DE OTRO MODO, QUE SURJA DE, FUERA DE O EN RELACIÓN CON EL SOFTWARE O EL USO U OTRAS NEGOCIACIONES EN EL SOFTWARE.
pt_br: O SOFTWARE É FORNECIDO "COMO ESTÁ", SEM GARANTIA DE QUALQUER TIPO, EXPRESSA OU IMPLÍCITA, INCLUINDO, MAS NÃO SE LIMITANDO ÀS GARANTIAS DE COMERCIALIZAÇÃO, ADEQUAÇÃO A UMA FINALIDADE ESPECÍFICA E NÃO VIOLAÇÃO. EM NENHUMA HIPÓTESE OS AUTORES OU TITULARES DE DIREITOS AUTORAIS SÃO RESPONSÁVEIS POR QUALQUER RECLAMAÇÃO, DANOS OU OUTRAS RESPONSABILIDADES, SEJA EM AÇÃO DE CONTRATO, DELITO OU DE OUTRA FORMA, DECORRENTE DE, FORA DE OU EM CONEXÃO COM O SOFTWARE OU O USO OU OUTRAS NEGOCIAÇÕES NO PROGRAMA.
ru: ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ, СООТВЕТСТВИЕ ОПРЕДЕЛЕННОЙ ЦЕЛИ И ОТСУТСТВИЯ НАРУШЕНИЙ. НИ В КОЕМ СЛУЧАЕ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА КАКИЕ-ЛИБО ПРЕТЕНЗИИ, УБЫТКИ ИЛИ ИНУЮ ОТВЕТСТВЕННОСТЬ, БУДЬ ТО В РЕЗУЛЬТАТЕ ДЕЙСТВИЯ ДОГОВОРА, ПРАВОНАРУШЕНИЯ ИЛИ ИНЫМ ОБРАЗОМ, ВОЗНИКАЮЩИЕ В СВЯЗИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ИСПОЛЬЗОВАНИЕМ ИЛИ ДРУГИМИ ОПЕРАЦИЯМИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
uk: ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ НАДАЄТЬСЯ «ЯК Є», БЕЗ БУДЬ-ЯКИХ ГАРАНТІЙ, ЯВНИХ АБО НЕПРЯМИХ, ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЬ ГАРАНТІЯМИ ПРИДАТНОСТІ ДЛЯ ТОРГОВОГО ЗАБЕЗПЕЧЕННЯ, ПРИДАТНОСТІ ДЛЯ ВИЗНАЧЕНОЇ МЕТИ ТА ВІДСУТНІСТЮ ПОРУШЕНЬ. НІ В НІКОМУ ВИПАДКУ АВТОРИ АБО ВЛАСНИКИ АВТОРСЬКИХ ПРАВ НЕ НЕСУТЬ ВІДПОВІДАЛЬНОСТІ ЗА БУДЬ-ЯКІ ПРЕТЕНЗІЇ, ЗБИТКИ ЧИ ІНШУ ВІДПОВІДАЛЬНІСТЬ, ЧИ ТО ЗА ДІЄЮ ДОГОВОРУ, ЧИ ПРАВОПОРУШЕННЯ, ЧИ ІНШОГО, ЩО ВИНИКАЄ З ІНШИХ ЗВ'ЯЗКІВ З ЦИМ ПРОГРАМНИМ ЗАБЕЗПЕЧЕННЯМ ЧИ ВИКОРИСТАННЯМ ЧИ ІНШИМИ ДІЯМИ В ЦЬОМУ ПРОГРАМНОМУ ЗАБЕЗПЕЧЕННІ.
zh_cn: 本软件是“按原样”提供的，没有任何形式的明示或暗示的保证，包括但不限于适销性，特定用途的适用性和不侵权的保证。在任何情况下，作者或版权持有者均不对因本软件或本软件的使用或其他交易而引起的，因本软件的使用或与本软件有关的合同，侵权或其他行为的任何索赔，损害或其他责任负责。

source: Your games do not need to be under the same license. You are free to release your Godot projects under any license and to create commercial games with the engine.
de: Ihre Spiele müssen nicht unter derselben Lizenz stehen. Es steht Ihnen frei, Ihre Godot-Projekte unter einer beliebigen Lizenz freizugeben und kommerzielle Spiele mit der Engine zu erstellen.
es: No es necesario que sus juegos estén bajo la misma licencia. Eres libre de publicar tus proyectos de Godot bajo cualquier licencia y de crear juegos comerciales con el motor.
ko: 여러분의 게임이 같은 라이선스 하에 있을 필요는 없습니다.임의의 라이선스 하에 Godot 프로젝트를 자유롭게 출시하고, 엔진으로 상용 게임을 제작할 수 있습니다.
pl: Twoja gra nie musi być na takiej samej licencji. Możesz dowolnie wydawać swoje projekty stworzone w Godot pod jakąkolwiek licencją chcesz i tworzyć komercyjne gry używając tego silnika (oryg: Your games do not need to be under the same license. You are free to release your Godot projects under any license and to create commercial games with the engine).
pt_br: Seus jogos não precisam estar sob a mesma licença. Você é livre para lançar seus projetos em Godot sob qualquer licença e criar jogos comerciais com a Engine.
ru: Ваша игра не должна распространяться под той же лицензией. Вы вольны выпускать ваши проекты на Godot под любой лицензией и создавать коммерческие игры на движке.
uk: Ваші ігри не зобов'язані мати таку саму ліцензію. Ви можете вільно випускати свої проекти Godot під будь-якою ліцензією та створювати комерційні ігри на движку.
zh_cn: 你的游戏无需遵循相同的许可证。你可以选择任意许可证自由地发布自己的 Godot 项目，并使用该引擎创建商业游戏。

source: Inclusion
de: Fazit
es: Inclusión
ko: 포함하는 법
pl: Załączanie
pt_br: Inclusão
ru: Включение
uk: Включення
zh_cn: 包含

source: The license does not specify how it has to be included, so anything is valid as long as it can be displayed under some condition. These are the most common approaches (only need to implement one of them, not all).
de: Die Lizenz gibt nicht an, wie sie integriert werden muss, daher ist alles gültig, solange es unter bestimmten Bedingungen angezeigt werden kann. Dies sind die gängigsten Ansätze (es muss nur einer implementiert werden, nicht alle).
es: La licencia no especifica cómo debe incluirse, por lo que cualquier cosa es válida siempre que pueda mostrarse bajo alguna condición. Estos son los enfoques más comunes (solo es necesario implementar uno de ellos, no todos).
ko: 라이선스에는 포함시키는 방법이 지정되어 있지 않기 때문에 어떤 조건에서 표시될 수 있는 것이면 무엇이든 유효합니다. 아래는 가장 일반적인 접근방식입니다 (모두가 아니라 하나만 구현하면 됩니다).
pl: Licencja nie określa, w jaki sposób ma być umieszczona w projekcie pochodnym, więc wszystkie sposoby wyświetlenia licencji spełniają wymagania pod pewnymi warunkami. Oto najpopularniejsze rozwiązania (wystarczy wdrożyć tylko jedno z nich, nie muszą być wszystkie) (oryg: The license does not specify how it has to be included, so anything is valid as long as it can be displayed under some condition. These are the most common approaches (only need to implement one of them, not all).
pt_br: A licença não especifica como deve ser incluída, portanto qualquer coisa é válida desde que ela possa ser exibida sob alguma condição. Essas são as abordagens mais comuns (só é necessário implementar uma delas, não todas).
ru: В лицензии не указано, как именно она должна быть включена, поэтому она считается действительной в любом виде, если её можно отобразить каким-либо образом. Это наиболее распространённые подходы (необходимо реализовать только один из них, не все).
uk: Ліцензія не визначає, як вона має бути включена, тому будь-яка інформація є дійсною, якщо вона може бути відображена за певних умов. Це найпоширеніші підходи (треба реалізувати лише один з них, а не всі).
zh_cn: 许可证没有指定必须包含的方式, 因此任何内容只要在某些情况下可以显示就有效. 这些是最常见的方法(只需要实现其中一种, 而不是全部).

source: Godot provides several methods to get license information in the Engine singleton. This allows you to source the license information directly from the engine binary, which prevents the information from becoming outdated if you update engine versions.
es: Godot provee diversos métodos para obtener información de licencia en el singleton Engine. Esto te permite obtener la información de licencia directamente desde el binario del motor, lo que previene obtener información desactualizada si actualizas el motor.
zh_cn: Godot 提供了多种方法来获取引擎单例中的许可证信息。 这将允许你直接从引擎二进制文件中获取许可证信息，从而防止更新引擎版本时信息过时。

source: For the engine itself:
es: Para el motor mismo:
zh_cn: 对于引擎自己：
