Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/complying_with_licenses.po
Languages: de, es, ko, pl, pt_br, ru, uk, zh_cn

source: If you exported your project using a :ref:`custom build with specific modules disabled <doc_optimizing_for_size>`, you don't need to list the disabled modules' licenses in your exported project.
de: Wenn Sie Ihr Projekt mit einem :ref:`benutzerdefinierten Build mit deaktivierten Modulen <doc_optimizing_for_size>` exportiert haben, müssen Sie die Lizenzen der deaktivierten Module in Ihrem exportierten Projekt nicht auflisten.
es: Si exportó su proyecto usando una :ref:`compilación personalizada con módulos específicos deshabilitados <doc_optimizing_for_size>`, no necesita enumerar las licencias de los módulos deshabilitados en su proyecto exportado.
ko: :ref:`비활성화 특정 모듈 커스텀 빌드<doc_optimizing_for_size>`를 사용하여 프로젝트를 내보낸 경우, 프로젝트에 비활성화 모듈의 라이선스를 명시할 필요가 없습니다.
pt_br: Se você exportou seu projeto usando uma :ref:`build customizada com módulos específicos desabilitados <doc_optimizing_for_size>`, você não precisa listar as licenças dos módulos desabilitados em seu projeto exportado.
ru: Если вы экспортировали свой проект, используя :ref:`пользовательскую сборку с отключенными определенными модулями <doc_optimizing_for_size>`, вам не нужно перечислять лицензии отключенных модулей в экспортированном проекте.
uk: Якщо ви експортували свій проект за допомогою :ref:`власної збірки з вимкненими певними модулями<doc_optimizing_for_size>`, вам не потрібно перераховувати ліцензії вимкнених модулів у експортованому проекті.
zh_cn: 如果你导出的项目使用的是\ :ref:`禁用了特定模块的自定义构建 <doc_optimizing_for_size>`\ ，在导出后的项目中无需列出禁用模块的协议。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
ko: 번역 상태
pl: Status tłumaczenia
pt_br: Progresso da Tradução
ru: Статус перевода
uk: Стан перекладу
zh_cn: 翻译状态

source: FreeType
de: FreeType-Schriften
ko: 프리타입(FreeType)
ru: FreeType (язык программирования)
uk: Вільний тип

source: ENet
uk: ЄNet

source: mbed TLS
ru: mbеd TLS
uk: ембед TLS

source: Some games have a special menu (often in the settings) to display licenses.
de: Einige Spiele haben ein spezielles Menü (oft in den Einstellungen), um Lizenzen anzuzeigen.
pl: Niektóre gry mają specjalne menu (często w ustawieniach) gdzie wyświetla się licencje.

source: Just printing the licensing text using the :ref:`print() <class_@GDScript_method_print>` function may be enough on platforms where a global output log is readable. This is the case on desktop platforms, Android and HTML5 (but not iOS and UWP).
de: Das bloße Drucken des Lizenztextes mit der Funktion :ref:`print() <class_@GDScript_method_print>` kann auf Plattformen ausreichen, auf denen ein globales Ausgabeprotokoll lesbar ist (z.B. auf Desktopplatformen, Android und HTML5, aber nicht auf iOS oder UWP).
pl: Samo wypisanie tekstu licencji za pomocą funkcji :ref:`print() <class_@GDScript_method_print>` może wystarczyć na platformach, na których można odczytać dziennik na wyjściu aplikacji (global output log ). Dzieje się tak w przypadku komputerów stacjonarnych, systemu Android i HTML5 (ale nie iOS i UWP).
