Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, fi, pt_br, zh_cn

source: Poor class-extending support in most script VMs, and adapting to the way Godot works is highly inefficient (Lua, Python, JavaScript).
cs: Špatná podpora rozšíření tříd ve většině skriptů a přizpůsobení se způsobu, jakým Godot pracuje, je vysoce neefektivní (Lua, Python, JavaScript).
de: Schlechte Unterstützung für Klassenerweiterung in den meisten Skript-VMs und die Anpassung an die Funktionsweise von Godot ist sehr ineffizient (Lua, Python, JavaScript).
fi: Useimmissa skriptivirtuaalikoneissa ei ole hyvää luokkien laajennustukea, josta johtuen Godotin toimintatapaan mukautuminen on hyvin tehotonta (Lua, Python, JS).
pt_br: Não há um bom suporte a extensão de classes na maioria das VMs de scripting, e adaptá-las para a forma como o Godot funciona é altamente ineficiente (Lua, Python, JavaScript).
zh_cn: 大多数脚本语言（Lua、Python、JavaScript）的虚拟机没有很好地支持类扩展，适配 Godot 工作方式的效率极低。

source: Many existing languages have horrible interfaces for binding to C++, resulting in a large amount of code, bugs, bottlenecks, and general inefficiency (Lua, Python, Squirrel, JavaScript, etc.). We wanted to focus on a great engine, not a great number of integrations.
zh_cn: 许多现有语言的 C++ 绑定接口都非常糟糕，会产生大量代码、错误、瓶颈，而且效率普遍低下（例如 Lua、Python、Squirrel、JavaScript 等）。我们希望专注于一个更好的引擎，而不是大量的缝合。

source: No native vector types (Vector3, Transform3D, etc.), resulting in highly reduced performance when using custom types (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
zh_cn: 没有原生的向量类型（Vector3、Transform3D 等），导致使用自定义类型实现时，性能大大降低（Lua、Python、Squirrel、JavaScript、ActionScript 等）。

source: Garbage collector results in stalls or unnecessarily large memory usage (Lua, Python, JavaScript, ActionScript, etc.).
cs: Automatická správa paměti (Garbage Collector) má za následek prodlevy nebo zbytečně velké využití paměti (Lua, Python, JavaScript, ActionScript atd.).
de: Der Garbage Collector führt zu Verzögerungen oder unnötig viel Speicherbelegung (Lua, Python, JavaScript, ActionScript, etc.).
fi: Roskienkeruu aiheuttaa pysähdyksiä tai tarpeettoman suurta muistinkulutusta (Lua, Python, JavaScript, ActionScript, jne.).
pt_br: Coletor de lixo resulta em atrasos e um grande uso desnecessário de memória (Lua, Python, JavaScript, ActionScript, etc.).
zh_cn: 在大部分解释型编程语言（Lua、Python、JavaScript、ActionScript 等）中，垃圾收集器会导致延迟或不必要的大内存使用。

source: Difficulty integrating with the code editor for providing code completion, live editing, etc. (all of them).
zh_cn: 难以与代码编辑器集成从而提供代码补全、实时编辑等功能（其他语言都这样）。

source: GDScript was designed to curtail the issues above, and more.
cs: GDScript byl navržen tak, aby omezil výše uvedené problémy a další.
de: GDScript wurde entworfen, um diese und weitere Probleme zu umgehen.
fi: GDScript suunniteltiin vähentämään sekä yllä mainittuja, että muitakin ongelmia.
pt_br: O GDScript foi projetado para reduzir os problemas acima, e mais.
zh_cn: GDScript 是为了减少上述问题以及防止更多问题而设计的。

source: What 3D model formats does Godot support?
pt_br: Quais tipos de formatos de modelos 3D são suportados por Godot?
zh_cn: Godot 支持哪些 3D 模型格式？

source: You can find detailed information on supported formats, how to export them from your 3D modeling software, and how to import them for Godot in the :ref:`doc_importing_3d_scenes` documentation.
pt_br: Você pode encontrar informações detalhadas sobre formatos suportados, como exportá-los pelo seu software de modelagem 3D e como importá-los para o Godot na :ref:`doc_importing_3d_scenes` documentação.
zh_cn: 你可以在 :ref:`doc_importing_3d_scenes` 文档中找到有关支持的格式、如何从 3D 建模软件导出以及如何导入 Godot 的详细信息。

source: Will [insert closed SDK such as FMOD, GameWorks, etc.] be supported in Godot?
cs: Bude [vložit uzavřemé SDK, jako je FMOD, GameWorks atd.] v Godotu podporováno?
de: Wird [proprietäres SDK à la FMOD, GameWorks, etc. hier einfügen] in Godot unterstützt werden?
fi: Tuleeko [lisää tähän suljettu SDK kuten FMOD, GameWorks, tms.] olemaan tuettu Godotissa?
pt_br: O [insira aqui um SDK fechado como FMOD, GameWorks, etc.] será suportado no Godot?
zh_cn: Godot 会支持【此处插入 FMOD、GameWorks 等闭源 SDK 的名字】吗？

source: The aim of Godot is to create a free and open source MIT-licensed engine that is modular and extendable. There are no plans for the core engine development community to support any third-party, closed-source/proprietary SDKs, as integrating with these would go against Godot's ethos.
zh_cn: Godot 的目标是创建一个自由开源、MIT 许可、模块化和可扩展的引擎。核心引擎开发社区没有计划支持任何第三方、闭源或专有 SDK，因为集成这些 SDK 会违背 Godot 的精神。

source: That said, because Godot is open source and modular, nothing prevents you or anyone else interested in adding those libraries as a module and shipping your game with them, as either open- or closed-source.
zh_cn: 正因为 Godot 是开源和模块化的，所以没有什么能阻止你或其他任何感兴趣的人将这些库添加为模块，并以开源或闭源的方式在你的游戏中使用他们。

source: To see how support for your SDK of choice could still be provided, look at the Plugins question below.
cs: Chcete-li zjistit, jak by mohlo být podpoporováno vámi vybrané SDK, podívejte se níže na otázku týkající se pluginů .
de: Wie die Implementierung für Ihr gewünschtes SDK doch umgesetzt werden kann, erfähren Sie in der Fragestellung zu Plugins weiter unten im Text.
fi: Nähdäksesi kuinka haluamallesi SDK:lle voidaan lisätä tuki, katso Liitännäiset kysymystä yllä.
pt_br: Para ver como prover suporte a seu SDK de preferência, veja a pergunta sobre Plugins acima.
zh_cn: 如欲了解如何支持你使用的 SDK，请查看下面的插件问题。

source: If you know of a third-party SDK that is not supported by Godot but that offers free and open source integration, consider starting the integration work yourself. Godot is not owned by one person; it belongs to the community, and it grows along with ambitious community contributors like you.
zh_cn: 如果你知道 Godot 尚不支持但提供自由和开源集成的第三方SDK，请考虑自己开始集成工作。Godot 不属于个人；它属于社区，它与像你一样雄心勃勃的社区贡献者一起成长。

source: How can I extend Godot?
cs: Jak mohu rozšířit Godot?
de: Wie kann ich Godot erweitern?
fi: Miten voin laajentaa Godotia?
pt_br: Como posso fazer extensões para o Godot?
zh_cn: 如何扩展 Godot？

source: For extending Godot, like creating Godot Editor plugins or adding support for additional languages, take a look at :ref:`EditorPlugins <doc_making_plugins>` and tool scripts.
cs: Chcete-li rozšířit Godot, například vytvořit pluginy editoru Godot nebo přidat podporu pro další jazyky, podívejte se na :ref:`EditorPlugins <doc_making_plugins>` a skripty nástrojů.
de: Um Godot zu erweitern, zum Beispiel durch das Erstellen von Editorerweiterungen oder die Unterstützung weiterer Sprachen, siehe :ref:`Plugins <doc_making_plugins>` und die Tool-Skripte.
fi: Godotin laajentamiseksi, kuten Godot Editorin liitännäisten luomiseksi tai ylimääräisen kielen tuen lisäämiseksi, katso :ref:`EditorPlugins <doc_making_plugins>` ja työkaluskriptejä.
pt_br: Para criar extensões para o Godot, como plugins para o Editor ou adicionar suporte a novas linguagens, dê uma olhada em :ref:`Criando Plugins <doc_making_plugins>` e ferramentas de scripts.
zh_cn: 要扩展 Godot，比如创建 Godot 编辑器插件或添加对其他语言的支持，请参阅\ :ref:`编辑器插件 <doc_making_plugins>`\ 和工具脚本。

source: Also, see the official blog post on GDExtension, a way to develop native extensions for Godot:
pt_br: Além disto, veja as postagem do blog oficial sobre GDExtension, um caminho para desenvolver extensões nativas para a Godot:
zh_cn: 另外，可以看看官方的博客文章，了解 GDExtension ，一种为Godot开发原生扩展的方法：

source: `Introducing GDNative's successor, GDExtension <https://godotengine.org/article/introducing-gd-extensions>`_
zh_cn: `GDNative 的继任者，GDExtension 来了！ <https://godotengine.org/article/introducing-gd-extensions>`_

source: You can also take a look at the GDScript implementation, the Godot modules, as well as the `Jolt physics engine integration <https://github.com/godot-jolt/godot-jolt>`__ for Godot. This would be a good starting point to see how another third-party library integrates with Godot.
zh_cn: 你还可以查看 GDScript 的实现，Godot 模块以及 Godot 的\ `Jolt 物理引擎集成 <https://github.com/godot-jolt/godot-jolt>`__\ 。这个将是你了解如何将第三方库整合到 Godot 中的一个很好的起点。

source: How do I install the Godot editor on my system (for desktop integration)?
de: Wie installiere ich den Godot Editor (für Desktop Integration) auf meinem System?
fi: Kuinka asennan Godot editorin järjestelmälleni (työpöytäintegrointia varten)?
pt_br: Como instalo o editor Godot no meu sistema (para integração com desktop)?
zh_cn: 如何在我的系统上安装 Godot 编辑器（进行桌面集成）？

source: Since you don't need to actually install Godot on your system to run it, this means desktop integration is not performed automatically. There are two ways to overcome this. You can install Godot from `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (all platforms), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) or `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux). This will automatically perform the required steps for desktop integration.
de: Da Godot für die Ausführung nicht unbedingt auf dem eigenen System installiert werden muss, bedeutet es, dass die Desktop-Integration nicht automatisch passiert. Es gibt zwei Wege das zu bewältigen. Sie können Godot von `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (alle Plattformen), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) oder `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux) installieren. Dies wird automatisch die benötigten Schritte für eine Desktop-Integration ausführen.
pt_br: Como você não precisa realmente instalar o Godot em seu sistema para executá-lo, isso significa que a integração com a área de trabalho não é realizada automaticamente. Existem duas maneiras de contornar isso. Você pode instalar Godot pela `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__ (todas as plataformas), `Scoop <https://scoop.sh/>`__ (Windows), `Homebrew <https://brew.sh/>`__ (macOS) ou `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__ (Linux). Isso executará automaticamente as etapas necessárias para a integração da área de trabalho.
zh_cn: Godot 实际并不需要在你的系统上进行安装就能够运行，因此不会自动进行桌面集成。解决方法有两种。你可以通过 `Steam <https://store.steampowered.com/app/404790/Godot_Engine/>`__\ （全平台）、\ `Scoop <https://scoop.sh/>`__\ （Windows）、\ `Homebrew <https://brew.sh/>`__\ （macOS）、\ `Flathub <https://flathub.org/apps/details/org.godotengine.Godot>`__\ （Linux）来安装 Godot。这样就会自动执行桌面集成所需的步骤。

source: Alternatively, you can manually perform the steps that an installer would do for you:
de: Alternativ können Sie die Schritte, die ein Installationsprogramm für Sie erledigen würde, auch manuell durchführen:
fi: Vaihtoehtoisesti voit manuaalisesti tehdä asennuksen vaiheet, jotka asennus ohjelma tekisi puolestasi:
pt_br: Como alternativa, você pode executar manualmente as etapas que um instalador faria por você:
zh_cn: 另外你也可以手动执行安装文件会帮你执行的步骤：

source: Move the Godot executable to a stable location (i.e. outside of your Downloads folder), so you don't accidentally move it and break the shortcut in the future.
de: Verschieben Sie die ausführbare Godot-Datei an einen dauerhaften Speicherort (z.B. außerhalb des Downloads-Ordners), damit Sie sie nicht aus Versehen verschieben und die Verknüpfung in Zukunft nicht mehr funktioniert.
fi: Siirrä Godotin suoritustiedosto pysyvään sijaintiin (eli lataukset-kansion ulkopuolelle), jotta et siirrä sitä vahingossa ja riko pikakuvaketta tulevaisuudessa.
pt_br: Mova o executável do Godot para um local estável (ou seja, fora da sua pasta Downloads), para que você não o mova acidentalmente e quebre o atalho no futuro.
zh_cn: 将 Godot 可执行文件移动到稳定的位置（即你的 Downloads 文件夹之外），这样你以后就不会不小心对它进行移动、不会破坏快捷方式了。

source: Right-click the Godot executable and choose **Create Shortcut**.
de: Klicken Sie mit der rechten Maustaste auf die ausführbare Godot-Datei und wählen Sie **Verknüpfung erstellen**.
fi: Napsauta hiiren oikealla painikkeella Godotin suoritustiedostoa ja valitse **Luo pikakuvake**.
pt_br: Clique com o botão direito do mouse no executável Godot e escolha **Criar atalho**.
zh_cn: 右键单击 Godot 可执行文件，选择\ **创建快捷方式**\ 。

source: Move the created shortcut to ``%APPDATA%\Microsoft\Windows\Start Menu\Programs``. This is the user-wide location for shortcuts that will appear in the Start menu. You can also pin Godot in the task bar by right-clicking the executable and choosing **Pin to Task Bar**.
zh_cn: 将创建的快捷方式移动到 ``%APPDATA%\Microsoft\Windows\Start Menu\Programs``\ 。这是针对用户的快捷方式存放位置，它会显示在开始菜单中。你也可以将 Godot 固定在任务栏上，右键单击可执行文件并选择\ **固定至任务栏**\ 即可。

source: Drag the extracted Godot application to ``/Applications/Godot.app``, then drag it to the Dock if desired. Spotlight will be able to find Godot as long as it's in ``/Applications`` or ``~/Applications``.
de: Ziehen Sie die entpackte Godot-Anwendung nach ``/Applications/Godot.app`` und ziehen Sie sie dann, falls gewünscht, in das Dock. Spotlight wird Godot finden können, solange es sich in ``/Applications`` oder ``~/Applications`` befindet.
pt_br: Arraste o aplicativo Godot extraído para ``/Applications/Godot.app``, então arraste-o para o Dock se desejar. O Spotlight será capaz de encontrar o Godot desde que esteja em ``/Applications`` ou ``~/Applications``.
zh_cn: 将解压出的 Godot 应用拖拽至 ``/Applications/Godot.app``\ ，如果需要的话还可以再拖到 Dock 栏上。只要 Godot 在 ``/Applications`` 或 ``~/Applications`` 中，“聚焦”就能找到它。

source: Move the Godot binary to a stable location (i.e. outside of your Downloads folder), so you don't accidentally move it and break the shortcut in the future.
de: Verschieben Sie die ausführbare Godot-Datei an einen dauerhaften Speicherort (z.B. außerhalb des Downloads-Ordners), damit Sie sie nicht aus Versehen verschieben und die Verknüpfung in Zukunft nicht mehr funktioniert.
pt_br: Mova o binário do Godot para um local estável (ou seja, fora da sua pasta Downloads), para que você não o mova acidentalmente e quebre o atalho no futuro.
zh_cn: 将 Godot 二进制文件移动到稳定的位置（即你的 Downloads 文件夹之外），这样你以后就不会不小心对它进行移动、不会破坏快捷方式了。

source: Rename and move the Godot binary to a location present in your ``PATH`` environment variable. This is typically ``/usr/local/bin/godot`` or ``/usr/bin/godot``. Doing this requires administrator privileges, but this also allows you to :ref:`run the Godot editor from a terminal <doc_command_line_tutorial>` by entering ``godot``.
de: Benennen Sie die Godot-Anwendung um und verschieben Sie sie an einen Ort, der in Ihrer ``PATH`` Umgebungsvariablen enthalten ist. Dies ist normalerweise ``/usr/local/bin/godot`` oder ``/usr/bin/godot``. Dazu sind zwar Administratorrechte erforderlich, aber damit können Sie auch :ref:`den Godot-Editor von einem Terminal aus starten <doc_command_line_tutorial>`, indem Sie ``godot`` eingeben.
pt_br: Renomeie e mova o binário do Godot para um local presente em sua variável de ambiente ``PATH``. Normalmente é ``/usr/local/bin/godot`` ou ``/usr/bin/godot``. Fazer isso requer privilégios de administrador, mas também permite que você :ref:`execute o editor Godot a partir de um terminal <doc_command_line_tutorial>` digitando ``godot``.
zh_cn: 将 Godot 二进制文件进行重命名，然后移动到处于 ``PATH`` 环境变量中的某个位置。通常是 ``/usr/local/bin/godot`` 或者 ``/usr/bin/godot``\ 。这个操作需要管理员权限，不过能够让你通过输入 ``godot`` 直接\ :ref:`从命令行运行 Godot 编辑器 <doc_command_line_tutorial>`\ 。

source: If you cannot move the Godot editor binary to a protected location, you can keep the binary somewhere in your home directory, and modify the ``Path=`` line in the ``.desktop`` file linked below to contain the full *absolute* path to the Godot binary.
de: Wenn Sie die Godot-Editor-Anwendung nicht an einen geschützten Ort verschieben können, ist es auch möglich, die Binärdatei irgendwo in Ihrem Heimatverzeichnis aufzubewahren und die Zeile ``Path=`` in der unten verlinkten Datei ``.desktop`` so zu ändern, dass sie den vollständigen *absoluten* Pfad zur Godot-Anwendung enthält.
pt_br: Se você não pode mover o binário do editor Godot para um local protegido, você pode manter o binário em algum lugar em seu diretório pessoal, e modificar a linha ``Path=`` no arquivo ``.desktop`` linkado abaixo para conter o * caminho absoluto* para o binário do Godot.
zh_cn: 如果你无法将 Godot 编辑器二进制文件移动到受保护的位置，你可以将它保存在你的家目录中的某个位置，然后修改下方链接的 ``.desktop`` 文件中的 ``Path=`` 行，让它包含指向 Godot 二进制文件的完整\ *绝对*\ 路径。

source: Save `this .desktop file <https://raw.githubusercontent.com/godotengine/godot/master/misc/dist/linux/org.godotengine.Godot.desktop>`__ to ``$HOME/.local/share/applications/``. If you have administrator privileges, you can also save the ``.desktop`` file to ``/usr/local/share/applications`` to make the shortcut available for all users.
zh_cn: 将\ `这个 .desktop 文件 <https://raw.githubusercontent.com/godotengine/godot/master/misc/dist/linux/org.godotengine.Godot.desktop>`__\ 保存到 ``$HOME/.local/share/applications/``\ 。如果你有管理员权限，你还可以把这个 ``.desktop`` 文件保存到 ``/usr/local/share/applications`` 中，这样所有用户就都能够使用这个快捷方式了。

source: Is the Godot editor a portable application?
cs: Je editor Godot přenosná aplikace?
de: Ist der Godot-Editor eine portable Anwendung?
pt_br: O editor Godot é um aplicativo portátil?
zh_cn: Godot 编辑器是绿色应用吗？

source: In its default configuration, Godot is *semi-portable*. Its executable can run from any location (including non-writable locations) and never requires administrator privileges.
de: In seiner Standardkonfiguration ist Godot *halbportabel*. Seine ausführbare Datei kann von jedem Ort aus ausgeführt werden (auch von nicht beschreibbaren Orten) und erfordert keine Administratorrechte.
pt_br: Em sua configuração padrão, Godot é *semi-portátil*. Seu executável pode ser executado em qualquer local (incluindo locais não graváveis) e nunca requer privilégios de administrador.
zh_cn: 默认配置下，Godot 是\ *半绿色*\ 的。从任何位置运行都可以运行它的可执行文件（包括无法写入的位置），无须管理员权限。

source: However, configuration files will be written to the user-wide configuration or data directory. This is usually a good approach, but this means configuration files will not carry across machines if you copy the folder containing the Godot executable. See :ref:`doc_data_paths` for more information.
de: Die Konfigurationsdateien werden jedoch in das benutzerweite Konfigurations- oder Datenverzeichnis geschrieben. Dies ist in der Regel ein guter Ansatz, aber das bedeutet, dass Konfigurationsdateien nicht auf andere Rechner übertragen werden, wenn Sie den Ordner mit der ausführbaren Godot-Datei kopieren. Siehe :ref:`doc_data_paths` für weitere Informationen.
pt_br: No entanto, os arquivos de configuração serão gravados na configuração do usuário atual ou no diretório de dados. Esta é geralmente uma boa abordagem, mas isso significa que os arquivos de configuração não serão utilizáveis em máquinas diferentes se você copiar a pasta que contém o executável Godot. Veja :ref:`doc_data_paths` para mais informações.
zh_cn: 不过，配置文件会写入到针对用户的配置或数据目录。通常来说，这是不错的做法，但也意味着将包含 Godot 可执行文件的文件夹复制到另一台机器上是无法带走配置文件的。更多信息请参阅 :ref:`doc_data_paths`\ 。

source: If *true* portable operation is desired (e.g. for use on an USB stick), follow the steps in :ref:`doc_data_paths_self_contained_mode`.
de: Wenn ein *echter* portabler Betrieb gewünscht ist (z.B. für die Verwendung auf einem USB-Stick), folgen Sie den Schritten in :ref:`doc_data_paths_self_contained_mode`.
pt_br: Se uma *verdadeira* operação portátil for desejada (como por exemplo, para uso em um pendrive), siga as etapas em :ref:`doc_data_paths_self_contained_mode`.
zh_cn: 如果你需要\ *真·绿色*\ 的操作（例如放到 U 盘上使用），请按照 :ref:`doc_data_paths_self_contained_mode` 中的步骤操作。

source: Why does Godot use Vulkan or OpenGL instead of Direct3D?
cs: Proč Godot používá místo Direct3D Vulkan nebo OpenGL?
de: Warum verwendet Godot Vulkan oder OpenGL anstelle von Direct3D?
fi: Miksi Godot käyttää Vulkania tai OpenGL:ää Direct3d:n sijasta?
pt_br: Por que o Godot usa Vulkan ou OpenGL ao invés do Direct3D?
zh_cn: 为什么 Godot 使用 Vulkan/OpenGL 而不是 Direct3D？

source: Godot aims for cross-platform compatibility and open standards first and foremost. OpenGL and Vulkan are the technologies that are both open and available on (nearly) all platforms. Thanks to this design decision, a project developed with Godot on Windows will run out of the box on Linux, macOS, and more.
zh_cn: Godot 致力于实现跨平台兼容性和开放式标准。OpenGL 和 Vulkan 是几乎在所有平台上都开放且可用的技术。得益于这一设计，在 Windows 上使用 Godot 开发的项目也能在 Linux、macOS 等平台上开箱即用。

source: Since Godot only has a few people working on its renderer, we would prefer having fewer rendering backends to maintain. On top of that, using a single API on all platforms allows for greater consistency with fewer platform-specific issues.
cs: Vzhledem k tomu, že Godot pracuje na svém rendereru pouze s několika lidmi, upřednostňovali bychom, aby se udržovalo méně backendů vykreslování. Kromě toho umožňuje použití jediného rozhraní API na všech platformách větší konzistenci s menším počtem problémů specifických pro jednotlivé platformy.
de: Da am Godot-Renderer nur wenige Leute arbeiten, würden wir es bevorzugen, weniger Renderer zu unterstützen. Darüber hinaus bietet eine einzelne, verwendete API auf allen Platformen eine höhere Konsitenz und weniger plattformspezifische Probleme.
fi: Koska Godotilla on vain muutama henkilö kehittämässä sen renderöijää, suosisimme että meillä olisi vähemmän renderöinti backendejä ylläpidettävänä. Sen lisäksi, yhden API:n käyttäminen kaikilla alustoilla mahdollistaa paremman johdonmukaisuuden vähemmillä alustakohtaisilla ongelmilla.
pt_br: Como Godot tem apenas algumas pessoas trabalhando em seu renderizador, preferimos ter menos back-ends de renderização para manter. Além disso, usar uma única API em todas as plataformas permite maior consistência com menos problemas específicos de cada plataforma.
zh_cn: 由于 Godot 只有少数人在处理其渲染器，因此我们希望维护较少的渲染后端。最重要的是，在所有平台上使用单个 API 可以提高一致性，减少特定于平台的问题。

source: In the long term, we may develop a Direct3D 12 renderer for Godot (mainly for Xbox), but Vulkan and OpenGL will remain the default rendering backends on all platforms, including Windows.
zh_cn: 从长远来看，我们可能会为 Godot 开发 Direct3D 12 渲染器（主要用于 Xbox ），但 Vulkan 和 OpenGL 仍将是所有平台（包括 Windows）上的默认渲染后端。

source: Why does Godot aim to keep its core feature set small?
cs: Proč se Godot snaží udržet svou základní sadu funkcí malou?
de: Warum ist die Godot Engine darauf aus, ihren Funktionsumfang klein zu halten?
fi: Miksi Godot pyrkii pitämään ydintoimintojen kokoelman pienenä?
pt_br: Por que Godot pretende manter seu conjunto de recursos principais pequeno?
zh_cn: 为什么 Godot 旨在保持其核心功能集较小？

source: Godot intentionally does not include features that can be implemented by add-ons unless they are used very often. One example of something not used often is advanced artificial intelligence functionality.
zh_cn: Godot 有意不包含可以通过附加组件实现的功能，除非它们非常常用。不经常使用的一个例子是高级人工智能功能。

source: There are several reasons for this:
cs: Existuje několik důvodů:
de: Dafür gibt es mehrere Gründe:
fi: Tähän on useita syitä:
pt_br: Há algumas razões para isto:
zh_cn: 这有几个原因：

source: **Code maintenance and surface for bugs.** Every time we accept new code in the Godot repository, existing contributors often take the responsibility of maintaining it. Some contributors don't always stick around after getting their code merged, which can make it difficult for us to maintain the code in question. This can lead to poorly maintained features with bugs that are never fixed. On top of that, the "API surface" that needs to be tested and checked for regressions keeps increasing over time.
zh_cn: **代码维护和表面 bug。** 每次我们在 Godot 仓库中接受新的代码时，现有的贡献者往往会承担起维护它的责任。一些贡献者在合并他们的代码后并不总是坚持下去，这会使我们难以维护有问题的代码。这可能会导致维护不善的功能会带有从未修复的错误。最重要的是，需要测试和检查回归的“API 表面”随着时间的推移不断增加。
