Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, fi, pt_br, zh_cn

source: **Ease of contribution.** By keeping the codebase small and tidy, it can remain fast and easy to compile from source. This makes it easier for new contributors to get started with Godot, without requiring them to purchase high-end hardware.
cs: **Snadné přispívání.** Díky tomu, že je kódová základna malá a přehledná,ji lzei i nadále rychle a snadno kompilovat ze zdrojových kódů. Noví přispěvatelé tak mohou s Godotem snáze začít pracovat, aniž by museli kupovat špičkový hardware.
de: **Kleiner Beitrag.** Wenn der Code klein und übersichtlich bleibt, geht es schneller und leichter, den Code zu Kompilieren. Das macht es einfacher für neue Entwickler, mit Godot zu starten, ohne High-end Hardware kaufen zu müssen.
fi: **Osallistumisen helppous.** Koska koodi on pieni ja siisti, sen kääntäminen on helppoa ja nopeaa. Tämän vuoksi uusien osallistujien on helppo alkaa kehittämään Godotia ilman kallista laitteistoa.
pt_br: **Facilidade de contribuição.** Mantendo a base de código pequena e limpa, a tarefa de compilar o código-fonte continuará simples e rápida. Isso deixa mais fácil para novos contribuidores começarem a trabalhar com o Godot, sem a necessidade dos mesmos comprarem máquinas mais potentes.
zh_cn: **易于贡献。**\ 通过保持代码库小而整洁, 可以保持快速、轻松地从源代码编译。这使得新贡献者更容易入门 Godot，无需他们购买高端硬件。

source: **Keeping the binary size small for the editor.** Not everyone has a fast Internet connection. Ensuring that everyone can download the Godot editor, extract it and run it in less than 5 minutes makes Godot more accessible to developers in all countries.
cs: **Udržování malé velikosti binárního souboru pro editor.** Ne každý má rychlé připojení k internetu. Zajištění toho, aby si každý mohl stáhnout editor Godot, rozbalit jej a spustit za méně než 5 minut, činí Godot přístupnějším pro vývojáře ve všech zemích.
de: **Halten Sie die Binärgröße für den Editor klein.** Nicht jeder besitzt eine schnelle Internet Verbindung. Wenn Sie sicherstellen, dass jeder den Godot-Editor herunterladen, extrahieren und in weniger als 5 Minuten ausführen kann, ist Godot für Entwickler in allen Ländern zugänglicher.
fi: **Editorin tiedostokoon pitäminen pienenä.** Kaikilla ei ole nopeaa Internet-yhteyttä. Godotin lataaminen ja käyttäminen alle viidessä minuutissa tekee siitä helpommin saatavamman kehittäjille ympäri maailmaa.
pt_br: **Manter o tamanho binário pequeno para o editor.** Nem todos têm uma conexão rápida com a Internet. Ter certeza de que todos podem baixar o Godot, extraí-lo e rodá-lo em menos de 5 minutos faz dele mais acessível para desenvolvedores em todos os países.
zh_cn: **为编辑器保持较小的二进制大小。**\ 并非每个人都拥有快速的 Internet 连接。确保每个人都可以在 5 分钟内下载、解压缩并运行 Godot 编辑器，这使得所有国家/地区的开发人员都可以更轻松地访问 Godot。

source: **Keeping the binary size small for export templates.** This directly impacts the size of projects exported with Godot. On mobile and web platforms, keeping file sizes low is important to ensure fast installation and loading on underpowered devices. Again, there are many countries where high-speed Internet is not readily available. To add to this, strict data usage caps are often in effect in those countries.
zh_cn: **为导出模板保持较小的二进制大小。**\ 这直接影响到 Godot 导出的项目的大小。在移动和 Web 平台上，较小的文件大小是低端设备上快速安装和加载的首要条件。同上，在许多国家，高速网络并不普及。并且这些国家往往有严格的网络流量上限。

source: For all the reasons above, we have to be selective of what we can accept as core functionality in Godot. This is why we are aiming to move some core functionality to officially supported add-ons in future versions of Godot. In terms of binary size, this also has the advantage of making you pay only for what you actually use in your project. (In the meantime, you can :ref:`compile custom export templates with unused features disabled <doc_optimizing_for_size>` to optimize the distribution size of your project.)
de: Aus all den oben genannten Gründen müssen wir selektiv auswählen, was wir als Kernfunktionalität in Godot akzeptieren können. Aus diesem Grund möchten wir einige Kernfunktionen in zukünftigen Versionen von Godot auf offiziell unterstützte Add-Ons übertragen. In Bezug auf die Dateigröße hat das auch den Vorteil, dass man nur die wirklich benötigten Funktionen mit im finalen Export hat. So kann die Größe des Export minimiert werden. (In der Zwischenzeit ist es auch möglich :ref: `benutzerdefinierte Exportvorlagen mit deaktivierten nicht verwendeten Funktionen zu kompilieren <doc_optimizing_for_size>` , um die Verteilungsgröße Ihres Projekts zu optimieren.)
pt_br: Por todas as razões acima, temos que ser seletivos no que podemos aceitar como funcionalidade base no Godot. Esse é o motivo pelo qual pretendemos mover algumas funcionalidades base para add-ons oficiais em versões futuras do Godot. Em termos de tamanho do binário, isso também tem a vantagem de fazer com que você "pague" somente pelo que usa em seu projeto. (Enquanto isso, você pode :ref:`compilar modelos de exportação personalizados com certas funcionalidades desabilitadas <doc_optimizing_for_size>` para otimizar o tamanho de seu projeto.)
zh_cn: 基于上述原因，我们必须选择哪些功能作为 Godot 的核心功能。这就是为什么我们计划在 Godot 的未来版本里，将转移一些核心功能到官方支持的附加组件中。在文件大小方面，这也算是一个优点，你的项目可以精简掉没有实际使用过的功能（目前，你可以通过\ :ref:`编译自定义导出模板、禁用未使用的功能 <doc_optimizing_for_size>`\ 来优化项目的发布大小。）

source: How should assets be created to handle multiple resolutions and aspect ratios?
cs: Jak by měly být vytvořeny zdroje, aby zvládaly vícenásobná rozlišení a poměry stran?
de: Wie sollten Assets für einen optimalen Umgang mit unterschiedlichen Bildschirmauflösungen und Seitenverhältnissen angelegt werden?
fi: Kuinka assetit pitäisi luoda ottaen huomioon useat näyttötarkkuudet ja kuvasuhteet?
pt_br: Como devem ser criados os assets para lidar com múltiplas resoluções ou proporções de tela?
zh_cn: 如果要适配多种分辨率和纵横比，资产应做哪些处理？

source: This question pops up often and it's probably thanks to the misunderstanding created by Apple when they originally doubled the resolution of their devices. It made people think that having the same assets in different resolutions was a good idea, so many continued towards that path. That originally worked to a point and only for Apple devices, but then several Android and Apple devices with different resolutions and aspect ratios were created, with a very wide range of sizes and DPIs.
cs: Tato otázka se objevuje často a je to pravděpodobně díky nedorozumění, které vytvořilo Apple, když původně zdvojnásobilo rozlišení svých zařízení. To přimělo lidi, aby si mysleli, že mít stejné zdroje v různých rozlišeních, je dobrý nápad, a tak mnozí pokračovali dál touto cestou. To původně fungovalo jenom do určité míry a pouze pro zařízení Apple, ale poté bylo vytvořeno několik dalších zařízení Android a Apple s různými rozlišeními a poměry stran, s velmi širokou škálou velikostí a DPI.
de: Diese Frage kommt häufig auf und rührt wahrscheinlich von einem durch Apple entstandenen Missverständnisses, als sie damit begannen, eine Verdoppelung der Größe ihrer Bildschirmauflösungen vorzunehmen. Es ließ die Leute in dem Glauben, Assets in verschiedenen Größen bereitzustellen sei eine gute Idee, und so fand diese Praxis immer häufiger Einzug bei Entwicklern. Dies klappte jedoch nur bis zu einem gewissen Grad und ausschließlich für Apple-Geräte, jedoch nicht für Android- und spätere Apple-Produkte, die mit einer deutlich größeren Bandbreite neuer Bildschirmgrößen und DPIs ausgestattet waren.
fi: Tämä kysymys pulpahtaa esiin usein ja siitä käy luultavasti kiittäminen Applen luoman väärinkäsityksen, kun he alun perin tuplasivat laitteidensa näyttötarkkuuden. Se sai ihmiset ajattelemaan, että samojen assettien käyttäminen eri näyttötarkkuuksilla oli hyvä idea, joten moni jatkoi sillä polulla. Se toimin alun perin tiettyyn pisteeseen saakka ja vain Applen laitteilla, mutta sen jälkeen on luotu monta Android- ja Apple-laitetta eri näyttötarkkuuksilla ja kuvasuhteila, hyvin laajalla joukolla eri kokoja ja kuvapistetiheyksiä.
pt_br: Essa pergunta aparece com frequência e provavelmente por conta do desentendimento criado pela Apple quando eles dobraram a resolução de seus dispositivos. Isso fez as pessoas pensarem que ter os mesmos conteúdos em diferentes resoluções era uma boa ideia, então muitos continuaram nesse caminho. Aquilo funcionou até certo ponto e só em dispositivos Apple, mas então vários dispositivos Apple e Android com diferentes resoluções e aspectos foram criados, e com uma variedade enorme de tamanhos e DPIs.
zh_cn: 这个问题很常见，可能要归功于苹果公司。苹果一开始将它们的设备分辨率加倍，让人觉得不同分辨率使用相同的资产是个好主意，所以很多人就这么做下去了。起初只有苹果设备这么做，但 Android 和后来的苹果设备又有了不同的分辨率和宽高比，它们的大小和 DPI 变得多种多样。

source: The most common and proper way to achieve this is to, instead, use a single base resolution for the game and only handle different screen aspect ratios. This is mostly needed for 2D, as in 3D, it's just a matter of camera vertical or horizontal FOV.
zh_cn: 最常见和最恰当的处理方法是，为游戏使用单一基本分辨率，并仅处理不同的屏幕宽高比。主要是 2D 游戏需要这么做，在 3D 游戏中它只是相机的垂直或水平 FOV 的问题。

source: Choose a single base resolution for your game. Even if there are devices that go up to 1440p and devices that go down to 400p, regular hardware scaling in your device will take care of this at little or no performance cost. The most common choices are either near 1080p (1920x1080) or 720p (1280x720). Keep in mind the higher the resolution, the larger your assets, the more memory they will take and the longer the time it will take for loading.
zh_cn: 为游戏选择单一的基础分辨率。即使有分辨率高达 1440p 的设备和低至 400p 的设备，设备中的常规硬件扩展也可以在很少或没有性能成本的情况下解决这个问题。分辨率最常见的选择是接近 1080p (1920x1080) 或 720p (1280x720)。请记住，分辨率越高，资产越大，所需的内存就越多，加载所需的时间也就越长。

source: Use the stretch options in Godot; canvas items stretching while keeping aspect ratios works best. Check the :ref:`doc_multiple_resolutions` tutorial on how to achieve this.
zh_cn: 使用 Godot 中的拉伸选项；画布项目在保持宽高比时拉伸效果最好。请参阅教程 :ref:`doc_multiple_resolutions` 来学习如何实现。

source: Determine a minimum resolution and then decide if you want your game to stretch vertically or horizontally for different aspect ratios, or if there is one aspect ratio and you want black bars to appear instead. This is also explained in :ref:`doc_multiple_resolutions`.
cs: Určete minimální rozlišení a poté se rozhodněte, zda chcete, aby se vaše hra natahovala svisle nebo vodorovně pro různé poměry stran, nebo zda existuje jeden poměr stran a chcete, aby se místo toho zobrazovaly černé pruhy. To je také vysvětleno v :ref:`doc_multiple_resolutions` .
de: Setze eine minimale Auflösung und entscheide dann, ob das Spiel horizontal oder vertikal gestreckt werden soll (bei unterschiedlichen Seitenverhältnissen), oder ob um eine fixe Auflösung herum schwarze Balken gezeichnet werden sollen. Das wird auch in :ref:`doc_multiple_resolutions` erklärt.
fi: Määritä pienin näyttötarkkuus ja päätä sitten haluatko pelisi venyvän pysty- vai vaakasuunnassa eri kuvasuhteille, vai onko sen sijaan olemassa yksi kuvasuhde ja haluat mustien reunusten ilmestyvän. Tämä on selitetty myös osiossa :ref:`doc_multiple_resolutions`.
pt_br: Determine uma resolução mínima e decida se deseja que seu jogo se estenda vertical ou horizontalmente para diferentes proporções, ou se há uma proporção mínima e você deseja que barras pretas apareçam nas bordas. Isso também é explicado em :ref:`doc_multiple_resolutions`.
zh_cn: 确定最小分辨率，然后决定是否希望游戏垂直或水平拉伸以获得不同的宽高比，或者如果有一个宽高比并且你希望显示黑条。这也在 :ref:`doc_multiple_resolutions` 中有所解释。

source: For user interfaces, use the :ref:`anchoring <doc_size_and_anchors>` to determine where controls should stay and move. If UIs are more complex, consider learning about Containers.
cs: U uživatelských rozhraní použijte :ref:`kotvení <doc_size_and_anchors>`, abyste určili, kde by měly ovládací prvky zůstat a kam by se měly případně pohybovat. Pokud jsou uživatelská rozhraní komplexnější, zvažte poučení o kontejnerech.
de: Um das Verhalten von Steuerelementen im Raum besser zu kontrollieren, sollten Sie diese :ref:`verankern <doc_size_and_anchors>`. Bei komplexeren Benutzeroberflächen ist es ratsam, sich zudem über Container zu informieren.
fi: Käyttöliittymiä varten käytä :ref:`ankkurointia <doc_size_and_anchors>` määrittääksesi missä kontrollien pitäisi sijaita ja minne niiden pitäisi siirtyä. Jos käyttöliittymät ovat monimutkaisempia, harkitse Container-rakenteiden opettelua.
pt_br: Para interfaces de usuário, utilize a :ref:`ancoragem <doc_size_and_anchors>` para determinar onde os controles devem estar e se mover. Se as interfaces são mais complexas, considere aprender sobre Containers.
zh_cn: 对于用户界面，请使用 :ref:`锚定 <doc_size_and_anchors>` 来确定控件应停留和移动的位置。如果 UI 更复杂，请考虑学习 Container（容器）。

source: And that's it! Your game should work in multiple resolutions.
cs: A to je vše! Vaše hra by měla fungovat ve více rozlišeních.
de: Und das war's! Das Spiel dürfte nun in mehreren Auflösungen funktionieren.
fi: Ja siinä se! Pelisi pitäisi toimia useilla eri näyttötarkkuuksilla.
pt_br: E é isso! Seu jogo deve funcionar em múltiplas resoluções.
zh_cn: 就是这样！你的游戏应该能够以多种分辨率运行了。

source: When is the next release of Godot out?
cs: Kdy vyjde další verze Godota?
de: Wann erscheint die nächste Godot-Version?
fi: Milloin Godotin seuraava versio julkaistaan?
pt_br: Quando será o próximo lançamento do Godot?
zh_cn: Godot 的下一个版本什么时候发布？

source: When it's ready! See :ref:`doc_release_policy_when_is_next_release_out` for more information.
cs: Až bude připraven! Viz :ref:`doc_release_policy_when_is_next_release_out` pro více informací.
de: Wenn sie fertig ist! Siehe :ref:`doc_release_policy_when_is_next_release_out` für weitere Informationen.
fi: Kun se on valmis! Katso lisätietoja: :ref:`doc_release_policy_when_is_next_release_out`.
pt_br: Quando estiver pronto! Veja :ref:`doc_release_policy_when_is_next_release_out` para mais informações.
zh_cn: 当它准备好的时候！详情见 :ref:`doc_running_code_in_the_editor`\ 。

source: Which Godot version should I use for a new project?
zh_cn: 新项目应该使用哪个版本的 Godot？

source: We recommend using Godot 4.x for new projects, but depending on the feature set you need, it may be better to use 3.x instead. See :ref:`doc_release_policy_which_version_should_i_use` for more information.
pt_br: Recomendamos utilizar o Godot 4.x para novos projetos, porém dependendo do conjunto de funcionalidades que precisa, pode ser melhor usar a 3.x. Veja :ref:`doc_release_policy_which_version_should_i_use` para mais informações.
zh_cn: 我们建议在新项目中使用 Godot 4.x，但是取决于你所需的功能，也许使用 3.x 更好。具体可参阅 :ref:`doc_release_policy_which_version_should_i_use`\。

source: Should I upgrade my project to use new Godot versions?
pt_br: Devo atualizar meu projeto para usar novas versões do Godot?
zh_cn: 是否需要将我的项目升级到Godot的新版本？

source: Some new versions are safer to upgrade to than others. In general, whether you should upgrade depends on your project's circumstances. See :ref:`doc_release_policy_should_i_upgrade_my_project` for more information.
pt_br: Algumas versões são mais seguras de serem atualizadas que outras. No geral, se você deve ou não atualizar depende das circunstâncias do seu projeto. Veja :ref:`doc_release_policy_should_i_upgrade_my_project` para mais informações.
zh_cn: 新版本在某些方面更安全。一般来说，是否升级取决于你的项目环境。详见 :ref:`doc_release_policy_should_i_upgrade_my_project`\ 。

source: I would like to contribute! How can I get started?
cs: Chtěl bych přispět! Jak mohu začít?
de: Ich würde gerne etwas beitragen! Wie kann ich anfangen?
fi: Haluan auttaa! Kuinka pääsen alkuun?
pt_br: Eu gostaria de contribuir! Como eu posso começar?
zh_cn: 我想要贡献！ 该如何开始？

source: Awesome! As an open source project, Godot thrives off of the innovation and the ambition of developers like you.
zh_cn: 太棒了！作为一个开源项目，Godot 的发展得益于像你这样的开发者的创新和雄心。

source: The best way to start contributing to Godot is by using it and reporting any `issues <https://github.com/godotengine/godot/issues>`_ that you might experience. A good bug report with clear reproduction steps helps your fellow contributors fix bugs quickly and efficiently. You can also report issues you find in the `online documentation <https://github.com/godotengine/godot-docs/issues>`_.
pt_br: A melhor forma de começar a contribuir para o Godot é utilizando-o e reportando qualquer `problema <https://github.com/godotengine/godot/issues>`_que você talvez passe. Um bom relatório de bug com direta descrição dos passos necessários para reproduzi-lo, ajudam os contribuidores a corrigir os bugs de forma rápida e eficiente. Você também pode reportar um problema que encontre na `documentação online <https://github.com/godotengine/godot-docs/issues>`_.
zh_cn: 开始为 Godot 做出贡献的最佳方式是使用它并报告你可能遇到的任何\ `问题 <https://github.com/godotengine/godot/issues>`_\ 。一份带有清晰重现步骤的好 bug 报告可以帮助其他贡献者快速有效地修复 bug。你也可以在\ `在线文档 <https://github.com/godotengine/godot-docs/issues>`_\ 中报告你发现的问题。

source: If you feel ready to submit your first PR, pick any issue that resonates with you from one of the links above and try your hand at fixing it. You will need to learn how to compile the engine from sources, or how to build the documentation. You also need to get familiar with Git, a version control system that Godot developers use.
pt_br: Se você se sentir pronto para enviar seu primeiro PR, escolha qualquer problema que lhe interesse em um dos links acima e tente corrigi-lo. Você precisará aprender como compilar o mecanismo (a engine) a partir dos fontes ou como construir a documentação. Você também precisa se familiarizar com o Git, um sistema de controle de versão usado pelos desenvolvedores do Godot.
zh_cn: 如果你准备提交你的第一个 PR，请从上面的链接之一中选择你感兴趣的任何一个问题，并尝试解决它。你将需要学习如何从源代码编译引擎，或如何构建文档。你还需要熟悉 Git，这是 Godot 开发人员使用的版本控制系统。

source: We explain how to work with the engine source, how to edit the documentation, and what other ways to contribute are there in our :ref:`documentation for contributors <doc_ways_to_contribute>`.
pt_br: Explicamos como trabalhar com o código-fonte da engine, como editar a documentação e quais outras formas de contribuir que existem em nossa :ref:`documentação para contribuidores <doc_ways_to_contribute>`.
zh_cn: 我们在 :ref:`贡献者文档 <doc_ways_to_contribute>` 中解释了如何使用引擎源代码、如何编辑文档以及其他形式的贡献方式。

source: I have a great idea for Godot. How can I share it?
cs: Mám skvělý nápad pro Godota. Jak se o něj mohu podělit?
de: Ich habe eine tolle Idee für Godot. Wie kann ich sie teilen?
fi: Minulla on loistava idea Godotiin. Kuinka voin jakaa sen?
pt_br: Eu tenho uma grande ideia para o Godot. Como posso compartilhar essa ideia?
zh_cn: 我有个关于 Godot 的好主意，该如何分享它？

source: We are always looking for suggestions about how to improve the engine. User feedback is the main driving force behind our decision-making process, and limitations that you might face while working on your project are a great data point for us when considering engine enhancements.
pt_br: Estamos sempre em busca de sugestões sobre como melhorar a engine. O feedback do usuário é a principal força motriz por trás do nosso processo de tomada de decisão, e as limitações que você pode enfrentar ao trabalhar em seu projeto são um excelente ponto de dados para nós ao considerarmos melhorias na engine.
zh_cn: 我们一直在寻找关于如何改进引擎的建议。用户的反馈是我们决策过程背后的主要驱动力，你在为自己的项目工作时可能遇到的限制是我们在考虑如何增强引擎时的重要依据。

source: If you experience a usability problem or are missing a feature in the current version of Godot, start by discussing it with our `community <https://godotengine.org/community/>`_. There may be other, perhaps better, ways to achieve the desired result that community members could suggest. And you can learn if other users experience the same issue, and figure out a good solution together.
pt_br: Se você tiver algum problema de usabilidade ou estiver faltando algum recurso na versão atual do Godot, comece discutindo isso com nossa `comunidade <https://godotengine.org/community/>`_. Poderão existir outras formas, talvez melhores, de alcançar o resultado desejado que os membros da comunidade possam sugerir. E você pode saber se outros usuários enfrentam o mesmo problema e descobrir uma boa solução juntos.
zh_cn: 如果你遇到可用性问题，或者当前版本的 Godot 缺少一项功能，请首先与我们的 `社区 <https://godotengine.org/community/>`_ 讨论。社区成员可能会提出其他更好的方法来实现期望的结果。你可以了解其他用户是否遇到过同样的问题，并一起找出一个好的解决方案。

source: If you come up with a well-defined idea for the engine, feel free to open a `proposal issue <https://github.com/godotengine/godot-proposals/issues>`_. Try to be specific and concrete while describing your problem and your proposed solution — only actionable proposals can be considered. It is not required, but if you want to implement it yourself, that's always appreciated!
pt_br: Se você tiver uma ideia bem definida para a engine, sinta-se à vontade para abrir uma `proposta <https://github.com/godotengine/godot-proposals/issues>`_. Tente ser específico e concreto ao descrever o seu problema e a solução proposta – apenas propostas viáveis podem ser consideradas. Não é obrigatório, mas se você quiser implementá-la sozinho, será sempre apreciado!
zh_cn: 如果你对引擎有一个明确的改进想法，请随意打开一个 `提案 issue <https://github.com/godotengine/godot-proposals/issues>`_ 。在描述你的问题和建议的解决方案时，尽量具体和明确——只有可行的建议才会被考虑。这不是必须的，但如果你想自己实现它，我们会非常感激！

source: If you only have a general idea without specific details, you can open a `proposal discussion <https://github.com/godotengine/godot-proposals/discussions>`_. These can be anything you want, and allow for a free-form discussion in search of a solution. Once you find one, a proposal issue can be opened.
pt_br: Se você tiver apenas uma ideal geral, sem detalhes específicos, você pode abrir uma `Discussão <https://github.com/godotengine/godot-proposals/discussions>`_. Pode ser o que você quiser, permitindo uma discussão livre em busca de uma solução. Depois de encontrar-la, você precisa abrir uma proposta.
zh_cn: 如果你只有一个大致的想法，没有具体的细节，你可以开启一个 `提案讨论 <https://github.com/godotengine/godot-proposals/discussions>`_ 。讨论可以包含你想要的任何内容，并允许自由形式的讨论以寻求解决方案。一旦找到了一个解决方案，就可以打开提案 issue。

source: Please, read the `readme <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_ document before creating a proposal to learn more about the process.
pt_br: Antes de criar uma nova proposta, leia o `readme <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_ para saber mais sobre o processo.
zh_cn: 在创建提案之前，请阅读 `自述文件 <https://github.com/godotengine/godot-proposals/blob/master/README.md>`_\，以了解有关该过程的更多信息。

source: Is it possible to use Godot to create non-game applications?
cs: Je možné použít Godot k vytváření jiných než herních aplikací?
de: Ist es möglich mit Godot Anwendungen zu entwickeln welche kein Spiel sind?
fi: Onko Godotia mahdollista käyttää hyötysovellusten tekoon?
pt_br: É possível usar o Godot para criar aplicativos que não sejam jogos?
zh_cn: 是否能用 Godot 创建非游戏应用？

source: Yes! Godot features an extensive built-in UI system, and its small distribution size can make it a suitable alternative to frameworks like Electron or Qt.
cs: Ano! Godot má rozsáhlý vestavěný systém uživatelského rozhraní a díky své malé distribuční velikosti může být vhodnou alternativou k frameworkům jako Electron nebo Qt.
de: Ja! Godot beinhaltet ein umfangreiches UI System. Die geringe Distributions-Größe von Godot kann es zu einer geeigneten Alternative zu Frameworks wie Electron oder Qt machen.
fi: Kyllä! Godotissa on sisäänrakennettuna laaja käyttöliittymäjärjestelmä, ja sen pieni tiedostokoko tekee siitä varteenotettavan vaihtoehdon muille ympäristöille, kuten Electron tai Qt.
pt_br: Sim! O Godot possui um extenso sistema de UI embutido, e seu pequeno tamanho de distribuição pode torná-lo uma alternativa adequada para frameworks como Electron ou Qt.
zh_cn: 是的！Godot 具有广泛的内置 UI 系统，其较小的软件包可以使它成为 Electron 或 Qt 等框架的合适替代品。
