Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, fi, pt_br, zh_cn

source: When creating a non-game application, make sure to enable :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>` in the Project Settings to decrease CPU and GPU usage.
cs: Při vytváření neherní aplikace nezapomeňte v nastavení projektu povolit :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>`, abyste snížili využití CPU a GPU.
de: Wenn Sie eine "nicht spiele" Applikation entwickeln stellen Sie sicher das Sie :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>` in den Projekt Einstellungen einschalten um die CPU und GPU Belastung zu verringern.
fi: Kun teet muuta kuin peliä, käytä projektin asetusta :ref:`low-processor mode <class_ProjectSettings_property_application/run/low_processor_mode>`, jotta sovellus käyttäisi säästeliäästi prosessoria ja näytönohjainta.
pt_br: Quando criar uma aplicação que não seja um jogo, certifique-se de habilitar o :ref:`Modo Baixo Processamento <class_ProjectSettings_property_application/run/low_processor_mode>` nas Configurações do Projeto para diminuir o uso da CPU e GPU.
zh_cn: 当创建一个非游戏的应用程序时，确保在项目设置中启用 :ref:`低处理器模式 <class_ProjectSettings_property_application/run/low_processor_mode>` 以减少CPU和GPU占用。

source: Check out `Material Maker <https://github.com/RodZill4/material-maker>`__ and `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ for examples of open source applications made with Godot.
cs: Podívejte se na `Material Maker <https://github.com/RodZill4/material-maker>`__ a `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__, kde najdete příklady open source aplikací vytvořených pomocí Godotu.
de: Besuchen Sie `Material Maker <https://github.com/RodZill4/material-maker>`__ und `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ für Beispiele von Open Source Anwendungen welche mit Godot erstellt wurden.
fi: Katso esimerkiksi avoimen lähdekoodin Godot-sovellukset `Material Maker <https://github.com/RodZill4/material-maker>`__ ja `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__.
pt_br: Confira `Material Maker <https://github.com/RodZill4/material-maker>`__ e `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__ para exemplos de aplicativos de código aberto desenvolvidos com o Godot.
zh_cn: 请查看 `Material Maker <https://github.com/RodZill4/material-maker>`__ 和 `Pixelorama <https://github.com/Orama-Interactive/Pixelorama>`__\ ，以了解用 Godot 制作的开源应用程序的例子。

source: Is it possible to use Godot as a library?
cs: Je možné Godot použít jako knihovnu?
de: Ist es möglich Godot als Bibliothek zu nutzen?
fi: Onko mahdollista käyttää Godotin pelimoottoria itsenäisesti luokkakirjastona?
pt_br: É possível utilizar o Godot como uma biblioteca?
zh_cn: 是否能将 Godot 作为库使用？

source: Godot is meant to be used with its editor. We recommend you give it a try, as it will most likely save you time in the long term. There are no plans to make Godot usable as a library, as it would make the rest of the engine more convoluted and difficult to use for casual users.
cs: Godot je určen k použití s jeho editorem. Doporučujeme vám to vyzkoušet, protože to s největší pravděpodobností ušetří čas v dlouhodobém horizontu. Neexistují žádné plány na to, aby byl Godot použitelný jako knihovna, protože by to zvyšovalo spletitost a obtížnost použití zbytku enginupro příležitostné uživatele.
de: Godot ist für die Verwendung in seinem eigenen Bearbeitungsprogramm gedacht. Wir empfehlen diesen auszuprobieren, da er Ihnen wahrscheinlich langfristig viel Zeit sparen wird. Es gibt keine Pläne Godot als Bibliothek nutzbar zu machen, da es den Rest der Engine komplizierter mache und somit für normale Benutzer schwieriger zu benutzen.
fi: Godot on tarkoitettu käytettäväksi editorissaan. Suosittelemme kokeilemaan sitä, koska todennäköisesti säästät näin aikaa pitkässä juoksussa. Ei ole suunnitelmissa tehdä Godotista luokkakirjastoa, koska se tekisi muusta pelimoottorista monimutkaisemman ja vaikeamman käyttää tavalliselle käyttäjälle.
pt_br: O Godot é desenvolvido para ser usado com sua interface de edição. Recomendamos que você experimente, pois provavelmente economizará tempo a longo prazo. Não há planos de tornar o Godot utilizável como uma biblioteca, pois isso tornaria o restante do motor mais complicado e difícil de usar para usuários casuais.
zh_cn: Godot 旨在与其编辑器一起使用。我们建议你尝试一下编辑器，因为从长远来看，它很可能会节省你的时间。目前尚无计划把 Godot 作为库使用，因为这会使引擎的其余部分更加混乱，难以为普通用户使用。

source: If you want to use a rendering library, look into using an established rendering engine instead. Keep in mind rendering engines usually have smaller communities compared to Godot. This will make it more difficult to find answers to your questions.
cs: Pokud chcete použít vykreslovací knihovnu, prozkoumejte místo toho použití zavedeného vykreslovacího enginu. Mějte na paměti, že vykreslovací enginy mají obvykle menší komunity ve srovnání s Godotem. To ztěžuje nalezení odpovědí na vaše otázky.
de: Wenn Sie eine Render-Bibliothek nutzen möchten, sollten Sie hierfür eine etablierte Render-Engine verwenden. Beachten Sie dabei, dass diese meist kleinere Benutzergruppen als Godot haben, was es schwieriger macht Antworten auf Ihre Fragen zu finden.
fi: Jos haluat käyttää renderöintikirjastoa, tutustu sen sijaan vakiintuneeseen renderöintimoottoriin. Pidä mielessä, että renderöintimoottoreilla on yleensä pienemmät yhteisöt kuin Godotilla. Tämä vaikeuttaa vastausten löytämistä kysymyksiisi.
pt_br: Se você deseja usar uma biblioteca de renderização, procure usar um mecanismo de renderização estabelecido. Lembre-se de que os mecanismos de renderização geralmente têm comunidades menores em comparação com o Godot. Isso tornará mais difícil encontrar respostas para suas perguntas.
zh_cn: 如果你想使用一个渲染库，那就使用一个已经建立的渲染引擎来代替。需要注意的是，与 Godot 相比，渲染引擎通常拥有更小的社区，这将会使你解决问题的难度加大。

source: What user interface toolkit does Godot use?
cs: Jaký toolkit uživatelského rozhraní Godot používá?
de: Welches UI Toolkit nutzt Godot?
fi: Mitä käyttöliittymä työkalupakkia Godot käyttää?
pt_br: Qual kit de ferramentas de interface do usuário o Godot usa?
zh_cn: Godot 使用的用户界面工具包是什么？

source: Godot does not use a standard :abbr:`GUI (Graphical User Interface)` toolkit like GTK, Qt or wxWidgets. Instead, Godot uses its own user interface toolkit, rendered using OpenGL ES or Vulkan. This toolkit is exposed in the form of Control nodes, which are used to render the editor (which is written in C++). These Control nodes can also be used in projects from any scripting language supported by Godot.
cs: Godot nepoužívá standardní :abbr:`GUI (Graphical User Interface)` sadu nástrojů jako GTK, Qt nebo wxWidgets. Místo toho Godot používá vlastní sadu nástrojů uživatelského rozhraní vykreslovanou pomocí OpenGL ES nebo Vulkan. Tato sada nástrojů je vystavena ve formě uzlů Control, které se používají k vykreslování editoru (který je napsán v jazyce C++). Tyto uzly Control lze také použít v projektech z libovolného skriptovacího jazyka podporovaného systémem Godot.
de: Godot nutzt kein Standart :abbr:`GUI (Graphical User Interface)` Toolkit wie GTK, Qt oder wxWidgets. Stattdessen nutzt Godot sein eigenes Oberflächen-Toolkit welches mit Open GL oder Vulcan gerendert wird. Dieses Toolkit wird in Form von Control Nodes dargestellt, welche verwendet werden um den Editor zu rendern (welcher in C++ geschrieben wurde). Diese Control Nodes können ebenfalls für Projekte von einer beliebige Skriptsprache welche von Godot unterstützt wird verwendet werden.
fi: Godot ei käytä tavallista :abbr:'GUI (Graafinen käyttöliittymä)' työkalupakkia, kuten GTK, Qt tai wxWidgets. Sen sijaan Godot käyttää omaa käyttöliittymätyökalusarjaansa, joka on renderoitu OpenGL ES: llä tai Vulkanilla. Tämä työkalupakki näkyy ohjaussolmujen muodossa, joita käytetään muokkaimen hahmontamiseen (joka on kirjoitettu C ++-muodossa). Näitä ohjaussolmuja voidaan käyttää myös minkä tahansa Godotin tukeman komentosarjakielen projekteissa.
pt_br: O Godot não usa um kit de ferramentas :abbr:`GUI (Interface Gráfica de Usuário)` padrão como GTK, Qt ou wxWidgets. Em vez disso, Godot usa seu próprio kit de ferramentas de interface de usuário, renderizado usando OpenGL ES ou Vulkan. Este kit de ferramentas é exposto na forma de nós de Controle, que são usados para renderizar o editor (que é escrito em C++). Estes nós de Controle também podem ser usados em projetos de qualquer linguagem de scripting suportada pelo Godot.
zh_cn: Godot 不使用标准的 :abbr:`GUI(Graphical User Interface)` 工具箱，如 GTK、Qt 或 wxWidgets。相反，Godot 使用自己的用户界面工具包，使用 OpenGL ES 或 Vulkan 进行渲染。这个工具包以控件节点（Control）的形式暴露出来，用于渲染编辑器（用 C++ 编写）。这些控制节点也可以在 Godot 支持的任何脚本语言的项目中使用。

source: This custom toolkit makes it possible to benefit from hardware acceleration and have a consistent appearance across all platforms. On top of that, it doesn't have to deal with the LGPL licensing caveats that come with GTK or Qt. Lastly, this means Godot is "eating its own dog food" since the editor itself is one of the most complex users of Godot's UI system.
cs: Tato vlastní sada nástrojů umožňuje využívat hardwarovou akceleraci a mít konzistentní vzhled na všech platformách. Kromě toho se nemusí potýkat s licenčními výhradami LGPL, které jsou spojeny s GTK nebo Qt. V neposlední řadě to znamená, že Godot "žere vlastní psí žrádlo", protože samotný editor je jedním z nejsložitějších uživatelů systému uživatelského rozhraní Godot.
de: Dieses eigene Toolkit macht es möglich von Hardware Beschleunigung sowie einer konsistenten Erscheinung auf allen Plattformen zu profitieren. Zusätzlich muss sie nicht mit LGPL Lizenz Einschränkungen umgehen welche von GTK oder GT kommen. Zuletzt bedeutet das, dass Godot "das eigene Hundefutter isst", da der Editor selbst einer der komplexesten Nutzer von Godots UI System ist.
fi: Tämä mukautettu työkalupakki mahdollistaa laitteistokiihdytyksen hyödyntämisen ja yhtenäisen ulkoasun kaikilla alustoilla. Lisäksi sen ei tarvitse käsitellä LGPL-lisenssisäännöksiä, jotka liittyvät GTK:hon tai Qt:hen. Lopuksi tämä tarkoittaa, että Godot "syö omaa koiranruokaansa" koska editori itsessään on yksi Godot'n käyttöliittymäjärjestelmän monimutkaisimmista käyttäjistä.
pt_br: Este kit de ferramentas personalizado possibilita o benefício da aceleração de hardware e tem uma aparência consistente em todas as plataformas. Além disso, ele não precisa lidar com as ressalvas de licenciamento LGPL que vêm com GTK ou Qt. Por último, isso significa que o Godot está "comendo sua própria comida de cachorro", já que o próprio editor é um dos usuários mais complexos do sistema de UI do Godot.
zh_cn: 这个定制的工具包使它能获益于硬件加速，并在全平台上拥有一致的外观。最重要的是，它不必处理 GTK 或 Qt 所带来的 LGPL 许可注意事项。最后，这意味着 Godot 在“自产自用”，因为编辑器本身就是 Godot UI 系统中最复杂的用例之一。

source: This custom UI toolkit :ref:`can't be used as a library <doc_faq_use_godot_as_library>`, but you can still :ref:`use Godot to create non-game applications by using the editor <doc_faq_non_game_applications>`.
cs: Tuto vlastní sadu nástrojů uživatelského rozhraní :ref:`nelze použít jako knihovnu <doc_faq_use_godot_as_library>`, ale stále můžete :ref:`použít Godot k vytváření neherních aplikací pomocí editoru <doc_faq_non_game_applications>`.
de: Dieses eigene UI Toolkit :ref:`kann nicht als lib verwendet werden <doc_faq_use_godot_as_library>`, aber :ref:`Godot kann für "für nicht Spiele" Apps verwenden werden indem der Editor genutzt wird<doc_faq_non_game_applications>`.
fi: Tätä mukautettua käyttöliittymätyökalupakettia :ref:`ei voi käyttää kirjastona <doc_faq_use_godot_as_library>`, mutta voit silti :ref:`käyttää Godotia muiden kuin pelisovellusten luomiseen käyttämällä editoria <doc_faq_non_game_applications>`.
pt_br: Este kit de ferramentas de UI customizado :ref:`não pode ser usado como uma biblioteca <doc_faq_use_godot_as_library>`, mas você ainda pode :ref:`usar o Godot para criar aplicativos não-jogos usando o editor <doc_faq_non_game_applications>`.
zh_cn: 这个自定义 UI 工具包\ :ref:`不能作为一个库使用 <doc_faq_use_godot_as_library>`，但你仍然可以\ :ref:`通过使用 Godot 编辑器来创建非游戏应用程序<doc_faq_non_game_applications>`。

source: Why does Godot use the SCons build system?
pt_br: Por que Godot usa o sistema de construção SCons?
zh_cn: 为什么 Godot 使用 SCons 构建系统？

source: Godot uses the `SCons <https://www.scons.org/>`__ build system. There are no plans to switch to a different build system in the near future. There are many reasons why we have chosen SCons over other alternatives. For example:
zh_cn: Godot 使用 `SCons <https://www.scons.org/>`__ 构建系统。近期没有改用其他构建系统的计划。我们选择 SCons 而不是其他构建系统的原因有很多，例如：

source: Godot can be compiled for a dozen different platforms: all PC platforms, all mobile platforms, many consoles, and WebAssembly.
pt_br: Godot pode ser compilado para uma dúzia de plataformas diferentes: todas as plataformas de PC, todas as plataformas móveis, muitos consoles e WebAssembly.
zh_cn: Godot 可以针对多种不同的平台进行编译：所有 PC 平台、所有移动平台、各种游戏主机、WebAssembly。

source: Developers often need to compile for several of the platforms **at the same time**, or even different targets of the same platform. They can't afford reconfiguring and rebuilding the project each time. SCons can do this with no sweat, without breaking the builds.
pt_br: Os desenvolvedores geralmente precisam compilar para várias plataformas **ao mesmo tempo**, ou até mesmo destinos diferentes da mesma plataforma. Eles não podem se dar ao luxo de reconfigurar e reconstruir o projeto todas as vezes. SCons pode fazer isso sem suor, sem quebrar as compilações.
zh_cn: 开发者们经常需要\ **同时**\ 将代码编译到多个平台上，或者同一个平台的不同架构上，但他们负担不起每次都要重新配置和重构项目。SCons 可以毫不费力地完成此任务，而不会破坏构建。

source: SCons will *never* break a build no matter how many changes, configurations, additions, removals etc.
pt_br: SCons *nunca* irá interromper uma compilação, não importa quantas alterações, configurações, adições, remoções etc. tenha sido feitas.
zh_cn: 无论对项目做出多少修改、配置、增加、删除之类的事情，SCons *都不会* 把构建工作搞砸。

source: Godot's build process is not simple. Several files are generated by code (binders), others are parsed (shaders), and others need to offer customization (:ref:`modules <doc_custom_modules_in_cpp>`). This requires complex logic which is easier to write in an actual programming language (like Python) rather than using a mostly macro-based language only meant for building.
pt_br: O processo de construção de Godot não é simples. Vários arquivos são gerados por código (binders), outros são analisados (shaders), e outros precisam oferecer personalização (:ref:`modules <doc_custom_modules_in_cpp>`). Isso requer lógica complexa que é mais fácil de escrever em uma linguagem de programação real (como Python) em vez de usar uma linguagem baseada em macro apenas significava para o building.
zh_cn: Godot的构建过程并不简单。几个文件由代码生成（绑定器），其他文件被解析(着色器)，而其他文件则需要提供自定义（ \ :ref:`模块<doc_custom_modules_in_cpp>`\ ）。这需要复杂的逻辑，而该逻辑更容易用实际的编程语言（如Python）编写，而不是使用基于宏且仅限于构建过程的语言。

source: Please try to keep an open mind and get at least a little familiar with SCons if you are planning to build Godot yourself.
zh_cn: 如果你想要自己构建 Godot，放宽心态， 至少稍微熟悉一下这个构建系统。

source: Why does Godot not use STL (Standard Template Library)?
cs: Proč Godot nepoužívá STL (Standard Template Library)?
de: Warum verwendet Godot nicht STL (Standard Template Library)?
fi: Miksi Godot ei käytä STL:ää (Standard Template Library)?
pt_br: Por que Godot não usa STL (Standard Template Library, ou Biblioteca de Modelos Padrão)?
zh_cn: 为什么 Godot 不使用 STL（标准模板库）？

source: Like many other libraries (Qt as an example), Godot does not make use of STL (with a few exceptions such as threading primitives). We believe STL is a great general-purpose library, but we had special requirements for Godot.
zh_cn: 像许多其他库一样（Qt 就是一个例子），Godot 没有使用 STL（例外是使用了一些多线程基础设施之类的东西）。我们相信 STL 是一个强大的通用库，但我们对用于Godot上的库有特殊的要求。

source: STL templates create very large symbols, which results in huge debug binaries. We use few templates with very short names instead.
cs: Šablony STL vytvářejí velmi rozsáhlé symboly, jejichž výsledkem jsou obrovské debugovací binární soubory. Místo toho používáme několik šablon s velmi krátkými jmény.
de: STL-Vorlagen erzeugen sehr große Symbole und diese führen zu großen Debug-Binärdateien. Wir verwenden stattdessen nur wenige Vorlagen mit sehr kurzen Namen.
fi: STL-templatet aiheuttavat hyvin suuria symboleja, jotka johtavat valtaviin debug-binääreihin. Me käytämme sen sijaan vain muutamia templateja erittäin lyhyillä nimillä.
pt_br: Os modelos STL criam símbolos muito grandes, o que resulta em enormes binários de depuração. Em vez disso, usamos alguns modelos com nomes bem curtos.
zh_cn: STL 模板会创建大量符号，产生巨型的调试二进制文件。我们使用一些名称很短的模板来代替。

source: Most of our containers cater to special needs, like Vector, which uses copy on write and we use to pass data around, or the RID system, which requires O(1) access time for performance. Likewise, our hash map implementations are designed to integrate seamlessly with internal engine types.
cs: Většina našich kontejnerů vyhovuje zvláštním potřebám, jako je Vector, který využívá kopii při zápisu a které používáme k předávání dat, nebo systému RID, který vyžaduje pro výkon (O1) přístupový čas. Naše implementace hash map jsou také navrženy tak, aby hladce spolupracovaly s interními typy enginu.
de: Die meisten unserer Container sind für spezielle Anforderungen ausgelegt, wie z.B. Vector, welcher Copy on Write verwendet und wir verwenden, um Daten weiterzugeben, oder das RID-System, das O(1)-Zugriffszeit für die Leistung benötigt. Ebenso sind unsere Hash-Map-Implementierungen so konzipiert, dass sie sich nahtlos in die internen Enginetypen integrieren lassen.
fi: Suurin osa konteistamme soveltuu erikoistarpeisiin, kuten Vector, joka kopioi datan ennen kirjoitusta (copy on write) ja kun siirrämme dataa paikasta toiseen, tai RID systeemi, joka varaa O(1) käyttöajan suoritusta varten. Kuin myös meidän hash map-toteutus on suunniteltu toimimaan saumattomasti pelimoottorin sisäisten tyypitysten kanssa.
pt_br: A maioria de nossos contêineres atende a necessidades especiais, como Vector, que usa cópia na gravação e usamos para transmitir dados, ou o sistema RID, que requer tempo de acesso O(1) para desempenho. Da mesma forma, nossas implementações de hash map foram projetadas para integrar-se perfeitamente aos tipos de mecanismo interno.
zh_cn: 我们的大多数容器都是针对特定需求设计的，例如 Vector 使用写时复制，我们用它来传递数据，而 RID 系统则需要 O(1) 访问时间来提高性能。同样，我们的哈希表实现旨在与内部引擎类型无缝集成。

source: Our containers have memory tracking built-in, which helps better track memory usage.
cs: Naše kontejnery mají vestavěné sledování paměti, což pomáhá lépe sledovat celkové využití paměti.
de: Unsere Container nutzen "memory tracking", was beim Analysieren des Speicherverbrauchs hilft.
fi: Meidän konttimme sisältävät sisään rakennetun muistin tarkkailun, joka auttaa tarkkailemaan laitteen muistin käyttöä.
pt_br: Nossos contêineres possuem rastreamento de memória embutido, o que ajuda a rastrear melhor o uso da memória.
zh_cn: 我们的容器内置了内存跟踪，有助于更好地跟踪内存的使用情况。

source: For large arrays, we use pooled memory, which can be mapped to either a preallocated buffer or virtual memory.
cs: Pro rozsáhlá pole používáme paměť alokovanou v pevných blocích, kterou lze namapovat buď na předběžně přidělenou vyrovnávací paměť nebo na virtuální paměť.
de: Für den Gebrauch von großen Arrays, benutzen wir zusammengelegten Speicher, der entweder einem vorab zugewiesenen Buffer oder einem virtuellen Speicher zugeordnet werden kann.
fi: Suurille matriiseille käytetään yhdistettyä muistia, joka voidaan liittää joko valmiiksi varattuun puskuriin tai virtuaalimuistiin.
pt_br: Para matrizes (arrays) grandes, usamos memória em pool, que pode ser mapeada para um buffer previamente alocado ou para uma memória virtual.
zh_cn: 对于大型数组，我们使用内存池，可以映射到预先分配的缓冲区或虚拟内存。

source: We use our custom String type, as the one provided by STL is too basic and lacks proper internationalization support.
cs: Používáme náš vlastní typ String, protože typ poskytovaný STL je příliš prostý a postrádá náležitou podporu internacionalizace.
de: Wir verwenden unsere eigene angepasste String Klasse, da die von STL bereitgestellte zu einfach ist und Internationalisierung nur unzureichend unterstützt wird.
fi: Käytämme omaa merkkijono-tyyppiä, koska STL:n tarjoama tyyppi on liian yksinkertainen ja siitä puuttuu kunnollinen kansainvälistämistuki.
pt_br: Usamos nosso tipo de String personalizado, pois o fornecido pela STL é muito básico e carece de suporte adequado à internacionalização.
zh_cn: 我们使用自定义字符串类型，因为 STL 提供的版本过于基础，并且缺乏适当的国际化支持。

source: Why does Godot not use exceptions?
cs: Proč Godot nepoužívá výjimky?
de: Weshalb verwendet Godot keine "exceptions"?
fi: Miksei Godot käytä poikkeuksia?
pt_br: Por que Godot não usa exceções?
zh_cn: 为什么 Godot 不使用异常？

source: We believe games should not crash, no matter what. If an unexpected situation happens, Godot will print an error (which can be traced even to script), but then it will try to recover as gracefully as possible and keep going.
cs: Věříme, že hry by se neměly zhroutit ať už je důvod jakýkoliv. Pokud dojde k neočekávané situaci, Godot oznámí chybu (kterou lze vysledovat i ke skriptu), ale pak se pokusí co možná nejelegantněji vzpamatovat a pokračovat v krasojízdě.
de: Wir glauben Spiele sollten nicht Abstürzen, egal was auch passiert. Wenn eine unerwartete Situation auftritt, dann schreibt Godot eine Fehlermeldung, versucht dies danach aber so gut es geht wieder auszugleichen und weiter zu laufen.
fi: Me uskomme että pelien ei pidä kaatua, vaikka olisi mikä. Jos odottamaton tilanne tapahtuu, Godot tulostaa virheen (mikä voidaan seurata jopa skriptiin asti), mutta sen jälkeen yrittää toipua mahdollisimman sievästi ja jatkaa toimintaa.
pt_br: Acreditamos que os jogos não devem travar, aconteça o que acontecer. Se uma situação inesperada acontecer, Godot imprimirá um erro (que pode ser rastreado até mesmo no script), mas tentará se recuperar da maneira mais elegante possível e continuar.
zh_cn: 我们相信无论如何游戏都不应该崩溃。如果发生意外情况，Godot将打印一个错误（甚至可以追溯到脚本），但之后它会尽可能优雅地恢复，并继续前进。

source: Additionally, exceptions significantly increase the binary size for the executable and result in increased compile times.
zh_cn: 此外，异常会显著增加可执行文件的二进制大小，并且导致编译时间增加。

source: Does Godot use an ECS (Entity Component System)?
pt_br: O Godot usa um ECS (Sistema de Componentes da Entidade)?
zh_cn: Godot使用 ECS（实体组件系统）吗？

source: Godot does **not** use an ECS and relies on inheritance instead. While there is no universally better approach, we found that using an inheritance-based approach resulted in better usability while still being fast enough for most use cases.
pt_br: Godot **não** usa um ECS e depende de herenças. Embora não exista uma abordagem melhor, descobrimos que o uso de uma abordagem baseada em herenças resultou em uma melhor usuabilidade e, ao mesmo tempo foi rapido o suficiente na maioria dos casos.
zh_cn: Godot不使用 ECS 而是依赖于继承。虽然没有一种普遍的更好的方法，我们发现使用继承的效率已经可以满足于绝大多数使用场景。

source: That said, nothing prevents you from making use of composition in your project by creating child Nodes with individual scripts. These nodes can then be added and removed at run-time to dynamically add and remove behaviors.
pt_br: Dito isto, nada impede que você faça uso da composição em seu projeto, criando nós filhos com scripts individuais. Esses nós podem então ser adicionados e removidos no tempo de execução para adicionar e remover comportamentos dinamicamente.
zh_cn: 也就是说，没有什么能阻止你在项目中通过使用脚本创建子节点来使用组合。这些节点可以在随后的运行时中添加和删除，以实现动态添加和删除。
