Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, fi, pt_br, zh_cn

source: More information about Godot's design choices can be found in `this article <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`__.
pt_br: Mais informações sobre as escolhas de design do Godot podem ser encontradas em `este artigo <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`___.
zh_cn: 可以在\ `这篇文章 <https://godotengine.org/article/why-isnt-godot-ecs-based-game-engine>`__\ 中找到更多有关 Godot 设计抉择的信息。

source: Why does Godot not force users to implement DOD (Data-Oriented Design)?
zh_cn: 为什么 Godot 不强制用户实现 DOD（面向数据设计）？

source: While Godot internally attempts to use cache coherency as much as possible, we believe users don't need to be forced to use DOD practices.
zh_cn: 尽管 Godot 的内部实现中尽可能的使用了缓存一致性，但我们认为不应该强迫用户使用 DOD。

source: DOD is mostly a cache coherency optimization that can only provide significant performance improvements when dealing with dozens of thousands of objects which are processed every frame with little modification. That is, if you are moving a few hundred sprites or enemies per frame, DOD won't result in a meaningful improvement in performance. In such a case, you should consider a different approach to optimization.
zh_cn: DOD 主要是缓存一致性优化，只有在每帧需要处理数以万计的对象，并且做出的修改较少时，才能够提供显著的性能提升。假如你每帧要移动的精灵或敌人只有几百个，那么 DOD 并不会带来有意义的性能提升。在这种情况下，你应该考虑别的优化手段。

source: The vast majority of games do not need this and Godot provides handy helpers to do the job for most cases when you do.
cs: Drtivá většina her totp nepotřebuje a Godot poskytuje šikovné pomocníky, kteří si se ctí poradí ve většině případů, které budete potřebovat.
de: Die größte Mehrheit der Spiele brauchen dies nicht und Godot stellt praktische Hilfen bereit, um die Arbeit in den meisten Fällen zu erledigen.
fi: Suurin osa peleistä ei tarvitse tätä ja Godot tarjoaa käteviä apukeinoja tehtävän suorittamiseksi kun tilanne niin vaatii.
pt_br: A grande maioria dos jogos não precisa disso e Godot fornece ajudantes úteis para fazer o trabalho na maioria dos casos.
zh_cn: 绝大多数游戏都不需要这个, 并且Godot提供了方便的辅助工具来完成大多数情况下的工作.

source: If a game needs to process such a large amount of objects, our recommendation is to use C++ and GDExtensions for performance-heavy tasks and GDScript (or C#) for the rest of the game.
pt_br: Se for necessário um jogo que realmente precise processar uma quantidade tão grande de objetos, nossa recomendação é usar C++ e GDExtensions para as partes de alto desempenho e GDScript (ou C#) para o restante do jogo.
zh_cn: 如果一个游戏的确需要处理较多数量游戏对象，那么我们建议使用 C++ 和 GDExtensions 处理需要高性能的部分，使用 GDScript（或 C#）负责游戏的其它部分。

source: How can I support Godot development or contribute?
cs: Jak mohu podpořit Godotův rozvoj nebo přispět?
de: Wie kann ich die Entwicklung der Godot Engine unterstützen oder einen (finanziellen) Beitrag leisten?
fi: Miten voin tukea Godotin kehitystä tai olla avuksi?
pt_br: Como eu posso ajudar no desenvolvimento do Godot ou contribuir?
zh_cn: 如何支持或参与 Godot 的发展？

source: See :ref:`doc_ways_to_contribute`.
cs: Viz :ref:`doc_ways_to_contribute`.
de: Siehe :ref:`doc_ways_to_contribute`.
fi: Katso :ref:`doc_ways_to_contribute`.
pt_br: Veja :ref:`doc_ways_to_contribute`.
zh_cn: 见\ :ref:`doc_ways_to_contribute`\ 。

source: Who is working on Godot? How can I contact you?
cs: Kdo pracuje na Godotovi? Jak vás mohu kontaktovat?
de: Wer arbeitet an Godot? Wie kann ich euch kontaktieren?
fi: Kuka työstää Godotia? Kuinka voin olla yhteydessä?
pt_br: Quem está trabalhando no Godot? Como entro em contato com vocês?
zh_cn: 谁在为 Godot 工作？如何联系？

source: See the corresponding page on the `Godot website <https://godotengine.org/contact>`_.
cs: Podívejte se na příslušnou stránku na `webu Godot <https://godotengine.org/contact>`_.
de: Siehe die dazugehörige Seite auf der `Godot-Webseite <https://godotengine.org/contact>`_.
fi: Katso aiheesta kertovaa sivua `Godotin verkkosivustolla <https://godotengine.org/contact>`_.
pt_br: Veja a página correspondente na `página do Godot <https://godotengine.org/contact>`_.
zh_cn: 见 `Godot 官网 <https://godotengine.org/contact>`_\ 上的相应页面。

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
fi: Käännöksen tila
pt_br: Progresso da Tradução
zh_cn: 翻译状态

source: FAQ
de: Häufig gestellte Fragen
fi: UKK
pt_br: Perguntas Frequentes

source: Godot is `Free and Open-Source Software <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_ available under the `OSI-approved <https://opensource.org/licenses/MIT>`_ MIT license. This means it is free as in "free speech" as well as in "free beer."
cs: Godot je `Svobodný software a software s otevřeným zdrojovým kódem <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_ dostupný pod `OSI licencí <https://opensource.org/licenses/MIT>`_ MIT. To znamená, že je zdarma jako ve "svobodě projevu", stejně jako v "pivo zdarma."
de: Godot ist eine freie Open Source Software und verfügbar unter der von der `OSI anerkannten <https://opensource.org/licenses/MIT>`_ MIT-Lizenz. Das bedeutet, sie ist so frei wie "freie Meinungsäußerung" oder "freies Bier."
fi: Godot on `vapaa ja avoimen lähdekoodin ohjelmisto <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_ `OSI-hyväksytyn <https://opensource.org/licenses/MIT>`_ MIT-lisenssin alaisuudessa. Tämä tarkoittaa, että se vapaa kuin "sananvapaus" ja ilmainen kuin "ilmainen olut."

source: All the contents of this accompanying documentation are published under the permissive Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) license, with attribution to "Juan Linietsky, Ariel Manzur and the Godot Engine community."
cs: Veškerý obsah této doprovodné dokumentace je zveřejněn pod licencí Creative Commons Attribution 3.0 ( `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_ ), s uvedením licence „Juan Linietsky, Ariel Manzur a komunita Godot Engine. "
de: Alle Inhalte dieser Dokumentation werden unter der freizügigen Creative Commons Attribution 3.0-Lizenz (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) mit Namensnennung von "Juan Linietsky, Ariel Manzur und der Godot Engine Community" veröffentlicht.
fi: Kaikki tämän mukana tulevan dokumentaation sisältö on julkaistu sallivan Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) lisenssin alla, liitteellä "Juan Linietsky, Ariel Manzur and the Godot Engine community."

source: For full details, look at the `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ as well as the `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ and `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ files in the Godot repository.
cs: Úplné podrobnosti naleznete v souboru `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ a také `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ a `LOGO\_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ soubory v úložišti Godot.
de: Für alle Details siehe die Dateien `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ und `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ sowie `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ im Godot-Repository.
fi: Täysiä yksityiskohtia varten, katso `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ sekä `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ ja `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.md>`_ tiedostoja Godotin koodikannassa.

source: Windows (and UWP)
cs: Windows (a UWP)
de: Windows (und UWP)
fi: Windows (ja UWP)

source: Both 32- and 64-bit binaries are supported where it makes sense, with 64 being the default.
cs: V případě, že to dává smysl, jsou podporovány 32bitové i 64bitové binární soubory, přičemž 64 je výchozí.
de: Sowohl 32- als auch 64-Bit Binaries werden unterstützt, wobei 64 Bit der Standard ist.
fi: Sekä 32- että 64-bittisiä binääritiedostoja tuetaan jos se on järkevää, oletuksena on käytössä 64-bittinen versio.

source: Additionally, there is some unofficial third-party work being done on building for some consoles. However, none of this is included in the default build scripts or export templates at this time.
cs: Kromě toho se na buildech pro některé konzole účastní neoficiálně třetí strany. Nic z toho však není součástí výchozích skriptů sestavení nebo exportních šablon.
de: Darüberhinaus gibt es einige inoffizielle Drittanbieter, die an der Kompilierung für bestimmte Konsolen arbeiten. Allerdings ist nichts davon standardmäßig in den Buildskripten oder Exportvorlagen enthalten.
fi: Konsoleille on lisäksi tekeillä joitakin kolmannen osapuolen epävirallisia käännöksiä. Mikään tästä ei kuitenkaan toistaiseksi sisälly mukana tuleviin käännösskripteihin tai vientimalleihin.

source: The officially supported languages for Godot are GDScript, Visual Scripting, C#, and C++. See the subcategories for each language in the :ref:`scripting <toc-learn-scripting>` section.
cs: Oficiálně podporované jazyky v Godotu jsou GDScript, Vizuální Skriptování, C# a C++. Viz podkategorie pro každý jazyk v :ref:`skriptování <toc-učit se-skriptování>` sekce.
de: Die offiziell unterstützten Sprachen für Godot sind GDScript, VisualScript, C# und C++. Genaueres zu jeder Sprache ist in der jeweiligen Unterkategorie im :ref:`scripting <toc-learn-scripting>`-Abschnitt.
fi: Godotin virallisesti tukemia kieliä ovat GDScript, Visual Scripting, C# ja C++. Katso jokaisen kielen alakategoria :ref:`skriptaus <toc-learn-scripting>` luvusta.

source: Note that C# support is still relatively new, and as such, you may encounter some issues along the way. Our friendly and hard-working development community is always ready to tackle new problems as they arise, but since this is an open-source project, we recommend that you first do some due diligence yourself. Searching through discussions on `open issues <https://github.com/godotengine/godot/issues>`_ is a great way to start your troubleshooting.
cs: Všimněte si, že podpora C # je stále relativně nová, a proto se můžete setkat s některými problémy. Naše přátelská a pracovitá komunita vývojářů je vždy připravena řešit nové problémy, jakmile se objeví, ale protože se jedná o projekt s otevřeným zdrojovým kódem, doporučujeme vám nejprve udělat si vlastní hloubkový průzkum. Prohledávání diskusí o `otevřených problémech <https://github.com/godotengine/godot/issues>`_ je skvělý způsob, jak začít s řešením problémů vlastních.
de: Beachten Sie, dass die Unterstüzung für C# relativ neu ist und deswegen noch einige Probleme mit sich bringen kann. Unsere freundlichen und hart arbeitenden Entwickler sind immer bereit, neu auftretende Probleme zu beheben, aber da dies ein Open Source-Projekt ist, empfehlen wir Ihnen, sich erst selbst eingehend mit dem Problem zu beschäftigen. Die `offenen Bugmeldungen <https://github.com/godotengine/godot/issues>`_ zu durchforsten ist dabei ein guter Anfang.
fi: Huomioi, että C# tuki on vielä suhteellisen uusi ja sellaisenaan saatat törmätä matkan varrella joihinkin ongelmiin. Ystävällinen ja ahkera kehitysyhteisömme on aina valmis taklaamaan uudet ongelmat sitä myötä, kun niitä ilmaantuu, mutta koska tämä on avoimen lähdekoodin projekti, suosittelemme, että teet itse ensin hieman pohjatyötä. `Avoimet ongelmat <https://github.com/godotengine/godot/issues>`_ -keskusteluiden läpikäynti on hyvä tapa aloittaa vianetsintä.

source: As for new languages, support is possible via third parties using the GDNative / NativeScript / PluginScript facilities. (See the question about plugins below.) Work is currently underway, for example, on unofficial bindings for Godot to `Python <https://github.com/touilleMan/godot-python>`_ and `Nim <https://github.com/pragmagic/godot-nim>`_.
cs: Pokud jde o nové jazyky, podpora je možná prostřednictvím třetích stran pomocí infrastruktury GDNative / NativeScript / PluginScript. (Viz otázka o pluginech níže.) V současné době probíhají práce na neoficiální podpoře `Pythonu <https://github.com/touilleMan/godot-python>`_ a `Nimu <https://github.com/pragmagic/godot-nim>`_ pro skriptování v Godotu.
de: Für weitere Sprachen ist das manuelle Einbinden per GDNative / NativeScript / PluginScript gegeben. (siehe hierzu die Frage zu Plugins weiter unten) So werden derzeit unter anderem Schnittstellen zum Einbinden von `Python <https://github.com/touilleMan/godot-python>`_ und `Nim <https://github.com/pragmagic/godot-nim>`_ entwickelt.
fi: Uusille kielille tuki on mahdollista saada kolmansien osapuolien avulla, käyttäen GDNative / NativeScript / PluginScript suomia mahdollisuuksia. (Katso kysymys liitännäisistä alla.) Työn alla ovat esimerkiksi epäviralliset `Python <https://github.com/touilleMan/godot-python>`_ ja `Nim <https://github.com/pragmagic/godot-nim>`_ liitteet Godotille.

source: GDScript is Godot's integrated scripting language. It was built from the ground up to maximize Godot's potential in the least amount of code, affording both novice and expert developers alike to capitalize on Godot's strengths as fast as possible. If you've ever written anything in a language like Python before then you'll feel right at home. For examples, history, and a complete overview of the power GDScript offers you, check out the :ref:`GDScript scripting guide <doc_gdscript>`.
cs: GDScript je integrovaný skriptovací jazyk pro Godot. Byl postaven od základů tak, aby maximalizoval potenciál enginu při využití mínimálního množství kódu. To umožňuje jak začínajícím, tak i pokročilým vývojářům co nejrychleji ovládnout silné stránky Godota. Pokud jste někdy napsali něco v jazyce jako Python, budete se zde cítit jako doma. Příklady, historie a úplný přehled možností, které vám GDScript nabízí, najdete v :ref:`skriptovací příručka GDScript <doc_gdscript>` .
de: GDScript ist Godots integrierte Skriptsprache. Sie wurde von Grund auf entwickelt, um das Potential von Godot mit möglichst wenig Code auszuschöpfen, sodass sowohl Anfänger als auch erfahrene Entwickler von Godots Stärken profitieren können. Wenn Sie schon mal etwas in einer Programmiersprache wie Python entwickelt haben, werden Sie sich bei GDScript schnell wie zu Hause fühlen. Für Beispiele, eine Versionshistorie und eine komplette Übersicht, was GDScript so bietet, schauen Sie sich die `GDScript-Anleitung <doc_gdscript>`_ an.
fi: GDScript on Godotin integroitu skriptikieli. Se rakennettiin perustuksista lähtien maksimoimaan Godotin mahdollisuuksia pienimpään mahdolliseen koodimäärään, antaen sekä aloittelevien että asiantuntevien kehittäjien hyödyntää Godotin vahvuuksia niin nopeasti kuin mahdollista. Jos olet koskaan aiemmin kirjoittanut mitään Pythonin kaltaisilla kielillä, tunnet olevasi kuin kotona. Nähdäksesi esimerkkejä, historiaa ja täyden katsauksen GDScriptin tarjoamaan tehoon, vilkaise :ref:`GDScript skriptausopasta <doc_gdscript>`_.

source: There are several reasons to use GDScript--especially when you are prototyping, in alpha/beta stages of your project, or are not creating the next AAA title--but the most salient reason is the overall **reduction of complexity**.
cs: Existuje několik důvodů, proč používat GDScript - zejména když prototypujete, ve fázích alfa / beta vašeho projektu nebo nevytváříte další titul AAA -, ale nejdůležitějším důvodem je celkové **snížení složitosti.**.
de: Es gibt mehrere Gründe GDScript zu verwenden -- besonders wenn Sie einen Prototypen entwerfen, in Alpha- oder Beta-Phasen eines Projektes stecken, oder Sie nicht gerade den nächsten AAA-Titel entwickeln -- aber der überzeugendste Grund ist die allgemeine **Verringerung von Komplexität**.
fi: On useita syitä käyttää GDScriptiä – varsinkin, jos olet kehittämässä prototyyppiä, projektisi alfa/beta-vaiheessa, tai et ole kehittämässä seuraavaa AAA-peliä – mutta kaikkein keskeisin syy ylipäätään on **monimutkaisuuden väheneminen**.

source: The original intent of creating a tightly integrated, custom scripting language for Godot was two-fold: first, it reduces the amount of time necessary to get up and running with Godot, giving developers a rapid way of exposing themselves to the engine with a focus on productivity; second, it reduces the overall burden of maintenance, attenuates the dimensionality of issues, and allows the developers of the engine to focus on squashing bugs and improving features related to the engine core--rather than spending a lot of time trying to get a small set of incremental features working across a large set of languages.
cs: Původní záměr vytvořit těsně integrovaný, vlastní skriptovací jazyk pro Godot byl dvojí: zaprvé, snižit množství času potřebného k poznání a ovládnutí Godotu, což potenciálním vývojářům poskytuje rychlý způsob, jak se seznámit s enginem a používat ho produktivně; za druhé, redukovat celkové břemeno údržby, zmenšit složitost problémů a umožnit vývojářům enginu soustředit se na odstraňování chyb a vylepšování funkcí souvisejících s jádrem enginu, spíše než utápět spoustu času prací na malých přírůstkových funkcích pro velké množství jazyků.
de: Die ursprüngliche Absicht, eine eng integrierte, benutzerdefinierte Skriptsprache für Godot zu entwickeln, ergab sich aus zwei Gründen: Erstens reduziert sie die Zeit, die für die Inbetriebnahme und den Betrieb mit Godot erforderlich ist, und gibt Entwicklern eine schnelle Möglichkeit, sich mit der Engine mit Produktivitätsfokus auseinanderzusetzen; Zweitens reduziert sie die allgemeine Wartungslast, verringert die Dimensionalität von Problemen und ermöglicht es den Entwicklern der Engine, sich auf das Beheben von Fehlern und die Verbesserung von Funktionen im Zusammenhang mit dem Engine Kern zu konzentrieren, anstatt viel Zeit damit zu verbringen einen kleinen Satz inkrementeller Funktionen über eine große Anzahl von Sprachen hinweg zu nutzen.
fi: Alkuperäinen tarkoitus tiukasti integroidun räätälöidyn skriptikielen luonnilla Godotiin oli kaksitahoinen. Ensiksi, se vähentää Godotin aloittamiseen ja sen kanssa liikkeellepääsyyn tarvittavaa aikaa, antaen kehittäjille nopean tien tutustua pelimoottoriin ja keskittyä tuottavuuteen. Toiseksi, se vähentää ylläpidon taakkaa, vähentää ongelmien ulottuuvuutta, ja sallii pelimoottorin kehittäjien keskittyä bugien liiskaukseen ja moottorin ytimeen liittyvien ominaisuuksien parantamiseen – sen sijaan, että paljon aikaa kulutettaisiin siihen, että yritetään saada pieni joukko lisäominaisuuksia toimimaan suurelle joukolle ohjelmointikieliä.

source: Since Godot is an open-source project, it was imperative from the start to prioritize a more integrated and seamless experience over attracting additional users by supporting more familiar programming languages--especially when supporting those more familiar languages would result in a worse experience. We understand if you would rather use another language in Godot (see the list of supported options above). That being said, if you haven't given GDScript a try, try it for **three days**. Just like Godot, once you see how powerful it is and rapid your development becomes, we think GDScript will grow on you.
cs: Protože Godot je projekt s otevřeným zdrojovým kódem, bylo od počátku nezbytné upřednostňovat integrovanější a bezproblémovou zkušenost před získáváním dalších uživatelů podporou známějších programovacích jazyků - zejména pokud by podpora těchto známých jazyků vedla k horšímu zkušenosti. Chápeme, že byste v Godotu raději používali jiný jazyk (viz výše uvedený seznam podporovaných možností). Jak již bylo řečeno, pokud jste nezkoušeli GDScript, zkuste to na **tři dny**. Stejně jako Godot, jakmile uvidíte, jak silný je a jak rychle se váš vývoj postupuje, myslíme si, že GDScript si vás získá.
de: Eine stark integrieretes Erlebnis ist wichtiger als die Gewinnung zusätzlicher Benutzer, da es sich bei Godot um ein Open-Source-Projekt handelt. Daher verzichtet Godot darauf, mehr (vertraute) Programmiersprachen zu unterstützen, weil diese zu einem schlechteren Ergebnis führen würde, da sie nicht in der gleichen Weise mit der Umgebung integriert werden können. Wir verstehen, wenn Sie lieber eine andere Sprache in Godot verwenden möchten (Liste der unterstützten Optionen oben). Doch wenn Sie GDScript noch nicht ausprobiert haben, versuchen Sie es wenigstens für **drei Tage**. Sobald Sie sehen, wie mächtig die Sprache ist und wie schnell Ihre Entwicklung wird, sind wir sicher, dass Sie GDScript lieben werden.
fi: Koska Godot on avoimen lähdekoodin projekti, oli alusta saakka välttämätöntä keskittyä parempaan integraatioon ja saumattomaan kokemukseen, sen sijaan että houkuteltaisiin enemmän käyttäjiä tukemalla tuttuja ohjelmointikieliä – etenkin kun näiden tutumpien kielien tukeminen olisi johtanut huonompaan kokemukseen. Ymmärrämme jos mieluummin käyttäisit toista kieltä Godotissa (katso luettelo tuetuista vaihtoehdoista yllä). Siltikin, jos et ole vielä kokeillut GDScriptiä, kokeile sitä **kolme päivää**. Aivan kuten Godotin kanssa, kun huomaat miten tehokas se on ja kuinka nopeaa kehittämisestäsi tulee, luulemme että GDScript kasvaa osaksi sinua.

source: In the early days, the engine used the `Lua <https://www.lua.org>`__ scripting language. Lua is fast, but creating bindings to an object oriented system (by using fallbacks) was complex and slow and took an enormous amount of code. After some experiments with `Python <https://www.python.org>`__, it also proved difficult to embed.
cs: V dávných časech používal engin skriptovací jazyk `Lua <https://www.lua.org>`_ . Lua je rychlá, ale vytváření vazeb na objektově orientovaný systém (pomocí fallbacks) bylo složité a pomalé a vyžadovalo enormní množství kódu. Po několika experimentech s `Pythonem <https://www.python.org>`_ se i toto řešení ukázalo jako problematické.
de: Anfänglich nutzte die Engine noch `Lua <http://www.lua.org>`__ als Skriptsprache. Lua ist schnell, aber die Sprachanbindung an ein objektorientiertes System zu erstellen (durch Verwendung von Fallbacks) war komplex, langsam und verlangte nach enorm viel Code. Nach einigen Experimenten mit `Python <http://www.python.org>`__ stellte sich auch diese Sprache als schwierig einzubetten heraus.
fi: Alkuun pelimoottori käytti `Lua <https://www.lua.org>` skripti kieltä. Lua on nopea, mutta liitoksien luominen objekti orientoidussa kielessä (fallback menetelmällä) oli hankalaa ja hidasta ja tarvitsi todella paljon koodia. Joidenkin kokeiden `Python <https://www.python.org>` kanssa, se osoittautui myös hankalaksi toteuttaa.

source: Many existing languages have horrible interfaces for binding to C++, resulting in large amount of code, bugs, bottlenecks, and general inefficiency (Lua, Python, Squirrel, JavaScript, etc.) We wanted to focus on a great engine, not a great amount of integrations.
cs: Mnoho existujících jazyků má odporná rozhraní pro vazbu na C ++, což vede k velkému množství kódu, chyb, úzkých míst a obecně neefektivnosti (Lua, Python, Squirrel, JavaScript atd.) Chtěli jsme se zaměřit na skvělý engine, ne na velké množství integrovaných jazyků.
de: Viele bestehende Sprachen haben ineffiziente Schnittstellen zur Anbindung an C++, was zu einer großen Menge Code, Bugs, Engpässen und allgemeiner Ineffizienz führt (Lua, Python, Squirrel, JavaScript, etc.). Wir wollten uns auf eine großartige Engine konzentrieren, nicht auf eine große Anzahl von Skriptsprachen.
fi: Useilla olemassa olevilla kielillä on kaamea rajapinta C++ liitäntää varten, mikä johtaa suureen määrään koodia, bugeja, pullonkauloja ja yleistä tehottomuutta (Lua, Python, Squirrel, JavaScript, jne.) Halusimme keskittyä mahtavaan pelimoottoriin, emme suureen määrään integraatioita.
