Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, fi, pt_br, zh_cn

source: No native vector types (vector3, matrix4, etc.), resulting in highly reduced performance when using custom types (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
cs: Žádné nativní typy vektorů (vector3, matrix4 atd.), což má za následek velmi snížený výkon při používání vlastních typů (Lua, Python, Squirrel, JavaScript, ActionScript atd.).
de: Keine nativen Vektor-Typen (vector3, matrix4, usw.), was eine stark reduzierte Performance zur Folge hat, wenn eigene Objekttypen genutzt werden (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
fi: Natiivien vektorityyppien puute (vector3, matrix4, jne.), joka johtaa hyvin alhaiseen suorituskykyyn räätälöityjä tyyppejä käyttäessä (Lua, Python, Squirrel, JS, AS, jne).

source: Difficulty to integrate with the code editor for providing code completion, live editing, etc. (all of them). This is well-supported by GDScript.
cs: Potíže při integraci script editoru s automatickým navrhováním doplňování kódu (code completion), úpravou prováděného kódu atd. (Všechny). Toto všechno je dobře podporováno GDScriptem.
de: Schwierigkeiten bei der Integration in den Code-Editor zur Code-Vervollständigung, Live-Bearbeitung, etc. (alle davon). Dies wird von GDScript unterstützt.
fi: Hankaluudet yhdistää koodieditoriin niin, että voitaisiin tarjota koodin täydennys, ajonaikainen editointi, jne. Kaikki tämä on hyvin tuettuna GDScriptissä.

source: What type of 3D model formats does Godot support?
cs: Jaký typ formátů 3D modelů Godot podporuje?
de: Welche Arten von 3D-Modellformaten unterstützt Godot?
fi: Minkätyyppisiä 3D-mallien tallennusmuotoja Godot tukee?

source: Godot supports Collada via the `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ exporter (Maya, 3DSMax). If you are using Blender, take a look at our own `Better Collada Exporter <https://godotengine.org/download>`_.
cs: Godot podporuje Colladu prostřednictvím exportéru `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ ( Maya, 3DSMax). Pokud používáte Blender, podívejte se na náš vlastní `Lepší Collada Exportér <https://godotengine.org/download>`_.
de: Godot Unterstützt Collada mit dem `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ Exporter (Maya, 3DSMax). Wenn Sie Blender verwenden, schauen Sie sich unseren eigenen `Better Collada Exporter <https://godotengine.org/download>`_ an.
fi: Godotissa on siitä huolimatta hyvä Collada-formaatin tuki. Ole hyvä ja käytä `OpenCollada <https://github.com/KhronosGroup/OpenCOLLADA/wiki/OpenCOLLADA-Tools>`_ vientityökalua täyden yhteensopivuuden saavuttamiseksi, jos käytät Maya tai 3DS Max -työkaluja. Jos käytät Blenderiä, vilkaise omaa `Better Collada Exporter <https://godotengine.org/download>`_ vientityökaluamme.

source: As of Godot 3.0, glTF is supported.
cs: Od Godot 3.0 je podporován glTF.
de: Ab Godot 3.0 wird gITF unterstützt.
fi: glTF on tuettu Godotin versiosta 3.0 lähtien.

source: FBX is supported via the Open Asset Import library. However, FBX is proprietary so we recommend using other formats listed above, if suitable for your workflow.
cs: FBX je podporován prostřednictvím knihovny Open Asset Import. FBX je však proprietární, takže pokud je to vhodné pro váš pracovní postup, doporučujeme použít jiné výše uvedené formáty.
de: FBX wird mit der Bibliothek "Open Asset Import Library (Assimp)" unterstützt. Allerdigs ist es propritär, so dass wir die Verwendung eines anderen Formats aus der obigen Liste empfehlen, sollte es denn für Ihren Workflow geeignet sein.
fi: FBX on tuettu Open Asset Import libraryn kautta. Huomiotavaa, FBX on yksityisomistuksellinen joten suosittelemme käyttämään muita tuettuja formaatteja, jos se sopii sinun työnkulkuun.

source: The aim of Godot is to create a free and open-source MIT-licensed engine that is modular and extendable. There are no plans for the core engine development community to support any third-party, closed-source/proprietary SDKs, as integrating with these would go against Godot's ethos.
cs: Cílem Godota je vytvořit bezplatný a open-source MIT-licencovaný engine, který je modulární a rozšiřitelný. Neexistují žádné plány na to, aby komunita pro vývoj jádra enginu podporovala jakékoli SDK třetích stran s uzavřeným zdrojem / proprietární, protože jejich integrace by byla v rozporu s étosem Godota.
de: Das Ziel von Godot ist es, eine freie und quelloffene, MIT-lizensierte Engine, die modular und erweiterbar ist, zu entwickeln. Es gibt keine Pläne der Kernentwickler, irgendwelche proprietäre SDKs einzubinden, da dies dem Ethos Godots widersprechen würde.
fi: Godotin tavoitteena on luoda vapaa ja avoimen lähdekoodin MIT-lisenssoitu pelimoottori, joka on modulaarinen ja laajennettava. Pelimoottorin ydinkehitysyhteisöllä ei ole aikomuksia tukea mitään kolmannen osapuolen suljetun/omisteisen lähdekoodin SDK:ta, sillä sellaiseen integroituminen olisi Godotin eetoksen vastaista.

source: That said, because Godot is open-source and modular, nothing prevents you or anyone else interested in adding those libraries as a module and shipping your game with them--as either open- or closed-source.
cs: Vzhledem k tomu, že Godot je open-source a modulární, nic nebrání vám ani nikomu jinému, kdo by měl zájem, přidat tyto knihovny jako modul a distribuovat vaší hru s nimi -a to formou open či closed source.
de: Dennoch, da Godot quelloffen und modular ist, hindert Sie nichts daran, diese Bibliotheken als Module hinzuzufügen und Ihr Spiel mit ihnen zu vertreiben - sei es als Open Source oder proprietäre Software.
fi: Siitä huolimatta, koska Godot on avointa lähdekoodia ja modulaarinen, mikään ei estä sinua tai ketään kiinnostunutta lisäämään noita kirjastoja moduulina ja julkaisemaan peliäsi niitä käyttäen, joko avoimena tai suljettuna lähdekoodina.

source: If you know of a third-party SDK that is not supported by Godot but that offers free and open-source integration, consider starting the integration work yourself. Godot is not owned by one person; it belongs to the community, and it grows along with ambitious community contributors like you.
cs: Pokud víte o sadě SDK třetích stran, která není podporována Godotem, ale která nabízí bezplatnou integraci s otevřeným zdrojovým kódem, zvažte zahájení integrační práce svépomocí. Godot není ve vlastnictví jedné osoby; patří komunitě a roste spolu s ambicemi komunitních přispěvatelů, jako jste vy.
de: Wenn Ihnen nützliche SDKs bekannt sind, die noch nicht von Godot unterstützt werden, aber eine freie und quelloffene Integration erlauben, können Sie gerne selbst an dieser arbeiten. Godot gehört nicht einer Person; es gehört der Allgemeinheit und wächst mit ambitionierten Mitwirkenden aus der Community wie Ihnen.
fi: Jos tiedät kolmannen osapuolen SDK:n, joka ei ole tuettu Godotissa, mutta joka tarjoaa vapaan ja avoimen lähdekoodin integraation, harkitse integraatiotyön aloittamista itse. Godot ei ole yhden henkilön omistama; se kuuluu yhteisölle ja kasvaa kaltaistesi kunnianhimoisten edistäjien toimesta.

source: Move the created shortcut to ``%LOCALAPPDATA%\Microsoft\Windows\Start Menu\Programs``. This is the user-wide location for shortcuts that will appear in the Start menu. You can also pin Godot in the task bar by right-clicking the executable and choosing **Pin to Task Bar**.
de: Verschieben Sie die erstellte Verknüpfung nach ``%LOCALAPPDATA%\Microsoft\Windows\Start Menu\Programs``. Dies ist der benutzerweite Speicherort für Verknüpfungen, die im Startmenü angezeigt werden. Sie können Godot auch an die Taskleiste anheften, indem Sie mit der rechten Maustaste auf die ausführbare Datei klicken und **An Taskleiste anheften** wählen.
fi: Siirrä luotu pikakuvake sijaintiin ``%LOCALAPPDATA%\Microsoft\Windows\Start Menu\Programs``. Tämä on käyttäjä kohtainen sijainti pikakuvakkeille, jotka näkyvät Käynnistä-valikossa. Voit myös kiinnittää Godotin tehtäväpalkkiin napsauttamalla hiiren kakkospainikkeella suoritustiedostoa ja valitsemalla **Kiinnitä tehtäväpalkkiin**.

source: Save `this .desktop file <https://raw.githubusercontent.com/godotengine/godot/3.x/misc/dist/linux/org.godotengine.Godot.desktop>`__ to ``$HOME/.local/share/applications/``. If you have administrator privileges, you can also save the ``.desktop`` file to ``/usr/local/share/applications`` to make the shortcut available for all users.
de: Speichern Sie `diese .desktop-Datei <https://raw.githubusercontent.com/godotengine/godot/3.x/misc/dist/linux/org.godotengine.Godot.desktop>`__ unter ``$HOME/.local/share/applications/``. Wenn Sie über Administratorrechte verfügen, können Sie die ``.desktop``-Datei auch unter ``/usr/local/share/applications`` speichern, damit die Verknüpfung für alle Benutzer verfügbar ist.

source: Godot aims for cross-platform compatibility and open standards first and foremost. OpenGL and Vulkan are the technologies that are both open and available (nearly) on all platforms. Thanks to this design decision, a project developed with Godot on Windows will run out of the box on Linux, macOS, and more.
cs: Godot usiluje především o kompatibilitu mezi platformami a otevřené standardy. OpenGL a Vulkan jsou technologie, které jsou otevřené a dostupné (téměř) na všech platformách. Díky tomuto rozhodnutí o návrhu dojde u systému Linux, macOS a dalších k vylepšení projektu vyvinutého v Godotu pro Windows.
de: Godot strebt in erster Linie plattformübergreifende Kompatibilität und offene Standards an. OpenGL und Vulkan sind die Technologien, die sowohl offen als auch (fast) auf allen Plattformen verfügbar sind. Dank dieser Designentscheidung wird ein mit Godot unter Windows entwickeltes Projekt auch unter Linux, MacOS und anderen Systemen sofort einsatzbereit sein.
fi: Godot pyrkii ennen kaikkea eri alustojen väliseen yhteensopivuuteen ja avoimiin standardeihin. OpenGL ja Vulkan ovat tekniikoita, jotka ovat sekä avoimia että saatavilla (lähes) kaikilla alustoilla. Tämän suunnittelupäätöksen ansiosta Godotilla Windowsissa kehitetty projekti toimii Linuxissa, macOS:ssa ja muilla alustoilla.

source: In the long term, we may develop a Direct3D 12 renderer for Godot (mainly for the Xbox's purposes), but Vulkan and OpenGL will remain the default rendering backends on all platforms, including Windows.
cs: Z dlouhodobého hlediska můžeme vyvinout vykreslovací modul Direct3D 12 pro Godot (hlavně pro účely Xboxu), ale Vulkan a OpenGL zůstanou výchozím backendem vykreslování na všech platformách, včetně Windows.
de: Auf lange Sicht könnten wir einen Direct3D 12 Renderer für Godot entwickeln (vor allem für die Xbox), doch Vulkan und OpenGL werden die Standard-Renderer auf allen Plattformen bleiben, auch auf Windows.
fi: Pitkällä aikavälilla saatamme kehittää Direct3D 12 -renderöijän Godotille (pääasiassa Xboxia varten), mutta Vulkan ja OpenGL pysyvät oletus renderöinti tekniikkana kaikille alustoille, mukaanlukien Windows.

source: Godot intentionally does not include features that can be implemented by add-ons unless they are used very often. One example of this would be advanced artificial intelligence functionality.
cs: Godot záměrně neobsahuje funkce, které lze implementovat pomocí doplňků, pokud nejsou používány velmi často. Příkladem mohou být pokročilé funkce umělé inteligence.
de: Godot beinhaltet bewusst keine Funktionalität welche als Add-On implementiert werden kann - außer sie wird häufig verwendet. Ein Beispiel hierfür ist die fortschrittliche Funktionalität für künstliche Intelligenz.
fi: Godotista on jätetty tarkoituksella pois ominaisuudet, joita voidaan toteuttaa lisäosilla, ellei niitä tarvita hyvin usein. Esimerkkinä edistyneemmät tekoälyominaisuudet.

source: **Code maintenance and surface for bugs.** Every time we accept new code in the Godot repository, existing contributors often take the reponsibility of maintaining it. Some contributors don't always stick around after getting their code merged, which can make it difficult for us to maintain the code in question. This can lead to poorly maintained features with bugs that are never fixed. On top of that, the "API surface" that needs to be tested and checked for regressions keeps increasing over time.
cs: **Údržba kódu a vyhledávání chyb.** Pokaždé, když do úložiště Godot přijmeme nový kód, stávající přispěvatelé často přebírají odpovědnost za jeho údržbu. Někteří přispěvatelé po začlenění svého kódu ne vždy zůstávají, což nám může ztížit údržbu daného kódu. To může vést ke špatně udržovaným funkcím s chybami, které nejsou nikdy opraveny. Kromě toho se "plocha API", kterou je třeba testovat a kontrolovat, zda nedošlo k regresi, v průběhu času neustále zvětšuje.
de: **Wartung und Fehlersuche.** Jedes mal, wenn neuer Code ins Godot Repository hinzugefügt wird, übernehmen die Autoren oft die Aufgabe, sich um ihn zu kümmern. Manche Autoren lassen ihren Code einfach in ruhe, nachdem er Implementiert worden ist, was es schwierig für uns macht, ihn zu pflegen. Dies kann zu schlecht gepflegten Features mit Fehlern führen, die nie behoben worden sind. Über alldem wird die API, die getestet und nach Rezessionen verbessert werden muss, stetig größer.
fi: **Koodin ylläpitäminen ja virheiden mahdollisuus.** Joka kerta kun hyväksymme uutta koodia Godotiin, kehittäjät ottavat vastuun myös sen ylläpitämisestä. Jotkin osallistujat eivät jää projektiin sen jälkeen, kun heidän koodinsa on lisätty, joka voi tehdä vaikeaksi tuon koodin ylläpitämisen. Seurauksena voi olla heitteille jätettyjä ominaisuuksia ja ongelmia, joita ei koskaan korjata. Sen lisäksi rajapinta kasvaa koko ajan, ja siihen liittyvät tarkistukset lisääntyvät vastaavasti.

source: **Keeping the binary size small for export templates.** This directly impacts the size of projects exported with Godot. On mobile and web platforms, keeping file sizes low is primordial to ensure fast installation and loading on underpowered devices. Again, there are many countries where high-speed Internet is not readily available. To add to this, strict data usage caps are often in effect in those countries.
cs: **Zachování malé velikosti binárních souborů pro exportní šablony.** To přímo ovlivňuje velikost projektů exportovaných pomocí Godotu. U mobilních a webových platforem je udržení nízké velikosti souborů prvořadé pro zajištění rychlé instalace a načítání na málo výkonných zařízeních. Opět existuje mnoho zemí, kde není snadno dostupný vysokorychlostní internet. Navíc v těchto zemích často platí přísné limity pro využívání dat.
de: **Die Größe der Binary für Exportvorlagen klein halten.** Dies hat direkten Einfluss auf die Größe von Projekten, die mit Godot exportiert wurden. Auf mobilen und Web-Plattformen ist eine geringe Dateigröße von großer Bedeutung, um eine schnelle Installation und ein schnelles Laden auf leistungsschwachen Geräten zu ermöglichen. Auch hier gilt, dass es viele Länder gibt, in denen Hochgeschwindigkeits-Internet nicht ohne weiteres verfügbar ist. Hinzu kommt, dass in diesen Ländern oft strenge Datennutzungsobergrenzen gelten.
fi: **Vientimallien pitäminen pienenä.** Tämä vaikuttaa suoraan Godotilla tehtyjen sovellusten kokoon. Mobiililaitteilla ja selainalustoilla tiedostojen pitäminen pienenä on ensisijaisen tärkeää, että ne latautuu ja asentuu myös heikkotehoisemmilla laitteilla. On myös monia maita, joissa nopeat Internet-yhteydet eivät ole kaikkien saatavilla, tai niissä on tiukkoja datan käyttörajoituksia.

source: The most common and proper way to achieve this is to, instead, use a single base resolution for the game and only handle different screen aspect ratios. This is mostly needed for 2D, as in 3D it's just a matter of Camera XFov or YFov.
cs: Nejběžnějším a nejvhodnějším způsobem, jak toho dosáhnout, je namísto toho použít pro hru jediné základní rozlišení a ošetřit pouze různé poměry stran obrazovky. To je většinou potřeba pro 2D, protože ve 3D je to jen záležitost souřadnic kamery XFov nebo YFov.
de: Der eleganteste Weg, dies zu erreichen, ist eine Basisauflösung für das Spiel zu verwenden und anschließend mit verschiedenen Bildschirmgrößen umzugehen. Dies wird am meisten für 2D benötigt, denn in 3D ist es im Wesentlichen nur eine Frage der Kamera (XFov und YFov).
fi: Kaikkein yleisin ja oikein tapa saavuttaa tämä on sen sijaan käyttää yhtä pohjanäyttötarkkuutta pelille ja käsitellä vain eri kuvasuhteet. Tätä tarvitaan lähinnä 2D:lle, koska 3D:ssä on kyse vain kameran XFov tai YFov arvoista.

source: Choose a single base resolution for your game. Even if there are devices that go up to 2K and devices that go down to 400p, regular hardware scaling in your device will take care of this at little or no performance cost. Most common choices are either near 1080p (1920x1080) or 720p (1280x720). Keep in mind the higher the resolution, the larger your assets, the more memory they will take and the longer the time it will take for loading.
cs: Vyberte si jediné základní rozlišení pro vaši hru. I když existují zařízení, která mají až 2K a zařízení, která jenom na 400p, bude se o to starat pravidelné škálování hardwaru ve vašem zařízení s malými nebo žádnými požadavky na výkon. Nejběžnější volby jsou buď blízko 1080p (1920x1080) nebo 720p (1280x720). Mějte na paměti, že čím vyšší rozlišení, tím větší je vaše zdroje, tím více paměti zaberou a déle bude trvat jejich načítání.
de: Wählen Sie eine einfache Basisauflösung für Ihr Spiel. Selbst zwischen Geräten, die über eine Auflösung von 2K hinausgehen und die nur eine Auflösung von unter 400p unterstützen, erledigt das standardisierte, hardwarebasierte Skalieren einen hervorragenden Job bei gleichzeitig minimalen Performanceeinbußen. Populär sind 1080p (1920x1080) oder 720p (1280x720). Beachten Sie jedoch, je höher die Auflösung und die Texturen sind, desto mehr Arbeitsspeicher wird das Gerät benötigen und desto länger wird es dauern, bis das Spiel fertig geladen ist.
fi: Valitse pelillesi yksi pohjaresoluutio. Vaikka onkin olemassa laitteita, jotka yltävät 2K tarkkuuteen, ja laitteita, joilla on niinkin alhainen tarkkuus kuin 400p, laitteesi tavallinen laiteistoskaalaus hoitaa tämän pienellä tai olemattomalla suorituskykykustannuksella. Yleisimmät valinnat ovat lähellä 1080p (1920x1080) ja 720p (1280x720) tarkkuuksia. Pidä mielessä, että mitä suurempi näyttötarkkuus, sitä suuremmat ovat assettisi, ja sitä enemmän muistia ne vievät sekä sitä kauemmin niiden lataus kestää.

source: Use the stretch options in Godot; 2D stretching while keeping aspect ratios works best. Check the :ref:`doc_multiple_resolutions` tutorial on how to achieve this.
cs: Použijte možnosti roztažení v Godot; 2D roztažení při zachování poměru stran funguje nejlépe. Podívejte se na návod :ref:`doc_multiple_resolutions` , jak toho dosáhnout.
de: Benutze die Streck-Optionen in Godot. Am besten funktioniert 2D-Strecken, wenn das Seitenverhältnis gleich bleibt (siehe :ref:`doc_multiple_resolutions`).
fi: Käytä Godotin venytysvalintoja; 2D-venytys kuvasuhde säilyttäen toimii parhaiten. Tarkista :ref:`doc_multiple_resolutions` oppaasta kuinka tämä saadaan aikaan.

source: If there is a desire to make your game also work on ancient devices with tiny screens (fewer than 300 pixels in width), you can use the export option to shrink images, and set that build to be used for certain screen sizes in the App Store or Google Play.
cs: Pokud chcete, aby vaše hra fungovala také na starých zařízeních s malými obrazovkami (šířka menší než 300 pixelů), můžete pomocí možnosti exportu zmenšit obrázky a nastavit, aby se toto sestavení použilo v App Storu či Google Play pro určité velikosti obrazovky .
de: Ist es gewünscht, das Spiel auf älteren Geräten mit kleinen Bildschirmen (weniger als 300 Pixel horizontal) laufen zu lassen, können die Bilder mit der Export-Option verkleinert werden und für bestimmte Bildschirmgrößen im Google Play Store oder im Apple Store eingesetzt werden.
fi: Jos on tarvetta saada pelisi toimimaan myös muinaisilla laitteilla ja niiden pikkuruisilla näytöillä (vähemmän kuin 300 pikseliä leveitä), voit käyttää vientivalintoja kuvien kutistamiseen ja asettaa tuon kyseisen käännöksen käytettäväksi tietyillä näyttöko'oilla App Store tai Google Play -kaupoissa.

source: Also, see the official blog posts on these topics:
cs: Podívejte se také na oficiální blogové příspěvky k těmto tématům:
de: Siehe auch die offiziellen Blogeinträge zu diesen Themen (auf Englisch):
fi: Katso myös viralliset blogikirjoitelmat liittyen näihin aiheisiin:

source: `A look at the GDNative architecture <https://godotengine.org/article/look-gdnative-architecture>`_
cs: `Pohled na architekturu GDNative <https://godotengine.org/article/look-gdnative-architecture>`_
de: `Ein Blick auf die GDNative-Architektur <https://godotengine.org/article/look-gdnative-architecture>`_

source: `GDNative is here! <https://godotengine.org/article/dlscript-here>`_
cs: `GDNative je tady! <https://godotengine.org/article/dlscript-here>`_
de: `GDNative ist hier! <https://godotengine.org/article/dlscript-here>`_

source: You can also take a look at the GDScript implementation, the Godot modules, as well as the `unofficial Python support <https://github.com/touilleMan/godot-python>`_ for Godot. This would be a good starting point to see how another third-party library integrates with Godot.
cs: Můžete se také podívat na implementaci GDScriptu, moduly Godotu a také na `neoficiální podporu Pythonu <https://github.com/touilleMan/godot-python>`_ pro Godota. To by bylo dobrým výchozím bodem pro pochopení, jak se knihovny třetích stran integrují do Godota.
de: Sie können auch einen Blick auf die GDScript Implementierung werfen, die Godot-Module und die `inoffizielle Python-Unterstützung <https://github.com/touilleMan/godot-python>`_ für Godot. Dies ist ein guter Startpunkt um zu sehen wie eine weitere Bibliothek von einem Drittanbieter in Godot integriert wird.
fi: Voit myös vilkaista GDScriptin toteutusta, Godot moduuleja sekä myös `epävirallista Python-tukea <https://github.com/touilleMan/godot-python>`_ Godotille. Näistä lähtökohdista saat hyvin selville, miten jokin toinen kolmannen osapuolen kirjasto on integroitu Godotiin.

source: Awesome! As an open-source project, Godot thrives off of the innovation and ambition of developers like you.
cs: Skvělý! Jako open-source projekt Godot vzkvétá díky inovacím a ambicím vývojářů, jako jste vy.
de: Super! Als Open Source-Projekt lebt Godot von den Ambitionen und Ideen von Entwicklern wie Ihnen.
fi: Mahtavaa! Avoimen lähdekoodin projektina Godot kukoistaa kaltaistesi kunnianhimoisten ja innovoivien kehittäjien ansiosta.
