Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, fi, pt_br, zh_cn

source: The first place to get started is in the `issues <https://github.com/godotengine/godot/issues>`_. Find an issue that resonates with you, then proceed to the `How to Contribute <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_ guide to learn how to fork, modify, and submit a Pull Request (PR) with your changes.
cs: První místo, kde začít, je v `nesrovnalosti <https://github.com/godotengine/godot/issues>`_ . Najděte problém, se kterým souzníte, a poté se pokračujte do průvodce `Jak přispět <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_ a naučte se, jak udělat fork , upravte a odešlete Pull Request (PR) s vašimi změnami.
de: Als Erstes können Sie sich die `Bugreports <https://github.com/godotengine/godot/issues>`_ anschauen. Finden Sie ein Ticket, das Sie anspricht, dann lesen Sie die `Anleitung zum Mitwirken <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_ durch, um zu erfahren wie Sie einen Projekt-Fork anlegen, ihn bearbeiten und einen Pull Request (PR) mit Ihren Ergänzungen absenden können.
fi: Ensimmäinen paikka, josta aloittaa on `ongelmat <https://github.com/godotengine/godot/issues>`_. Etsi ongelma, joka herättää sinussa vastakaikua, ja etene sitten `How to Contribute <https://github.com/godotengine/godot/blob/master/CONTRIBUTING.md#contributing-pull-requests>`_ oppaaseen oppiaksesi kuinka haaroitat, muokkaat ja lähetät muutospyynnön (PR) muutoksistasi.

source: It might be tempting to want to bring ideas to Godot, like ones that result in massive core changes, some sort of mimicry of what another game engine does, or alternative workflows that you'd like built into the editor. These are great, and we are thankful to have such motivated people want to contribute, but Godot's focus is and always will be the core functionality as outlined in the `Roadmap <https://github.com/godotengine/godot-roadmap/blob/master/ROADMAP.md>`_, `squashing bugs and addressing issues <https://github.com/godotengine/godot/issues>`_, and conversations between Godot community members.
cs: Může být lákavé chtít vnést do Godota nápady, a to třeba i ty, které mají za následek masivní změny jádra, nějaký druh napodobování ostatních herních enginů nebo alternativní pracovní postupy, které byste chtěli zabudovat do editoru. To je skvělé a jsme vděční za to, že takoví motivovaní lidé chtějí přispět, ale Godot se zaměřuje a vždy bude zaměřovat na základní funkce, jak je uvedeno v `Roadmap <https://github.com/godotengine/godot-roadmap/blob /master/ROADMAP.md>`_ , `odstraňování chyb a řešení problémů <https://github.com/godotengine/godot/issues>`_ a konverzacích členů komunity Godot.
de: Es mag verlockend sein, Ideen in Godot einzubringen, etwa solche, die zu gravierenden Codeänderungen führen würden, um eine Art Nachahmung einer anderen Game-Engine zu verwirklichen oder alternative Arbeitsabläufe, die in den Editor eingebaut werden sollen. Diesen Enthusiasmus finden wir großartig und sind dankbar dafür, so motivierte Leute dabei zu haben, doch Godots Fokus ist und bleibt die Kernfunktionalität, so wie sie in der `Roadmap <https://github.com/godotengine/godot-roadmap/blob/master/ROADMAP.md>`_, `squashing bugs and addressing issues <https://github.com/godotengine/godot/issues>`_ und in Diskussionen zwischen Godot-Community-Mitgliedern beschrieben ist.
fi: Saattaa olla houkuttelevaa haluta tuoda Godotiin ideoita, kuten sellaisia, jotka johtavat massiivisiin ydinmuutoksiin, jonkinlaiseen jäljittelyyn toisen pelimoottorin toiminnasta tai vaihtoehtoisiin työnkulkuihin, jotka haluaisit sisällyttää muokkaimeen. Nämä ovat hienoja ideoita ja olemme kiitollisia siitä, että näin motivoituneet ihmiset haluavat osallistua, mutta Godot keskittyy ja tulee aina keskittymään ydintoimintoihin, jotka on hahmoteltu `etenemissuunnitelmassa <https://github.com/godotengine/godot-roadmap/blob/master/ROADMAP.md>`, `vikojen korjaamiseen ja ongelmien ratkaisemiseen <https://github.com/godotengine/godot/issues>` ja Godot-yhteisön jäsenten välisiin keskusteluihin.

source: Most developers in the Godot community will be more interested to learn about things like:
cs: Většina vývojářů v komunitě Godot se bude více zajímat o věci jako:
de: Die meisten Entwickler in der Godot Community werden eher and Dingen interessiert sein, wie:
fi: Useimmat kehittäjät Godotin yhteisössä ovat kiinnostuneempia oppimaan sellaisista asioista kuten:

source: Your experience using the software and the problems you have (we care about this much more than ideas on how to improve it).
cs: Vaše zkušenosti s používáním softwaru a problémy, které máte (na tom nám záleží mnohem více než jen na nápadech, jak jej vylepšit).
de: Ihre Erfahrung mit der Software und die Probleme, die Sie haben (uns interessiert das um einiges mehr als die Ideen, wie man die Software verbessern kann).
fi: Kokemuksista ohjelmiston käyttämisessä ja millaisiin ongelmiin olet törmännyt (välitämme tästä paljon enemmän kuin ideoista kuinka parantaa sitä).

source: The features you would like to see implemented because you need them for your project.
cs: Implementace funkcí, které byste rádi viděli, protože je potřebujete pro svůj projekt.
de: Die Funktionen, die Sie gerne in der Engine implementiert sehen würden, weil Sie sie für ein Projekt benötigt werden.
fi: Ominaisuuksista, joita haluaisit nähdä toteutettavan, koska tarvitset niitä projektissasi.

source: The concepts that were difficult to understand while learning the software.
cs: Pojmy, které byly při učení softwaru obtížně srozumitelné.
de: Die Konzepte, die schwierig zu verstehen waren zum Erlernen der Software.
fi: Käsitteistä, jotka oli vaikea ymmärtää opetellessasi ohjelmiston käyttöä.

source: The parts of your workflow you would like to see optimized.
cs: Části vašeho pracovního postupu, které byste chtěli optimalizovat.
de: Teile von Arbeitsabläufen, die Sie gerne optimiert haben würden.
fi: Työnkulun osista, joita haluaisit nähdä tehostettavan.

source: Parts where you missed clear tutorials or where the documentation wasn't clear.
cs: Části, ve kterých vám scházely jasné návody nebo kde dokumentace nebyla srozumitelná.
de: Teile, wo Ihnen verständliche Anleitungen fehlten oder wo die Dokumentation nicht ausführlich genug war.
fi: Osista, joista et löytänyt selkeää opasta tai joissa dokumentaatio ei ollut selvä.

source: Please don't feel like your ideas for Godot are unwelcome. Instead, try to reformulate them as a problem first, so developers and the community have a functional foundation to ground your ideas on.
cs: Prosím, nemyslete si, že vaše nápady pro Godota jsou nevítané. Místo toho se je pokuste nejprve přeformulovat jako problém, takže vývojáři a komunita budou mít funkční základ, o který mohou vaše postřehy opřít.
de: Bitte haben Sie nicht das Gefühl, dass Ihre Ideen nicht willkommen wären. Versuchen Sie stattdessen zuerst, sie als Problem neu zu formulieren, sodass die Entwickler und die gesamte Community einen festen Bezugspunkt haben, auf dem sie Ihre Idee diskutieren können.
fi: Älä suinkaan ajattele, että ideasi Godotiin eivät ole tervetulleita. Sen sijaan, yritä muotoilla ne ensin uudestaan ongelman muotoon, jolloin kehittäjillä ja yhteisöillä on käytännöllinen perusta johon pohjustaa ideasi.

source: A good way to approach sharing your ideas and problems with the community is as a set of user stories. Explain what you are trying to do, what behavior you expect to happen, and then what behavior actually happened. Framing problems and ideas this way will help the whole community stay focused on improving developer experiences as a whole.
cs: Dobrým způsobem, jak přistupovat ke sdílení vašich nápadů a problémů s komunitou, je vytvořit příběh. Vysvětlete, co se snažíte udělat, jaké chování očekáváte a jaké chování se skutečně stalo. Formulování problémů a nápadů tímto způsobem pomůže celé komunitě soustředit se na zlepšování celkové vývojářské zkušenosti.
de: Ein geeigneter Ansatz, Ideen und Probleme mit der Gemeinschaft zu teilen, ist mit einer Reihe praktischer Anwendergeschichten. Beschreiben Sie, was Sie beabsichtigen, welches Verhalten Sie idealerweise dabei erwarten würden und wie es sich aber tatsächlich ereignet hat. Probleme und Ideen auf diese Weise einzugrenzen, wird der Allgemeinheit helfen, sich auf die Verbesserung der Nutzererfahrung als Ganzes zu konzentrieren.
fi: Hyvä tapa lähestyä ideoittesi ja ongelmiesi jakamista yhteisön kanssa, on sarja käyttäjätarinoita. Selosta mitä yrität tehdä, mitä toimintaa odotat tapahtuvan ja mitä toimintaa oikeastaan tapahtui. Ongelmien ja ideoiden asettaminen tähän tapaan auttaa koko yhteisöä pysymään keskittyneenä parantamaan pelikehittäjien kokemuksia kokonaisuutena.

source: Bonus points for bringing screenshots, concrete numbers, test cases, or example projects (if applicable).
cs: Bonusové body za podání screenshotů, konkrétních čísel, testovacích případů nebo příkladů projektů (pokud jsou k dispozici).
de: Bonuspunkte gibt es für Bildschirmfotos, konkrete Zahlen, Testfälle oder Beispielprojekte (falls machbar).
fi: Bonuspisteitä kuvakaappauksien, kouriintuntuvien lukujen, testitapausten ja esimerkkiprojektien toimittamisesta (jos mahdollista).

source: That said, we wouldn't recommend using Godot to create a *mobile* application since low-processor mode isn't supported on mobile platforms yet.
cs: Přesto bychom nedoporučovali používat Godot k vytváření *mobilních* aplikací, protože nízkoprocesorový režim zatím není na mobilních platformách podporován.
de: Dennoch wir empfehlen es nicht mit Godot eine *mobile* App zu erstellen da der low-processor mode noch nicht auf mobilen Plattformen unterstützt wird.
fi: Emme kuitenkaan suosittele Godotia mobiilisovellusten tekoon, koska kyseistä virransäästöominaisuutta ei vielä tueta mobiilijärjestelmillä.

source: Like many other libraries (Qt as an example), Godot does not make use of STL. We believe STL is a great general purpose library, but we had special requirements for Godot.
cs: Stejně jako mnoho jiných knihoven (Qt jako příklad), Godot nevyužívá STL. Věříme, že STL je skvělá univerzální knihovna, ale pro Godota jsme měli specifické požadavky.
de: Wie viele andere Bibliotheken (zum Beispiel QT) verzichtet auch Godot auf den Einsatz der STL. Wir glauben, dass die STL eine großartige Allzweck-Bibliothek ist, allerdings hatten wir besondere Anforderungen für Godot.
fi: Kuten monet muut kirjastot (esimerkiksi Qt), Godot ei käytä STL-kirjastoa. Uskomme, että STL on hyvä yleiskäyttöinen kirjasto, mutta meillä oli erikoisvaatimuksia Godotille.

source: Additionally, exceptions significantly increase binary size for the executable.
cs: Výjimky navíc výrazně zvyšují celkovou velikost spustitelného souboru.
de: Zusätzlich vergrößern "exceptions" die Größe des ausführbaren Programm erheblich.
fi: Lisäksi, poikkeukset lisäävät huomattavasti binäärin kokoa suoritettavassa ohjelmassa.

source: Why does Godot not enforce RTTI?
cs: Proč Godot nevynucuje RTTI?
de: Weshalb erzwingt Godot keine RTTI?
fi: Miksi Godot ei pakota RTTItä?

source: Godot provides its own type-casting system, which can optionally use RTTI internally. Disabling RTTI in Godot means considerably smaller binary sizes can be achieved, at a little performance cost.
cs: Godot poskytuje svůj vlastní systém přetypování, který může interně používat RTTI. Zakázání RTTI v Godot znamená, že lze dosáhnout výrazně menších velikostí spustitelných souboru při nízkých nákladech na výkon.
de: Godot stellt sein eigenes Type-Casting-System bereit, welches, nach Belieben, von der RTTI internen Gebrauch machen kann. Deaktiviertes RTTI in Godot bedeutet deutlich kleinere Größe, der ausführbaren Programmen, mit dem Nachteil einer wenig schlechteren Leistung.
fi: Godot tarjoaa oman tyypinvalintajärjestelmänsä, joka voi valinnaisesti käyttää RTTI:tä sisäisesti. RTTI:n poistaminen käytöstä Godotissa tarkoittaa sitä, että voidaan saavuttaa huomattavasti pienempiä binäärikokoja, mutta suorituskyky on hieman heikompi.

source: Why does Godot not force users to implement DoD (Data oriented Design)?
cs: Proč Godot nenutí uživatele implementovat DoD (Data orientovaný design)?
de: Warum zwingt Godot seine Benutzer nicht zur Implementierung von DoD (Data oriented Design)?
fi: Miksi Godot ei pakota käyttäjiään toteuttamaan DoD-mallia (Data oriented Design, Tietokanta ensin-suunnittelu) ?

source: While Godot internally for a lot of the heavy performance tasks attempts to use cache coherency as well as possible, we believe most users don't really need to be forced to use DoD practices.
cs: Zatímco Godot interně pro mnoho náročných úkolů se snaží co nejlépe využít koherenci mezipaměti, věříme, že většina uživatelů skutečně nepotřebuje být nucena využívat postupy DoD.
de: Während Godot intern versucht, die Cache-Zusammenhänge für viele Aufgaben mit hoher Leistung so gut wie möglich zu nutzen, sind wir der Meinung, dass die meisten Benutzer nicht dazu gezwungen werden müssen, DoD-Methoden zu gebrauchen.
fi: Vaikka Godot pyrkii sisäisesti käyttämään välimuistin koherenssia mahdollisimman hyvin monissa raskaissa suorituskykytehtävissä, uskomme, että useimpia käyttäjiä ei oikeastaan tarvitse pakottaa käyttämään DoD-käytäntöjä.

source: DoD is mostly a cache coherency optimization that can only gain you significant performance improvements when dealing with dozens of thousands of objects (which are processed every frame with little modification). As in, if you are moving a few hundred sprites or enemies per frame, DoD won't help you, and you should consider a different approach to optimization.
cs: DoD je spočívá převážně v optimalizaci koherence mezipaměti, která vám může přinést pouze významné zvětšení výkonu při práci s velkými desítkami tisíc objektů (při zpracování v každém snímku s malou úpravou). V případě, že pohybujete několika stovkami skřítků nebo nepřátel za snímek, DoD vám tedy stějně nepomůže a měli byste zvážit jiný přístup k optimalizaci.
de: DoD ist größtenteils eine Cache-Zusammenhang-Optimierung, mit welcher nur eine erhebliche Leistungssteigerung erlangt werden kann, wenn diese mehrere tausende Objekte berechnen muss. Wenn wenige Hundert Sprites oder Gegner pro Bild bewegt werden, wird DoD keine Hilfe sein und eine andere Herangehensweise der Optimierung sollte in Erwägung gezogen werden.
fi: DoD on enimmäkseen välimuistin koherenssioptimointi, jolla voidaan saavuttaa merkittäviä suorituskykyparannuksia vain, kun käsitellään kymmeniä tuhansia objekteja (joita käsitellään joka kehys ja joita ei juurikaan muuteta). Toisin sanoen, jos siirrät muutamaa sataa spriteä tai vihollista ruutua kohden, DoD ei auta sinua ja sinun pitäisi harkita erilaista optimointitapaa.

source: If a game that really needs to process such large amount of objects is needed, our recommendation is to use C++ and GDNative for the high performance parts and GDScript (or C#) for the rest of the game.
cs: Pokud hra kutečně potřebuje zpracovat tak velké množství objektů, doporučujeme použít C ++ a GDNative pro části s požadavkem na vysoký výkon a GDScript (nebo C #) pro zbytek hry.
de: Falls ein Spiel, das wirklich eine solch große Anzahl von Objekten benötigt, wird von uns empfohlen C++ und GDNative für den Hochleistungsteil des Spiels zu gebrauchen und für den Rest GDScript (oder C#).
fi: Jos tarvitaan peliä, jonka on todella käsiteltävä näin suuri määrä objekteja, suosittelemme käyttämään C++:a ja GDNativea suorituskykyisiin osiin ja GDScriptiä (tai C#:a) muuhun peliin.
