Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/faq.po
Languages: cs, de, fi, pt_br, zh_cn

source: Frequently asked questions
cs: Často kladené otázky
de: Häufig gestellte Fragen
fi: Usein kysytyt kysymykset
pt_br: Perguntas Frequentes
zh_cn: 常见问题

source: What can I do with Godot? How much does it cost? What are the license terms?
cs: Co mohu dělat s Godot? Kolik to stojí? Co jsou licenční podmínky?
de: Was kann ich mit Godot machen? Wie viel kostet es? Wie lauten die Lizenzbedingungen?
fi: Mitä voin tehdä Godotilla? Paljonko se maksaa? Millaiset lisenssiehdot ovat?
pt_br: O que eu posso fazer com o Godot? Quanto custa? Quais são os termos de licença?
zh_cn: 可以用 Godot 做什么？需要花多少钱？有哪些许可条款？

source: Godot is `Free and open source Software <https://en.wikipedia.org/wiki/Free_and_open source_software>`_ available under the `OSI-approved <https://opensource.org/licenses/MIT>`_ MIT license. This means it is free as in "free speech" as well as in "free beer."
pt_br: Godot é um `Software Livre e de Código Aberto <https://en.wikipedia.org/wiki/Free_and_open-source_software>`_ disponível sob a licença MIT `aprovada pela OSI <https://opensource.org/licenses/MIT>`_. Isso significa que é livre, bem como gratuito e "de graça."
zh_cn: Godot 是在 `OSI 认可的 <https://opensource.org/licenses/MIT>`_ MIT 许可证下可用的\ `自由和开源软件 <https://zh.wikipedia.org/wiki/%E8%87%AA%E7%94%B1%E5%8F%8A%E5%BC%80%E6%94%BE%E6%BA%90%E4%BB%A3%E7%A0%81%E8%BD%AF%E4%BB%B6>`_\ 。这意味着它不仅可以自由使用，也可以免费获取。

source: In short:
cs: Ve zkratce:
de: Zusammengefasst:
fi: Lyhyesti:
pt_br: Resumindo:
zh_cn: 简而言之：

source: You are free to download and use Godot for any purpose: personal, non-profit, commercial, or otherwise.
cs: Můžete si zdarma stáhnout a používat Godot pro jakýkoli účel, osobní, neziskový, komerční nebo jinak.
de: SIe können Godot frei herunterladen und für jeden Zweck verwenden: persönlich, gemeinnützig, kommerziell oder sonstiges.
fi: Voit ladata ja käyttää Godotia vapaasti mihin tahansa tarkoitukseen; henkilökohtaiseen, yleishyödylliseen, kaupalliseen tai muuhun.
pt_br: Você é livre para baixar e usar o Godot para qualquer finalidade: pessoal, sem fins lucrativos, comercial ou qualquer outro.
zh_cn: 你可以自由下载和使用 Godot，用于个人、非营利、商业等任何目的。

source: You are free to modify, distribute, redistribute, and remix Godot to your heart's content, for any reason, both non-commercially and commercially.
cs: Máte možnost modifikovat, distribuovat, redistribuovat a remixovat Godot , tak jak uznáte za vhodné, a to z jakéhokoli důvodu, a to jak nekomerčně, tak komerčně.
de: Sie dürfen Godot nach Herzenslust verändern und weitergeben (auch verändert), egal ob kommerziell oder nicht.
fi: Voit muokata, jakaa, levittää eteenpäin ja uudelleenyhdistellä Godotia sydämesi kyllyydestä, mistä tahansa syystä, sekä ei-kaupallisesti että kaupallisesti.
pt_br: Você é livre para modificar, distribuir, redistribuir e remixar o Godot como quiser, por qualquer motivo, seja ele não-comercial ou comercial.
zh_cn: 无论出于任何原因，商业还是非商业，你都可以根据自己的心之所向，自由地对 Godot 进行修改、分发、再分发、改版。

source: All the contents of this accompanying documentation are published under the permissive Creative Commons Attribution 3.0 (`CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_) license, with attribution to "Juan Linietsky, Ariel Manzur and the Godot Engine community."
pt_br: Todo o conteúdo desta documentação anexa está publicado sob a licença permissiva Creative Commons Attribution 3.0 (`CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_), com atribuição a "Juan Linietsky, Ariel Manzur e a comunidade Godot Engine."
zh_cn: 本随附文档的所有内容均在宽松的知识共享署名 3.0（\ `CC-BY 3.0 <https://creativecommons.org/licenses/by/3.0/>`_\ ）许可下发布，署名为“Juan Linietsky、Ariel Manzur 和 Godot 引擎社区。”

source: Logos and icons are generally under the same Creative Commons license. Note that some third-party libraries included with Godot's source code may have different licenses.
cs: Loga a ikony jsou obecně pod stejnou licencí Creative Commons. Upozorňujeme, že některé knihovny třetích stran zahrnuté ve zdrojovém kódu Godota mohou mít různé licence.
de: Für Logos und Symbole gilt generell die gleiche "Creative Commons"-Lizenz. Beachten Sie jedoch, dass manche Bibliotheken von Drittanbietern, die im Quellcode Godots enthalten sind, abweichende Lizenzen enthalten können.
fi: Logot ja ikonit kuuluvat pääasiassa saman Creative Commons -lisenssin alle. Ota huomioon, että jotkin Godotin sisällyttämät kolmansien osapuolten lähdekoodit voivat kuulua toisentyyppisiin lisensseihin.
pt_br: Logomarcas e ícones geralmente estão sob a mesma licença Creative Commons. Note que algumas bibliotecas de terceiros incluídas no código-fonte do Godot podem ter licenças diferentes.
zh_cn: Logo 徽标和图标均在相同的 CC 共享许可下。注意，Godot 的源代码中包含的某些第三方库可能具有不同的许可。

source: For full details, look at the `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ as well as the `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ and `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.txt>`_ files in the Godot repository.
pt_br: Para mais detalhes, consulte os arquivos `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_, e também `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ e `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.txt>`_ no repositório do Godot.
zh_cn: 有关详细信息，请查看 Godot 仓库中的 `COPYRIGHT.txt <https://github.com/godotengine/godot/blob/master/COPYRIGHT.txt>`_ 以及 `LICENSE.txt <https://github.com/godotengine/godot/blob/master/LICENSE.txt>`_ 和 `LOGO_LICENSE.txt <https://github.com/godotengine/godot/blob/master/LOGO_LICENSE.txt>`_ 文件。

source: Also, see `the license page on the Godot website <https://godotengine.org/license>`_.
cs: Viz také `licenční stránka na webu Godot <https://godotengine.org/license>`_ .
de: Siehe auch `Hinweise zur Lizenz auf der Godot-Webseite <https://godotengine.org/license>`_.
fi: Katso myös `Godotin lisenssi-sivu <https://godotengine.org/license>`_.
pt_br: Veja também a `página da Licença no site do Godot <https://godotengine.org/license>`_.
zh_cn: 还可以查阅 `Godot 网站上的许可页面 <https://godotengine.org/license>`_\ 。

source: Which platforms are supported by Godot?
cs: Které platformy podporuje Godot?
de: Welche Plattformen werden von Godot unterstützt?
fi: Mitä laitealustoja Godot tukee?
pt_br: Quais plataformas são suportadas pelo Godot?
zh_cn: Godot 支持哪些平台？

source: **For the editor:**
cs: **Pro editora:**
de: **Vom Editor unterstützt:**
fi: **Editorissa:**
pt_br: **Para o editor:**
zh_cn: **编辑器：**

source: Android (experimental)
cs: Android (experimentální)
de: Android (experimentell)
zh_cn: Android（实验性）

source: `Web <https://editor.godotengine.org/>`__ (experimental)
zh_cn: `网页版 <https://editor.godotengine.org/>`__\ （实验性）

source: **For exporting your games:**
cs: **Pro export vašich her:**
de: **Für das Exportieren von Spielen:**
fi: **Pelien viennissä**
pt_br: **Para exportar seus jogos:**
zh_cn: **导出游戏：**

source: Both 32- and 64-bit binaries are supported where it makes sense, with 64 being the default. Official macOS builds support Apple Silicon natively as well as x86_64.
pt_br: Ambos os binários de 32 e 64 bits são suportados onde fizerem sentido, sendo 64 o padrão. As builds para macOS oficial suportam Apple Silicon nativamente, bem como x86_64.
zh_cn: 同时支持 32 位和 64 位的二进制文件，默认为 64 位。官方 macOS 版本原生支持 Apple Silicon 以及 x86_64。

source: Some users also report building and using Godot successfully on ARM-based systems with Linux, like the Raspberry Pi.
cs: Někteří uživatelé také hlásí sestavení a používání Godot úspěšně na systémech založených na ARM s Linuxem, jako je Raspberry Pi.
de: Einige Nutzer berichten, dass sie Godot auch auf ARM-basierten Linux-Systemen – wie dem Raspberry Pi – erfolgreich kompilieren und benutzen konnten.
fi: Jotkut käyttäjät ovat raportoineet kääntäneensä ja käyttäneensä Godotia onnistuneesti Linuxissa ARM-pohjaisilla järjestelmillä, kuten Raspberry Pi:llä.
pt_br: Alguns usuários também relatam terem compilado e utilizado o Godot com êxito em sistemas baseados em ARM com Linux, como Raspberry Pi.
zh_cn: 一些用户也在 Linux 的基于 ARM 的系统上成功构建和使用 Godot，如树莓派。

source: The Godot team can't provide an open source console export due to the licensing terms imposed by console manufacturers. Regardless of the engine you use, though, releasing games on consoles is always a lot of work. You can read more about :ref:`doc_consoles`.
pt_br: A equipe do Godot não pode fornecer uma exportação de console de código aberto devido aos termos de licenciamento impostos pelos fabricantes de consoles. Independentemente da engine que você usa, lançar jogos em consoles é sempre muito trabalhoso. Você pode ler mais sobre isso aqui: :ref:`doc_consoles`.
zh_cn: 由于游戏主机制造商施加的许可条款，Godot 团队无法提供开源的主机导出项。但是无论使用哪种引擎，在主机上发布游戏始终是一项繁重的工作。更多相关内容见 :ref:`doc_consoles`\ 。

source: For more on this, see the sections on :ref:`exporting <toc-learn-workflow-export>` and :ref:`compiling Godot yourself <toc-devel-compiling>`.
cs: Pro více informací o tom, viz oddíly na :ref:`export <toc-learn-workflow-export>` a :ref:`Godot vlastní kompilace <toc-devel-compiling>`.
de: Mehr dazu in den Abschnitten :ref:`Exportieren <toc-learn-workflow-export>` und :ref:`Godot kompilieren <toc-devel-compiling>`.
fi: Lisää tästä aiheesta :ref:`vienti <toc-learn-workflow-export>` ja :ref:`Godotin itse kääntö <toc-devel-compiling>` -osioissa.
pt_br: Para mais informações, veja as seções :ref:`exportação <toc-learn-workflow-export>` e :ref:`compilando Godot você mesmo <toc-devel-compiling>`.
zh_cn: 有关这方面的更多信息，请参阅\ :ref:`导出 <toc-learn-workflow-export>`\ 和\ :ref:`编译 Godot <toc-devel-compiling>` 章节。

source: Godot 3 also had support for Universal Windows Platform (UWP). This platform port was removed in Godot 4 due to lack of maintenance, and it being deprecated by Microsoft. It is still available in the current stable release of Godot 3 for interested users.
pt_br: Godot 3 também tinha suporte para Universal Windows Platform (UWP). Esta porta de plataforma foi removida em Godot 4 devido à falta de manutenção, e está sendo depreciada pela Microsoft. Ainda está disponível na versão estável atual do Godot 3 para usuários interessados.
zh_cn: Godot 3 还支持通用 Windows 平台 (UWP)。但由于缺乏维护，该平台端口已在 Godot 4 中被删除，并已被 Microsoft 弃用。对于感兴趣的用户来说，它仍然可以在当前的 Godot 3 稳定版本中使用。

source: Which programming languages are supported in Godot?
cs: Které programovací jazyky jsou podporovány v Godotu?
de: Welche Programmiersprachen werden in Godot unterstützt?
fi: Mitkä ohjelmointikielet ovat tuettuina Godotissa?
pt_br: Quais linguagens de programação são suportadas pelo Godot?
zh_cn: Godot 支持哪些编程语言？

source: The officially supported languages for Godot are GDScript, C#, and C++. See the subcategories for each language in the :ref:`scripting <toc-learn-scripting>` section.
pt_br: As linguagens suportadas oficialmente no Godot são GDScript, C# e C++. Veja as subcategorias para cada linguagem na seção de :ref:`scripting <toc-learn-scripting>`.
zh_cn: Godot 官方支持的语言是 GDScript、C# 和 C++。请参阅\ :ref:`脚本 <toc-learn-scripting>`\ 章节中的各个语言的相关段落。

source: If you are just starting out with either Godot or game development in general, GDScript is the recommended language to learn and use since it is native to Godot. While scripting languages tend to be less performant than lower-level languages in the long run, for prototyping, developing Minimum Viable Products (MVPs), and focusing on Time-To-Market (TTM), GDScript will provide a fast, friendly, and capable way of developing your games.
cs: Pokud teprve začínáte s vývojem v Godotu nebo s vývojem her obecně, GDScript je jazyk právě pro vás a to protože je v Godotu nativné podporován. Zatímco skriptovací jazyky mají v dlouhodobém horizontu tendenci být méně výkonné než jazyky nižší úrovně, pro prototypování, vývoj minimálních životaschopných produktů (MVP) a zaměřování se na TTM (Time-To-Market), GDScript poskytne rychlý, uživatelsky přívětivý a výkonný prostředek pro rozvoj vašich her.
de: Wenn Sie gerade beginnen sich mit Godot oder generell Spieleentwicklung zu befassen, empfehlen wir GDScript zu lernen und zu nutzen, da es nativ von Godot unterstützt wird. Skriptsprachen sind insgesamt weniger performant als Sprachen wie C oder Rust, aber zum schreiben von Prototypen, Minimal-Viable-Products und bezogen auf die Time-To-Market bietet GDScript einen schnellen, freundlichen und mächtigen Weg, Spiele zu entwickeln.
fi: Jos olet vasta aloittelemassa joko Godotin käyttöä tai peliohjelmointia yleisesti on suositeltua opetella ja käyttää GDScript-kieltä, sillä se on Godotin natiivikieli. Vaikka skriptikielet tahtovat olla pitkässä juoksussa suorituskyvyltään heikompia kuin matalan tason kielet, prototyypitykseen, Minimum Viable Product (MVP) kehitykseen ja Time-To-Market (TTM) fokusoitumiseen GDScript tarjoaa nopean, ystävällisen ja kyvykkään tavan kehittää pelejäsi.
pt_br: Se você está apenas começando com o Godot ou desenvolvimento de jogos em geral, GDScript é a linguagem recomendada para aprender e usar, uma vez que é nativa no Godot. Enquanto linguagens de script tendem a ter menos performance que linguagens de menor nível, para prototipagem, desenvolvimento de Minimum Viable Products (MVPs), e focar em Time-To-Market (TTM), GDScript vai fornecer um modo rápido, amigável e capaz de desenvolver seus jogos.
zh_cn: 如果你刚开始接触 Godot 或一般的游戏开发，推荐学习并使用 GDScript 语言，因为它是 Godot 的原生语言。虽然从长远来看，脚本语言的性能往往不如低级语言，但对于原型设计、开发最小可行产品（MVP）和关注上市时间（TTM）来说，GDScript 将提供一种快速、友好、有能力的游戏开发方式。

source: Note that C# support is still relatively new, and as such, you may encounter some issues along the way. C# support is also currently missing on the web platform. Our friendly and hard-working development community is always ready to tackle new problems as they arise, but since this is an open source project, we recommend that you first do some due diligence yourself. Searching through discussions on `open issues <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`__ is a great way to start your troubleshooting.
pt_br: Observe que o suporte ao C# ainda é relativamente novo e, como tal, você pode encontrar alguns problemas ao longo do caminho. Atualmente o suporte a C# não é suportado pela plataforma web. Nossa comunidade de desenvolvimento amigável e esforçada está sempre pronta para enfrentar novos problemas à medida que eles surgem, mas como esse é um projeto de código aberto, recomendamos que você faça primeiro uma diligência prévia. Pesquisar em `problemas em aberto <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>` é uma ótima maneira de começar sua resolução de problemas.
zh_cn: 请注意，加入 C# 支持的时间相对较短，因此你可能会遇到一些问题。Web 平台目前也缺少 C# 支持。我们友好而勤奋的开发社区随时准备在出现新问题时解决这些问题，但由于这是一个开源项目，我们建议你先自己进行一些评估。通过搜索关于\ `未解决问题 <https://github.com/godotengine/godot/issues?q=is%3Aopen+is%3Aissue+label%3Atopic%3Adotnet>`__\ 的讨论来排除问题。

source: As for new languages, support is possible via third parties with GDExtensions. (See the question about plugins below). Work is currently underway, for example, on unofficial bindings for Godot to `Python <https://github.com/touilleMan/godot-python>`_ and `Nim <https://github.com/pragmagic/godot-nim>`_.
pt_br: Quanto a novas linguagens, é possível oferecer suporte através de terceiros com as GDExtensions. (Veja abaixo sobre como os plugins funcionam.) Existe trabalho em andamento, por exemplo, para vinculações não oficiais do Godot para `Python <https://github.com/touilleMan/godot-python>`_ e para `Nim <https://github.com/pragmagic/godot-nim>`_.
zh_cn: 对于新语言，可以通过第三方使用 GDExtension 获得支持（请参阅下面关于插件的问题）。目前工作正在进行，例如，Godot 与 `Python <https://github.com/touilleMan/godot-python>`_ 和 `Nim <https://github.com/pragmagic/godot-nim>`_ 的非官方绑定。

source: What is GDScript and why should I use it?
cs: Co je GDScript a proč bych jej měl používat?
de: Was ist GDScript und warum sollte ich es verwenden?
fi: Mikä on GDScript ja miksi minun pitäisi käyttää sitä?
pt_br: O que é GDScript e porque eu devo usá-lo?
zh_cn: GDScript 是什么？为什么要用它？

source: GDScript is Godot's integrated scripting language. It was built from the ground up to maximize Godot's potential in the least amount of code, affording both novice and expert developers alike to capitalize on Godot's strengths as fast as possible. If you've ever written anything in a language like Python before, then you'll feel right at home. For examples and a complete overview of the power GDScript offers you, check out the :ref:`GDScript scripting guide <doc_gdscript>`.
pt_br: GDScript é a linguagem de script integrada do Godot. Ela foi construída desde o início para maximizar o potencial do Godot com a menor quantidade de código, permitindo que desenvolvedores novatos e experientes capitalizem os pontos fortes de Godot o mais rápido possível. Se você já escreveu algo em uma linguagem como Python antes, você se sentirá em casa. Para exemplos, histórico e uma visão geral completa do poder que o GDScript oferece a você, verifique o :ref:`Guia de script do GDScript <doc_gdscript>`.
zh_cn: GDScript 是 Godot 所集成的脚本语言。它是从头开始构建的，目标是用最少的代码让 Godot 的潜力最大化，使新手和专业开发人员都能尽可能快地利用 Godot 的优势。如果你曾经用类似 Python 这样的语言写过任何东西，那么你会感到得心应手。如果你想了解关于 GDScript 的示例以及完整的功能介绍，请查看 :ref:`GDScript 脚本指南 <doc_gdscript>`\ 。

source: There are several reasons to use GDScript, especially when you are prototyping, in alpha/beta stages of your project, or are not creating the next AAA title. The most salient reason is the overall **reduction of complexity**.
pt_br: Há várias razões para usar o GDScript - especialmente quando você está criando protótipos, em fases alfa/beta do seu projeto, ou não está criando o próximo título AAA. A razão mais importante é a **redução da complexidade**.
zh_cn: 使用 GDScript 有不少原因，尤其是你在进行原型设计时、在项目的 alpha/beta 阶段、或者项目不是 3A 大作时。但最突出的优势就是整体\ **复杂度降低**\ 。

source: The original intent of creating a tightly integrated, custom scripting language for Godot was two-fold: first, it reduces the amount of time necessary to get up and running with Godot, giving developers a rapid way of exposing themselves to the engine with a focus on productivity; second, it reduces the overall burden of maintenance, attenuates the dimensionality of issues, and allows the developers of the engine to focus on squashing bugs and improving features related to the engine core, rather than spending a lot of time trying to get a small set of incremental features working across a large set of languages.
pt_br: A intenção original de criar uma linguagem de script personalizada e altamente integrada para Godot visa duas coisas: primeiro, reduzir a quantidade de tempo necessária para começar a usar o Godot, oferecendo aos desenvolvedores uma maneira rápida de se expor à engine com foco na produtividade; segundo, reduzir o esforço geral de manutenção, diminuir a variedade de problemas, e permitir que os desenvolvedores da engine se concentrem em resolver bugs e melhorar as funcionalidade relacionadas ao core da engine, em vez de desperdiçar tempo tentando fazer um pequeno conjunto incremental de funcionalidades funcionar para um grande número de linguagens.
zh_cn: 为 Godot 创建一个紧密集成的自定义脚本语言的初衷有两点：首先，它减少了启动和运行Godot 所需的时间，使开发人员沉浸于引擎并专注生产力；其次，它减少了维护的总体负担，降低了问题的维度，让引擎开发者专注于排除错误并改进与引擎核心相关的功能，而不是花费大量时间试图在一大堆语言中获得一小部分增量功能。

source: Since Godot is an open source project, it was imperative from the start to prioritize a more integrated and seamless experience over attracting additional users by supporting more familiar programming languages, especially when supporting those more familiar languages would result in a worse experience. We understand if you would rather use another language in Godot (see the list of supported options above). That being said, if you haven't given GDScript a try, try it for **three days**. Just like Godot, once you see how powerful it is and rapid your development becomes, we think GDScript will grow on you.
zh_cn: 由于 Godot 是开源项目，因此从一开始就必须优先考虑更加集成和无缝的体验，而不是通过支持大多人熟悉的编程语言来吸引更多用户——特别是在支持那些大多人熟悉的语言会导致更糟糕的体验时。我们理解你更想在 Godot 中使用其他语言（请参阅上面支持的选项列表）。话虽如此，如果你还没试过 GDScript，先试\ **三天**\ 。就像 Godot 一样，一旦你看到它有多强大并且开发多迅速，我们认为你将对 GDScript 刮目相看。

source: More information about getting comfortable with GDScript or dynamically typed languages can be found in the :ref:`doc_gdscript_more_efficiently` tutorial.
cs: Více informací o pohodlném používání GDScriptu nebo dynamicky jazyků najdete v tutoriálu :ref:`doc_gdscript_more_efffully`.
de: Weitere Informationen, um sich mit GDScript bzw. dynamisch typisierten Sprachen vertraut zu machen, können in der Anleitung :ref:`doc_gdscript_more_efficiently` gefunden werden.
fi: Lisää tietoa GDScriptiin tai dynaamisesti tyypitettyihin kieliin tutustumista varten löydät :ref:`doc_gdscript_more_efficiently` oppaasta.
pt_br: Mais informações sobre como ficar mais confortável usando GDScript ou outras linguagens de tipagem dinâmica podem ser encontradas no tutorial :ref:`doc_gdscript_more_efficiently`.
zh_cn: 有关熟悉 GDScript 或动态类型语言的更多信息，请参阅 :ref:`doc_gdscript_more_efficiently` 教程。

source: What were the motivations behind creating GDScript?
cs: Jaké byla motivace pro vytvořeníí GDScript?
de: Was war die Motivation, GDScript zu entwickeln?
fi: Mitkä olivat vaikuttimet GDScriptin luomiselle?
pt_br: Quais foram as motivações por trás da criação do GDScript?
zh_cn: 创建 GDScript 背后的动机是什么？

source: In the early days, the engine used the `Lua <https://www.lua.org>`__ scripting language. Lua can be fast thanks to LuaJIT, but creating bindings to an object-oriented system (by using fallbacks) was complex and slow and took an enormous amount of code. After some experiments with `Python <https://www.python.org>`__, that also proved difficult to embed.
zh_cn: 在早期，引擎使用 `Lua <https://www.lua.org>`__ 脚本语言。Lua 高性能来源于 LuaJIT，但是创建与面向对象系统的绑定（通过使用回退）是非常复杂且缓慢的，并且需要大量代码。在用 `Python <https://www.python.org>`__ 进行了一些实验后，它也被证明是难以嵌入的。

source: The main reasons for creating a custom scripting language for Godot were:
cs: Hlavní důvody pro vytvoření vlastního skriptovacího jazyka pro Godot byly:
de: Die Hauptgründe, eine eigene Skriptsprache für Godot zu entwickeln, waren:
fi: Tärkeimmät syyt oman skriptikielen luomiselle Godotiin olivat:
pt_br: As principais razões para criação de uma linguagem personalizada para Godot foram:
zh_cn: 为 Godot 创建自定义脚本语言的主要原因有：

source: Poor threading support in most script VMs, and Godot uses threads (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
cs: Špatná podpora vláken v enginech většiny skriptů a Godot používá vlákna(Lua, Python, Squirrel, JavaScript, ActionScript atd.).
de: Schlechte Threading-Unterstützung in den meisten Skript-VMs und Godot nutzt Threads (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
fi: Useimmissa skriptivirtuaalikoneissa ei ole hyvää säikeistystukea ja Godot käyttää säikeitä (Lua, Python, Squirrel, JS, AS, jne.).
pt_br: Não há um bom suporte a threads na maioria das VMs de scripting, e o Godot utiliza threads (Lua, Python, Squirrel, JavaScript, ActionScript, etc.).
zh_cn: Godot 使用多线程，而大多数脚本虚拟机对线程的支持不佳（Lua、Python、Squirrel、JavaScript、ActionScript 等）。
