Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/troubleshooting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Editor tooltips in the Inspector and Node docks blink when they're displayed.
cs: Popisky nástrojů editoru v docích Inspektor a Uzel při zobrazení blikají.
de: Editor-Tooltips in den Inspektor- und Node-Docks blinken, wenn sie angezeigt werden.
es: Los globos de información de herramientas del Editor en los muelles Inspector y Nodo parpadean cuando son mostrados.
fr: Les infobulles de l'éditeur dans l'inspecteur et les docks de nœuds clignotent lorsqu'elles sont affichées.
it: I suggerimenti dell'editor nell'Inspector e nella finestra dei Nodi lampeggiano quando vengono visualizzati.
ja: インスペクタードックとノードドックのエディターツールチップは、表示されると点滅します。
pl: Etykietki edytora w dokach Inspektor i Węzły migają, gdy są wyświetlane.
pt_br: Os balões de dicas do Inspetor do Painel de Nós piscam quando exibidos.
ru: Всплывающие подсказки редактора в доках Inspector и Node мигают при отображении.
uk: Підказки редактора на панелях Inspector і Node блимають, коли вони відображаються.
zh_cn: 检查器和节点面板的编辑器工具提示出现后闪烁。
zh_tw: 檢查器和節點面板的編輯器工具提示出現後閃爍。

source: This is a `known issue <https://github.com/godotengine/godot/issues/32990>`__ caused by the third-party Stardock Fences application on Windows. The only known workaround is to disable Stardock Fences while using Godot.
cs: Jedná se o `známý problém <https://github.com/godotengine/godot/issues/32990>`__ způsobený aplikací třetí strany Stardock Fences v systému Windows. Jediným známým řešením je vypnutí aplikace Stardock Fences při používání Godotu.
de: Das ist ein `bekannter Fehler <https://github.com/godotengine/godot/issues/32990>`__ verursacht durch die Drittanbieter-Software Stardock Fences auf Windows. Die einzige bekannte Übergangslösung ist Stardock Fences, während der Verwendung von Godot zu deaktivieren.
es: Esto es un `known issue <https://github.com/godotengine/godot/issues/32990>`__ causado por la aplicación de terceros Stardock Fences en Windows. La única solución conocida es deshabilitar Stardock Fences mientras se utiliza Godot.
fi: Tämä on `tuttu ongelma <https://github.com/godotengine/godot/issues/32990>`__, jonka aiheuttaa kolmannen osapuolen Stardock Fences -sovellus Windowsissa. Ainoa tunnettu kiertotapa on poistaa Stardock Fences käytöstä Godotia käytettäessä.
fr: Il s'agit d'un `problème connu <https://github.com/godotengine/godot/issues/32990>`__ causé par l'application tierce Stardock Fences pour Windows. La seule solution connue est de désactiver Stardock Fences lors de l'utilisation de Godot.
it: Questo è un `problema noto <https://github.com/godotengine/godot/issues/32990>`__ causato dall'applicazione di terze parti Stardock Fences su Windows. L'unica soluzione conosciuta è disabilitare Stardock Fences mentre si usa Godot.
ja: これは、Windows上のサードパーティのStardockFencesアプリケーションによって引き起こされる `既知の問題<https://github.com/godotengine/godot/issues/32990>` です。唯一の既知の回避策は、Godotの使用中にStardockFencesを無効にすることです。
ko: 이는 Windows의 서드 파티 응용 프로그램 Stardock Fence로 인해 발생하는 `알려진 문제 <https://github.com/godotengine/godot/issues/32990>`__\ 입니다. 유일하게 알려진 해결책은 Godot을 사용하는 동안 Stardock Fence를 비활성화하는 것입니다.
pl: Jest to `znany problem <https://github.com/godotengine/godot/issues/32990>`__ spowodowany przez aplikację Stardock Fences innej firmy w systemie Windows. Jedynym znanym obejściem jest wyłączenie Stardock Fences podczas korzystania z Godota.
pt_br: Esse é um `problema conhecido <https://github.com/godotengine/godot/issues/32990>`__ causado pela aplicação de terceiros Stardock Fences no Windows. O único contorno conhecido é desabilitar Stardock Fences enquanto usa o Godot.
ru: Это `известная проблема <https://github.com/godotengine/godot/issues/32990>`__ которая происходит из–за сторонней программы Stardock Fences для Windows. Известный способ решения проблемы это выключение Stardock Fences когда используется Godot.
uk: Це "відома проблема <https://github.com/godotengine/godot/issues/32990>`__, спричинена стороннім застосунком Stardock Fences у Windows. Єдиний відомий обхідний шлях — вимкнути Stardock Fences під час використання Godot.
zh_cn: 这是个\ `已知错误 <https://github.com/godotengine/godot/issues/32990>`__\ ，是由 Windows 上的第三方程序 Stardock Fences 引起的。已知的绕过方法是在使用 Godot 时禁用 Stardock Fences。
zh_tw: 這是個\ `已知錯誤< https://github.com/godotengine/godot/issues/32990 >`__\， 是由Windows上的協力廠商程式Stardock Fences引起的。 已知的繞過方法是在使用Godot時禁用Stardock Fences。

source: The Godot editor appears frozen after clicking the system console.
cs: Po kliknutí na konzolu systému se editor Godot zamrzne.
de: Der Godot Editor scheint einzufrieren, nachdem die Systemkonsole angeklickt wurde.
es: El editor de Godot se congela después de hacer clic en la consola del sistema.
fr: L'éditeur Godot apparaît figé après avoir cliqué sur la console système.
it: L'editor di Godot appare bloccato dopo aver fatto clic sulla console di sistema.
ja: システムコンソールをクリックすると、Godotエディタがフリーズしたように見える。
pl: Po kliknięciu konsoli systemowej edytor Godot ulega zamrożeniu.
pt_br: O editor do Godot parece congelar após clicar no console do sistema.
ru: Godot-редактор явно подвисает после нажатия на системную консоль.
uk: Редактор Godot зависає при натисканні на системну консоль.
zh_cn: 点击系统控制台后，Godot 编辑器没有响应。
zh_tw: 點擊系統主控台後，Godot 編輯器沒有回應。

source: When running Godot on Windows with the system console enabled, you can accidentally enable *selection mode* by clicking inside the command window. This Windows-specific behavior pauses the application to let you select text inside the system console. Godot cannot override this system-specific behavior.
cs: Pokud používáte Godot ve Windows se zapnutou systémovou konzolou, můžete omylem aktivovat *režim výběru* kliknutím do příkazového okna. Toto chování specifické pro Windows pozastaví aplikaci, aby vám umožnila vybrat text uvnitř konzoly systému. Godot nemůže potlačit toto specifické chování systému.
de: Wenn Godot unter Windows mit aktivierter Konsole ausgeführt wird, kann versehentlich der *Auswahlmodus* aktiviert werden, indem in das Kommandofenster geklickt wird. Dieses Windows-spezifische Verhalten pausiert die Anwendung und lässt Sie Text innerhalb der Konsole auswählen. Godot kann dieses System-spezifische Verhalten nicht überschreiben.
es: Cuando se corre Godot en Windows con la consola del sistema activada, Tu puedes accidentalmente activar el *Modo de Selección* clickeando a dentro de la ventana de comandos.
fi: Kun käytät Godotia Windowsissa, kun järjestelmäkonsoli on käytössä, voit vahingossa ottaa käyttöön *valintatilan* klikkaamalla komentoikkunan sisällä. Tämä Windows-kohtainen käyttäytyminen pysäyttää sovelluksen, jotta voit valita tekstiä järjestelmäkonsolin sisällä. Godot ei voi ohittaa tätä järjestelmäkohtaista käyttäytymistä.
fr: Lorsque vous exécutez Godot sous Windows avec la console système activée, vous pouvez accidentellement activer le *mode sélection* en cliquant dans la fenêtre de commande. Ce comportement spécifique à Windows met l'application en pause pour vous permettre de sélectionner du texte dans la console système. Godot ne peut pas passer outre ce comportement spécifique au système.
it: Quando si esegue Godot su Windows con la console di sistema abilitata, è possibile abilitare accidentalmente la *modalità di selezione* facendo clic all'interno della finestra di comando. Questo comportamento specifico di Windows sospende l'applicazione per consentire di selezionare il testo all'interno della console di sistema. Godot non può ignorare questo comportamento specifico del sistema.
ja: システムコンソールが有効な状態でGodotをWindows上で実行しているとき、コマンドウィンドウの内側をクリックすると誤って *選択モード* を有効にしてしまうことがあります。このWindows固有の動作は、システムコンソール内でテキストを選択できるようにアプリケーションを一時停止させます。Godot はこのシステム固有の動作を上書きすることができません。
ko: 시스템 콘솔을 활성화한 Windows에서 Godot을 실행할 때, 명령 창 내부를 클릭해 실수로 *선택 모드*\ 를 활성화할 수 있습니다. 이 Windows 관련 동작은 응용 프로그램을 일시 중지하여 시스템 콘솔 내에서 텍스트를 선택할 수 있도록 합니다. Godot는 이 시스템 전용 동작을 바꿀 수 없습니다.
pl: W przypadku uruchamiania Godota w systemie Windows z włączoną konsolą systemową można przypadkowo włączyć *tryb wyboru*, klikając w oknie poleceń. To zachowanie specyficzne dla systemu Windows wstrzymuje aplikację, aby umożliwić zaznaczenie tekstu w konsoli systemowej. Godot nie może zastąpić tego specyficznego dla systemu zachowania.
pt_br: Ao executar o Godot no Windows com o console do sistema aberto, você pode acidentalmente habilitar o *modo de seleção* clicando dentro da janela de comando. Esse comportamento específico do Windows pausa o aplicativo para que você selecione o texto dentro do console do sistema. O Godot não pode ignorar esse comportamento específico do sistema.
ru: При запуске Godot через системную консоль на Windows — вы можете случайно включить *режим выделения*, кликая внутри командного окна. Это специфичное для Windows поведение приостанавливает работу приложения, чтобы вы могли выделить текст в системной консоли. Godot не может отменить это специфическое для системы поведение.
uk: При роботі Godot у Windows із увімкненою системною консоллю ви можете випадково увімкнути *режим вибору*, клацнувши всередині командного вікна. Ця поведінка, специфічна для Windows, призупиняє застосунок, щоб дозволити вам вибрати текст усередині системної консолі. Godot не може замінити цю специфічну для системи поведінку.
zh_cn: 在启用了系统控制台的 Windows 上运行 Godot 时，您可以通过在命令窗口中单击来意外启用\ *选择模式*\ 。Windows 的这种特定行为会暂停应用程序，以便您在系统控制台内选择文本。Godot 无法覆盖此系统特定的行为。
zh_tw: 在 Windows 上啟用系統主控台時執行 Godot，可能會不小心在命令視窗內因點擊而啟用了 **選擇模式** 。這個行為只會發生在 Windows 上，會暫停應用程式來讓使用者可選擇系統主控台內的文字。Godot 無法複寫此一系統特定的行為。

source: To solve this, select the system console window and press Enter to leave selection mode.
cs: Chcete-li to vyřešit, vyberte okno konzoly systému a stiskněte klávesu Enter pro opuštění režimu výběru.
de: Wählen Sie um dies zu beheben das Fenster der Systemkonsole aus und drücken Sie Enter, um den Auswahlmodus zu verlassen.
es: Para solucionarlo, seleccione la ventana de la consola del sistema y pulse Intro para salir del modo de selección.
fi: Voit ratkaista tämän valitsemalla järjestelmän konsoli-ikkunan ja poistumalla valintatilasta painamalla Enter-näppäintä.
fr: Pour résoudre ce problème, sélectionnez la fenêtre de la console système et appuyez sur la touche Entrée pour quitter le mode de sélection.
it: Per risolvere questo problema, seleziona la finestra della console di sistema e premi Invio per uscire dalla modalità di selezione.
ja: これを解決するには、システムコンソールウィンドウを選択し、Enterキーを押して選択モードを解除します。
ko: 이것을 해결하려면 시스템 콘솔 창을 선택하고 Enter를 눌러 선택 모드를 종료하십시오.
pl: Aby rozwiązać ten problem, wybierz okno konsoli systemowej i naciśnij klawisz Enter, aby opuścić tryb wyboru.
pt_br: Para resolver isto, selecione a janela do console do sistema e pressione Enter para sair do modo de seleção.
ru: Для решения проблемы, выберите окно этой системной консоли и нажмите Enter, чтобы отключить режим выделения.
uk: Щоб вирішити цю проблему, виберіть вікно системної консолі та натисніть Enter, щоб вийти з режиму вибору.
zh_cn: 要解决此问题，请选择系统控制台窗口，然后按 Enter 退出选择模式。
zh_tw: 要解決此問題，請選擇系統主控台視窗，並按一下 Enter 鍵來離開選擇模式。

source: Some text such as "NO DC" appears in the top-left corner of the project manager and editor window.
cs: V levém horním rohu okna správce projektu a editoru se zobrazí text, například "NO DC".
de: Einige Texte wie "NO DC" werden in der oberen linken Ecke des Projektmanagers und des Editorfensters angezeigt.
es: Un texto como "NO DC" aparece en la esquina superior izquierda de la ventana del administrador de proyectos y del editor.
fr: Un texte tel que "NO DC" apparaît dans le coin supérieur gauche de la fenêtre du gestionnaire de projet et de l'éditeur.
it: Un testo come "NO DC" appare nell'angolo in alto a sinistra della finestra del gestore dei progetti e dell'editor.
ja: プロジェクトマネージャーやエディターのウィンドウの左上に「NO DC」などの文字が表示されます。
pl: Niektóre teksty, takie jak „NO DC” pojawiają się w lewym górnym rogu okna menedżera projektu i edytora.
pt_br: Textos como "NO DC" aparecem no canto superior esquerdo do gerenciador de projetos e na janela do editor.
ru: Текст «NO DC», появляется в верхнем левом углу менеджера проектов и окна редактора.
uk: У верхньому лівому куті менеджера проєктів та вікна редактора з'являється якийсь текст, наприклад "NO DC".
zh_cn: 在项目管理器和编辑器窗口的左上角出现“NO DC”之类的文本。
zh_tw: 在專案管理員與編輯器視窗左上角出現"NO DC"之類的文字。

source: This is caused by the NVIDIA graphics driver injecting an overlay to display information.
cs: Je to způsobeno tím, že grafický ovladač NVIDIA vkládá překryvnou vrstvu pro zobrazení informací.
de: Dies wird durch den NVIDIA-Grafiktreiber verursacht, der ein Overlay zur Anzeige von Informationen einfügt.
es: Esto es causado por controlador de gráficos NVIDIA que inyecta una superposición para mostrar información.
fi: Tämä johtuu siitä, että NVIDIA-näytönohjain lisää peittokuvan tietojen näyttämiseksi.
fr: Cela est dû au fait que le pilote graphique NVIDIA injecte un *overlay* pour afficher des informations.
it: Questo è causato dal driver grafico NVIDIA che inietta un overlay per visualizzare le informazioni.
ja: これは、NVIDIAグラフィックスドライバが情報を表示するためにオーバーレイを挿入することが原因です。
ko: 이것은 NVIDIA 그래픽 드라이버가 정보를 표시하기 위해 오버레이를 삽입하기 때문에 발생합니다.
pl: Jest to spowodowane przez sterownik graficzny NVIDIA stosujący nakładkę w celu wyświetlenia informacji.
pt_br: Isso é devido ao driver gráfico da NVIDIA injetando um overlay para mostrar informações.
ru: Это вызвано тем, что графические драйверы NVIDIA выводят оверлей для отображения информации.
uk: Це спричинено тим, що графічний драйвер NVIDIA вводить накладку для відображення інформації.
zh_cn: 这是由于 NVIDIA 显卡驱动程序注入了覆盖显示信息造成的。
zh_tw: 這是由於NVIDIA顯卡驅動程序注入了覆蓋顯示資訊造成的。

source: To disable this overlay on Windows, restore your graphics driver settings to the default values in the NVIDIA Control Panel.
cs: Chcete-li toto překrytí v systému Windows zakázat, obnovte nastavení grafického ovladače na výchozí hodnoty v ovládacím panelu NVIDIA.
de: Um dieses Overlay unter Windows zu deaktivieren, setzen Sie die Grafiktreibereinstellungen in der NVIDIA-Systemsteuerung auf die Standardwerte zurück.
es: Para desabilitar esta superposicion en Windows, restablece las configuraciones de tu controlador de gráficos en el panel de control para devolver los valores predeterminados.
fi: Jos haluat poistaa tämän päällekkäisyyden käytöstä Windowsissa, palauta grafiikkaohjaimen asetukset NVIDIAn ohjauspaneelin oletusarvoihin.
fr: Pour désactiver cet *overlay* sous Windows, rétablissez les paramètres de votre pilote graphique aux valeurs par défaut dans le panneau de configuration NVIDIA.
it: Per disabilitare questa sovrapposizione su Windows, ripristina le impostazioni del driver grafico ai valori predefiniti nel pannello di controllo NVIDIA.
ja: Windowsでこのオーバーレイを無効にするには、NVIDIA Control Panelでグラフィックドライバーの設定をデフォルト値に戻してください。
ko: Windows에서 이 오버레이를 비활성화하려면, 그래픽 드라이버 설정을 NVIDIA 제어판의 기본값으로 복원하십시오.
pl: Aby wyłączyć tę nakładkę w systemie Windows, przywróć ustawienia sterownika graficznego do wartości domyślnych w Panelu sterowania NVIDIA.
pt_br: Para desabilitar esse overlay no Windows, restaure suas configurações do driver gráfico para os valores padrões no Painel de Controle NVIDIA.
ru: Чтобы отключить этот оверлей в Windows, восстановите настройки видеодрайвера по умолчанию в контрольной панели NVIDIA.
uk: Щоб вимкнути це накладання в Windows, відновіть налаштування графічного драйвера до значень за замовчуванням на панелі керування NVIDIA.
zh_cn: 要在 Windows 上禁用此覆盖，请在 NVIDIA 控制面板中将图形驱动程序设置恢复为默认值。
zh_tw: 要在Windows上禁用此覆蓋，請在NVIDIA控制台中將圖形驅動程序設定恢復為預設值。

source: To disable this overlay on Linux, open ``nvidia-settings``, go to **X Screen 0 > OpenGL Settings** then uncheck **Enable Graphics API Visual Indicator**.
cs: Chcete-li toto překrytí v Linuxu zakázat, otevřete ``nvidia-settings``, přejděte na **X Screen 0 > OpenGL Settings** a zrušte zaškrtnutí **Enable Graphics API Visual Indicator**.
de: Um dieses Overlay unter Linux zu deaktivieren, öffnen Sie ``nvidia-settings``, gehen Sie zu **X Screen 0 > OpenGL Settings** und entfernen Sie das Häkchen bei **Enable Graphics API Visual Indicator**.
es: Para desactivar esta superposición en Linux, abre ``nvidia-settings``, ve a **X Screen 0 > OpenGL Settings** y desmarca **Enable Graphics API Visual Indicator**.
fi: Voit poistaa tämän päällekkäisyyden käytöstä Linuxissa avaamalla ``nvidia-settings``, siirtymällä kohtaan **X Screen 0 > OpenGL-asetukset** ja poistamalla sen jälkeen valintaruudun **Enable Graphics API Visual Indicator**.
fr: Pour désactiver cet *overlay* sous Linux, ouvrez ``nvidia-settings``, allez dans **X Screen 0 > OpenGL Settings** puis décochez **Enable Graphics API Visual Indicator**.
it: Per disabilitare questo overlay su Linux, apri ``nvidia-settings``, vai su **X Screen 0 > OpenGL Settings** e deseleziona **Enable Graphics API Visual Indicator**.
ja: Linuxでこのオーバーレイを無効にするには、 ``nvidia-settings`` を開き、 **X Screen 0 > OpenGL Settings** を選択し、 **Enable Graphics API Visual Indicator** のチェックを外します。
ko: 리눅스에서 이 오버레이 사용을 중지하려면, ``nvidia-settings``\ 을 열고, **X Screen 0 > OpenGL Setting**\ 에서 **Enable Graphics API Visual Indicator**\ 를 선택 취소합니다.
pl: Aby wyłączyć tą nakładkę na systemie Linux otwórz ``nvidia-settings`` , przejdź do **X Screen 0 > OpenGL Settings** potem odznacz **Enable Graphics API Visual Indicator**.
pt_br: Para desabilitar esse overlay no Linux, abra ``nvidia-settings``, vá até **X Screen 0 > OpenGL Settings** e desmarque **Enable Graphics API Visual Indicator**.
ru: Чтобы отключить этот оверлей в Linux, откройте ``nvidia-settings``, перейдите в **X Screen 0> OpenGL Settings**, затем снимите флажок **Enable Graphics API Visual Indicator**.
uk: Щоб вимкнути це накладання в Linux, відкрийте ``nvidia-settings``, перейдіть до **X Screen 0> OpenGL Settings**, а потім зніміть галочку **Enable Graphics API Visual Indicator**.
zh_cn: 要在 Linux 上禁用此覆盖，请打开 ``nvidia-settings``\ ，转到 **X Screen 0 > OpenGL Settings**\ ，然后取消选中 **Enable Graphics API Visual Indicator**\ 。
zh_tw: 要在Linux上禁用此覆蓋，請打開``nvidia-settings``\，轉到**X Screen 0 > OpenGL Settings**\，然後取消選中**Enable Graphics API Visual Indicator**\。

source: The project window appears blurry, unlike the editor.
cs: Na rozdíl od editoru se okno projektu jeví rozmazané.
de: Das Projektfenster erscheint im Gegensatz zum Editor unscharf.
es: La ventana del proyecto aparece borrosa, a diferencia del editor.
fr: La fenêtre du projet apparaît floue, contrairement à l'éditeur.
it: La finestra del progetto appare sfocata, a differenza dell'editor.
ja: プロジェクトウィンドウが、エディタと違ってぼやけて見える。
pl: W przeciwieństwie do edytora okno projektu jest niewyraźne.
pt_br: A janela do projeto aparece embaçada, ao contrário do editor.
ru: Отображение в окне проекта выглядит размытым, в отличии от показанного в редакторе.
uk: Вікно проєкту виглядає розмитим, на відміну від редактора.
zh_cn: 项目窗口看起来很模糊，但编辑器没有模糊。
zh_tw: 專案視窗看起來很模式，編輯器則不會。

source: Unlike the editor, the project isn't marked as DPI-aware by default. This is done to improve performance, especially on integrated graphics, where rendering 3D scenes in hiDPI is slow.
cs: Na rozdíl od editoru si není projekt ve výchozím nastavení vědom DPI. Toto se provádí za účelem zlepšení výkonu, zejména u integrované grafiky, kde je vykreslování 3D scén v hiDPI pomalé.
de: Im Gegensatz zum Editor ist das Projekt nicht standardmässig als DPI-Aware gekennzeichnet. Besonderns auf integrierten Grafikkarten kann so die Performance erhöht werden, wohingegen das Rendern von 3D Sczenen in hiDPI langsam ist.
es: A diferencia del editor, el proyecto no está marcado como DPI-aware por defecto. Esto se hace para mejorar el rendimiento, especialmente en los gráficos integrados, donde el renderizado de escenas 3D en hiDPI es lento.
fi: Toisin kuin muokkaimessa, projektia ei ole oletusarvoisesti merkitty DPI-tunnistavaksi. Tämä on tehty suorituskyvyn parantamiseksi, erityisesti integroidulla grafiikalla, jossa 3D-kohtausten renderöinti hiDPI:llä on hidasta.
fr: Contrairement à l'éditeur, le projet n'est pas marqué par défaut comme étant compatible DPI. Ceci est fait pour améliorer les performances, en particulier sur les cartes graphiques intégrés, où le rendu des scènes 3D en hiDPI est lent.
it: A differenza dell'editor, il progetto non è contrassegnato come compatibile con DPI per impostazione predefinita. Questo viene fatto per migliorare le prestazioni, specialmente sulla sceda grafica integrata, dove il rendering di scene 3D in hiDPI è lento.
ja: エディタとは異なり、プロジェクトではデフォルトでDPI対応に設定されていません。これはパフォーマンスを向上させるためで、特に統合グラフィックス上では、hiDPIでの3Dシーンのレンダリングが遅くなります。
ko: 에디터와 달리 프로젝트는 기본값으로 DPI 인식을 사용하지 않습니다. 이는 hiDPI에서 3D 씬을 렌더링하는 속도가 느린 곳(특히 내장 그래픽)에서 성능을 향상시키기 위함입니다.
pl: W przeciwieństwie do edytora projekt nie jest domyślnie oznaczony jako obsługujący DPI. Ma to na celu poprawę wydajności, szczególnie w przypadku zintegrowanej grafiki, gdzie renderowanie scen 3D w trybie hiDPI jest powolne.
pt_br: Diferente do editor, o projeto não está marcado como DPI-aware por padrão. Isto é feito para melhorar o desempenho, especialmente em gráficos integrados, onde a renderização de cenas 3D em hiDPI é lenta.
ru: В отличии от редактора, в настройках проекта по умолчанию не помечен флажок DPI-поддержки. Это сделано для повышения производительности, особенно для интегрированной графики, где рендеринг 3D-сцен в hiDPI происходит медленно.
uk: На відміну від редактора, проєкт за замовчуванням не позначений як DPI-відомий. Це робиться для покращення продуктивності, особливо в інтегрованій графіці, де промальовування 3D-сцен у hiDPI відбувається повільно.
zh_cn: 与编辑器不同，默认情况下，该项目未标记为支持 DPI。这样做是为了提高性能，特别是在 hiDPI 中渲染 3D 场景较慢的集成图形上。
zh_tw: 專案視窗與編輯器不同，預設情況下不會依據 DPI 做調整。這個特性是為了提升效能，特別是內顯在 hiDPI 下算繪 3D 場景時很慢。
