Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/troubleshooting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: Troubleshooting
cs: Odstraňování problémů
de: Fehlerbeseitigung
es: Solución De Problemas
fi: Ongelmien ratkonta
fr: Dépannage
it: Risoluzione dei problemi
ja: トラブルシューティング
ko: 문제 해결
pl: Rozwiązywanie problemów
pt_br: Solução de problemas
ru: Устранение неполадок
uk: Вирішення проблем
zh_cn: 故障排除
zh_tw: 疑難排解

source: This page lists common issues encountered when using Godot and possible solutions.
cs: Tato stránka obsahuje seznam běžných problémů, které se vyskytly při používání Godotu, a možná řešení.
de: Diese Seite listet häufig auftretende Probleme bei der Verwendung von Godot und mögliche Lösungen auf.
es: Esta página enumera los problemas comunes que se encuentran al usar Godot y las posibles soluciones.
fi: Tämä sivu listaa yleisiä ongelmia ja mahdollisia ratkaisuja niihin Godotia käyttäessä.
fr: Cette page énumère les problèmes courants rencontrés lors de l'utilisation de Godot et les solutions possibles.
it: Questa pagina elenca i problemi comuni riscontrati durante l'utilizzo di Godot e le possibili soluzioni.
ja: このページでは、Godotを使用する際によく遭遇する問題と、その解決策の候補を一覧にしています。
ko: 이 페이지에는 Godot 사용 중 발생하는 일반적인 문제와 가능한 해결 방법이 나열되어 있습니다.
pl: Ta strona zawiera listę typowych problemów napotkanych podczas korzystania z Godota i możliwych rozwiązań.
pt_br: Esta página lista problemas comuns ao usar o Godot e possíveis soluções.
ru: На этой странице перечислены распространенные проблемы, возникающие при использовании Godot, и возможные их решения.
uk: На цій сторінці перелічено найпоширеніші проблеми, що виникають при використанні Godot, та можливі способи їх вирішення.
zh_cn: 这个页面列出了使用 Godot 时的常见问题以及可能的解决办法。
zh_tw: 本頁列出了在使用 Godot 時會遇到的場景問題與可行的解決方案。

source: See :ref:`doc_using_the_web_editor` for caveats specific to the HTML5 version of the Godot editor.
cs: Viz :ref:`doc_using_the_web_editor`, kde jsou uvedena upozornění specifická pro verzi HTML5 editoru Godot.
de: Schauen sie sich :ref:`doc_using_the_web_editor`an, für Vorbehalte, die für die HTML5-Version des Godot-Editors spezifisch sind.
es: Ver :ref: `doc_using_the_web_editor` para advertencias específicas de la versión HTML5 del editor Godot.
fi: Katso :ref:`doc_using_the_web_editor` Godot-editorin HTML5-versiota koskevista varoituksista.
fr: Voir :ref:`doc_using_the_web_editor` pour les avertissements spécifiques à la version HTML5 de l'éditeur Godot.
it: Vedi :ref`doc_using_the_web_editor`per scorciatoie specifiche alla versione HTML5 dell'editor di Godot.
ja: HTML5版のGodotエディタに特有の注意点については、 :ref:`doc_using_the_web_editor` をご覧ください。
ko: HTML5 버전 Godot 에디터 주의 사항은 :ref:`doc_using_the_web_editor`\ 를 참고하세요.
pl: Zobacz :ref:`doc_using_the_web_editor` konkretne zastrzeżenia wersji HTML5 edytora Godot.
pt_br: Veja :ref:`doc_using_the_web_editor` para detalhes importantes específicos para a versão HTML5 do editor do Godot.
ru: Смотрите :ref:`doc_using_the_web_editor`, чтобы познакомиться с особенностями, относящимися к HTML5 версии редактора Godot.
uk: Дивіться :ref:`doc_using_the_web_editor` для застережень, характерних для версії HTML5 редактора Godot.
zh_cn: 关于 Godot 编辑器 HTML5 版本特定的注意事项，请参阅 :ref:`doc_using_the_web_editor`\ 。
zh_tw: 關於 Godot 編輯器 HTML5 版本的特定注意事項，請參考 :ref:`doc_using_the_web_editor`。

source: Everything I do in the editor or project manager appears delayed by one frame.
cs: Všechno, co dělám v editoru nebo projektovém manažerovi, se zdá být zpožděno o jeden snímek.
de: Alles, was man im Editor oder Projektmanager macht, erscheint um einen Frame verzögert.
es: Todo lo que hago en el editor o en el administrador de proyectos aparece retrasado por un fotograma.
fr: Tout ce que je fais dans l'éditeur ou le manager de projet semble retardé d'une image.
it: Tutto ciò che faccio nell'editor o nel gestore di progetti sembra ritardato di un fotogramma.
ja: エディタやプロジェクトマネージャーで行うことがすべて、1フレーム分遅れて見える。
pl: Wszystko, co robię w edytorze lub menadżerze projektu, wydaje się być opóźnione o jedną klatkę.
pt_br: Tudo que eu faço no editor ou no gerenciador de projeto aparece atrasado em um frame.
ru: Всё, что я делаю в редакторе или менеджере проектов, подвисает на один кадр.
uk: Все, що я роблю в редакторі, або менеджері проєктів, підвисає на один кадр.
zh_cn: 我在编辑器或项目管理器里做的任何事都会延迟一帧显示。
zh_tw: 我在編輯器與專案管理員中做任何事情感覺都慢了一幀。

source: This is a `known bug <https://github.com/godotengine/godot/issues/23069>`__ on Intel graphics drivers on Windows. Updating to the latest graphics driver version *provided by Intel* should fix the issue.
cs: Toto je `známá chyba <https://github.com/godotengine/godot/issues/23069>`_ v grafických ovladačích Intel pro Windows. Problém by měla vyřešit aktualizace na nejnovější verzi grafického ovladače *poskytovanou společností Intel*.
de: Das ist ein `bekannter Bug <https://github.com/godotengine/godot/issues/23069>`__ mit Grafiktreibern von Intel unter Windows. Ein Update auf die neuesten Grafiktreiber, die *von Intel zu Verfügung gestellt werden*, sollte das Problem beheben.
es: Este es un `error conocido <https://github.com/godotengine/godot/issues/23069>` en los controladores gráficos Intel en Windows. Actualizando a la última versión del controlador gráfico *suministrados por Intel* debería arreglar el problema.
fi: Tämä on `tuttu vika <https://github.com/godotengine/godot/issues/23069>`__ Intelin grafiikkaohjaimissa Windowsissa. Intelin * toimittaman * uusimpaan grafiikkaohjaimen versioon * päivittämisen pitäisi korjata ongelma.
fr: Il s'agit d'un `bug connu" <https://github.com/godotengine/godot/issues/23069>`__ sur les pilotes graphiques Intel sous Windows. La mise à jour vers la dernière version du pilote graphique *fourni par Intel* devrait résoudre le problème.
it: Si tratta di un `bug noto <https://github.com/godotengine/godot/issues/23069>` __ dei driver grafici Intel su Windows. L'aggiornamento alla versione più recente del driver grafico *fornita da Intel* dovrebbe risolvere il problema.
ja: これは、Windows上のIntel製グラフィックスドライバにある\ `既知のバグ <https://github.com/godotengine/godot/issues/23069>`__\ です。\ *Intelが提供する* グラフィックスドライバの最新バージョンにアップデートすれば、この問題は解決されるはずです。
ko: 이는 Windows에서 발생하는 Intel 그래픽 드라이버의 `알려진 버그 <https://github.com/godotengine/godot/issues/23069>`__\ 입니다. *인텔에서 제공하는* 최신 그래픽 드라이버 버전으로 업데이트하면 문제가 해결됩니다.
pl: To jest ` znany błąd <https://github.com/godotengine/godot/issues/23069> `__ w sterownikach grafiki Intel w systemie Windows. Aktualizacja do najnowszej wersji sterownika karty graficznej * dostarczonej przez firmę Intel * powinna rozwiązać problem.
pt_br: Este é um `bug conhecido <https://github.com/godotengine/godot/issues/23069>`__ em drivers gráficos da Intel no Windows. Atualizar os drivers para sua última versão *fornecida pela Intel* deve resolver o problema.
ru: Это `известная ошибка <https://github.com/godotengine/godot/issues/23069>`__ на графических драйверах Intel под Windows. Обновление до последней версии графического драйвера, *предоставляемого Intel,* должно исправить проблему.
uk: Це `відома помилка <https://github.com/godotengine/godot/issues/23069>`__ на графічних драйверах Intel під Windows. Оновлення графічного драйвера *наданого Intel* до останньої версії має вирішити проблему.
zh_cn: 这是一个 Windows 上 Intel 显卡驱动的\ `已知问题 <https://github.com/godotengine/godot/issues/23069>`_\ 。更新到 *Intel 提供的*\ 最新版本的显卡驱动应该能够修复这个问题。
zh_tw: 這個問題是 Windows 上 Intel 圖形驅動程式的 `已知 Bug <https://github.com/godotengine/godot/issues/23069>`__ 。請將顯示卡驅動程式的版本更新到 **Intel 提供的** 最新版本，應該就能解決。

source: You should use the graphics driver provided by Intel rather than the one provided by your desktop or laptop's manufacturer because their version is often outdated.
cs: Měli byste použít grafický ovladač dodaný společností Intel, místo ovladače od dodavatele vašeho stolního počítače nebo notebooku, protože jejich verze je často zastaralá.
de: Sie sollten die Grafiktreiber benutzen, die von Intel zur Verfügung gestellt werden, da die Treiber, die von Ihren Desktop oder Laptop Herstellern mitgeliefert werden, meistens veraltet sind.
es: Deberías utilizar el driver de gráficos proporcionado por Intel en lugar del proporcionado por el fabricante de tu ordenador de escritorio o portátil porque la versión del fabricante suele estar desfasada.
fi: Sinun tulisi käyttää Intelin tarjoamia näytönohjainajureita työpöytäsi tai kannettavan tietokoneesi valmistajan tarjoamien ajureiden sijaan, koska ne ovat usein tuoreammat.
fr: Vous devriez utiliser le pilote graphique fourni par Intel plutôt que celui fourni par le fabricant de votre ordinateur de bureau ou de votre ordinateur portable, car leur version est souvent dépassée.
it: Dovresti utilizzare il driver grafico fornito da Intel anziché quello fornito dal produttore del desktop o del laptop perché la loro versione è spesso obsoleta.
ja: デスクトップやラップトップのメーカーが提供しているものは古い場合がよくあるので、代わりにインテルが提供しているグラフィックドライバーを使用してください。
ko: 데스크톱 또는 랩톱 제조업체에서 제공하는 그래픽 드라이버가 종종 오래되었기 때문에 인텔에서 제공하는 그래픽 드라이버를 사용해야합니다.
pl: Powinieneś używać sterownikó graficznych dostarczonych przez firmę Intel, a nie tegych dostarczonych przez producenta komputera stacjonarnego lub laptopa, ponieważ ich wersja jest często nieaktualna.
pt_br: Você deve usar os drivers gráficos fornecidos pela Intel ao invés do entregue pela fabricante do seu desktop ou laptop porque geralmente este está desatualizado.
ru: Используйте графический драйвер от компании Intel вместо того, что поставляется изготовителем вашего ПК или ноутбука. Зачастую это объясняется устаревшей версией заводских настроек.
uk: Вам варто використовувати графічний драйвер, що надається компанією Intel, а не той, який надає виробник комп'ютера, чи ноутбука, оскільки їх версія часто застаріла.
zh_cn: 你应该使用 Intel 提供的显卡驱动而非你的笔记本生产厂商提供的，因为他们的驱动版本经常是过期了的。
zh_tw: 請使用由 Intel 提供的顯示卡驅動程式，而不要使用主機或筆電製造商提供的程式，因為通常版本都很舊。

source: The grid disappears and meshes turn black when I rotate the 3D camera in the editor.
cs: Mřížka zmizí a oka zčernají, když otočím 3D kameru v editoru.
de: Das Gitter verschwindet und die Meshes werden schwarz, sobald Ich die 3D Kamera im Editor rotiere.
es: La rejilla desaparece y las mallas se vuelven negras cuando giro la cámara 3D en el editor.
fr: La grille disparaît et les maillages deviennent noires quand je fais tourner la caméra 3D dans l'éditeur.
it: La griglia scompare e le mesh diventano nere quando ruoto la telecamera 3D nell'editor.
ja: エディタ上で3Dカメラを回転させるとグリッドが消えてメッシュが黒くなる。
pl: Kiedy obracam kamerę 3D w edytorze, siatka koordynująca znika, a siatka obiektu 3D staje się czarna.
pt_br: A grade desaparece e as malhas ficam pretas quando eu rotaciono a câmera 3D no editor.
ru: Координатная сетка исчезает, а полисетки темнеют, когда я изменяю ракурс 3D-камеры в редакторе.
uk: Координатна сітка зникає, а полісіткм темніють, коли я змінюю ракурс 3D-камери в редакторі.
zh_cn: 当我在编辑器中旋转 3D 相机时，栅格消失了，网格也变黑了。
zh_tw: 在編輯器中旋轉 3D 相機時，柵欄不見了，網格也變成了全黑。

source: This is a `known bug <https://github.com/godotengine/godot/issues/30330>`__ on Intel graphics drivers on Windows.
cs: Toto je `známá chyba <https://github.com/godotengine/godot/issues/30330>`_ v grafických ovladačích Intel pro Windows.
de: Dies ist ein `bekannter Fehler <https://github.com/godotengine/godot/issues/30330>`__ von Intel Grafiktreibern unter Windows.
es: Este es un `conocido error <https://github.com/godotengine/godot/issues/30330>` en los controladores de gráficos Intel en Windows.
fi: Tämä on `tuttu vika <https://github.com/godotengine/godot/issues/30330>`__ Intelin grafiikkaohjaimissa Windowsissa.
fr: Il s'agit d'un `bug connu <https://github.com/godotengine/godot/issues/30330>`__ sur les pilotes graphiques Intel sous Windows.
it: Questo è un `bug noto <https://github.com/godotengine/godot/issues/30330>` __ dei driver grafici Intel su Windows.
ja: これは、Windows上のIntelグラフィックスドライバにおける\ `既知のバグ <https://github.com/godotengine/godot/issues/30330>`__\ です。
ko: 이는 Windows에서 발생하는 Intel 그래픽 드라이버의 `알려진 버그 <https://github.com/godotengine/godot/issues/30330>`__\ 입니다.
pl: To jest `znany błąd <https://github.com/godotengine/godot/issues/30330>`__ w sterownikach grafiki Intel w systemie Windows.
pt_br: Este é um `bug conhecido <https://github.com/godotengine/godot/issues/30330>`__ em drivers gráficos da Intel no Windows.
ru: Это `распространённая ошибка <https://github.com/godotengine/godot/issues/30330>`__ графических драйверов Intel на Windows.
uk: Це `відома помилка <https://github.com/godotengine/godot/issues/30330>`__ графічних драйверів Intel під Windows.
zh_cn: 这是一个 Windows 上 Intel 显卡驱动的\ `已知问题 <https://github.com/godotengine/godot/issues/30330>`_\ 。
zh_tw: 這是 Windows 上 Intel 圖形顯示卡的一個 `已知 Bug <https://github.com/godotengine/godot/issues/30330>`__ 。

source: The only workaround, for now, is to switch to the GLES2 renderer. You can switch the renderer in the top-right corner of the editor or the Project Settings.
cs: Jediným řešením je prozatím přepnout na vykreslovač GLES2. Vykreslovací modul můžete přepnout v pravém horním rohu editoru nebo v nastavení projektu.
de: Bisher ist die einzige Abhilfe, zum GLES2 Renderer zu wechseln. Sie können den Renderer in der oberen rechten Ecke des Editors oder in den Projekteinstellungen wechseln.
es: La única solución, por ahora, es cambiar al renderizador GLES2. Puedes cambiar el renderizador en la esquina superior derecha del editor o en Configuración del Proyecto.
fi: Tällä hetkellä ainoa kiertotie on vaihtaa GLES2 renderöijään. Voit vaihtaa renderöijää editorin yläoikeasta kulmasta tai projektin asetuksista.
fr: La seule solution, pour l'instant, est de passer au moteur de rendu GLES2. Vous pouvez changer de moteur de rendu dans le coin supérieur droit de l'éditeur ou dans les paramètres du projet.
it: L'unica soluzione, per ora, è passare al renderer GLES2. Puoi cambiare il renderer nell'angolo in alto a destra dell'editor o nelle Impostazioni del progetto.
ja: 唯一の回避策は、今のところGLES2レンダラに切り替えることのみです。レンダラーの切り替えは、エディタの右上かプロジェクト設定から行えます。
ko: 현재로서는 GLES2 렌더러로 전환하는 것이 유일한 해결 방법입니다. 에디터의 오른쪽 위 구석 또는 프로젝트 설정에서 렌더러를 변경할 수 있습니다.
pl: Na razie jedynym obejściem jest przejście na renderer GLES2. Możesz przełączyć renderer w prawym górnym rogu edytora lub w ustawieniach projektu.
pt_br: A única solução, por enquanto, é mudar para o renderizador GLES2. Você pode alternar o renderizador no canto superior direito do editor ou nas Configurações do Projeto.
ru: Пока что, единственный обходной путь — это переключиться на GLES2 рендерер. Переключатель находится в верхнем правом углу редактора, или же в Настройках проекта.
uk: На даний момент єдиним обхідним шляхом є перехід на візуалізатор (рендер) GLES2. Ви можете змінити його у верхньому правому куті редактора, або в Налаштуваннях проєкту.
zh_cn: 目前唯一的解决办法是切换到 GLES2 渲染器。你可以在编辑器的右上角或者项目设置中切换。
zh_tw: 目前唯一的臨時解決方案，就只有將算繪引擎改成 GLES2。可以從編輯器的右上角切換算繪引擎，或是在 [專案設定] 中更改。

source: If you use a computer allowing you to switch your graphics card, like NVIDIA Optimus, you can use the dedicated graphics card to run Godot.
cs: Pokud používáte počítač, který vám umožňuje přepínat grafickou kartu, například NVIDIA Optimus, můžete ke spuštění Godotu použít vyhrazenou grafickou kartu.
de: Falls Sie einen Computer benutzen, der Ihnen das Wechseln Ihrer Grafikkarte ermöglicht, wie zum Beispiel NVIDIA Optimus, können Sie die dedizierte Grafikkarte verwenden, um Godot auszuführen.
es: Si tú ordenador permite intercambiar entre tarjetas gráficas, como NVIDIA Optimus, puedes usar una tarjeta gráfica dedicada para ejecutar Godot.
fi: Jos käytät tietokonetta, jossa voit vaihtaa näytönohjaimen, kuten NVIDIA Optimus, voit käyttää Godotia erillisellä näytönohjaimella.
fr: Si vous utilisez un ordinateur vous permettant de changer de carte graphique, comme NVIDIA Optimus, vous pouvez utiliser la carte graphique dédiée pour faire tourner Godot.
it: Se utilizzi un computer che ti consente di cambiare scheda grafica, come NVIDIA Optimus, puoi utilizzare la scheda grafica dedicata per eseguire Godot.
ja: もしNVIDIA Optimusのようにグラフィックカードの切り替えが可能なコンピュータであれば、専用グラフィックカードを使ってGodotを実行することができます。
ko: NVIDIA Optimus와 같이 그래픽 카드를 변경할 수 있는 컴퓨터를 사용하는 경우 전용 그래픽 카드로 Godot를 실행할 수 있습니다.
pl: Jeśli używasz komputera umożliwiającego zmianę karty graficznej, takiego jak NVIDIA Optimus, możesz użyć dedykowanej karty graficznej do uruchomienia Godota.
pt_br: Se você usa um computador que permite trocar sua placa gráfica, como o NVIDIA Optimus, pode usar a placa gráfica dedicada para executar o Godot.
ru: Если вы используете компьютер с возможностью переключения на другую видеокарту, например используя NVIDIA Optimus — вы можете выделить отдельную видеокарту для работы в Godot.
uk: Якщо ви використовуєте комп’ютер, що дозволяє переключити вашу графічну карту, наприклад NVIDIA Optimus, ви можете використовувати спеціальну відеокарту для роботи Godot.
zh_cn: 如果你使用的电脑支持切换显卡，比如 NVIDIA Optimus，你可以使用独立显卡运行 Godot。
zh_tw: 如果使用的電腦允許切換顯示卡，如 NVIDIA Optimus，則可以使用合適的顯示卡來執行 Godot。

source: The editor or project takes a very long time to start.
cs: Spuštění editoru nebo projektu trvá velmi dlouho.
de: Der Editor oder das Projekt benötigt sehr lange um zu starten.
es: El editor o el proyecto tarda mucho tiempo en arrancar.
fr: L'éditeur ou le projet prend beaucoup de temps à démarrer.
it: L'avvio dell'editor o del progetto richiede molto tempo.
ja: エディタやプロジェクトの開始に非常に時間がかかる。
pl: Uruchomienie edytora lub projektu zajmuje bardzo dużo czasu.
pt_br: O editor ou projeto leva muito tempo para iniciar.
ru: Длительный запуск редактора или проекта.
uk: Редактор або проєкт довго запускається.
zh_cn: 此编辑器或项目花了很长时间才启动。
zh_tw: 編輯器或專案花了很多時間才打開。

source: This is a `known bug <https://github.com/godotengine/godot/issues/20566>`__ on Windows when you have specific USB peripherals connected. In particular, Corsair's iCUE software seems to cause the bug. Try updating your USB peripherals' drivers to their latest version. If the bug persists, you need to disconnect the faulty peripherals before opening the editor. You can then connect the peripheral again.
cs: Toto je `známá chyba <https://github.com/godotengine/godot/issues/20566>`__ v systému Windows, pokud máte připojena konkrétní periferní zařízení USB. Zdá se, že chybu způsobil zejména software iCUE společnosti Corsair. Zkuste aktualizovat ovladače periferních zařízení USB na nejnovější verzi. Pokud chyba přetrvává, musíte před otevřením editoru odpojit vadné periferie. Potom můžete periferní zařízení znovu připojit.
de: Dies ist ein `bekannter Fehler <https://github.com/godotengine/godot/issues/20566>`__ unter Windows wenn Sie bestimmte USB-Peripheriegeräte angeschlossen haben. Insbesondere die iCUE-Software von Corsair scheint den Fehler zu verursachen. Aktualisieren Sie die Treiber Ihrer USB-Peripheriegeräte auf die neueste Version. Wenn der Fehler weiterhin besteht, müssen Sie die fehlerhaften Peripheriegeräte trennen, bevor Sie den Editor öffnen. Sie können das Peripheriegerät danach wieder anschließen.
es: Este es un `error conocido <https://github.com/godotengine/godot/issues/20566>` en Windows cuando se tienen conectados periféricos USB específicos. En particular, el software iCUE de Corsair parece ser el causante del fallo. Intenta actualizar los controladores de tus periféricos USB a su última versión. Si el error persiste, debes desconectar los periféricos defectuosos antes de abrir el editor. A continuación, puedes volver a conectar el periférico.
fi: Tämä on `tuttu vika <https://github.com/godotengine/godot/issues/20566>`__ Windowsissa, kun on liitetty tiettyjä USB-lisälaitteita. Erityisesti Corsair'in iCUE-ohjelmisto näyttää aiheuttavan vian. Kokeile päivittää USB-lisälaitteiden' ajurit niiden uusimpaan versioon. Jos vika jatkuu, sinun on irrotettava vialliset oheislaitteet ennen editorin avaamista. Sen jälkeen voit liittää oheislaitteet uudelleen.
fr: Il s'agit d'un `bug connu <https://github.com/godotengine/godot/issues/20566>`__ sur Windows lorsque vous avez des périphériques USB spécifiques connectés. En particulier, le logiciel iCUE de Corsair semble être à l'origine du bug. Essayez de mettre à jour les pilotes de vos périphériques USB avec leur dernière version. Si le bogue persiste, vous devez déconnecter les périphériques défectueux avant d'ouvrir l'éditeur. Vous pouvez ensuite reconnecter le périphérique.
it: Questo è un `bug noto <https://github.com/godotengine/godot/issues/20566>` __ su Windows quando sono collegate periferiche USB specifiche. In particolare, il software iCUE di Corsair sembra causare il bug. Prova ad aggiornare i driver delle tue periferiche USB alla versione più recente. Se il bug persiste, devi scollegare le periferiche difettose prima di aprire l'editor. È quindi possibile collegare nuovamente le periferiche.
ja: これはWindows上において、特定のUSB周辺機器を接続している場合に発生する\ `既知のバグ <https://github.com/godotengine/godot/issues/20566>`__\ です。特に、Corsair の iCUE ソフトウェアがこのバグの原因となっているようです。USB周辺機器のドライバを最新バージョンにアップデートしてみてください。バグが続く場合は、エディタを開く前に問題のある周辺機器を切断する必要があります。その後、再度周辺機器を接続してください。
ko: 이는 특정 USB 주변 장치가 연결되어 있을 때 Windows에서 발생하는 '알려진 버그 <https://github.com/godotengine/godot/issues/20566>'__\ 입니다. 특히, Corsair의 iCUE 소프트웨어가 버그를 일으키는 것 같습니다. USB 주변 기기의 드라이버를 최신 버전으로 업데이트해 보세요. 버그가 지속되면 에디터를 열기 전에 결함이 있는 주변 장치를 분리해야 합니다. 그런 다음 주변 장치를 다시 연결할 수 있습니다.
pl: Jest to `` znany błąd <https://github.com/godotengine/godot/issues/20566> `__ w systemie Windows, gdy masz podłączone określone urządzenia peryferyjne USB. W szczególności oprogramowanie Corsair iCUE wydaje się powodować błąd. Spróbuj zaktualizować sterowniki urządzeń peryferyjnych USB do ich najnowszej wersji. Jeśli błąd będzie się powtarzał, musisz odłączyć wadliwe urządzenia peryferyjne przed otwarciem edytora. Następnie możesz ponownie podłączyć urządzenie peryferyjne.
pt_br: Esse é um `bug conhecido <https://github.com/godotengine/godot/issues/20566>`__ no Windows quando você tem periféricos USB específicos conectados. Em particular, o software iCUE da Corsair parece causar o bug. Tente atualizar os drivers dos seus periféricos USB para a última versão. Se o bug persistir, você precisa desconectar os periféricos com defeito antes de abrir o editor. Após isso, você pode conectá-lo novamente.
ru: Это `распространённая ошибка <https://github.com/godotengine/godot/issues/20566>`__ на Windows, которая возникает из-за специфических USB периферийных устройств. В частности, ошибку вызывает программное обеспечение Corsair iCUE. Попробуйте обновить драйверы подобных устройств до последней версии. Если ошибка не исчезнет, вам придётся извлечь это устройство перед запуском редактора, после чего подключить вновь.
uk: Це `відома помилка <https://github.com/godotengine/godot/issues/20566>`__ на Windows при підключених певних периферійних пристроях USB. Зокрема, програмне забезпечення iCUE Corsair, може спричиняти помилку. Спробуйте оновити драйвери периферійних пристроїв USB до останньої версії. Якщо помилка не зникає, вам потрібно відключити несправну периферію, перш ніж відкривати редактор. Потім можна знову підключити периферійний пристрій.
zh_cn: 当您连接了特定的 USB 外设时，这是 Windows 上的一个\ `已知错误 <https://github.com/godotengine/godot/issues/20566>`_\ 。特别是，海盗船的 iCUE 软件似乎引起了该错误。尝试将 USB 外设的驱动程序更新为最新版本。如果错误仍然存在，则需要在打开编辑器之前断开故障外围设备的连接。然后，您可以再次连接外围设备。
zh_tw: 這是在 Windows 上的一個 `已知 Bug <https://github.com/godotengine/godot/issues/20566>`__ ，會發生在有連接到特定 USB 週邊設備時。特別是 Corsair 的 iCUE 軟體似乎會導致這個問題。請試著更新這些 USB 週邊設備的驅動程式至最新版本。若仍然遇到此 Bug，則必須在開啟編輯器時先斷開有問題的週邊設備。開啟後即可重新接上。
