Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/about/troubleshooting.po
Languages: cs, de, es, fi, fr, it, ja, ko, pl, pt_br, ru, uk, zh_cn, zh_tw

source: To resolve this, open **Project > Project Settings** and enable **Display > Window > Dpi > Allow Hidpi**. On top of that, make sure your project is configured to support :ref:`multiple resolutions <doc_multiple_resolutions>`.
cs: Chcete-li to vyřešit, otevřete **Project> Project Settings** and enable **Display> Window> Dpi> Allow Hidpi**. Kromě toho se ujistěte, že je váš projekt nakonfigurován tak, aby podporoval :ref:`multiple resolutions <doc_multiple_resolutions>`.
de: Öffnen Sie um dies zu beheben **Projekt > Projekt Einstellungen** und aktivieren Sie **Display > Window > DPI > Allow hidpi**. Vergewissern Sie sich ausserdem, dass die Konfiguration Ihres Projektes :ref:`mehrere Auflösungen <doc_multiple_resolutions>` unterstützt.
es: Para resolver esto, abre **Proyecto > Configuración del Proyecto** y habilita **Mostrar > Ventana > Dpi > Permitir Hidpi**. Además, asegúrate de que tu proyecto esté configurado para soportar :ref:`multiple resolutions <doc_multiple_resolutions>`.
fi: Voit ratkaista tämän avaamalla **Projekti > Projektin asetukset** ja ottamalla käyttöön **Näyttö > Ikkuna > Dpi > Salli Hidpi**. Varmista lisäksi, että projektisi on määritetty tukemaan :ref:`monen resoluutio <doc_multiple_resolutions>`.
fr: Pour résoudre ce problème, ouvrez **Projet > Paramètres du projet** et activez **Display > Window > Dpi > Allow Hidpi**. En plus de cela, assurez-vous que votre projet est configuré pour supporter :ref:`multiple résolutions <doc_multiple_resolutions>`.
it: Per risolvere questo problema, apri ** Progetto> Impostazioni progetto ** e abilita ** Visualizza> Finestra> Dpi> Consenti Hidpi **. Inoltre, assicurati che il tuo progetto sia configurato per supportare :ref:`multiple resolution <doc_multiple_resolutions>`.
ja: これを解決するには、\ **プロジェクト > プロジェクト設定**\ を開き、\ **Display > Window > Dpi > Allow Hidpi**\ を有効にします。さらに、プロジェクトが\ :ref:`複数の解像度 <doc_multiple_resolutions>`\ に対応するように設定されていることを確認してください。
ko: 이 문제를 해결하려면 **프로젝트(Project) > 프로젝트 설정(Project Settings)**\ 을 열고 **Display > Window > Dpi > Allow Hidpi**\ 를 활성화합니다. 그 전에, 프로젝트가 :ref:`multiple resolutions <doc_multiple_resolutions>`\ 를 지원하도록 설정되어 있는지 확인하세요.
pl: Aby rozwiązać ten problem, otwórz ** Projekt> Ustawienia projektu ** i włącz ** Wyświetlacz> Okno> Dpi> Zezwalaj na Hidpi **. Ponadto upewnij się, że Twój projekt jest skonfigurowany do obsługi: ref: `wiele rozdzielczości <doc_multiple_resolutions>`.
pt_br: Para resolver isso, abra **Projeto > Configurações do Projeto** e ative **Exibição > Janela > Dpi > Permitir Hidpi**. Além disso, verifique se o seu projeto está configurado para suportar :ref:`múltiplas resoluções <doc_multiple_resolutions>`.
ru: Для решения, откройте *Проект > Настройки проекта* и включите опцию **Display > Window > Dpi > Allow Hidpi**. Кроме того, убедитесь, что ваш проект настроен на поддержку :ref:`нескольких разрешений <doc_multiple_resolutions>`.
uk: Для вирішення відкрийте **Проєкт > Параметри проєкта** і позначте опцію **Display > Window > Dpi > Allow Hidpi**. Крім цього переконайтеся, що ваш проєкт налаштований на підтрмку :ref:`декількох розширень <doc_multiple_resolutions>`.
zh_cn: 要解决此问题，请打开\ **项目 > 项目设置**\ 然后启用 **显示 > 窗口 > DPI > 允许 hiDPI**\ 。此外，请确保你的项目已经配置为支持\ :ref:`多分辨率 <doc_multiple_resolutions>`\ 。
zh_tw: 要解決此問題，請開啟 **[專案] > [專案設定]** 並啟用 **[Display] > [Window] > [Dpi] > [Allow Hidpi]** 。除此之外，請確保專案有設定好 :ref:`多解析度 <doc_multiple_resolutions>` 支援。

source: The project window doesn't appear centered when I run the project.
cs: Když spustím projekt, okno projektu se neobjeví na středu.
de: Das Projektfenster erscheint nicht zentriert, wenn Ich das Projekt ausführe.
es: La ventana del proyecto no aparece centrada cuando ejecuto el proyecto.
fr: La fenêtre du projet n'apparaît pas centrée lorsque j'éxécute le projet.
it: La finestra del progetto non appare centrata quando eseguo il progetto.
ja: プロジェクトを実行してもプロジェクトウィンドウが中央に表示されない。
pl: Okno projektu nie jest wycentrowane, kiedy uruchamiam projekt.
pt_br: A janela do projeto não aparece centralizada quando eu executo o projeto.
ru: Когда я запускаю проект, окно проекта не отображается по центру.
uk: При запуску вікно проєкта не відображається по центрі.
zh_cn: 运行项目时项目窗口没有居中显示。
zh_tw: 執行專案時，專案視窗沒有顯示在正中間。

source: This is a `known bug <https://github.com/godotengine/godot/issues/13017>`__. To resolve this, open **Project > Project Settings** and enable **Display > Window > Dpi > Allow Hidpi**. On top of that, make sure your project is configured to support :ref:`multiple resolutions <doc_multiple_resolutions>`.
cs: Toto je `známá chyba <https://github.com/godotengine/godot/issues/13017>`__. Chcete-li to vyřešit, otevřete **Project > Project Settings** and enable **Display > Window > Dpi > Allow Hidpi**. Kromě toho se ujistěte, že je váš projekt nakonfigurován tak, aby podporoval :ref:`multiple resolutions <doc_multiple_resolutions>`.
de: Dies ist ein `bekannter Fehler <https://github.com/godotengine/godot/issues/13017>`__. Um dies zu beheben, öffnen Sie **Projekt> Projekteinstellungen** und aktivieren Sie **Anzeige> Fenster> Dpi> Hidpi zulassen**. Stellen Sie außerdem sicher Ihr Projekt so zu konfigurieren, dass es :ref:`mehrere Auflösungen <doc_multiple_resolutions>` unterstützt.
es: Este es un "error conocido" <https://github.com/godotengine/godot/issues/13017>`__. Para resolverlo, abre **Proyecto > Configuración del Proyecto** y habilita **Mostrar > Ventana > Dpi > Permitir Hidpi**. Además, asegúrate de que tu proyecto esté configurado para soportar :ref:`multiple resolutions <doc_multiple_resolutions>`.
fi: Tämä on `tuttu virhe <https://github.com/godotengine/godot/issues/13017>`__. Voit ratkaista tämän avaamalla **Projekti > Projektin asetukset** ja ottamalla käyttöön **Näyttö > Ikkuna > Dpi > Salli Hidpi**. Varmista lisäksi, että projektisi on määritetty tukemaan :ref:`monen resoluutio <doc_multiple_resolutions>`.
fr: Il s'agit d'un `bug connu <https://github.com/godotengine/godot/issues/13017>`__. Pour résoudre ce problème, ouvrez **Projet > Paramètres du projet** et activez **Display > Window > Dpi > Allow Hidpi**. En plus de cela, assurez-vous que votre projet est configuré pour supporter :ref:`multiple résolutions <doc_multiple_resolutions>`.
it: Questo è un `bug noto <https://github.com/godotengine/godot/issues/13017>` __. Per risolvere questo problema, apri ** Progetto> Impostazioni progetto ** e abilita ** Visualizza> Finestra> Dpi> Consenti Hidpi **. Inoltre, assicurati che il tuo progetto sia configurato per supportare :ref:`multiple resolution <doc_multiple_resolutions>`.
ja: これは\ `既知のバグ <https://github.com/godotengine/godot/issues/13017>`__\ です。これを解決するには、\ **プロジェクト > プロジェクト設定**\ を開き、\ **Display > Window > Dpi > Allow Hidpi**\ を有効にしてください。さらに、プロジェクトが\ :ref:`複数の解像度 <doc_multiple_resolutions>`\ に対応するように設定されていることを確認してください。
ko: 이는 `알려진 오류 <https://github.com/godotengine/godot/issues/13017>`__\ 입니다. 해결하려면 **프로젝트(Project) > 프로젝트 설정(Project Settings)**\ 에서 **Display > Window > Dpi > Allow Hidpi**\ 를 활성화하세요. 그 전에, 프로젝트가 :ref:`multiple resolutions <doc_multiple_resolutions>`\ 을 지원하도록 설정되어 있어야 합니다.
pl: To jest `znany błąd <https://github.com/godotengine/godot/issues/13017>`__. By go rozwiązać, otwórz **Projekt > Ustawienia projektu** i włącz **Display > Window > Dpi > Allow Hidpi**. Dodatkowo, upewnij się, że twój projekt jest skonfigurowany by wspierać :ref:`wiele rozdzielczości <doc_multiple_resolutions>`.
pt_br: Este é um `bug conhecido <https://github.com/godotengine/godot/issues/13017>`__. Para resolvê-lo, Abra **Projeto > Configurações do Projeto** e ative **Exibição > Janela > Dpi > Permitir Hidpi**. Além disso, verifique se o seu projeto está configurado para suportar :ref:`múltiplas resoluções <doc_multiple_resolutions>`.
ru: Это `распространённая ошибка <https://github.com/godotengine/godot/issues/13017>`__. Для её решения откройте **Проект > Настройки проекта** и включите опцию **Display > Window > Dpi > Allow Hidpi**. Кроме того, убедитесь, что ваш проект настроен на поддержку :ref:`нескольких разрешений <doc_multiple_resolutions>`.
uk: Це `відома помилка <https://github.com/godotengine/godot/issues/13017>`__. Для вирішення відкрийте **Проєкт > параметри проєкта** і позначте опцію **Display > Window > Dpi > Allow Hidpi**. А також переконайтеся, що ваш проєкт налаштований на підтримку :ref:`декількох розширень <doc_multiple_resolutions>`.
zh_cn: 这是一个\ `已知问题 <https://github.com/godotengine/godot/issues/13017>`_\ 。解决方法是打开\ **项目 > 项目设置**\ 并开启 **显示 > 窗口 > DPI > 允许 hiDPI**\ 。此外，请确保你的项目已经配置为支持\ :ref:`多分辨率 <doc_multiple_resolutions>`\ 。
zh_tw: 這是一個 `已知的 Bug <https://github.com/godotengine/godot/issues/13017>`__ 。要解決此問題，請開啟 **[專案] > [專案設定]** 並啟用 **[Display] > [Window] > [Dpi] > [Allow Hidpi]** 。除此之外，請確保專案有設定好 :ref:`多解析度 <doc_multiple_resolutions>` 支援。

source: The project works when run from the editor, but fails to load some files when running from an exported copy.
cs: Projekt funguje při spuštění z editoru, ale při spuštění z exportované kopie se mu nepodaří načíst některé soubory.
de: Das Projekt funktioniert, wenn es vom Editor ausgeführt wird, aber scheitert beim Laden einiger Dateien, falls es von einer exportierten Kopie läuft.
es: El proyecto funciona cuando se ejecuta desde el editor, pero falla al cargar algunos archivos cuando se ejecuta desde una copia exportada.
fr: Le projet fonctionne lorsqu'il est exécuté à partir de l'éditeur, mais ne parvient pas à charger certains fichiers lorsqu'il est exécuté à partir d'une copie exportée.
it: Il progetto funziona quando viene eseguito dall'editor, ma non riesce a caricare alcuni file quando viene eseguito da una copia esportata.
ja: エディタから実行するとプロジェクトは動作するが、エクスポートしたコピーから実行するといくつかのファイルの読み込みに失敗する。
pl: Projekt działa poprawnie uruchomiony przez edytor, jednak nie ładuje niektórych plików gdy jest uruchomiony z wyeksportowanej kopii.
pt_br: O projeto funciona quando executado a partir do editor, mas falha ao carregar alguns arquivos ao executar a partir de uma cópia exportada.
ru: Проект работает при запуске из редактора, но не может загрузить некоторые файлы при запуске из экспортированной копии.
uk: Проєкт працює при запуску з редактора, але не вдається завантажити деякі файли при запуску з експортованої копії.
zh_cn: 项目在编辑器中正常运行，但在导出后无法加载部分文件。
zh_tw: 專案可以從編輯器裡執行，但是從匯出的版本執行時無法載入某些檔案。

source: This is usually caused by forgetting to specify a filter for non-resource files in the Export dialog. By default, Godot will only include actual *resources* into the PCK file. Some files commonly used, such as JSON files, are not considered resources. For example, if you load ``test.json`` in the exported project, you need to specify ``*.json`` in the non-resource export filter. See :ref:`doc_exporting_projects_export_mode` for more information.
cs: To je obvykle způsobeno opomenutím určit filtr souborů, které nejsou zdroji, v dialogovém okně Export. Ve výchozím nastavení Godot zahrne do souboru PCK pouze skutečné *zdroje* . Některé soubory, které se běžně používají, například soubory JSON, se za zdroje nepovažují. Například pokud načítáte soubor ``test.json`` v exportovaném projektu, musíte ve filtru exportu souborů nepovažovaných za zdroje, zadat ``* .json``. Viz :ref:`doc_exporting_projects_export_mode` pro více informací.
de: Dies wird normalerweise dadurch verursacht, dass vergessen wird im Dialogfeld "Exportieren" einen Filter für Nicht-Ressourcendateien anzugeben. Standardmäßig nimmt Godot nur tatsächliche *Ressourcen* in die PCK-Datei auf. Einige häufig verwendete Dateien, z.B. JSON-Dateien, werden nicht als Ressourcen betrachtet. Wenn Sie beispielsweise ``test.json`` in das exportierte Projekt laden, müssen Sie ``*.json`` im Nicht-Ressourcen-Exportfilter angeben. Weitere Informationen finden Sie unter :ref:`doc_exporting_projects_export_mode`.
es: Esto suele deberse a que se olvida de especificar un filtro para los archivos que no son de recursos en el cuadro de diálogo de exportación. Por defecto, Godot sólo incluirá los *recursos* reales en el archivo PCK. Algunos archivos de uso común, como los archivos JSON, no se consideran recursos. Por ejemplo, si cargas ``test.json`` en el proyecto exportado, necesitas especificar ``*.json`` en el filtro de exportación de no recursos. Vea :ref:`doc_exporting_projects_export_mode` para más información.
fi: Tämä johtuu yleensä siitä, että unohdit määrittää suodattimen muille kuin resurssitiedostoille Vienti-valintaikkunassa. Oletusarvoisesti Godot sisällyttää PCK-tiedostoon vain todelliset *resurssit*. Joitakin yleisesti käytettyjä tiedostoja, kuten JSON-tiedostoja, ei pidetä resursseina. Jos esimerkiksi lataat ``test.json`` vietyyn projektiin, sinun on määriteltävä ``*.json`` ei-resurssien vientisuodattimeen. Katso lisätietoja kohdasta :ref:`doc_exporting_projects_export_mode`.
fr: Cela est généralement dû au fait d'avoir oublié de spécifier un filtre pour les fichiers non-ressource dans la boîte de dialogue Exporter. Par défaut, Godot n'inclura que les *ressources* réelles dans le fichier PCK. Certains fichiers couramment utilisés, tels que les fichiers JSON, ne sont pas considérés comme des ressources. Par exemple, si vous chargez `test.json`` dans le projet exporté, vous devez spécifier ``*.json`` dans le filtre d'exportation des fichiers non-ressource. Voir :ref:`doc_exporting_projects_export_mode` pour plus d'informations.
it: Ciò è solitamente causato dal dimenticare di specificare un filtro per i file non di risorse nella finestra di dialogo Esporta. Per impostazione predefinita, Godot includerà solo le *risorse* effettive nel file PCK. Alcuni file comunemente utilizzati, come i file JSON, non sono considerati risorse. Ad esempio, se carichi ``test.json`` nel progetto esportato, devi specificare ``* .json`` nel filtro di esportazione non di risorse. Vedi :ref:`doc_exporting_projects_export_mode` per maggiori informazioni.
ja: これは通常、エクスポートダイアログでリソース以外のファイルのフィルタを指定するのを忘れたことが原因です。デフォルトでは、Godotは実際の *リソース* のみをPCKファイルに含めます。JSONファイルのような一般的に使われているファイルはリソースとはみなされません。例えば、\ ``test.json`` をエクスポートしたプロジェクトで読み込む場合、\ ``*.json`` をリソース以外のエクスポートフィルタに指定する必要があります。詳しくは\ :ref:`doc_exporting_projects_export_mode`\ を参照してください。
ko: 이는 '대화 상자 내보내기'(export dialog)에서 리소스 파일이 아닌 파일의 필터링을 특정하지 않아 발생하는 오류입니다. 기본적으로 Godot은 PCK 파일에 실제 *리소스*\ 만을 포함하고 있습니다. JSON 파일과 같이 일반적으로 자주 사용되는 일부 파일 형식은 리소스로 취급하지 않습니다. 예를 들어, 내보낸 프로젝트에서 ``test.json`` 파일을 불러오는 경우 비 리소스 내보내기 필터(non-resource export filter)에서 ``*.json`` 파일 형식을 특정해야 합니다. 자세한 내용은 :ref:`doc_exporting_projects_export_mode`\ 를 참고하세요.
pl: To jest zazwyczaj spowodowane nie uwzględnieniem formatu w filtrze dla plików nie będących zasobami w okienku eksportu. Domyślnie Godot dodaje do pliku PCK jedynie właściwe *zasoby*. Niektóre często używane pliki, takie jak JSON nie są uznawane za zasoby. Na przykład, jeśli załadujesz ``test.json`` w wyeksportowanym projekcie, musisz wyszczególnić ``*.json`` w filtrze plików nie będącymi zasobami. Po więcej informacji zobacz :ref:`doc_exporting_projects_export_mode`.
pt_br: Isso é geralmente causado ao esquecer de especificar um filtro para arquivos sem recursos no diálogo Exportar. Por padrão, Godot somente incluirá *recursos* presentes no arquivo PCK. Alguns arquivos comumente usados, como arquivos JSON, não são considerados recursos. Por exemplo, se você carregar ``test.json`` no projeto exportado, você precisa especificar ``*.json`` no filtro de exportação sem recursos. Veja :ref:`doc_exporting_projects_export_mode` para mais informação.
ru: Обычно это происходит из-за того, что вы забыли указать фильтр для файлов без ресурсов в диалоге экспорта. По умолчанию Godot будет включать в файл PCK только фактические *ресурсы*. Некоторые часто используемые файлы, например, файлы JSON, не считаются ресурсами. Например, если вы загружаете ``test.json`` в экспортируемый проект, вам нужно указать ``*.json`` в фильтре экспорта не-ресурсов. Дополнительную информацию смотрите в :ref:`doc_exporting_projects_export_mode`.
uk: Зазвичай таке трапляється, якщо забути вказати фільтр для нересурсних файлів у діалоговому вікні Експорт. За замовчуванням, Godot включатиме лише фактичні (актуальні) *ресурси* у файл PCK. Деякі часто використовувані файли, наприклад файли JSON, не вважаються ресурсами. Наприклад, якщо ви завантажуєте ``test.json`` в експортованому проєкті, вам потрібно вказати ``*.json`` у фільтрі експорту не-ресурсів. Дивіться :ref:`doc_exporting_projects_export_mode` для отримання додаткової інформації.
zh_cn: 这通常是在导出对话框中忘记筛选非资源文件所导致的。默认情况下，Godot只会将实际的\ *资源*\ 包含在 PCK 文件中。一些常用的文件，例如 JSON 文件，不会被视为资源。例如，当你在导出的项目中加载 ``test.json`` 时，你需要在非资源导出过滤器中指定 ``*.json``\ 。详见：\ :ref:`doc_exporting_projects_export_mode`\ 。
zh_tw: 這個問題通常時因為忘記在 [匯出] 對話框中為非資源檔案指定篩選器導致的。預設情況下，Godot 只會將真正的 **資源 (Resource)** 打包進 PCK 檔案內。有些常用的檔案，如 JSON 檔，並不屬於資源。舉例來說，若在匯出的專案中載入 ``test.json`` ，則需要在非資源匯出篩選器內指定 ``*.json`` 。更多資訊請參考 :ref:`doc_exporting_projects_export_mode` 。

source: On Windows, this can also be due to :ref:`case sensitivity <doc_project_organization_case_sensitivity>` issues. If you reference a resource in your script with a different case than on the filesystem, loading will fail once you export the project. This is because the virtual PCK filesystem is case-sensitive, while Windows's filesystem is case-insensitive by default.
cs: V systému Windows to může být také způsobeno :ref:`problémy s rozlišením malých a velkých písmen <doc_project_organization_case_sensitivity>` . Pokud ve svém skriptu uvedete odkaz na zdroj jinou velikostí písma, než je v souborovém systému, načítání se po exportu projektu nezdaří. Je tomu tak proto, že ve virtuálním souborovém systému PCK se rozlišují velká a malá písmena, zatímco v systému souborů Windows se ve výchozím nastavení velká a malá písmena nerozlišují.
de: Unter Windows kann dies auch auf :ref:`case sensitive <doc_project_organization_case_sensitivity>` Probleme zurückzuführen sein. Wenn Sie in Ihrem Skript auf eine Ressource mit einer anderen Groß-/Kleinschreibung als im Dateisystem verweisen, schlägt das Laden fehl sobald Sie das Projekt exportieren. Dies liegt daran, da das virtuelle PCK-Dateisystem zwischen Groß- und Kleinschreibung unterscheidet, während das Windows-Dateisystem standardmäßig dies nicht unterscheidet.
es: En Windows, esto también puede deberse a problemas de :ref:`sensibilidad del caso <doc_project_organization_case_sensitivity>`. Si haces referencia a un recurso en tu script con un caso diferente al del sistema de archivos, la carga fallará una vez que exportes el proyecto. Esto se debe a que el sistema de archivos virtual PCK es sensible a mayúsculas y minúsculas, mientras que el sistema de archivos de Windows no es sensible a mayúsculas y minúsculas por defecto.
fi: Windowsissa tämä voi johtua myös :ref:`case sensitivity <doc_project_organization_case_sensitivity>` -ongelmista. Jos viittaat resurssiin skriptissäsi isolla alkukirjaimella kuin tiedostojärjestelmässä, lataus epäonnistuu kun viet projektin. Tämä johtuu siitä, että virtuaalinen PCK-tiedostojärjestelmä on kirjainherkkä, kun taas Windows'n tiedostojärjestelmä ei ole oletusarvoisesti kirjainherkkä.
fr: Sous Windows, cela peut également être dû à des problèmes de :ref:`sensibilité à la casse <doc_projet_organisation_case_sensitivity>`. Si vous faites référence à une ressource dans votre script avec une casse différente de celle du système de fichiers, le chargement échouera une fois que vous aurez exporté le projet. Cela est dû au fait que le système de fichiers PCK virtuel est sensible à la casse, alors que le système de fichiers de Windows est insensible à la casse par défaut.
it: Su Windows, ciò può anche essere dovuto ai problemi di :ref:`case sensitive <doc_project_organization_case_sensitivity>` . Se si fa riferimento a una risorsa nello script con un case diverso rispetto al file system, il caricamento fallirà una volta esportato il progetto. Questo perché il filesystem PCK virtuale fa distinzione tra maiuscole e minuscole, mentre il filesystem di Windows non fa distinzione tra maiuscole e minuscole per impostazione predefinita.
ja: Windowsでは、\ :ref:`大文字小文字の区別 <doc_project_organization_case_sensitivity>`\ における問題が原因である可能性もあります。スクリプト内のリソースを、ファイルシステム上とは異なる大文字小文字で参照した場合、プロジェクトをエクスポートすると読み込みに失敗します。これは、Windows のファイルシステムがデフォルトで大文字小文字を区別しないのに対し、仮想 PCK ファイルシステムは大文字小文字を区別しているためです。
ko: Windows의 :ref:`대소 문자 구분 <doc_project_organization_case_sensitivity>` 문제 때문일 수도 있습니다. 파일 시스템과 다른 대소 문자를 사용하여 스크립트에서 리소스를 참조하는 경우 프로젝트를 내보내면 리소스 로드가 실패합니다. 가상 PCK 파일 시스템은 대소 문자를 구분하지만, Windows의 파일 시스템은 기본적으로 대소 문자를 구분하지 않기 때문입니다.
pl: Na Windowsie, to może być spowodowane przez problemy z :ref:`case sensitivity <doc_project_organization_case_sensitivity>`. Jeśli w skrypcie odniesiesz się do zasobu z inną wielkością liter niż w systemie plików, podczas eksportu projektu nie zostanie on załadowany. Dzieje się tak ponieważ wirtualny system plików PCK jest wrażliwy na wielkość liter, podczas gdy system plików Windowsa domyślnie nie zwraca na nią uwagi.
pt_br: No Windows, isso também pode ser devido a problemas de :ref:`sensibilidade de maiúsculas e minúsculas <doc_project_organization_case_sensitivity>`. Se você fizer referência a um recurso em seu script com maiúsculas e minúsculas diferentes das do sistema de arquivos, o carregamento falhará quando você exportar o projeto. Isso ocorre porque o sistema de arquivos PCK virtual diferencia maiúsculas de minúsculas, enquanto o sistema de arquivos do Windows não diferencia maiúsculas de minúsculas por padrão.
ru: На Windows, эта проблема бывает связана с :ref:`чувствительностью к регистру <doc_project_organization_case_sensitivity>`. Если вы ссылаетесь на ресурс в вашем скрипте, с отличным, от принятой в системе регистром наименований файлов — экспорт проекта проваливается. Это связано с тем, что виртуальная файловая система PCK чувствительна к регистру, тогда как файловая система Windows по умолчанию не чувствительна к нему.
uk: У Windows це може бути пов'язано з :ref:`чутливістю до регістру <doc_project_organization_case_sensibility>`. Якщо ви посилаєтесь на ресурс у своєму скрипті з іншим регістром, ніж у файловій системі, завантаження не вдасться після експорту проєкту. Це пов’язано з тим, що віртуальна файлова система PCK чутлива до регістру, тоді як файлова система Windows за замовчуванням не чутлива до нього.
zh_cn: 在 Windows 上，也可能是\ :ref:`大小写敏感性 <doc_project_organization_case_sensitivity>`\ 的问题。如果你在脚本里引用资源时所使用的大小写与文件系统中的不符，在导出项目后就会载入失败。这是因为虚拟 PCK 文件系统是大小写敏感的，而 Windows 的文件系统是大小写不敏感的。
zh_tw: 而在 Windows 上，這個問題還可能是因為 :ref:`大小寫區分 <doc_project_organization_case_sensitivity>` 問題導致的。若在腳本中以與檔案系統不同的大小寫來參照資源，則匯出專案之後就會載入失敗。這是因為虛擬 PCK 檔案系統是有區分大小寫的，而 Windows 的檔案系統則預設不區分大小寫。

source: Translation status
cs: Stav překladu
fi: Käännöksen tila
it: Stato della traduzione
ja: 翻訳ステータス
ko: 번역 상태
pt_br: Progresso da Tradução
ru: Translation status (статус перевода)
uk: Стан перекладу
zh_cn: 翻译状态
zh_tw: 翻譯狀態
