Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/editor/introduction_to_editor_development.po
Languages: de, es

source: Introduction to editor development
de: Einführung in die Editorentwicklung
es: Introducción al desarrollo del editor

source: On this page, you will learn:
de: Auf dieser Seite erfahren Sie:
es: En esta pagina aprenderás:

source: The **design decisions** behind the Godot editor.
de: Die **Designentscheidungen** hinter dem Godot-Editor.
es: Las **decisiones de diseño** detrás del editor de Godot.

source: How to work efficiently on the Godot editor's C++ code.
de: Wie man effizient am C++-Code des Godot-Editors arbeitet.
es: Cómo trabajar eficientemente en el código C++ del editor de Godot.

source: This guide is aimed at current or future engine contributors. To create editor plugins in GDScript, see :ref:`doc_making_plugins` instead.
de: Diese Anleitung richtet sich an aktuelle oder zukünftige Engine-Mitwirkende. Um Editor-Plugins in GDScript zu erstellen, siehe stattdessen :ref:`doc_making_plugins`.
es: Esta guía está dirigida a los colaboradores actuales o futuros del motor de Godot. Para crear complementos de editor en GDScript, consulta :ref:`doc_making_plugins` en su lugar.

source: If you are new to Godot, we recommended you to read :ref:`doc_godot_design_philosophy` before continuing. Since the Godot editor is a Godot project written in C++, much of the engine's philosophy applies to the editor.
de: Wenn Sie neu bei Godot sind, empfehlen wir Ihnen, :ref:`doc_godot_design_philosophy` zu lesen, bevor Sie fortfahren. Da der Godot-Editor ein in C++ geschriebenes Godot-Projekt ist, gilt ein Großteil der Philosophie der Engine auch für den Editor.
es: Si eres nuevo en Godot, te recomendamos que leas :ref:`doc_godot_design_philosophy` antes de continuar. Dado que el editor de Godot es un proyecto de Godot escrito en C++, gran parte de la filosofía del motor se aplica al editor también.

source: Technical choices
de: Technische Entscheidungen
es: Elecciones tecnicas

source: The Godot editor is drawn using Godot's renderer and :ref:`UI system <doc_user_interface>`. It does *not* rely on a toolkit such as GTK or Qt. This is similar in spirit to software like Blender. While using toolkits makes it easier to achieve a "native" appearance, they are also quite heavy and their licensing is not compatible with Godot's.
de: Der Godot-Editor wird mit Godots Renderer und dem :ref:`UI-System <doc_user_interface>` gezeichnet. Er ist *nicht* auf ein Toolkit wie GTK oder Qt angewiesen. Dies ist ähnlich wie bei Software wie Blender. Während die Verwendung von Toolkits es einfacher macht, ein "natives" Aussehen zu erreichen, sind sie auch ziemlich schwerfällig und ihre Lizenzierung ist nicht mit der von Godot kompatibel.

source: The editor is fully written in C++. It can't contain any GDScript or C# code.
de: Der Editor ist vollständig in C++ geschrieben. Er kann keinen GDScript- oder C#-Code enthalten.
es: El editor está completamente escrito en C++. No puede contener ningún código GDScript o C#.

source: Directory structure
de: Verzeichnisstruktur
es: Estructura de directorios

source: The editor's code is fully self-contained in the `editor/ <https://github.com/godotengine/godot/tree/master/editor>`__ folder of the Godot source repository.
de: Der Code des Editors liegt vollständig im Ordner `editor/ <https://github.com/godotengine/godot/tree/master/editor>`__ des Godot Quellcode-Repositorys.
es: El código del editor está completamente contenido en la carpeta `editor/ <https://github.com/godotengine/godot/tree/master/editor>`__ del repositorio de código fuente de Godot.

source: Some editor functionality is also implemented via :ref:`modules <doc_custom_modules_in_cpp>`. Some of these are only enabled in editor builds to decrease the binary size of export templates. See the `modules/ <https://github.com/godotengine/godot/tree/master/modules>`__ folder in the Godot source repository.
de: Einige Editor-Funktionen werden auch über :ref:`Module <doc_custom_modules_in_cpp>` implementiert. Einige von ihnen sind nur in Editor-Builds aktiviert, um die Binärgröße von Exportvorlagen zu verringern. Siehe den Ordner `modules/ <https://github.com/godotengine/godot/tree/master/modules>`__ im Godot Quellcode-Repository.

source: Some important files in the editor are:
de: Einige wichtige Dateien im Editor sind:
es: Algunos archivos importantes en el editor son:

source: `editor/editor_node.cpp <https://github.com/godotengine/godot/blob/master/editor/editor_node.cpp>`__: Main editor initialization file. Effectively the "main scene" of the editor.
de: `editor/editor_node.cpp <https://github.com/godotengine/godot/blob/master/editor/editor_node.cpp>`__: Die Hauptinitialisierungsdatei des Editors. Effektiv die "Hauptszene" des Editors.

source: `editor/project_manager.cpp <https://github.com/godotengine/godot/blob/master/editor/project_manager.cpp>`__: Main Project Manager initialization file. Effectively the "main scene" of the Project Manager.
de: `editor/project_manager.cpp <https://github.com/godotengine/godot/blob/master/editor/project_manager.cpp>`__: Hauptinitialisierungsdatei des Projektmanagers. Effektiv die "Hauptszene" des Projektmanagers.

source: `editor/plugins/canvas_item_editor_plugin.cpp <https://github.com/godotengine/godot/blob/master/editor/plugins/canvas_item_editor_plugin.cpp>`__: The 2D editor viewport and related functionality (toolbar at the top, editing modes, overlaid helpers/panels, …).
de: `editor/plugins/canvas_item_editor_plugin.cpp <https://github.com/godotengine/godot/blob/master/editor/plugins/canvas_item_editor_plugin.cpp>`__: Der 2D-Editor-Viewport und die zugehörige Funktionalität (Toolbar am oberen Rand, Bearbeitungsmodi, überlagerte Helfer/Panels, ...).

source: `editor/plugins/node_3d_editor_plugin.cpp <https://github.com/godotengine/godot/blob/master/editor/plugins/node_3d_editor_plugin.cpp>`__: The 3D editor viewport and related functionality (toolbar at the top, editing modes, overlaid panels, …).
de: `editor/plugins/node_3d_editor_plugin.cpp <https://github.com/godotengine/godot/blob/master/editor/plugins/node_3d_editor_plugin.cpp>`__: Der 3D-Editor-Viewport und die zugehörige Funktionalität (Toobar am oberen Rand, Bearbeitungsmodi, überlagerte Panels, ...).

source: `editor/plugins/node_3d_editor_gizmos.cpp <https://github.com/godotengine/godot/blob/master/editor/plugins/node_3d_editor_gizmos.cpp>`__: Where the 3D editor gizmos are defined and drawn. This file doesn't have a 2D counterpart as 2D gizmos are drawn by the nodes themselves.
de: `editor/plugins/node_3d_editor_gizmos.cpp <https://github.com/godotengine/godot/blob/master/editor/plugins/node_3d_editor_gizmos.cpp>`__: Hier werden die 3D-Editor-Gizmos definiert und gezeichnet. Diese Datei hat kein 2D-Gegenstück, da 2D-Gizmos von den Nodes selbst gezeichnet werden.

source: Editor dependencies in ``scene/`` files
de: Editor-Abhängigkeiten in ``scene/``-Dateien
es: Dependencias del editor en archivos de ``scene/``

source: When working on an editor feature, you may have to modify files in Godot's GUI nodes, which you can find in the ``scene/`` folder.
de: Wenn Sie an einem Editor-Feature arbeiten, müssen Sie möglicherweise Dateien in Godots GUI-Nodes ändern, die Sie im Ordner ``scene/`` finden.
es: Cuando trabajas en una función del editor, es posible que tengas que modificar archivos en los nodos de la interfaz gráfica de Godot, los cuales puedes encontrar en la carpeta ``scene/``.

source: One rule to keep in mind is that you must **not** introduce new dependencies to ``editor/`` includes in other folders such as ``scene/``. This applies even if you use ``#ifdef TOOLS_ENABLED``.
de: Eine Regel, die Sie beachten sollten, ist, dass Sie **keine** neuen Abhängigkeiten zu ``editor/``-Includes in anderen Ordnern wie ``scene/`` einführen dürfen. Dies gilt auch, wenn Sie ``#ifdef TOOLS_ENABLED`` verwenden.
es: Una regla importante a tener en cuenta es que **no** debes introducir nuevas dependencias a inclusiones de ``editor/`` en otras carpetas, como por ejemplo ``scene/``. Esto se aplica incluso si usas ``#ifdef TOOLS_ENABLED``.

source: To make the codebase easier to follow and more self-contained, the allowed dependency order is:
de: Um die Codebasis übersichtlicher und in sich geschlossener zu gestalten, ist die zulässige Reihenfolge der Abhängigkeiten:
es: Para hacer que la base de código sea más fácil de seguir y esté más autocontenido, el orden de dependencia permitido es el siguiente:

source: This means that files in ``editor/`` can depend on includes from ``scene/``, ``servers/``, and ``core/``. But, for example, while ``scene/`` can depend on includes from ``servers/`` and ``core/``, it cannot depend on includes from ``editor/``.
de: Das bedeutet, dass Dateien in ``editor/`` von Includes aus ``scene/``, ``servers/`` und ``core/`` abhängen können. Aber während zum Beispiel ``scene/`` von Includes aus ``servers/`` und ``core/`` abhängen kann, kann es nicht von Includes aus ``editor/`` abhängen.
es: Esto significa que los archivos en ``editor/`` pueden depender de inclusiones de ``scene/``, ``servers/`` y ``core/``. Pero, por ejemplo, mientras que ``scene/`` puede depender de inclusiones de ``servers/`` y ``core/``, no puede depender de inclusiones de ``editor/``.

source: Currently, there are some dependencies to ``editor/`` includes in ``scene/`` files, but `they are in the process of being removed <https://github.com/godotengine/godot/issues/53295>`__.
de: Zur Zeit gibt es einige Abhängigkeiten zu ``editor/``-Includes in ``scene/``-Dateien, aber `sie sind dabei, entfernt zu werden <https://github.com/godotengine/godot/issues/53295>`__.

source: Development tips
de: Tipps zur Entwicklung
es: Tips de desarrollo

source: To iterate quickly on the editor, we recommend to set up a test project and :ref:`open it from the command line <doc_command_line_tutorial>` after compiling the editor. This way, you don't have to go through the Project Manager every time you start Godot.
de: Um schnell mit dem Editor arbeiten zu können, empfehlen wir, ein Testprojekt zu erstellen und es nach dem Kompilieren des Editors :ref:`über die Kommandozeile zu öffnen <doc_command_line_tutorial>`. Auf diese Weise müssen Sie nicht jedes Mal, wenn Sie Godot starten, über den Projektmanager gehen.

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
