Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/io/binary_serialization_api.po
Languages: es

source: Binary serialization API
es: API de serialización Binaria

source: Introduction
es: Introducción

source: Godot has a simple serialization API based on Variant. It's used for converting data types to an array of bytes efficiently. This API is used in the functions ``get_var`` and ``store_var`` of :ref:`class_File` as well as the packet APIs for :ref:`class_PacketPeer`. This format is *not* used for binary scenes and resources.
es: Godot tiene una API de serialización simple basada en Variant. Se utiliza para convertir tipos de datos en un arreglo de bytes de manera eficiente. Esta API se utiliza en las funciones ``get_var`` y ``store_var`` de :ref:`class_File`, así como en las API de paquetes para :ref:`class_PacketPeer`. Este formato *no* se utiliza para escenas y recursos binarios.

source: Packet specification
es: Especificación de paquete

source: The packet is designed to be always padded to 4 bytes. All values are little-endian-encoded. All packets have a 4-byte header representing an integer, specifying the type of data.
es: El paquete está diseñado para que siempre tenga un relleno de 4 bytes. Todos los valores están codificados en formato little-endian. Todos los paquetes tienen una cabecera de 4 bytes que representa un entero, especificando el tipo de datos.

source: The lowest value two bytes are used to determine the type, while the highest value two bytes contain flags::
es: Los dos bytes de menor valor se utilizan para determinar el tipo, mientras que los dos bytes de mayor valor contienen flags::

source: Type
es: Tipo

source: Value
es: Valor

source: integer
es: entero

source: float
es: real

source: transform2d
es: transformación 2d

source: plane
es: plano

source: quat
es: cuat

source: basis
es: bases

source: transform
es: transformación

source: node path
es: ruta de nodo

source: rid
es: rid (Resource ID)

source: object
es: objeto

source: dictionary
es: diccionario

source: array
es: arreglo

source: raw array
es: array crudo

source: int array
es: arreglo int

source: real array
es: array real

source: string array
es: array de cadenas

source: vector2 array
es: array de vector2

source: vector3 array
es: array de vector3

source: color array
es: array de color

source: max
es: maximo

source: Following this is the actual packet contents, which varies for each type of packet. Note that this assumes Godot is compiled with single-precision floats, which is the default. If Godot was compiled with double-precision floats, the length of "Float" fields within data structures should be 8, and the offset should be ``(offset - 4) * 2 + 4``. The "float" type itself always uses double precision.
es: A continuación se encuentran los contenidos reales del paquete, los cuales varían para cada tipo de paquete. Ten en cuenta que esto asume que Godot está compilado con floats de precisión simple, que es el valor predeterminado. Si Godot se compiló con floats de precisión doble, la longitud de los campos ``Float`` dentro de las estructuras de datos debería ser de 8 y el desplazamiento debería ser ``(offset - 4) * 2 + 4``. El tipo ``float`` en sí siempre utiliza precisión doble.

source: 0: null
es: 0: nulo

source: Offset
es: Ajuste

source: Len
es: Len (longitud)

source: Description
es: Descripción

source: Integer
es: Entero

source: 0 for False, 1 for True
es: 0 para False, 1 para True

source: If no flags are set (flags == 0), the integer is sent as a 32 bit integer:
es: Si no se establecen banderas (flags == 0), el entero se envía como un entero de 32 bits:

source: 32-bit signed integer
es: Entero con signo de 32 bits

source: If flag ``ENCODE_FLAG_64`` is set (``flags & 1 == 1``), the integer is sent as a 64-bit integer:
es: Si la bandera ``ENCODE_FLAG_64`` está establecida (``flags & 1 == 1``), el entero se envía como un entero de 64 bits:

source: 64-bit signed integer
es: Entero de 64 bits con signo

source: If no flags are set (flags == 0), the float is sent as a 32 bit single precision:
es: Si no se establecen banderas (flags == 0), el flotante se envía como una precisión simple de 32 bits:

source: Float
es: Flotante

source: IEEE 754 single-precision float
es: IEEE 754 flotante de precisión simple

source: If flag ``ENCODE_FLAG_64`` is set (``flags & 1 == 1``), the float is sent as a 64-bit double precision number:
es: Si la bandera ``ENCODE_FLAG_64`` está establecida (``flags & 1 == 1``), el flotante se envía como un número de precisión doble de 64 bits:

source: IEEE 754 double-precision float
es: IEEE 754 flotante de precisión doble

source: String length (in bytes)
es: Longitud de cadenas (en bytes)

source: UTF-8 encoded string
es: Cadena codificada en UTF-8

source: This field is padded to 4 bytes.
es: Este campo se rellena hasta alcanzar 4 bytes.

source: X coordinate
es: Coordenada X

source: Y coordinate
es: Coordenada Y

source: X size
es: Tamaño en X

source: Y size
es: Tamaño en Y

source: Z coordinate
es: Coordenada Z

source: The X component of the X column vector, accessed via [0][0]
es: La componente X del vector columna X, accedido mediante [0][0]

source: The Y component of the X column vector, accessed via [0][1]
es: La componente Y del vector columna X, accedido mediante [0][1]

source: The X component of the Y column vector, accessed via [1][0]
es: La componente X del vector columna Y, accedido mediante [1][0]

source: The Y component of the Y column vector, accessed via [1][1]
es: La componente Y del vector columna Y, accedido mediante [1][1]

source: The X component of the origin vector, accessed via [2][0]
es: La componente X del vector origin, accedido mediante [2][0]

source: The Y component of the origin vector, accessed via [2][1]
es: La componente Y del vector origin, accedido mediante [2][1]

source: Normal X
es: Normal en X

source: Normal Y
es: Normal en Y

source: Normal Z
es: Normal en Z

source: Distance
es: Distancia

source: Imaginary X
es: X imaginario

source: Imaginary Y
es: Y imaginario

source: Imaginary Z
es: Z imaginario

source: Real W
es: W real

source: Z size
es: Tamaño en Z

source: The Z component of the X column vector, accessed via [0][2]
es: La componente Z del vector columna X, accedido mediante [0][2]

source: The Z component of the Y column vector, accessed via [1][2]
es: La componente Z del vector columna Y, accedido mediante [1][2]

source: The X component of the Z column vector, accessed via [2][0]
es: La componente X del vector columna Z, accedido mediante [2][0]

source: The Y component of the Z column vector, accessed via [2][1]
es: La componente Y del vector columna Z, accedido mediante [2][1]

source: The Z component of the Z column vector, accessed via [2][2]
es: La componente Z del vector columna Z, accedido mediante [2][2]

source: The X component of the origin vector, accessed via [3][0]
es: La componente X del vector origin, accedido mediante [3][0]

source: The Y component of the origin vector, accessed via [3][1]
es: La componente Y del vector origin, accedido mediante [3][1]

source: The Z component of the origin vector, accessed via [3][2]
es: La componente Z del vector origin, accedido mediante [3][2]

source: Red (typically 0..1, can be above 1 for overbright colors)
es: Rojo (generalmente en el rango de 0 a 1, pero puede ser superior a 1 para colores muy brillantes)

source: Green (typically 0..1, can be above 1 for overbright colors)
es: Verde (generalmente en el rango de 0 a 1, pero puede ser superior a 1 para colores muy brillantes)

source: Blue (typically 0..1, can be above 1 for overbright colors)
es: Azul (generalmente en el rango de 0 a 1, pero puede ser superior a 1 para colores muy brillantes)

source: String length, or new format (val&0x80000000!=0 and NameCount=val&0x7FFFFFFF)
es: Longitud de la cadena o nuevo formato (val&0x80000000!=0 y NameCount=val&0x7FFFFFFF)

source: For old format:
es: Para el viejo formato:

source: Padded to 4 bytes.
es: Rellenado a 4 bytes.

source: For new format:
es: Para el nuevo formato:

source: Sub-name count
es: conteo de sub-nombre

source: Flags (absolute: val&1 != 0 )
es: Banderas (absolute: val&1 != 0 )

source: For each Name and Sub-Name
es: Por cada Nombre y Sub-nombre

source: String length
es: Longitud de la cuerda

source: Every name string is padded to 4 bytes.
es: Cada cadena de nombres es rellenado a 4 bytes.

source: 16: :ref:`RID<class_rid>` (unsupported)
es: 16: :ref:`RID<class_rid>` (sin soporte)

source: 17: :ref:`Object<class_object>` (unsupported)
es: 17: :ref:`Object<class_object>` (sin soporte)

source: val&0x7FFFFFFF = elements, val&0x80000000 = shared (bool)
es: val&0x7FFFFFFF = elementos, val&0x80000000 = compartidos (bool)

source: Then what follows is, for amount of "elements", pairs of key and value, one after the other, using this same format.
es: A continuación, para la cantidad de "elementos", se encuentran pares de clave y valor, uno tras otro, utilizando el mismo formato.

source: Then what follows is, for amount of "elements", values one after the other, using this same format.
es: A continuación, para la cantidad de "elementos", se encuentran los valores uno tras otro, utilizando el mismo formato.

source: Array length (Bytes)
es: Longitud de array (Bytes)

source: 8..8+length
es: 8..8+longitud

source: The array data is padded to 4 bytes.
es: Los datos del array son rellenados a 4 bytes.

source: Array length (Integers)
es: longitud de array(Enteros)

source: 8..8+length\*4
es: 8..8+longitud\*4

source: Array length (Floats)
es: Longitud de array (Flotantes)

source: 32-bits IEEE 754 float
es: IEEE 754 floatntes de 32-bits

source: Array length (Strings)
es: Longitud de array (Cadenas)

source: For each String:
es: Por cada Cadena:

source: Every string is padded to 4 bytes.
es: Cada cadena es rellenada a 4 bytes.

source: Array length
es: Longitud de la matriz

source: 8..8+length\*8
es: 8..8+longitud\*8

source: 8..12+length\*8
es: 8..12+longitud\*8

source: 8..8+length\*12
es: 8..8+longitud\*12

source: 8..12+length\*12
es: 8..12+longitud\*12

source: 8..16+length\*12
es: 8..16+longitud\*12

source: 8..8+length\*16
es: 8..8+longitud\*16

source: 8..12+length\*16
es: 8..12+longitud\*16

source: 8..16+length\*16
es: 8..16+longitud\*16

source: 8..20+length\*16
es: 8..20+longitud\*16

source: Translation status
es: Estado de traducción
