Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/io/saving_games.po
Languages: es, fr, ja, pt_br, zh_cn

source: Saving games
es: Guardar partidas
fr: L'enregistrement des parties
ja: ゲームの保存
pt_br: Salvando jogos (save)
zh_cn: 保存游戏

source: Introduction
es: Introducción
ja: はじめに
pt_br: Introdução
zh_cn: 简介

source: Save games can be complicated. For example, it may be desirable to store information from multiple objects across multiple levels. Advanced save game systems should allow for additional information about an arbitrary number of objects. This will allow the save function to scale as the game grows more complex.
es: Guardar partidas puede ser complicado. Por ejemplo, puede ser necesario almacenar información de varios objetos en varios niveles. Los sistemas avanzados de guardado de partidas deberían permitir la obtención de información adicional sobre un número arbitrario de objetos. Esto permitirá que la función de guardado se amplíe a medida que el juego se vuelva más complejo.
fr: Sauvegarder peut être compliqué. Par exemple, il est probable de vouloir stocker des informations de différents objets réparti dans différents niveaux. Les systèmes avancés de sauvegarde devraient permettre de sauvegarder des informations supplémentaires sur un nombre arbitraire d'objets. Cela permet à la fonction de sauvegarde de s'adapter à l'évolution en complexité du jeu.
ja: ゲームを保存するのは複雑です。例えば、 複数のレベルにまたがった複数のオブジェクトによる情報が保存される事が望ましい場合があります。 より高度なゲームシステムのセーブでは、任意の数のオブジェクトに関する追加情報の保存ができる必要があります。 これにより、ゲームがより複雑に成長するにつれて、保存機能を拡張できます。
pt_br: Salvar jogos pode ser complicado. Por exemplo, pode ser desejável armazenar informação de vários objetos em vários níveis. Sistemas avançados de salvamento de jogos devem permitir informações adicionais sobre um número arbitrário de objetos. Isto permitirá que a função de salvamento seja escalonada à medida que o jogo se torna mais complexo.
zh_cn: 保存游戏可能很复杂。比如, 我们可能会想要储存跨多个关卡的多个物品的信息。更高级的保存游戏可能需要存储关于具有任意数量的对象的附加信息。当游戏变得更加复杂时，这将让保存函数可以随着游戏一同变得更加复杂。

source: If you're looking to save user configuration, you can use the :ref:`class_ConfigFile` class for this purpose.
es: Si quieres guardar la configuración del usuario, puedes usar la clase :ref:`class_ConfigFile` para este propósito.
fr: Si vous cherchez à sauvegarder la configuration utilisateur, vous pouvez utiliser la classe :ref:`class_ConfigFile` dans ce but.
ja: ユーザー設定を保存する場合は、この目的で :ref:`ConfigFile <class_ConfigFile>` クラスを使用できます。
pt_br: Se você procura salvar a configuração de usuário, você pode utilizar a classe :ref:`class_ConfigFile` para este propósito.
zh_cn: 如果你想保存玩家的设置, 你可以用 :ref:`class_ConfigFile` 来实现这个目的。

source: Identify persistent objects
es: Identificar objetos persistentes
fr: Identifier des objets persistants
ja: 永続オブジェクトの識別
pt_br: Identificando objetos persistentes
zh_cn: 识别持久化对象

source: Firstly, we should identify what objects we want to keep between game sessions and what information we want to keep from those objects. For this tutorial, we will use groups to mark and handle objects to be saved, but other methods are certainly possible.
es: En primer lugar, debemos identificar qué objetos queremos conservar entre las sesiones de juego y qué información queremos conservar de esos objetos. Para este tutorial, usaremos grupos para marcar y manejar los objetos a guardar, pero desde luego existen otros métodos posibles.
fr: Tout d'abord, nous devons identifier les objets que nous voulons garder entre les sessions de jeu et les informations que nous voulons garder de ces objets. Pour ce tutoriel, nous utiliserons des groupes pour marquer et manipuler les objets à sauvegarder, mais d'autres méthodes sont certainement possibles.
ja: まず、ゲームセッション間で保持するオブジェクトと、それらのオブジェクトから保持する情報を特定する必要があります。このチュートリアルでは、グループを使用して保存するオブジェクトをマークおよび処理しますが、他の方法ももちろん可能です。
pt_br: Em primeiro lugar, devemos identificar quais objetos queremos manter entre as sessões de jogo e quais informações queremos manter desses objetos. Para este tutorial, usaremos grupos para marcar e manipular objetos para serem salvos, mas outros métodos certamente são possíveis.
zh_cn: 首先，我们应该确定在游戏会话中要保存什么对象，以及我们要从这些对象中保存什么信息。本教程中，我们将使用组来标记和处理要保存的对象，但当然也有其他可行的方法。

source: We will start by adding objects we wish to save to the "Persist" group. We can do this through either the GUI or script. Let's add the relevant nodes using the GUI:
es: Comenzaremos agregando objetos que deseamos guardar al grupo "Persist". Podemos hacer esto tanto a través de la GUI como mediante scripts. Añadamos los nodos relevantes utilizando la GUI:
fr: Nous allons commencer par ajouter les objets que nous souhaitons sauvegarder au groupe "Persist". Nous pouvons le faire par le biais de l'interface graphique ou de script. Ajoutons les nœuds pertinents en utilisant l'interface graphique :
pt_br: Começaremos adicionando objetos que desejamos salvar ao grupo "Persist". Podemos fazer isto através da GUI ou do script. Vamos adicionar os nós relevantes usando a GUI:

source: Once this is done, when we need to save the game, we can get all objects to save them and then tell them all to save with this script:
es: Una vez hecho esto, cuando necesitemos guardar la partida, podemos hacer que todos los objetos se salven y luego decirles a todos que se guarden con este script:
fr: Une fois que c'est fait, quand nous avons besoin de sauvegarder le jeu, nous pouvons obtenir tous les objets pour les sauvegarder et ensuite leur dire à tous de sauvegarder avec ce script :
ja: これが完了したら、ゲームを保存する必要があるときに、このスクリプトを使用して、保存するすべてのオブジェクトを取得し、それをすべて保存するように指示できます:
pt_br: Uma vez feito isto, quando precisarmos salvar o jogo, podemos obter todos os objetos para salvá-los e, em seguida, dizer a todos para salvar com este script:
zh_cn: 完成此操作后， 在我们需要保存游戏时，我们可以获取所有对象以保存它们，然后告诉所有对象通过此脚本保存数据:

source: Serializing
es: Serialización
fr: Sérialisation
ja: シリアル化
pt_br: Serializando
zh_cn: 序列化

source: The next step is to serialize the data. This makes it much easier to read from and store to disk. In this case, we're assuming each member of group Persist is an instanced node and thus has a path. GDScript has helper functions for this, such as :ref:`to_json() <class_@GDScript_method_to_json>` and :ref:`parse_json() <class_@GDScript_method_parse_json>`, so we will use a dictionary. Our node needs to contain a save function that returns this data. The save function will look like this:
es: El siguiente paso es serializar los datos. Esto hace que sea mucho más fácil de leer y almacenar en el disco. En este caso, asumiremos que cada miembro del grupo Persist es un nodo instanciado y por lo tanto tiene una ruta. GDScript tiene funciones de ayuda para esto, como :ref:`to_json() <class_@GDScript_method_to_json>` y :ref:`parse_json() <class_@GDScript_method_parse_json>`, así que usaremos un diccionario. Nuestro nodo necesita contener una función de guardado que devuelva estos datos. La función de guardar tendrá este aspecto:
fr: L'étape suivante consiste à sérialiser les données. Cela rend la lecture et le stockage sur disque beaucoup plus faciles. Dans ce cas, nous supposons que chaque membre du groupe Persist est un nœud instancié et a donc un chemin. GDScript a des fonctions d'aide pour cela, comme :ref:`to_json() <class_@GDScript_method_to_json>` et :ref:`parse_json() <class_@GDScript_method_parse_json>`, donc nous allons utiliser un dictionnaire. Notre nœud doit contenir une fonction de sauvegarde qui renvoie ces données. La fonction de sauvegarde ressemblera à ceci :
ja: 次のステップは、データをシリアル化することです。これにより、ディスクからの読み取りとディスクへの保存がはるかに簡単になります。この場合、グループ Persist の各メンバーはインスタンス化されたノードであり、したがってパスを持っていると想定しています。GDScriptには :ref:`to_json() <class_@GDScript_method_to_json>` や :ref:`parse_json() <class_@GDScript_method_parse_json>` などのヘルパー関数があり、辞書を使用します。ノードには、このデータを返す保存関数を含める必要があります。保存機能は次のようになります:
pt_br: O próximo passo é serializar os dados. Isso torna muito mais fácil ler e armazenar em disco. Nesse caso, estamos assumindo que cada membro do grupo Persist é um nó instanciado e, portanto, tem um caminho. O GDScript tem funções auxiliares para isso, como :ref:`to_json() <class_@GDScript_method_to_json>` e :ref:`parse_json() <class_@GDScript_method_parse_json>`, então usaremos um dicionário. Nosso nó precisa conter uma função save que retorne esses dados. A função salvar ficará assim:
zh_cn: 下一步是序列化数据。 这使得从硬盘读取数据和存储数据到硬盘变得更加容易。 在这种情况下，我们假设Persist组的每个成员都是一个实例化的节点，因此它们都有一个路径。 GDScript 有相关的辅助函数，如 :ref:`to_json() <class_@GDScript_method_to_json>` 和 :ref:`parse_json() <class_@GDScript_parse_json>`，所以我们使用Dictionary来表示数据。 我们的节点需要包含一个返回Dictionary的保存函数。 保存函数看上去大概会像这样:

source: This gives us a dictionary with the style ``{ "variable_name":value_of_variable }``, which will be useful when loading.
es: Esto nos da un diccionario con el estilo ``{ "variable_name":value_of_variable }``, que nos será útil al cargar.
fr: Cela nous donne un dictionnaire avec le style ``{"nom_variable":valeur_de_variable }``, qui sera utile lors du chargement.
ja: これにより、スタイルが ``{ "variable_name":value_of_variable }`` の辞書が得られます。これはロード時に役立ちます。
pt_br: Isso nos dá um dicionário com o estilo ``{ "nome_da_variável":valor_da_variável }``, que será útil ao carregar.
zh_cn: 我们得到一个样式为 ``{ "variable_name":that_variables_value }`` 的字典，它在加载游戏数据时会被用到。

source: Saving and reading data
es: Guardar y leer datos
fr: Sauvegarde et lecture des données
ja: データの保存と読み取り
pt_br: Salvando e lendo dados
zh_cn: 保存和读取数据

source: As covered in the :ref:`doc_filesystem` tutorial, we'll need to open a file so we can write to it or read from it. Now that we have a way to call our groups and get their relevant data, let's use :ref:`to_json() <class_@GDScript_method_to_json>` to convert it into an easily stored string and store them in a file. Doing it this way ensures that each line is its own object, so we have an easy way to pull the data out of the file as well.
es: Como se explica en el tutorial de :ref:`doc_filesystem`, necesitaremos abrir un archivo para poder escribir en él o leer de él. Ahora que tenemos una forma de llamar a nuestros grupos y obtener sus datos relevantes, usemos :ref:`to_json() <class_@GDScript_method_to_json>` para convertirlo en una cadena que se pueda guardar fácilmente y almacenarla en un archivo. Haciéndolo de esta manera nos aseguramos de que cada línea sea su propio objeto, así que también tenemos una manera fácil de recuperar los datos del archivo.
fr: Comme expliqué dans le tutoriel :ref:`doc_filesystem`, nous devons ouvrir un fichier pour pouvoir y écrire ou y lire. Maintenant que nous avons un moyen d'appeler nos groupes et d'obtenir leurs données pertinentes, utilisons :ref:`to_json() <class_@GDScript_method_to_json>` pour les convertir en une chaîne facilement stockable et les stocker dans un fichier. En procédant de cette façon, on s'assure que chaque ligne est son propre objet, de sorte que nous avons un moyen facile de sortir les données du fichier également.
ja: :ref:`doc_filesystem` チュートリアルで説明したように、ファイルを開いて、書き込みまたは読み取りができるようにする必要があります。グループを呼び出して関連データを取得する方法ができたので、\ :ref:`to_json() <class_@GDScript_method_to_json>` を使用して、簡単に保存できる文字列に変換し、ファイルに保存しましょう。このようにすると、各行が独自のオブジェクトになります。そのため、ファイルからデータを簡単に引き出すことができます。
pt_br: Conforme abordado no tutorial :ref:`doc_filesystem`, precisaremos abrir um arquivo para que possamos escrever ou ler a partir dele. Agora que temos uma maneira de chamar nossos grupos e obter seus dados relevantes, vamos usar :ref:`to_json() <class_@GDScript_method_to_json>` para convertê-los em uma string facilmente armazenada e armazená-los em um arquivo. Fazer isso dessa maneira garante que cada linha seja seu próprio objeto, portanto, também temos uma maneira fácil de extrair os dados do arquivo.
zh_cn: 正如在 :ref:`doc_filesystem` 教程中所述，我们需要打开一个文件来向其中写入或读取数据。 既然我们有办法调用我们的组并获取它们的相关数据，那么就让我们使用 :ref:`to_json() <class_@GDScript_method_to_json>` 将数据转换成一个容易存储的字符串并将它存储在文件中吧。 这样做可以确保每一行都是一个完整的对象的信息，这样的话将数据从文件中提取出来也会更加容易。

source: Game saved! Loading is fairly simple as well. For that, we'll read each line, use parse_json() to read it back to a dict, and then iterate over the dict to read our values. But we'll need to first create the object and we can use the filename and parent values to achieve that. Here is our load function:
es: ¡Juego guardado! La carga es bastante simple también. Para ello, leeremos cada línea; usaremos parse_json() para volver a leerla hasta un diccionario, y luego iteraremos sobre el diccionario para leer nuestros valores. Pero primero tendremos que crear el objeto y podemos usar el nombre de archivo y los valores del padre para lograrlo. Aquí está nuestra función de carga:
fr: Jeu sauvegardé ! Le chargement est également assez simple. Pour cela, nous allons lire chaque ligne, utiliser parse_json() pour la reconvertir dans un dict, et ensuite itérer dans le dict pour lire nos valeurs. Mais nous devons d'abord créer l'objet et nous pouvons utiliser le nom du fichier et les valeurs parentales pour y parvenir. Voici notre fonction de chargement :
ja: ゲームが保存されました！読み込みも非常に簡単です。そのために、各行を読み取り、parse_json() を使用してそれを辞書に戻し、反復処理を行って辞書の値を読み取ります。ただし、最初にオブジェクトを作成する必要があり、ファイル名と親の値を使用してそれを実現できます。読み込み関数は次のとおりです:
pt_br: Jogo salvo! O carregamento também é bastante simples. Para isso, vamos ler cada linha, usar parse_json() para lê-lo de volta para um dicionário e, em seguida, iterar sobre o dicionário para ler nossos valores. Mas precisamos primeiro criar o objeto e podemos usar o nome do arquivo e os valores pai para conseguir isso. Aqui está a nossa função de carregamento:
zh_cn: 游戏保存好了！ 加载也很简单。 为此，我们将读取每一行，使用parse_json() 将其读回到一个字典中，然后遍历字典以读取保存的值。 首先我们需要创建对象，这可以通过使用文件名和父值来实现。 这就是我们的加载函数:

source: Now we can save and load an arbitrary number of objects laid out almost anywhere across the scene tree! Each object can store different data depending on what it needs to save.
es: Ahora podemos guardar y cargar un número arbitrario de objetos dispuestos casi en cualquier lugar del árbol de la escena. Cada objeto puede almacenar diferentes datos dependiendo de lo que necesite guardar.
fr: Nous pouvons maintenant sauvegarder et charger un nombre arbitraire d'objets disposés presque partout dans l'arbre de scène ! Chaque objet peut stocker des données différentes en fonction de ce qu'il doit sauvegarder.
ja: これで、シーン ツリーのほぼ任意の場所に配置された任意の数のオブジェクトを保存して読み込むことができます！各オブジェクトは、保存する必要があるデータに応じて異なるデータを格納できます。
pt_br: Agora podemos salvar e carregar um número arbitrário de objetos dispostos em quase qualquer lugar na árvore de cena! Cada objeto pode armazenar dados diferentes dependendo do que precisa salvar.
zh_cn: 现在我们可以保存和加载几乎任何位于场景树中的任意数量的对象了！ 每个对象可以根据需要保存的内容存储不同的数据。

source: Some notes
es: Algunas notas
fr: Quelques notes
ja: いくつかの注意事項
pt_br: Algumas observações
zh_cn: 一些注释

source: We have glossed over setting up the game state for loading. It's ultimately up to the project creator where much of this logic goes. This is often complicated and will need to be heavily customized based on the needs of the individual project.
es: Hemos pasado por alto la configuración del estado del juego para la carga. En última instancia, depende del creador del proyecto donde va gran parte de esta lógica. Esto suele ser complicado y tendrá que ser muy personalizado en función de las necesidades del proyecto en particular.
fr: Nous avons passé sous silence la mise en place de l'état du jeu pour le chargement. C'est finalement au créateur du projet qu'il revient de décider où va une grande partie de cette logique. C'est souvent compliqué et devra être fortement personnalisé en fonction des besoins du projet.
ja: ゲームの状態を読み込むための設定に焦点をあてて説明をおこないました。最終的には、このロジックの多くがプロジェクトの作成者に委ねられます。これはしばしば複雑であり、個々のプロジェクトのニーズに基づいて大幅にカスタマイズする必要があります。
pt_br: Nós ignoramos a configuração do estado do jogo para carregamento. Cabe fundamentalmente ao criador do projeto onde grande parte dessa lógica é aplicada. Isso geralmente é complicado e precisará ser fortemente personalizado com base nas necessidades do projeto individual.
zh_cn: 我们可能忽略了"将游戏状态设置到适合以加载数据"这一步。最终, 这一步怎么做的决定权在项目创建者手里。这通常很复杂, 需要根据单个项目的需求对此步骤进行大量定制。

source: Additionally, our implementation assumes no Persist objects are children of other Persist objects. Otherwise, invalid paths would be created. To accommodate nested Persist objects, consider saving objects in stages. Load parent objects first so they are available for the :ref:`add_child() <class_node_method_add_child>` call when child objects are loaded. You will also need a way to link children to parents as the :ref:`NodePath <class_nodepath>` will likely be invalid.
es: Además, nuestra implementación asume que ningún objeto persistente es hijo de otro objeto persistente. De lo contrario, se crearían rutas inválidas. Para acomodar los objetos persistentes anidados, considera guardar los objetos en etapas. Cargar primero los objetos padre para que estén disponibles para la llamada :ref:`add_child() <class_node_method_add_child>` cuando se carguen los objetos hijo. También necesitarás una forma de enlazar a los hijos con los padres ya que la llamada :ref:`NodePath <class_nodepath>` probablemente será inválida.
fr: De plus, notre implémentation suppose qu'aucun objet Persist n'est l'enfant d'un autre objet Persist. Sinon, des chemins invalides seraient créés. Pour prendre en compte les objets Persistants imbriqués, envisagez de sauvegarder les objets par étapes. Chargez d'abord les objets parents pour qu'ils soient disponibles pour l'appel :ref:`add_child() <class_node_method_add_child>` quand les objets enfants sont chargés. Vous aurez aussi besoin d'un moyen de lier les enfants aux parents car le :ref:`NodePath <class_nodepath>` sera probablement invalide.
ja: さらに、この実装では、Persistオブジェクトは他のPersistオブジェクトの子ではないと想定しています。そうしないと、無効なパスが作成されます。ネストされた永続オブジェクトに対応するには、オブジェクトを段階的に保存することを検討してください。最初に親オブジェクトをロードして、子オブジェクトがロードされたときに :ref:`add_child() <class_node_method_add_child>` 呼び出しで使用できるようにします。\ :ref:`NodePath <class_nodepath>` はおそらく無効になるため、子を親にリンクする方法も必要です。
pt_br: Além disso, nossa implementação assume que nenhum objeto Persist é filho de outros objetos Persist. Caso contrário, seriam criados caminhos inválidos. Para acomodar objetos Persist aninhados, considere salvar objetos em etapas. Carregue os objetos pai primeiro para que estejam disponíveis para a chamada :ref:`add_child() <class_node_method_add_child>` quando os objetos filho forem carregados. Você também precisará de uma maneira de vincular filhos aos pais, pois o :ref:`NodePath <class_nodepath>` provavelmente será inválido.
zh_cn: 另外, 此实现假定没有Persist对象是其他Persist对象的子对象。 否则会产生无效路径。 如果这是项目的需求之一，可以考虑分阶段保存对象(父对象优先)，以便在加载子对象时可用它们将确保它们可用于 :ref:`add_child() <class_node_method_add_child>` 调用。 由于 :ref:`NodePath <class_nodepath>` 可能无效，因此可能还需要某种方式将子项链接到父项。

source: Translation status
es: Estado de traducción
fr: État de la traduction
pt_br: Progresso da Tradução

source: We will start by adding objects we wish to save to the "Persist" group. As in the :ref:`doc_scripting_continued` tutorial, we can do this through either the GUI or script. Let's add the relevant nodes using the GUI:
ja: 保存するオブジェクトを "Persist" グループに追加することから始めます。\ :ref:`doc_scripting_continued` チュートリアルのように、GUIまたはスクリプトを使用してこれを行うことができます。 GUIを使用して関連ノードを追加しましょう:
zh_cn: 首先我们将想要保存的对象添加到“Persist”组。 在 :ref:`doc_scripting_continued` 教程中，我们学会了通过GUI或脚本完成此操作。 那就让我们使用GUI来添加相关节点吧:
