Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/configuring_an_ide/xcode.po
Languages: de

source: `Xcode <https://developer.apple.com/xcode>`_ is a free macOS-only IDE. You can download it from the Mac App Store.
de: `Xcode <https://developer.apple.com/xcode>`_ ist eine kostenlose MacOS spezifische IDE. Sie können es aus dem Mac App Store herunterladen.

source: Importing the project
de: Projekt importieren

source: From Xcode's main screen create a new project using the **Other > External Build System** template.
de: Erstelle auf dem Hauptbildschirm von Xcode ein neues Projekt unter Verwendung der Vorlage **Other > External Build System**.

source: Open your build targets from the **Targets** section and select the **Info** tab.
de: Öffnen Sie Ihre Build targets aus dem Abschnitt **Targets** und wählen die Registerkarte **Info**.

source: Fill out the form with the following settings:
de: Füllen Sie das Formular mit den folgenden Einstellungen aus:

source: A full path to the **scons** executable, e.g. **/usr/local/bin/scons**
de: Ein vollständiger Pfad zur ausführbaren **scons** Datei, z.B. **/usr/local/bin/scons**

source: Arguments
de: Argumente

source: See :ref:`doc_introduction_to_the_buildsystem` for a full list of arguments.
de: Siehe :ref:`doc_introduction_to_the_buildsystem` für eine komplette Liste aller Argumente.

source: Directory
de: Verzeichnis

source: A full path to the Godot root folder
de: Ein vollständiger Pfad zum Godot-Stammordner

source: Add a Command Line Tool target which will be used for indexing the project by choosing **File > New > Target...**.
de: Fügen Sie ein Befehlszeilen-Tool-Ziel hinzu, das für die Indexierung des Projekts verwendet wird, indem Sie **File > New > Target...** wählen.

source: Select **OS X > Application > Command Line Tool**.
de: Wählen Sie **OS X > Application > Command Line Tool**.

source: Name it something so you know not to compile with this target (e.g. ``GodotXcodeIndex``).
de: Benennen Sie es, damit Sie wissen, dass Sie nicht mit diesem Ziel kompilieren dürfen (z. B. ``GodotXcodeIndex``).

source: For this target open the **Build Settings** tab and look for **Header Search Paths**.
de: Öffnen Sie für dieses Ziel die Registerkarte **Build Settings** und suchen nach **Header Search Paths**.

source: Set **Header Search Paths** to the absolute path to the Godot root folder. You need to include subdirectories as well. To achieve that, add two two asterisks (``**``) to the end of the path, e.g. ``/Users/me/repos/godot-source/**``.
de: Setzen Sie **Header Search Paths** auf den absoluten Pfad zum Godot-Stammordner. Sie müssen auch Unterverzeichnisse einschließen. Um dies zu erreichen, fügen Sie am Ende des Pfads zwei Sternchen (``**``) hinzu, z.B. ``/Users/me/repos/godot-source/**``.

source: Add the Godot source to the project by dragging and dropping it into the project file browser.
de: Fügen Sie die Godot-Quelle zum Projekt hinzu, indem Sie sie in den Projektdateibrowser ziehen und dort ablegen.

source: Uncheck **Create external build system project**.
de: Deaktivieren Sie **Externes Build-Systemprojekt erstellen**.

source: Next select **Create groups** for the **Added folders** option and check *only* your command line indexing target in the **Add to targets** section.
de: Wählen Sie als Nächstes **Gruppen erstellen** für die Option **Ordner hinzugefügt** und aktivieren Sie *nur* Ihr Befehlszeilen-Indizierungsziel im Abschnitt **Zu Zielen hinzufügen**.

source: Xcode will now index the files. This may take a few minutes.
de: Xcode indiziert nun die Dateien. Dies kann einige Minuten dauern.

source: Once Xcode is done indexing, you should have jump-to-definition, autocompletion, and full syntax highlighting.
de: Sobald die Indizierung von Xcode abgeschlossen ist, sollten Sie über Sprung-zur-Definition, Autovervollständigung und vollständige Syntaxhervorhebung verfügen.

source: Debugging the project
de: Debuggen des Projekts

source: To enable debugging support you need to edit the external build target's build and run schemes.
de: Um die Debugging-Unterstützung zu aktivieren, müssen Sie die Build- und Run-Schemata des externen Build-Ziels bearbeiten.

source: Open the scheme editor of the external build target.
de: Öffnen Sie den Schema-Editor des externen Build-Ziels.

source: Locate the **Build > Post Actions** section.
de: Suchen Sie den Abschnitt **Build > Post Actions**.

source: Add a new script run action
de: Fügen Sie eine neue Skriptausführungsaktion hinzu

source: Under **Provide build settings from** select your project. This allows to reference the project directory within the script.
de: Wählen Sie unter **Provide build settings from** Ihr Projekt aus. Dadurch kann auf das Projektverzeichnis im Skript verwiesen werden.

source: Create a script that will give the binary a name that Xcode can recognize, e.g.:
de: Erstellen Sie ein Skript, das der Binärdatei einen Namen gibt, der von Xcode erkannt werden kann, z.B.:

source: Build the external build target.
de: Erstellen Sie das externe Build-Ziel.

source: Open the scheme editor again and select **Run**.
de: Öffnen Sie den Schema-Editor erneut und wählen Sie **Ausführen**.

source: Set the **Executable** to the file you linked in your post-build action script.
de: Setzen Sie **Ausführbar** für die Datei fest, die Sie in Ihrem Post-Build-Aktionsskript verknüpft haben.

source: Check **Debug executable**.
de: Aktivieren Sie **Debug ausführbare Datei**.

source: You can add two arguments on the **Arguments** tab: the ``-e`` flag opens the editor instead of the project manager, and the ``--path`` argument tells the executable to open the specified project (must be provided as an *absolute* path to the project root, not the ``project.godot`` file).
de: Sie können der Registerkarte **Argumente** zwei Argumente hinzufügen: Das Flag ``-e`` öffnet den Editor anstelle des Projektmanagers, und das Argument ``--path`` weist die ausführbare Datei an, das angegebene Projekt zu öffnen ( muss als *absoluter* Pfad zum Projektstamm angegeben werden, nicht als ``project.godot`` Datei).

source: To check that everything is working, put a breakpoint in ``platform/osx/godot_main_osx.mm`` and run the project.
de: Um zu überprüfen, ob alles funktioniert, setzen Sie einen Haltepunkt in ``platform/osx/godot_main_osx.mm`` und führen Sie das Projekt aus.

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
de: Wenn Sie auf Probleme stoßen, bitten Sie um Hilfe in einem von `Godots Community-Kanälen <https://godotengine.org/community>`__.
