Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/gdscript_exports.po
Languages: de

source: GDScript exports
de: GDScript exportiert

source: Introduction to exports
de: Einführung in Exports

source: In Godot, class members can be exported. This means their value gets saved along with the resource (such as the :ref:`scene <class_PackedScene>`) they're attached to. They will also be available for editing in the property editor. Exporting is done by using the ``export`` keyword::
de: In Godot können Klassenmember exportiert werden. Das bedeutet, dass ihre Werte zusammen mit der zugehörigen Ressource (z.B. der :ref:`scene <class_PackedScene>`) gespeichert werden. Sie sind außerdem im Eigenschaftseditor verfügbar und können hier editiert werden. Das exportieren funktioniert über das Schlüsselwort ``export``:

source: One of the fundamental benefits of exporting member variables is to have them visible and editable in the editor. This way, artists and game designers can modify values that later influence how the program runs. For this, a special export syntax is provided.
de: Einer der größten Vorteile exportierter Variablen ist, dass diese im Editor sichtbar und veränderbar sind. Auf diese Weise können Grafiker, Spiele Designer, etc. diese Werte verändert, die dann das Spielgeschehen beeinflussen. Hierfür gibt es einen speziellen Export Befehl.

source: Exporting properties can also be done in other languages such as C#. The syntax varies depending on the language.
de: Eigenschaften exportieren ist auch in anderen Sprachen möglich, wie zum Beispiel C#. Der Befehlsaufbau unterscheidet sich je nach Sprache.

source: Examples
de: Beispiele

source: It must be noted that even if the script is not being run while in the editor, the exported properties are still editable. This can be used in conjunction with a :ref:`script in "tool" mode <doc_gdscript_tool_mode>`.
de: Es ist zu beachten, dass die exportierten Eigenschaften auch dann bearbeitet werden können, wenn das Skript im Editor nicht ausgeführt wird. Dies kann in Verbindung mit einem: ref: `Skript im" Tool "-Modus <doc_gdscript_tool_mode>` verwendet werden.

source: Exporting bit flags
de: Bit Flags exportieren

source: Integers used as bit flags can store multiple ``true``/``false`` (boolean) values in one property. By using the export hint ``int, FLAGS, ...``, they can be set from the editor::
de: Integer die als bit flags verwendet werden, können mehrere ``true``/``false`` (boolean) Werte auf einmal enthalten. Mit dem Exporthinweis ``int, FLAGS, ...`` können sie im Editor gesetzt werden::

source: You must provide a string description for each flag. In this example, ``Fire`` has value 1, ``Water`` has value 2, ``Earth`` has value 4 and ``Wind`` corresponds to value 8. Usually, constants should be defined accordingly (e.g. ``const ELEMENT_WIND = 8`` and so on).
de: Für jedes Flag muss ein Name angeben werden. In diesem Beispiel hat ``Fire`` den Wert 1, ``Water`` den Wert 2, ``Earth`` den Wert 4 und ``Wind`` den Wert 8. Normalerweise sollten Konstanten einheitlich bennant werden (z.B.: ``const ELEMENT_WIND = 8`` und so weiter).

source: Export hints are also provided for the physics and render layers defined in the project settings::
de: Exporthinweise werden auch für die in den Projekteinstellungen definierten Physik- und Renderebenen bereitgestellt::

source: Using bit flags requires some understanding of bitwise operations. If in doubt, use boolean variables instead.
de: Die Verwendung von Bitflags erfordert ein gewisses Verständnis der bitweisen Operationen. Verwenden Sie im Zweifelsfall stattdessen boolesche Variablen.

source: Exporting arrays
de: Arrays exportieren

source: Exported arrays can have initializers, but they must be constant expressions.
de: Exportierte Arrays können Initialisierer haben, müssen jedoch konstante Ausdrücke sein.

source: If the exported array specifies a type which inherits from Resource, the array values can be set in the inspector by dragging and dropping multiple files from the FileSystem dock at once.
de: Wenn das exportierte Array einen Typ angibt, der von Resource erbt, können die Array-Werte im Inspektor festgelegt werden, indem mehrere Dateien gleichzeitig aus dem FileSystem-Dock gezogen und abgelegt werden.

source: Setting exported variables from a tool script
de: Festlegen exportierter Variablen aus einem Tool-Skript

source: When changing an exported variable's value from a script in :ref:`doc_gdscript_tool_mode`, the value in the inspector won't be updated automatically. To update it, call :ref:`property_list_changed_notify() <class_Object_method_property_list_changed_notify>` after setting the exported variable's value.
de: Wenn Sie den Wert einer exportierten Variablen aus einem Skript in: ref: `doc_gdscript_tool_mode` ändern, wird der Wert im Inspektor nicht automatisch aktualisiert. Rufen Sie zum Aktualisieren Folgendes auf: ref: `property_list_changed_notify () <class_Object_method_property_list_changed_notify>`, nachdem Sie den Wert der exportierten Variablen festgelegt haben.

source: Advanced exports
de: Fortgeschrittene Exporte

source: Not every type of export can be provided on the level of the language itself to avoid unnecessary design complexity. The following describes some more or less common exporting features which can be implemented with a low-level API.
de: Nicht jede Art von Export kann auf der Ebene der Sprache selbst bereitgestellt werden, um unnötige Designkomplexität zu vermeiden. Im Folgenden werden einige mehr oder weniger häufig verwendete Exportfunktionen beschrieben, die mit einer Low-Level-API implementiert werden können.

source: Before reading further, you should get familiar with the way properties are handled and how they can be customized with :ref:`_set() <class_Object_method__get_property_list>`, :ref:`_get() <class_Object_method__get_property_list>`, and :ref:`_get_property_list() <class_Object_method__get_property_list>` methods as described in :ref:`doc_accessing_data_or_logic_from_object`.
de: Bevor Sie weiterlesen, sollten Sie sich mit der Art und Weise vertraut machen, wie Eigenschaften behandelt werden und wie sie angepasst werden können mit: ref: `_set () <class_Object_method__get_property_list>` ,: ref: `_get () <class_Object_method__get_property_list>` und: ref: ` _get_property_list () <class_Object_method__get_property_list> `Methoden wie beschrieben in: ref:` doc_accessing_data_or_logic_from_object`.

source: For binding properties using the above methods in C++, see :ref:`doc_binding_properties_using_set_get_property_list`.
de: Informationen zum Binden von Eigenschaften mit den oben genannten Methoden in C ++ finden Sie unter: ref: `doc_binding_properties_using_set_get_property_list`.

source: The script must operate in the ``tool`` mode so the above methods can work from within the editor.
de: Das Skript muss im `` Werkzeug`` -Modus arbeiten, damit die oben genannten Methoden im Editor ausgeführt werden können.

source: Adding script categories
de: Skript Kategorien hinzufügen

source: For better visual distinguishing of properties, a special script category can be embedded into the inspector to act as a separator. ``Script Variables`` is one example of a built-in category.
de: Zur besseren visuellen Unterscheidung von Eigenschaften kann eine spezielle Skriptkategorie in den Inspektor eingebettet werden, um als Trennzeichen zu fungieren. `` Skriptvariablen`` ist ein Beispiel für eine integrierte Kategorie.

source: ``name`` is the name of a category to be added to the inspector;
de: `` name`` ist der Name einer Kategorie, die dem Inspektor hinzugefügt werden soll;

source: ``PROPERTY_USAGE_CATEGORY`` indicates that the property should be treated as a script category specifically, so the type ``TYPE_NIL`` can be ignored as it won't be actually used for the scripting logic, yet it must be defined anyway.
de: `` PROPERTY_USAGE_CATEGORY`` gibt an, dass die Eigenschaft speziell als Skriptkategorie behandelt werden soll, sodass der Typ `` TYPE_NIL`` ignoriert werden kann, da er nicht für die Skriptlogik verwendet wird, aber dennoch definiert werden muss.

source: Grouping properties
de: Eigenschaften gruppieren

source: A list of properties with similar names can be grouped.
de: Eine Liste von Eigenschaften mit ähnlichen Namen kann gruppiert werden.

source: ``name`` is the name of a group which is going to be displayed as collapsible list of properties;
de: `` name`` ist der Name einer Gruppe, die als zusammenklappbare Liste von Eigenschaften angezeigt wird;

source: every successive property added after the group property will be collapsed and shortened as determined by the prefix defined via the ``hint_string`` key. For instance, ``rotate_speed`` is going to be shortened to ``speed`` in this case.
de: Jede nachfolgende Eigenschaft, die nach der Gruppeneigenschaft hinzugefügt wird, wird reduziert und gekürzt, wie durch das Präfix bestimmt, das über den Schlüssel ``tip_string`` definiert ist. Zum Beispiel wird ``rotate_speed`` in diesem Fall auf ``speed`` verkürzt.

source: ``PROPERTY_USAGE_GROUP`` indicates that the property should be treated as a script group specifically, so the type ``TYPE_NIL`` can be ignored as it won't be actually used for the scripting logic, yet it must be defined anyway.
de: `` PROPERTY_USAGE_GROUP`` gibt an, dass die Eigenschaft speziell als Skriptgruppe behandelt werden soll, sodass der Typ `` TYPE_NIL`` ignoriert werden kann, da er nicht für die Skriptlogik verwendet wird, aber dennoch definiert werden muss.
