Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/scripting/gdscript/warning_system.po
Languages: de

source: GDScript warning system
de: GDScript Warnungs System

source: The GDScript warning system complements :ref:`static typing <doc_gdscript_static_typing>` (but it can work without static typing too). It's here to help you avoid mistakes that are hard to spot during development, and that may lead to runtime errors.
de: Das GDScript-Warnsystem ergänzt :ref:`statische Typisierung <doc_gdscript_static_typing>` (kann aber auch ohne statische Typisierung funktionieren). Es hilft Ihnen dabei Fehler zu vermeiden, die während der Entwicklung schwer zu erkennen sind und zu Laufzeitfehlern führen können.

source: You can configure warnings in the Project Settings under the section called **Gdscript**:
de: Sie können Warnungen in den Projekteinstellungen unter dem Abschnitt **Gdscript** konfigurieren:

source: Warning system project settings
de: Konfigurieren des Warnverhaltens im Projekt

source: You can find a list of warnings for the active GDScript file in the script editor's status bar. The example below has 3 warnings:
de: Eine Liste der Warnungen für die aktive GDScript-Datei finden Sie in der Statusleiste des Skripteditors. Das folgende Beispiel enthält 3 Warnungen:

source: Warning system example
de: Beispiel: Ausgelöster Warnhinweis

source: To ignore specific warnings in one file, insert a special comment of the form ``# warning-ignore:warning-id``, or click on the ignore link to the right of the warning's description. Godot will add a comment above the corresponding line and the code won't trigger the corresponding warning anymore:
de: Um bestimmte Warnungen in einer Datei zu ignorieren, fügen Sie einen speziellen Kommentar in der Form ``# warning-ignore:warning-id`` ein oder klicken Sie auf den Link "Ignorieren" rechts neben der Beschreibung der Warnung. Godot fügt einen Kommentar über der entsprechenden Zeile hinzu und der Code löst keine entsprechende Warnung mehr aus:

source: Warning system ignore example
de: Ignorieren einer Warnung

source: You can also choose to ignore not just one but all warnings of a certain type in this file with ``# warning-ignore-all:warning-id``. To ignore all warnings of all types in a file add the comment ``# warnings-disable`` to it.
de: Sie können auch festlegen, dass nicht nur eine sondern alle Warnungen eines bestimmten Typs in dieser Datei mit ``# warning-ignore-all:warning-id`` ignoriert werden. Um alle Warnungen aller Art in einer Datei zu ignorieren, fügen Sie den Kommentar ``# warnings-disable`` hinzu.

source: Warnings won't prevent the game from running, but you can turn them into errors if you'd like. This way your game won't compile unless you fix all warnings. Head to the ``GDScript`` section of the Project Settings to turn on this option. Here's the same file as the previous example with warnings as errors turned on:
de: Warnungen verhindern nicht, dass das Spiel ausgeführt wird, aber Sie können sie in Fehler umwandeln wenn Sie möchten. Auf diese Weise wird Ihr Spiel erst kompiliert, wenn Sie alle Warnungen behoben haben. Gehen Sie zum Abschnitt ``GDScript`` der Projekteinstellungen, um diese Option zu aktivieren. Hier ist dieselbe Datei wie im vorherigen Beispiel mit Warnungen als aktivierte Fehler:

source: Warnings as errors
de: Warnungen als Fehler
