Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/introduction_to_shaders.po
Languages: es, pt_br, zh_cn

source: Introduction to shaders
es: Introducción a los shaders
pt_br: Introdução aos shaders
zh_cn: 着色器简介

source: This page explains what shaders are and will give you an overview of how they work in Godot. For a detailed reference of the engine's shading language, see :ref:`doc_shading_language`.
es: Esta página explica qué son los shaders y te proporcionará una visión general de cómo funcionan en Godot. Para una referencia detallada del lenguaje de sombreado del motor, consulta :ref:`doc_shading_language`.
pt_br: Esta página explica o que são shaders e lhe dará uma visão geral de como eles funcionam no Godot. Para uma referência detalhada da linguagem de shading do motor, veja :ref:`doc_shading_language`.
zh_cn: 本页面会讲解什么是着色器，会为你综述其在 Godot 中的使用方法。引擎中着色语言的详细参考见 :ref:`doc_shading_language`\ 。

source: Shaders are a special kind of program that runs on Graphics Processing Units (GPUs). They were initially used to shade 3D scenes but can nowadays do much more. You can use them to control how the engine draws geometry and pixels on the screen, allowing you to achieve all sorts of effects.
es: Los shaders son un tipo especial de programa que se ejecuta en las Unidades de Procesamiento Gráfico (GPU). Inicialmente se utilizaban para sombrear escenas 3D, pero en la actualidad pueden hacer mucho más. Puedes utilizarlos para controlar cómo el motor dibuja geometría y píxeles en la pantalla, lo que te permite lograr todo tipo de efectos.
pt_br: Shaders são um tipo especial de programa executado em unidades de processamento gráfico (GPUs). Eles foram inicialmente usados para sombrear cenas 3D, mas hoje em dia podem fazer muito mais. Você pode usá-los para controlar como o motor desenha a geometria e os pixels na tela, permitindo obter todos os tipos de efeitos.
zh_cn: 着色器（Shader）是一种在图形处理单元（GPU）上运行的特殊程序。他们最初使用来为 3D 场景着色的，不过现在能做的事情就更多了。你可以用它们来控制引擎在屏幕上绘制几何体以及像素的方式，可以用来实现各种特效。

source: Modern rendering engines like Godot draw everything with shaders: graphics cards can run thousands of instructions in parallel, leading to incredible rendering speed.
es: Los motores de renderizado modernos como Godot dibujan todo utilizando shaders: las tarjetas gráficas pueden ejecutar miles de instrucciones en paralelo, lo que lleva a una velocidad de renderizado increíble.
pt_br: Motores de renderização modernos como o Godot desenham tudo com shaders: placas gráficas podem executar milhares de instruções em paralelo, levando a uma incrível velocidade de renderização.
zh_cn: 类似 Godot 的现代渲染引擎都会用着色器来执行所有绘制操作：图形卡可以并行执行成千上万条指令，可以达到惊人的渲染速度。

source: Because of their parallel nature, though, shaders don't process information the way a typical program does. Shader code runs on each vertex or pixel in isolation. You cannot store data between frames either. As a result, when working with shaders, you need to code and think differently from other programming languages.
es: Debido a su naturaleza paralela, los shaders no procesan la información de la misma manera que lo hace un programa típico. El código del shader se ejecuta en cada vértice o píxel de forma aislada. Tampoco puedes almacenar datos entre fotogramas. Como resultado, al trabajar con shaders, necesitas programar y pensar de manera diferente a otros lenguajes de programación.
pt_br: Por causa de sua natureza paralela, porém, os shaders não processam informações da mesma forma que um programa típico faz. O código do shader é executado em cada vértice ou pixel isoladamente. Você também não pode armazenar dados entre quadros. Como resultado, ao trabalhar com shaders, você precisa programar e pensar de forma diferente de outras linguagens de programação.
zh_cn: 因为天生就是并行的，所以着色器处理信息的方式与普通的程序有所不同。着色器代码是单独针对顶点或像素执行的。你也无法在帧与帧之间存储数据。因此，使用着色器时，你需要使用与其他编程语言不同的编码和思考方式。

source: Suppose you want to update all the pixels in a texture to a given color. In GDScript, your code would use ``for`` loops::
es: Supongamos que quieres actualizar todos los píxeles de una textura a un color dado. En GDScript, tu código usaría bucles ``for`` de la siguiente manera:
pt_br: Suponha que você queira atualizar todos os pixels em uma textura para uma determinada cor. Em GDScript, seu código utilizaria loops ``for``::
zh_cn: 假设你想要把纹理中的所有像素点都设置成某个给定的颜色。使用 GDScript，你的代码会用 ``for`` 循环： ::

source: Your code is already part of a loop in a shader, so the corresponding code would look like this.
es: Tu código ya forma parte de un bucle en un shader, por lo que el código correspondiente se vería así.
pt_br: Seu código já é parte de um loop em um shader, então o código correspondente ficaria assim.
zh_cn: 在着色器中，你的代码已经是循环的一部分了，所以对应的代码应该类似这样。

source: The graphics card calls the ``fragment()`` function once or more for each pixel it has to draw. More on that below.
es: La tarjeta gráfica llama a la función ``fragment()`` una o más veces por cada píxel que tiene que dibujar. Más sobre eso a continuación.
pt_br: A placa gráfica chama a função ``fragment()`` uma ou mais vezes para cada pixel a ser desenhado. Mais sobre isso abaixo.
zh_cn: 图形卡会为需要绘制的每一个像素调用若干次 ``fragment()`` 函数。后面会详细说明。

source: Shaders in Godot
es: Shaders en Godot
pt_br: Shaders em Godot
zh_cn: Godot 中的着色器

source: Godot provides a shading language based on the popular OpenGL Shading Language (GLSL) but simplified. The engine handles some of the lower-level initialization work for you, making it easier to write complex shaders.
es: Godot proporciona un lenguaje de sombreado basado en el popular Lenguaje de Sombreado de OpenGL (GLSL) pero simplificado. El motor se encarga de parte del trabajo de inicialización de bajo nivel, lo que facilita la escritura de shaders complejos.
zh_cn: Godot 所提供的着色语言是基于流行的 OpenGL 着色语言（GLSL）的简化。引擎会为你处理一些底层的初始化工作，让编写复杂着色器更为简单。

source: In Godot, shaders are made up of main functions called "processor functions". Processor functions are the entry point for your shader into the program. There are seven different processor functions.
zh_cn: 在 Godot 中，着色器由若干主函数组成，这些函数被称为“处理器函数”。处理器函数是着色器程序的入口。有七种不同的处理器函数。

source: The ``vertex()`` function runs over all the vertices in the mesh and sets their positions and some other per-vertex variables. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
zh_cn: ``vertex()`` 函数会为网格中的所有顶点各运行一次，用来设置顶点的位置和其他与顶点相关的变量。在 :ref:`canvas_item 着色器 <doc_canvas_item_shader>`\ 和\ :ref:`空间着色器 <doc_spatial_shader>`\ 中使用。

source: The ``fragment()`` function runs for every pixel covered by the mesh. It uses values output by the ``vertex()`` function, interpolated between the vertices. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
zh_cn: ``fragment()`` 函数会为网格所覆盖的所有像素各运行一次。这个函数会用到 ``vertex()`` 函数输出的值，这些值会在顶点之间进行插值。在 :ref:`canvas_item 着色器 <doc_canvas_item_shader>`\ 和\ :ref:`空间着色器 <doc_spatial_shader>`\ 中使用。

source: The ``light()`` function runs for every pixel and for every light. It takes variables from the ``fragment()`` function and from its previous runs. Used in :ref:`canvas_item shaders <doc_canvas_item_shader>` and :ref:`spatial shaders <doc_spatial_shader>`.
zh_cn: ``light()`` 函数会为每个像素和每个灯光各运行一次。这个函数会用到 ``fragment()`` 函数以及前几次运行中的变量。在 :ref:`canvas_item 着色器 <doc_canvas_item_shader>`\ 和\ :ref:`空间着色器 <doc_spatial_shader>`\ 中使用。

source: The ``start()`` function runs for every particle in a particle system once when the particle is first spawned. Used in :ref:`particles shaders <doc_particle_shader>`.
zh_cn: ``start()`` 函数会在粒子系统中的每个粒子出生时各运行一次。在\ :ref:`粒子着色器 <doc_particle_shader>`\ 中使用。

source: The ``process()`` function runs for every particle in a particle system for each frame. Used in :ref:`particles shaders <doc_particle_shader>`.
zh_cn: ``start()`` 函数会为粒子系统中的每个粒子每帧时各运行一次。在\ :ref:`粒子着色器 <doc_particle_shader>`\ 中使用。

source: The ``sky()`` function runs for every pixel in the radiance cubemap when the radiance cubemap needs to be updated, and for every pixel on the current screen. Used in :ref:`sky shaders <doc_sky_shader>`.
zh_cn: ``sky()`` 函数会在辐射度立方体贴图需要更新时为辐射度立方体贴图中的每个像素各运行一次，也会为当前屏幕上的每个像素运行一次。在\ :ref:`天空着色器 <doc_sky_shader>`\ 中使用。

source: The ``fog()`` function runs for every froxel in the volumetric fog froxel buffer that intersects with the :ref:`FogVolume <class_FogVolume>`. Used by :ref:`fog shaders <doc_fog_shader>`.
zh_cn: ``fog()`` 函数会为体积雾片段体素缓冲中与 :ref:`FogVolume <class_FogVolume>` 相交的每个片段体素运行一次。在\ :ref:`雾着色器 <doc_fog_shader>`\ 中使用。

source: The ``light()`` function won't run if the ``vertex_lighting`` render mode is enabled, or if **Rendering > Quality > Shading > Force Vertex Shading** is enabled in the Project Settings. It's enabled by default on mobile platforms.
es: La función ``light()`` no se ejecutará si el modo de renderizado ``vertex_lighting`` está habilitado, o si la opción **Rendering > Quality > Shading > Force Vertex Shading** está habilitada en la Configuración del Proyecto. Por defecto, está habilitada en plataformas móviles.
zh_cn: 如果启用了 ``vertex_lighting`` 渲染模式，或者在项目设置中启用了 **Rendering > Quality > Shading > Force Vertex Shading**\ （渲染 > 质量 > 着色 > 强制顶点着色），则不会运行 ``light()`` 函数。在移动平台上默认启用。

source: Godot also exposes an API for users to write totally custom GLSL shaders. For more information see :ref:`doc_compute_shaders`.
zh_cn: Godot 还为用户编写完全自定义的 GLSL 着色器暴露了 API。详见 :ref:`doc_compute_shaders`\ 。

source: Shader types
es: Tipos de Shaders
pt_br: Tipos de shader
zh_cn: 着色器类型

source: Instead of supplying a general-purpose configuration for all uses (2D, 3D, particles, sky, fog), you must specify the type of shader you're writing. Different types support different render modes, built-in variables, and processing functions.
zh_cn: 你所编写的着色器必须指定类型（2D、3D、粒子、天空、雾），不存在所有场景都可以使用的通用配置。不同的类型支持不同的渲染模式、内置变量、处理函数。

source: In Godot, all shaders need to specify their type in the first line, like so:
es: En Godot, todos los shaders deben especificar su tipo en la primera línea, de la siguiente manera:
pt_br: Em Godot, todos os shaders precisam especificar seu tipo na primeira linha, assim:
zh_cn: 在 Godot 中，所有的着色器都需要在第一行指定它们的类型，类似这样：

source: Here are the available types:
es: Aqui están los tipos validos:
pt_br: Aqui estão os tipos disponíveis:
zh_cn: 有以下类型可用：

source: :ref:`spatial <doc_spatial_shader>` for 3D rendering.
es: :ref:`espacial <doc_spatial_shader>` para renderizado 3D.
pt_br: :ref:`spatial <doc_spatial_shader>` para renderização 3D.
zh_cn: 用于 3D 渲染的 :ref:`spatial <doc_spatial_shader>`\ 。

source: :ref:`canvas_item <doc_canvas_item_shader>` for 2D rendering.
es: :ref:`canvas_item <doc_canvas_item_shader>` para renderizado 2D.
pt_br: :ref:`canvas_item <doc_canvas_item_shader>` para renderização 2D.
zh_cn: 用于 2D 渲染的 :ref:`canvas_item <doc_canvas_item_shader>`\ 。

source: :ref:`particles <doc_particle_shader>` for particle systems.
es: :ref:`partículas <doc_particle_shader>` para sistemas de partículas.
pt_br: :ref:`particles <doc_particle_shader>` para sistemas de partículas.
zh_cn: 用于粒子系统的 :ref:`particles <doc_particle_shader>`\ 。

source: :ref:`sky <doc_sky_shader>` to render :ref:`Skies <class_Sky>`.
zh_cn: 用于渲染 :ref:`Skies <class_Sky>` 的 :ref:`sky <doc_sky_shader>`\ 。

source: :ref:`fog <doc_fog_shader>` to render :ref:`FogVolumes <class_FogVolume>`
zh_cn: 用于渲染 :ref:`FogVolumes <class_FogVolume>` 的 :ref:`fog <doc_fog_shader>`

source: Render modes
es: Modos de renderizado
pt_br: Modos de renderização
zh_cn: 渲染模式

source: Shaders have optional render modes you can specify on the second line, after the shader type, like so:
es: Los shaders tienen modos de renderizado opcionales que puedes especificar en la segunda línea, después del tipo de shader, de la siguiente manera:
zh_cn: 可以在着色器的第二行，也就是在着色器类型之后，指定渲染模式，类似这样：

source: Render modes alter the way Godot applies the shader. For example, the ``unshaded`` mode makes the engine skip the built-in light processor function.
es: Los modos de renderizado alteran la forma en que Godot aplica el shader. Por ejemplo, el modo ``unshaded`` hace que el motor omita la función incorporada de procesamiento de luces.
zh_cn: 渲染模式会修改 Godot 应用着色器的方式。例如，\ ``unshaded`` 模式会让引擎跳过内置的光线处理器函数。

source: Each shader type has different render modes. See the reference for each shader type for a complete list of render modes.
es: Cada tipo de shader tiene diferentes modos de renderizado. Consulta la referencia de cada tipo de shader para obtener una lista completa de los modos de renderizado disponibles.
pt_br: Cada tipo de shader tem diferentes modos de renderização. Veja a referência para cada tipo de shader para uma lista completa de modos de renderização.
zh_cn: 每种着色器类型都有不同的渲染模式。每种着色器类型的完整渲染模式列表请参阅参考手册。

source: Vertex processor
es: Procesador Vertex
pt_br: Processador de vértice
zh_cn: 顶点处理器

source: The ``vertex()`` processing function is called once for every vertex in ``spatial`` and ``canvas_item`` shaders. For ``particles`` shaders, it is called once for every particle.
es: La función de procesamiento ``vertex()`` se llama una vez por cada vértice en los shaders ``spatial`` y ``canvas_item``. Para los shaders de ``particles``, se llama una vez por cada partícula.
pt_br: A função de processamento ``vertex()`` é chamada uma vez para cada vértice em ``spatial`` e ``canvas_item`` shaders. Para ``particles`` shaders, ela é chamada uma vez para cada partícula.
zh_cn: 在 ``spatial`` 和 ``canvas_item`` 着色器中，会为每一个顶点调用 ``vertex()`` 处理函数。在 ``particles`` 着色器中则会为每一个粒子调用一次。

source: Each vertex in your world's geometry has properties like a position and color. The function modifies those values and passes them to the fragment function. You can also use it to send extra data to the fragment function using varyings.
es: Cada vértice en la geometría de tu mundo tiene propiedades como una posición y un color. La función "vertex()" modifica esos valores y los pasa a la función "fragment()". También puedes usarla para enviar datos adicionales a la función "fragment()" utilizando "varyings".
zh_cn: 你的世界中的几何体上，每一个顶点都有位置、颜色等属性。该函数会修改这些值，并将其传入片段函数。你也可以借助 varying 向片段着色器传递额外的数据。

source: By default, Godot transforms your vertex information for you, which is necessary to project geometry onto the screen. You can use render modes to transform the data yourself; see the :ref:`Spatial shader doc <doc_spatial_shader>` for an example.
es: Por defecto, Godot transforma la información de tus vértices por ti, lo cual es necesario para proyectar la geometría en la pantalla. Sin embargo, puedes utilizar modos de renderizado para transformar los datos tú mismo; consulta la documentación de :ref:`shaders espaciales <doc_spatial_shader>` para ver un ejemplo.
pt_br: Por padrão, Godot transforma suas informações de vértices para você, o que é necessário para projetar a geometria na tela. Você pode utilizar modos de renderização para transformar os dados você mesmo; veja o :ref:`Spatial shader doc <doc_spatial_shader>` para um exemplo.
zh_cn: 默认情况下，Godot 会为你对顶点信息进行变换，这是将几何体投影到屏幕上所必须的。你可以使用渲染模式来自行变换数据；示例见 :ref:`Spatial 着色器文档 <doc_spatial_shader>`\ 。

source: Fragment processor
es: Procesador Fragment
pt_br: Processador de fragmentos
zh_cn: 片段处理器

source: The ``fragment()`` processing function is used to set up the Godot material parameters per pixel. This code runs on every visible pixel the object or primitive draws. It is only available in ``spatial``, ``canvas_item``, and ``sky`` shaders.
zh_cn: ``fragment()`` 处理函数的作用是设置每一个像素的 Godot 材质参数。这里的代码会在绘制的对象或图元的每一个可见像素上执行。只能在 ``spatial``\ 、\ ``canvas_item``\ 、\ ``sky`` 着色器中使用。

source: The standard use of the fragment function is to set up material properties used to calculate lighting. For example, you would set values for ``ROUGHNESS``, ``RIM``, or ``TRANSMISSION``, which would tell the light function how the lights respond to that fragment. This makes it possible to control a complex shading pipeline without the user having to write much code. If you don't need this built-in functionality, you can ignore it and write your own light processing function, and Godot will optimize it away. For example, if you do not write a value to ``RIM``, Godot will not calculate rim lighting. During compilation, Godot checks to see if ``RIM`` is used; if not, it cuts all the corresponding code out. Therefore, you will not waste calculations on the effects that you do not use.
es: El uso estándar de la función ``fragment()`` es configurar las propiedades del material que se utilizan para calcular la iluminación. Por ejemplo, podrías establecer valores para ``ROUGHNESS``, ``RIM`` o ``TRANSMISSION``, que le indicarían a la función de luz cómo responder a esa fracción. Esto permite controlar un complejo proceso de sombreado sin que el usuario tenga que escribir mucho código. Si no necesitas esta funcionalidad incorporada, puedes ignorarla y escribir tu propia función de procesamiento de luz, y Godot la optimizará. Por ejemplo, si no escribes un valor en ``RIM``, Godot no calculará la iluminación del borde. Durante la compilación, Godot comprueba si se utiliza ``RIM``; si no es así, eliminará todo el código correspondiente. Por lo tanto, no desperdiciarás cálculos en efectos que no utilices.
pt_br: O uso padrão da função de fragmento é configurar as propriedades do material usadas para calcular a iluminação. Por exemplo, você definiria valores para ``ROUGHNESS``, ``RIM`` ou ``TRANSMISSION``, que informariam à função de luz como as luzes respondem a esse fragmento. Isso torna possível controlar um pipeline de sombreamento complexo sem que o usuário precise escrever muito código. Se você não precisa dessa funcionalidade integrada, pode ignorá-la e escrever sua própria função de processamento de luz, e Godot a otimizará. Por exemplo, se você não escrever um valor para ``RIM``, o Godot não calculará a iluminação do aro. Durante a compilação, Godot verifica se ``RIM`` é usado; caso contrário, ele corta todo o código correspondente. Portanto, você não desperdiçará cálculos nos efeitos que não usa.
zh_cn: 片段函数的标准用途是设置用于计算光照的材质属性。例如，你可以为 ``ROUGHNESS``\ 、\ ``RIM``\ 、\ ``TRNASMISSION`` 等设置值，告诉光照函数光照应该如何处理对应的片段。这样就可以控制复杂的着色管线，而不必让用户编写过多的代码。如果你不需要这一内置功能，那么你可以忽略它，自行编写光照处理函数，Godot 会将其优化掉。例如，如果你没有向 ``RIM`` 写入任何值，那么 Godot 就不会计算边缘光照。编译时，Godot 会检查是否使用了 ``RIM``\ ；如果没有，那么它就会把对应的代码删除。因此，你就不会在没有使用的效果上浪费算力。

source: Light processor
es: Procesador Light
pt_br: Processador de luz
zh_cn: 光照处理器

source: The ``light()`` processor runs per pixel too, and it runs once for every light that affects the object. It does not run if no lights affect the object. It exists as a function called inside the ``fragment()`` processor and typically operates on the material properties setup inside the ``fragment()`` function.
es: El procesador ``light()`` también se ejecuta por píxel y se ejecuta una vez por cada luz que afecta al objeto. No se ejecuta si ninguna luz afecta al objeto. Es una función que se llama dentro del procesador ``fragment()`` y generalmente opera en las propiedades del material configuradas dentro del procesador ``fragment()``.
pt_br: O processador ``light()`` funciona por pixel também, e funciona uma vez para cada luz que afeta o objeto. Ele não funciona se nenhuma luz afetar o objeto. Existe como uma função chamada dentro do processador ``fragment()`` e normalmente opera na configuração das propriedades do material dentro da função ``fragment()``.
zh_cn: ``light()`` 处理器也会在每一个像素上运行，并且同时还会在每一个影响该对象的灯光上运行。如果没有灯光影响该对象则不会运行。它会被用于 ``fragment()`` 处理器，一般会在 ``fragment()`` 函数中进行材质属性设置时执行。

source: The ``light()`` processor works differently in 2D than it does in 3D; for a description of how it works in each, see their documentation, :ref:`CanvasItem shaders <doc_canvas_item_shader>` and :ref:`Spatial shaders <doc_spatial_shader>`, respectively.
es: El procesador ``light()`` funciona de manera diferente en 2D que en 3D; para una descripción de cómo funciona en cada caso, consulta su documentación en :ref:`Shaders de CanvasItem <doc_canvas_item_shader>` y :ref:`Shaders espaciales <doc_spatial_shader>`, respectivamente.
pt_br: O processador ``light()`` funciona de forma diferente em 2D do que em 3D; para uma descrição de como funciona em cada um deles, veja sua documentação, :ref:`CanvasItem shaders <doc_canvas_item_shader>` e :ref:`Shaders espaciais <doc_spatial_shader>`, respectivamente.
zh_cn: ``light()`` 处理器在 2D 和 3D 中的工作方式不同；每种工作方式的详细描述请参阅它们对应的文档 :ref:`CanvasItem 着色器 <doc_canvas_item_shader>` and :ref:`Spatial 着色器 <doc_spatial_shader>`\ 。

source: Translation status
es: Estado de traducción
pt_br: Progresso da Tradução
zh_cn: 翻译状态

source: Processor functions
pt_br: Funções de processador

source: Depending on the shader type, you can override different processor functions. For ``spatial`` and ``canvas_item``, you have access to ``vertex()``, ``fragment()``, and ``light()``. For ``particles``, you only have access to ``vertex()``.
pt_br: Dependendo do tipo de shader, você pode anular diferentes funções do processador. Para ``spatial`` e ``canvas_item``, você tem acesso a ``vertex()``, ``fragment()``, e ``light()``. Para ``particles``, você só tem acesso a ``vertex()``.

source: The ``fragment()`` processing function is used to set up the Godot material parameters per pixel. This code runs on every visible pixel the object or primitive draws. It is only available in ``spatial`` and ``canvas_item`` shaders.
pt_br: A função de processamento ``fragment()`` é utilizada para configurar os parâmetros do material Godot por pixel. Este código roda em cada pixel visível do objeto ou desenhos primitivos. Está disponível apenas em shaders ``spatial`` e ``canvas_item``.
