Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/visual_shaders.po
Languages: de, es, fr, ja, zh_cn

source: The ``Fresnel`` node is designed to accept normal and view vectors and produces a scalar which is the saturated dot product between them. Additionally, you can setup the inversion and the power of equation. The ``Fresnel`` node is great for adding a rim-like lighting effect to objects.
de: Der ``Fresnel`` -Node ist so ausgelegt, dass er Normal- und Ansichtsvektoren akzeptiert und einen Skalar erzeugt, der das gesättigte Skalarprodukt zwischen ihnen ist. Zusätzlich können Sie die Inversion und die Potenz der Gleichung einstellen. Der ``Fresnel``-Node eignet sich hervorragend, um Objekten einen randartigen Lichteffekt zu verleihen.
es: El nodo ``Fresnel`` está diseñado para aceptar vectores normales y de vista y produce un escalar que es el producto de punto saturado entre ellos. Además, puede configurar la inversión y el poder de la ecuación. El nodo ``Fresnel`` es genial para añadir un efecto de iluminación de borde a los objetos.
fr: Le nœud ``Fresnel`` est conçu pour accepter des vecteurs normaux et de vision et produit un scalaire qui est le produit de points saturés entre eux. De plus, vous pouvez régler l'inversion et la puissance de l'équation. Le nœud ``Fresnel`` est idéal pour ajouter un effet de lumière sur les objets.
ja: ``Fresnel`` ノードは、法線ベクトルとビューベクトルを受け入れ、それらの間の飽和ドット積であるスカラーを生成するように設計されています。さらに、反転と方程式の力を設定できます。\ ``Fresnel``ノードは、オブジェクトに縁取りのような照明効果を追加するのに最適です。
zh_cn: ``Fresnel`` 节点用于接受法线向量和视图向量, 并生成一个标量, 即它们之间的饱和点积. 此外, 你可以设置反转和方程的幂. ``Fresnel`` 节点非常适合为对象添加类似边缘的照明效果.

source: Boolean node
de: Boolescher Node
es: Nodo Boolean
fr: Nœud booléen
ja: ブール型ノード
zh_cn: Boolean 节点

source: The ``Boolean`` node can be converted to ``Scalar`` or ``Vector`` to represent ``0`` or ``1`` and ``(0, 0, 0)`` or ``(1, 1, 1)`` respectively. This property can be used to enable or disable some effect parts with one click.
es: El nodo ``Boolean`` puede convertirse en ``Scalar`` o ``Vector`` para representar ``0`` o ``1`` y ``(0, 0, 0)`` o ``(1, 1, 1)`` respectivamente. Esta propiedad puede usarse para activar o desactivar algunas partes del efecto con un solo clic.
fr: Le nœud ``Boolean`` peut être converti en ``Scalar`` ou ``Vector`` pour représenter respectivement ``0`` ou ``1`` et ``(0, 0, 0)`` ou ``(1, 1, 1)``. Cette propriété peut être utilisée pour activer ou désactiver certaines parties de l'effet en un seul clic.
ja: ``Boolean`` ノードは ``Scalar`` または ``Vector`` に変換して ``0`` または ``1`` および ``'0, 0, 0)`` または ``(1, 1, 1, )`` を表すことができます。このプロパティを使用すると、一部のエフェクトパーツをワンクリックで有効または無効にできます。
zh_cn: ``Boolean`` 节点可以转换为或 ``Scalar`` 或 ``Vector`` , 分别表示 ``0`` 或 ``1`` 和 ``(0, 0, 0)`` 或 ``(1, 1, 1)`` . 该属性可用于一键启用或禁用某些效果部件.

source: If node
es: Si el nodo
fr: Nœud if
ja: ifノード
zh_cn: If 节点

source: The ``If`` node allows you to setup a vector which will be returned the result of the comparison between ``a`` and ``b``. There are three vectors which can be returned: ``a == b`` (in that case the tolerance parameter is provided as a comparison threshold – by default it is equal to the minimal value, i.e. ``0.00001``), ``a > b`` and ``a < b``.
es: El nodo ``If`` le permite configurar un vector que será devuelto como resultado de la comparación entre ``a`` y ``b``. Hay tres vectores que pueden ser devueltos: ``a == b`` (en ese caso el parámetro de tolerancia se proporciona como un umbral de comparación - por defecto es igual al valor mínimo, es decir, ``0.00001``), ``a > b`` y ``a < b``.
fr: Le nœud ``If`` vous permet de configurer un vecteur qui sera renvoyé comme résultat de la comparaison entre ``a`` et ``b``. Trois vecteurs peuvent être renvoyés : ``a == b`` (dans ce cas, le paramètre de tolérance est fourni comme seuil de comparaison - par défaut, il est égal à la valeur minimale, c'est-à-dire ``0.00001``), ``a > b`` et ``a < b``.
ja: ``If`` ノードを使用すると、\ ``a`` と ``b`` の比較結果を返すベクトルを設定できます。返される可能性のあるベクトルは3つあります: ``a == b`` (この場合、許容範囲パラメーターは比較のしきい値として提供されます - デフォルトでは最小値、つまり ``0.00001``に等しい)、\ ``a> b`` および ``a <b`` です。
zh_cn: ``If`` 节点允许你设置一个向量, 它将返回 ``a`` 和 ``b`` 之间的比较结果. 有三个向量可以返回: ``a == b`` (在这种情况下, 容差参数是作为比较阈值提供的--默认情况下它等于最小值, 即 ``0.00001`` ), ``a > b`` 和 ``a < b`` .

source: Switch node
es: Nodo Switch
fr: Nœud switch
ja: スイッチノード(Switch node)
zh_cn: Switch 节点

source: The ``Switch`` node returns a vector if the boolean condition is ``true`` or ``false``. ``Boolean`` was introduced above. If you convert a vector to a true boolean, all components of the vector should be above zero.
es: El nodo ``Switch`` devuelve un vector si la condición booleana es ``true`` o ``false``. ``Boolean`` fue introducido arriba. Si conviertes un vector en un verdadero booleano, todos los componentes del vector deben estar por encima de cero.
fr: Le nœud ``Switch`` renvoie un vecteur si la condition booléenne est ``true`` ou ``false``. ``Boolean`` a été introduit ci-dessus. Si vous convertissez un vecteur en un vrai booléen, toutes les composantes du vecteur doivent être supérieures à zéro.
ja: ``Switch`` ノードは、ブール条件が ``true`` または ``false`` の場合にベクトルを返します。\ ``Boolean`` は、上記で導入されました。ベクトルを真(true)のブール値に変換する場合、ベクトルのすべての要素はゼロより上でなければなりません。
zh_cn: 如果布尔条件是 ``true`` 或 ``false`` , ``Switch`` 节点返回一个向量. ``Boolean`` 在上面介绍过. 如果你把一个向量转换为真布尔值, 那么向量的所有分量都应该高于零.

source: The ``Switch`` node is only available on the GLES3 backed. If you are targeting GLES2 devices, you cannot use ``switch`` statements.
es: El nodo ``Switch`` sólo está disponible en el respaldo de GLES3. Si usted está apuntando a los dispositivos GLES2, no puede usar las declaraciones ``switch``.
fr: Le nœud ``Switch`` n'est disponible que sur le GLES3. Si vous ciblez les appareils GLES2, vous ne pouvez pas utiliser de déclarations ``switch``.
ja: ``Switch`` ノードは、GLES3でのみ使用可能です。 GLES2デバイスをターゲットにしている場合、\ ``switch`` ステートメントは使用できません。
zh_cn: ``Switch`` 节点只有在GLES3支持的情况下才可以使用. 如果你的目标是GLES2设备, 你不能使用 ``Switch`` 语句.

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
zh_cn: 翻译状态
