Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/shaders/visual_shaders.po
Languages: de, es, fr, ja, zh_cn

source: Using VisualShaders
de: VisualShaders verwenden
es: Usando VisualShaders
fr: Utilisation de VisualShaders
zh_cn: 使用 VisualShader

source: Just as VisualScript is an alternative for users that prefer a graphical approach to coding, VisualShaders are the visual alternative for creating shaders.
de: So wie VisualScript eine Alternative für Nutzer ist, die einen grafischen Ansatz für die Codierung bevorzugen, sind VisualShader die visuelle Alternative zum Erstellen von Shadern.
es: Así como VisualScript es una alternativa para los usuarios que prefieren un enfoque gráfico de la codificación, los VisualShaders son la alternativa visual para crear shaders.
fr: Tout comme VisualScript est une alternative pour les utilisateurs qui préfèrent une approche graphique du code, VisualShaders est l'alternative visuelle pour créer des shaders.
ja: VisualScriptがコーディングにグラフィカルなアプローチを好むユーザーの代替手段であるように、VisualShadersはシェーダーを作成するための視覚的な代替手段です。
zh_cn: 就像 VisualScript 是喜欢用图形化方法进行编码的用户的选择一样，VisualShader 是创建着色器的可视化选择。

source: As shaders are inherently linked to visuals, the graph-based approach with previews of textures, materials, etc. offers a lot of additional convenience compared to purely script-based shaders. On the other hand, VisualShaders do not expose all features of the shader script and using both in parallel might be necessary for specific effects.
es: Dado que los shaders están intrínsecamente ligados a lo visual, el enfoque basado en gráficos con vistas previas de texturas, materiales, etc. ofrece mucha más comodidad en comparación con los shaders basados puramente en scripts. Por otra parte, los VisualShaders no exponen todas las características del script de los shaders y el uso de ambos en paralelo podría ser necesario para efectos específicos.
fr: Les shaders étant intrinsèquement liés aux visuels, l'approche graphique avec aperçu des textures, des matériaux, etc. offre beaucoup plus de commodité que les shaders purement basés sur des scripts. D'autre part, les VisualShaders n'exposent pas toutes les caractéristiques du script de shader et l'utilisation des deux en parallèle peut être nécessaire pour des effets spécifiques.
ja: シェーダーは本質的にビジュアルにリンクされているため、テクスチャ、マテリアルなどのプレビューを使用したグラフベースのアプローチは、純粋にスクリプトベースのシェーダーと比較してさらに多くの利便性を提供します。一方、VisualShaderはシェーダースクリプトのすべての機能を公開するわけではなく、特定の効果のために両方を同時に使用する必要がある場合があります。
zh_cn: 由于着色器本质上与视觉效果有联系, 与纯粹基于脚本的着色器相比, 基于图的方式, 有纹理, 材质等的预览, 提供了很多额外的便利. 另一方面,VisualShaders并没有暴露出着色器脚本的所有功能, 对于特定的效果, 并行使用两者可能是必要的.

source: If you are not familiar with shaders, start by reading :ref:`doc_introduction_to_shaders`.
es: Si no estás familiarizado con los shaders, comienza leyendo :ref:`doc_introduction_to_shaders`.
fr: Si vous n'êtes pas familier avec les shaders, commencez par lire :ref:`doc_introduction_to_shaders`.
zh_cn: 如果你对着色器不熟悉，可以从阅读 :ref:`doc_introduction_to_shaders` 开始。

source: Creating a VisualShader
de: Erstellen eines VisualShader
es: Creando un VisualShader
fr: Création d'un VisualShader
ja: VisualShader(ビジュアルシェーダー)の作成
zh_cn: 创建 VisualShader

source: VisualShaders can be created in any :ref:`class_ShaderMaterial`. To begin using VisualShaders, create a new ``ShaderMaterial`` in an object of your choice.
es: Los VisualShaders pueden ser creados en cualquier :ref:`class_ShaderMaterial`. Para empezar a usar VisualShaders, crea un nuevo ``ShaderMaterial`` en un objeto de tu elección.
fr: Les VisualShaders peuvent être créés dans n'importe quel :ref:`class_ShaderMaterial`. Pour commencer à utiliser les VisualShaders, créez un nouveau ``ShaderMaterial`` dans un objet de votre choix.
ja: VisualShaderは、任意の :ref:`class_ShaderMaterial` で作成できます。 VisualShaderの使用を開始するには、選択したオブジェクトに新しい ``ShaderMaterial`` を作成します。
zh_cn: VisualShader 可以在任何 :ref:`class_ShaderMaterial` 中创建。要开始使用 VisualShader，请在你选择的对象中创建一个新的 ``ShaderMaterial``\ 。

source: Then assign a :ref:`class_VisualShader` resource to the ``Shader`` property.
de: Weisen Sie dann der Eigenschaft ``Shader`` eine Ressource :ref:`class_VisualShader` zu.
es: Entonces asigna un recurso :ref:`class_VisualShader`` a la propiedad ``Shader``.
fr: Ensuite, attribuez une ressource :ref:`class_VisualShader` à la propriété ``Shader``.
ja: 次に、\ :ref:`class_VisualShader` リソースを ``Shader`` プロパティに割り当てます。
zh_cn: 然后将一个 :ref:`class_VisualShader` 资源分配给 ``Shader`` 属性。

source: Click on the new ``VisualShader`` resource and the Visual Shader Editor will open automatically. The layout of the Visual Shader Editor comprises two parts: the upper toolbar and the graph itself.
es: Haz clic en el nuevo recurso ``VisualShader`` y el Editor de Shaders Visuales se abrirá automáticamente. El diseño del Editor de Shaders Visuales consta de dos partes: la barra de herramientas superior y el gráfico en sí.
fr: Cliquez sur la nouvelle ressource ``VisualShader`` et l'éditeur Visual Shader s'ouvrira automatiquement. La présentation de l'éditeur Visual Shader comprend deux parties : la barre d'outils supérieure et le graphique lui-même.
ja: 新しい ``VisualShader`` リソースをクリックすると、ビジュアルシェーダーエディタが自動的に開きます。ビジュアルシェーダーエディタのレイアウトは、上部のツールバーとグラフ自体の2つの部分で構成されています。
zh_cn: 点击新的 ``VisualShader`` 资源，Visual Shader 编辑器就会自动打开。Visual Shader 编辑器的布局包括两部分：上层工具栏和图表本身。

source: From left to right in the toolbar:
de: Von links nach rechts in der Werkzeugleiste:
es: De izquierda a derecha en la barra de herramientas:
fr: De gauche à droite dans la barre d'outils :
ja: ツールバーの左から右へ:
zh_cn: 在工具栏中从左到右：

source: The ``Add Node`` button displays a popup menu to let you add nodes to the shader graph.
es: El botón ``Add Node`` muestra un menú emergente que te permite añadir nodos al gráfico shader.
fr: Le bouton ``Add Node`` affiche un menu contextuel pour vous permettre d'ajouter des nœuds au graphe de shaders.
ja: ``ノードを追加...`` ボタンは、シェーダーグラフにノードを追加できるポップアップメニューを表示します。
zh_cn: ``添加节点`` 按钮会显示一个弹出式菜单，让你为着色器图添加节点。

source: The drop-down menu is the shader type: Vertex, Fragment and Light. Like for script shaders, it defines what built-in nodes will be available.
de: Das Aufklappmenü ist der Shader-Typ: Vertex, Fragment und Licht. Wie bei Skript-Shadern definiert es, welche eingebauten Nodes verfügbar sein werden.
es: El menú desplegable es del tipo shader: Vértice, Fragmento y Luz. Al igual que para los shaders de script, define qué nodos incorporados estarán disponibles.
fr: Le menu déroulant est le type de shader : Vertex, Fragment et Lumière. Comme pour les shaders script, il définit les nœuds intégrés qui seront disponibles.
ja: ドロップダウンメニューは、シェーダータイプ(頂点、フラグメント、Light)です。スクリプトシェーダーの場合と同様に、使用可能なビルトインノードを定義します。
zh_cn: 下拉菜单是着色器类型. 顶点, 碎片和光线和脚本着色器一样, 它定义了哪些内置节点将是可用的.

source: The following buttons and number input control the zooming level, grid snapping and distance between grid lines (in pixels).
de: Die folgenden Schaltflächen und die Zahleneingabe steuern die Zoomstufe, das Einrasten des Gitters und den Abstand zwischen den Gitterlinien (in Pixel).
es: Los siguientes botones y la entrada de números controlan el nivel de zoom, el ajuste de la cuadrícula y la distancia entre las líneas de la cuadrícula (en píxeles).
fr: Les boutons suivants et la saisie de chiffres contrôlent le niveau de zoom, l'accrochage à la grille et la distance entre les lignes de la grille (en pixels).
ja: 次のボタンと数値入力は、ズームレベル、グリッドスナップ、グリッドライン間の距離(ピクセル単位)を制御します。
zh_cn: 下面的按钮和数字输入控制缩放级别, 网格捕捉和网格线之间的距离(单位为像素).

source: The last icon shows the generated shader code corresponding to your graph.
de: Das letzte Symbol zeigt den generierten Shader-Code, der dem Diagramm entspricht.
es: El último icono muestra el código de shader generado correspondiente a tu gráfico.
fr: La dernière icône affiche le code du shader généré correspondant à votre graphique.
ja: 最後のアイコンは、グラフに対応する生成されたシェーダーコードを示しています。
zh_cn: 最后一个图标显示了与你的图形对应生成的着色器代码.

source: Although VisualShaders do not require coding, they share the same logic with script shaders. It is advised to learn the basics of both to have a good understanding of the shading pipeline.
de: Obwohl VisualShaders kein Coding erfordern, teilen sie dieselbe Logik mit Skript-Shadern. Es wird empfohlen, die Grundlagen von beiden zu erlernen, um ein gutes Verständnis der Shading-Pipeline zu haben.
es: Aunque los VisualShaders no requieren codificación, comparten la misma lógica con los script shaders. Se aconseja aprender lo básico de ambos para tener una buena comprensión de la tubería de shading.
fr: Bien que les VisualShaders ne nécessitent pas de code, ils partagent la même logique que les shaders script. Il est conseillé d'apprendre les bases des deux pour avoir une bonne compréhension du pipeline de shading.
ja: VisualShaderはコーディングを必要としませんが、スクリプトシェーダーと同じロジックを共有します。シェーディングパイプラインを十分に理解するために、両方の基本を学ぶことをお勧めします。
zh_cn: 虽然 VisualShader 不需要编码，但它们与脚本着色器有着相同的逻辑。建议学习这两者的基础知识，以便对着色管道有一个很好的理解。

source: The visual shader graph is converted to a script shader behind the scene, and you can see this code by pressing the last button in the toolbar. This can be convenient to understand what a given node does and how to reproduce it in scripts.
de: Das visuelle Shader-Diagramm wird im Hintergrund in einen Skript-Shader umgewandelt. Sie können diesen Code sehen, indem Sie den letzten Knopf in der Symbolleiste drücken. Dies kann praktisch sein um zu verstehen, was ein bestimmtes Node tut und wie man ihn in Skripten reproduzieren kann.
es: El gráfico shader visual se convierte en un script shader detrás de la escena, y puedes ver este código pulsando el último botón de la barra de herramientas. Esto puede ser conveniente para entender lo que hace un nodo dado y cómo reproducirlo en los scripts.
fr: Le graphique du visual shader est converti en un script shader en arrière-plan, et vous pouvez voir ce code en appuyant sur le dernier bouton de la barre d'outils. Cela peut être pratique pour comprendre ce que fait un nœud donné et comment le reproduire dans des scripts.
ja: ビジュアルシェーダーグラフは、背後でスクリプトシェーダーに変換されます。ツールバーの最後のボタンを押すと、このコードを表示できます。これは、特定のノードが何をするか、スクリプトでそれを再現する方法を理解するのに便利です。
zh_cn: 可视化的着色器图形在场景后台转换为脚本着色器, 按下工具栏上的最后一个按钮就可以看到代码. 这可以方便理解特定节点的作用, 以及如何在脚本中呈现.

source: Using the Visual Shader Editor
de: Verwendung des visuellen Shader-Editors
es: Usando el Editor Visual de Shaders
fr: Utilisation de l'éditeur Visual Shader
ja: ビジュアルシェーダーエディタの使用
zh_cn: 使用 Visual Shader 编辑器

source: By default, every new ``VisualShader`` will have an output node. Every node connection ends at one of the output node's sockets. A node is the basic unit to create your shader. To add a new node, click on the ``Add Node`` button on the upper left corner or right click on any empty location in the graph, and a menu will pop up.
de: Standardmäßig wird jeder neue ``VisualShader`` ein Ausgabe-Node haben. Jede Nodeverbindung endet an einem der Socket des Ausgangsnodes. Ein Node ist die Basiseinheit zur Erstellung eines Shaders. Um ein neues Node hinzuzufügen, klicken Sie auf die Schaltfläche ``Add Node`` in der oberen linken Ecke oder klicken mit der rechten Maustaste auf eine beliebige leere Stelle im Graphen und ein Menü öffnet sich.
es: Por defecto, cada nuevo ``VisualShader`` tendrá un nodo de salida. Cada conexión de nodo termina en una de las tomas del nodo de salida. Un nodo es la unidad básica para crear tu shader. Para añadir un nuevo nodo, haz clic en el botón ``Add Node`` de la esquina superior izquierda o haz clic con el botón derecho del ratón en cualquier lugar vacío del gráfico, y aparecerá un menú.
fr: Par défaut, chaque nouveau ``VisualShader`` aura un nœud de sortie. Chaque connexion de nœud se termine par une des prises du nœud de sortie. Un nœud est l'unité de base pour créer votre shader. Pour ajouter un nouveau nœud, cliquez sur le bouton ``Add Node`` dans le coin supérieur gauche ou cliquez avec le bouton droit sur un emplacement vide du graphique, et un menu apparaîtra.
ja: デフォルトでは、すべての新しい ``VisualShader`` には出力ノードがあります。すべてのノード接続は、出力ノードのソケットの1つで終了します。ノードは、シェーダーを作成するための基本単位です。新しいノードを追加するには、左上隅の[ノードの追加]ボタンをクリックするか、グラフ内の空の場所を右クリックすると、メニューがポップアップ表示されます。
zh_cn: 默认情况下, 每个新的 ``VisualShader`` 都会有一个输出节点. 每个节点的连接都在输出节点的一个套接处结束. 节点是创建着色器的基本单元. 要添加一个新的节点, 点击左上角的 ``添加节点`` 按钮, 或者在图形中的任何一个空的位置上右击, 就会弹出一个菜单.

source: This popup has the following properties:
de: Das Popup zeigt die folgenden Eigenschaften an:
es: Esta ventana tiene las siguientes propiedades:
fr: Ce popup a les propriétés suivantes :
ja: このポップアップには次のプロパティがあります。
zh_cn: 此弹出窗口具有以下属性:

source: If you right-click on the graph, this menu will be called at the cursor position and the created node, in that case, will also be placed under that position; otherwise, it will be created at the graph's center.
de: Wenn Sie mit der rechten Maustaste auf den Graphen klicken, wird dieses Menü an der Cursorposition aufgerufen und das erzeugte Node wird in diesem Fall ebenfalls unter dieser Position platziert; andernfalls wird es in der Mitte des Graphen platziert.
es: Si haces clic con el botón derecho del ratón en el gráfico, este menú se llamará en la posición del cursor y el nodo creado, en ese caso, también se colocará bajo esa posición; de lo contrario, se creará en el centro del gráfico.
fr: Si vous cliquez sur le graphique avec le bouton droit de la souris, ce menu sera appelé à la position du curseur et le nœud créé, dans ce cas, sera également placé sous cette position ; sinon, il sera créé au centre du graphique.
ja: グラフを右クリックすると、このメニューがカーソル位置で呼び出され、作成されたノードもその場合、その位置の下に配置されます。それ以外の場合は、グラフの中心に作成されます。
zh_cn: 如果你在图形上单击右键, 这个菜单将在光标位置被调出, 创建的节点, 在这种情况下, 也将被放在该位置, 否则, 将在图形的中心位置创建.

source: It can be resized horizontally and vertically allowing more content to be shown. Size transform and tree content position are saved between the calls, so if you suddenly closed the popup you can easily restore its previous state.
de: Es kann horizontal und vertikal in der Größe verändert werden, so dass mehr Inhalte angezeigt werden können. Die Größentransformation und die Position des Bauminhalts werden zwischen den Aufrufen gespeichert. Wenn also das Popup plötzlich geschlossen wird, kann man den vorherigen Zustand leicht wiederherstellen.
es: Puede ser redimensionado horizontal y verticalmente permitiendo mostrar más contenido. La transformación de tamaño y la posición del contenido del árbol se guardan entre las llamadas, así que si cierra de repente el popup puede restaurar fácilmente su estado anterior.
fr: Il peut être redimensionné horizontalement et verticalement, ce qui permet de montrer plus de contenu. La transformation de la taille et la position du contenu de l'arbre sont enregistrées entre les appels, de sorte que si vous fermez soudainement la fenêtre contextuelle, vous pouvez facilement restaurer son état précédent.
ja: 水平および垂直にサイズを変更して、より多くのコンテンツを表示できます。サイズ変換とツリーコンテンツの位置は呼び出し間で保存されるため、ポップアップを突然閉じた場合は、以前の状態を簡単に復元できます。
zh_cn: 它可以在水平和垂直方向上调整大小, 以允许显示更多的内容. 尺寸变换和树的内容位置在调用当中被保存, 所以如果突然关闭了弹出窗口, 可以很容易地恢复它以前的状态.

source: The ``Expand All`` and ``Collapse All`` options in the drop-down option menu can be used to easily list the available nodes.
de: Die Optionen ``Expand All`` und ``Collapse All`` im Aufklappmenü können verwendet werden, um die verfügbaren Nodes einfach aufzulisten.
es: Las opciones ``Expand All`` y ``Collapse All`` en el menú de opciones desplegables pueden ser usadas para listar fácilmente los nodos disponibles.
fr: Les options ``Expand All`` et ``Collapse All`` du menu déroulant peuvent être utilisées pour lister facilement les nœuds disponibles.
ja: ドロップダウンオプションメニューの[すべて展開]および[すべて折りたたむ]オプションを使用して、使用可能なノードを簡単にリストできます。
zh_cn: 下拉选项菜单中的 ``展开全部`` 和 ``折叠全部`` 选项可用于轻松列出可用节点.

source: You can also drag and drop nodes from the popup onto the graph.
de: Sie können auch Nodes aus dem Popup auf den Graphen ziehen.
es: También puedes arrastrar y soltar nodos de la ventana emergente en el gráfico.
fr: Vous pouvez également glisser et déposer des nœuds de la popup sur le graphique.
ja: また、ポップアップからグラフにノードをドラッグアンドドロップすることもできます。
zh_cn: 你也可以从弹出式菜单中拖放节点到图形上.

source: While the popup has nodes sorted in categories, it can seem overwhelming at first. Try to add some of the nodes, plug them in the output socket and observe what happens.
de: Obwohl im Popup Nodes in Kategorien sortiert ist, kann es auf den ersten Blick überwältigend erscheinen. Versuchen Sie einige der Nodes hinzuzufügen, stecken diese in den Ausgangssocket und beobachten, was passiert.
es: Aunque el popup tiene nodos clasificados en categorías, puede parecer abrumador al principio. Intenta añadir algunos de los nodos, conéctalos a la toma de salida y observa lo que sucede.
fr: Bien que le popup comporte des nœuds triés par catégories, il peut sembler écrasant au premier abord. Essayez d'ajouter certains des nœuds, branchez-les dans la prise de sortie et observez ce qui se passe.
ja: ポップアップにはカテゴリに分類されたノードがありますが、最初は圧倒されるように見えます。いくつかのノードを追加し、それらを出力ソケットに接続して、何が起こるかを観察してください。
zh_cn: 虽然弹出的节点是按类别分类的, 但一开始会不知所以. 试着添加一些节点, 将它们插入输出套接处, 观察会发生什么.

source: When connecting any ``scalar`` output to a ``vector`` input, all components of the vector will take the value of the scalar.
de: Wenn ein beliebiger ``scalar`` Ausgang mit einem ``vector`` Eingang verbunden wird, nehmen alle Komponenten des Vektors den Wert des Skalars an.
es: Al conectar cualquier salida ``scalar`` a una entrada ``vector``, todos los componentes del vector tomarán el valor del escalar.
fr: En connectant une sortie ``scalar`` à une entrée ``vector``, toutes les composantes du vecteur prendront la valeur du scalaire.
ja: いずれかの ``scalar`` 出力を ``vector`` 入力に接続すると、ベクトルのすべての要素がスカラーの値を取ります。
zh_cn: 当把任何 ``scalar`` 输出连接到 ``vector`` 输入时, 向量的所有分量将取标量的值.

source: When connecting any ``vector`` output to a ``scalar`` input, the value of the scalar will be the average of the vector's components.
de: Wenn ein beliebiger ``vector`` Ausgang mit einem ``scalar`` Eingang verbunden wird, ist der Wert des Skalars der Mittelwert der Komponenten des Vektors.
es: Cuando se conecta cualquier salida ``vector`` a una entrada ``scalar``, el valor del escalar será el promedio de los componentes del vector.
fr: Lorsque l'on connecte une sortie ``vector`` à une entrée ``scalar``, la valeur du scalaire sera la moyenne des composantes du vecteur.
ja: ``vector`` 出力を ``scalar`` 入力に接続すると、スカラーの値はベクトルの要素の平均になります。
zh_cn: 当把任何 ``vector`` 输出连接到 ``scalar`` 输入时, 标量的值将是向量分量的平均值.

source: Visual Shader nodes
es: Nodos de Visual Shaders
fr: Nœuds Visual Shader
ja: ビジュアルシェーダーノード
zh_cn: 可视化着色器节点

source: Below are some special nodes that are worth knowing about. The list is not exhaustive and might be expanded with more nodes and examples.
de: Nachfolgend sind einige spezielle Nodes aufgeführt, die wissenswert sind. Die Liste ist nicht ultimativ und könnte mit weiteren Nodes und Beispielen erweitert werden.
es: Abajo hay algunos nodos especiales que vale la pena conocer. La lista no es exhaustiva y podría ampliarse con más nodos y ejemplos.
fr: Vous trouverez ci-dessous quelques nœuds spéciaux qui méritent d'être connus. La liste n'est pas exhaustive et pourrait être complétée par d'autres nœuds et exemples.
ja: 以下は、知っておく価値のある特別なノードです。このリストは完全なものではなく、より多くのノードと例で展開される場合があります。
zh_cn: 以下是一些值得了解的特殊节点. 该清单并非详尽无遗, 可能会增加更多的节点和示例.

source: Expression node
es: Nodo Expression
fr: Nœud d'expression
ja: 式ノード(Expression Node)
zh_cn: Expression 节点

source: The ``Expression`` node allows you to write Godot Shading Language (GLSL-like) expressions inside your visual shaders. The node has buttons to add any amount of required input and output ports and can be resized. You can also set up the name and type of each port. The expression you have entered will apply immediately to the material (once the focus leaves the expression text box). Any parsing or compilation errors will be printed to the Output tab. The outputs are initialized to their zero value by default. The node is located under the Special tab and can be used in all shader modes.
es: El nodo ``Expression`` te permite escribir expresiones del Lenguaje de Shader Godot (similar al GLSL) dentro de tus shader visuales. El nodo tiene botones para añadir cualquier cantidad de puertos de entrada y salida necesarios y puede ser redimensionado. También puedes configurar el nombre y el tipo de cada puerto. La expresión que hayas introducido se aplicará inmediatamente al material (una vez que el foco abandone el cuadro de texto de la expresión). Cualquier error de análisis sintáctico o de compilación se imprimirá en la pestaña Salida. Las salidas se inicializan con su valor cero por defecto. El nodo se encuentra en la pestaña Especial y puede utilizarse en todos los modos de shader.
fr: Le nœud ``Expression`` vous permet d'écrire des expressions en langage Godot Shading (GLSL-like) à l'intérieur de vos shaders visuels. Le nœud dispose de boutons permettant d'ajouter n'importe quel nombre de ports d'entrée et de sortie requis et peut être redimensionné. Vous pouvez également définir le nom et le type de chaque port. L'expression que vous avez saisie s'appliquera immédiatement au matériau (une fois que le focus aura quitté la zone de texte de l'expression). Toute erreur d'analyse ou de compilation sera imprimée dans l'onglet Output. Les sorties sont initialisées par défaut à leur valeur zéro. Le nœud est situé sous l'onglet Spécial et peut être utilisé dans tous les modes de shaders.
ja: ``Expression`` ノードを使用すると、ビジュアルシェーダー内にGodot Shading Language(GLSLのような)式を記述できます。ノードには、必要な量の入力ポートと出力ポートを追加するボタンがあり、サイズを変更できます。各ポートの名前とタイプを設定することもできます。入力した式は、すぐにマテリアルに適用されます(フォーカスが式テキストボックスを離れると)。解析エラーまたはコンパイルエラーは、[出力]タブに出力されます。出力はデフォルトでゼロ値に初期化されます。このノードは[Special]タブの下にあり、すべてのシェーダーモードで使用できます。
zh_cn: ``Expression`` 节点允许你在视觉着色器中编写 Godot 着色语言(GLSL-like)表达式. 该节点具有添加任意数量的所需输入和输出端口的按钮, 并且可以调整其大小. 你还可以设置每个端口的名称和类型. 输入的表达式将立即应用于材质(焦点离开表达式文本框后). 任何解析或编译错误都将打印到 "输出" 选项卡. 默认情况下, 输出初始化为零值. 该节点位于 "特殊" 选项卡下, 可用于所有着色器模式.

source: The possibilities of this node are almost limitless – you can write complex procedures, and use all the power of text-based shaders, such as loops, the ``discard`` keyword, extended types, etc. For example:
es: Las posibilidades de este nodo son casi ilimitadas - puedes escribir procedimientos complejos, y usar todo el poder de los shaders basados en texto, como los bucles, la palabra clave ``discard``, los tipos extendidos, etc. Por ejemplo:
fr: Les possibilités de ce nœud sont presque illimitées - vous pouvez écrire des procédures complexes, et utiliser toute la puissance des shaders basés sur le texte, tels que les boucles, le mot-clé ``discard``, les types étendus, etc. Par exemple :
ja: このノードの可能性はほとんど無限です。複雑な手順を記述し、ループ、\ ``discard`` キーワード、拡張タイプなどのテキストベースのシェーダーのすべての機能を使用できます。次に例を示します:
zh_cn: 这个节点的可能性几乎无穷无尽 —— 你可以编写复杂的过程, 并使用基于文本的着色器的全部力量, 例如循环, 关键字 ``discard`` , 扩展类型, 等等. 例如:

source: Fresnel node
es: Nodo Fresnel
fr: Nœud Fresnel
ja: フレネルノード
zh_cn: Fresnel 结点
