Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/viewports.po
Languages: de, es, ja

source: It is possible to query a capture of the :ref:`Viewport <class_Viewport>` contents. For the root :ref:`Viewport <class_Viewport>`, this is effectively a screen capture. This is done with the following code:
de: Es ist möglich, eine Erfassung des Inhalts von :ref:`Viewport <class_Viewport>` abzufragen. Für den Wurzel :ref:`Viewport <class_Viewport>` ist dies effektiv eine Bildschirmaufnahme. Dies geschieht mit folgendem Code:
es: Es posible consultar una captura del contenido de :ref:`Viewport <class_Viewport>`. Para la raíz :ref:`Viewport <class_Viewport>`, esto es efectivamente una captura de pantalla. Esto se hace con el siguiente código:
ja: :ref:`Viewport <class_Viewport>` コンテンツのキャプチャをクエリすることが可能です。ルート :ref:`Viewport <class_Viewport>` の場合、これは事実上画面キャプチャです。これは、次のコードで実行されます:

source: But if you use this in ``_ready()`` or from the first frame of the :ref:`Viewport's <class_Viewport>` initialization, you will get an empty texture because there is nothing to get as texture. You can deal with it using (for example):
de: Wenn Sie dies jedoch in ``_ready()`` oder ab dem ersten Frame der :ref:`Viewport's <class_Viewport>` Initialisierung verwenden, erhalten Sie eine leere Textur, da nichts für eine Textur da ist. Sie können dies beispielsweise so handhaben:
es: Pero si usas esto en ``_ready()`` o desde el primer fotograma de la inicialización :ref:`Viewport's <class_Viewport>`, obtendrás una textura vacía porque no hay nada que obtener como textura. Puedes tratarlo usando (por ejemplo):
ja: しかし、これを ``_ready()`` で、または :ref:`Viewport <class_Viewport>` 初期化の最初のフレームから使用すると、テクスチャとして取得するものがないため、空のテクスチャを取得します。これは(例)を使用して対処できます:

source: Viewport Container
es: Contenedor del Viewport
ja: ビューポートコンテナ

source: If the :ref:`Viewport <class_Viewport>` is a child of a :ref:`ViewportContainer <class_viewportcontainer>`, it will become active and display anything it has inside. The layout looks like this:
de: Wenn der :ref:`Viewport <class_Viewport>` ein untergeordnetes Element eines :ref:`ViewportContainer <class_viewportcontainer>` ist, wird es aktiv und zeigt seinen gesamten Inhalt an. Das Layout sieht folgendermaßen aus:
es: Si el :ref:`Viewport <class_Viewport>` es hijo de un :ref:`ViewportContainer <class_viewportcontainer>`, se activará y mostrará todo lo que tenga dentro. El diseño se ve así:
ja: :ref:`Viewport <class_Viewport>` が:ref:`ViewportContainer <class_viewportcontainer>` の子である場合、アクティブになり、内部にあるものをすべて表示します。レイアウトは次のようになります:

source: The :ref:`Viewport <class_Viewport>` will cover the area of its parent :ref:`ViewportContainer <class_viewportcontainer>` completely if :ref:`Stretch<class_viewportcontainer_property_stretch>` is set to ``true`` in :ref:`ViewportContainer <class_viewportcontainer>`. Note: The size of the :ref:`ViewportContainer <class_viewportcontainer>` cannot be smaller than the size of the :ref:`Viewport <class_Viewport>`.
de: Der :ref:`Viewport <class_Viewport>` deckt den Bereich seines übergeordneten :ref:`ViewportContainer <class_viewportcontainer>` vollständig ab, wenn :ref:`Stretch <class_viewportcontainer_property_stretch>` in :ref:`ViewportContainer <class_viewportcontainer>` auf ` `true`` gesetzt ist. Hinweis: Die Größe des :ref:`ViewportContainer <class_viewportcontainer>` darf nicht kleiner sein als die Größe des :ref:`Viewport <class_Viewport>`.
es: El :ref:`Viewport <class_Viewport>` abarcará completamente el área de su padre :ref:`ViewportContainer <class_viewportcontainer>` si :ref:`Stretch<class_viewportcontainer_property_stretch>` está ajustado a ``true`` en :ref:`ViewportContainer <class_viewportcontainer>`. Nota: El tamaño del :ref:`ViewportContainer <class_viewportcontainer>` no puede ser menor que el tamaño del :ref:`Viewport <class_Viewport>`.
ja: :ref:`Stretch <class_viewportcontainer_property_stretch>` が :ref:`ViewportContainer <class_viewportcontainer>` で ``true`` に設定されている場合、\ :ref:`Viewport <class_Viewport>` は、その親 :ref:`ViewportContainer <class_viewportcontainer>` の領域を完全にカバーします。注: :ref:`ViewportContainer <class_viewportcontainer>` のサイズは、\ :ref:`Viewport <class_Viewport>` のサイズより小さくすることはできません。

source: Rendering
de: Rendern
es: Renderización
ja: レンダリング

source: Due to the fact that the :ref:`Viewport <class_Viewport>` is an entryway into another rendering surface, it exposes a few rendering properties that can be different from the project settings. The first is MSAA; you can choose to use a different level of MSAA for each :ref:`Viewport <class_Viewport>`; the default behavior is DISABLED. You can also set the :ref:`Viewport <class_Viewport>` to use HDR, HDR is very useful for when you want to store values in the texture that are outside the range 0.0 - 1.0.
de: Aufgrund der Tatsache, dass das :ref:`Viewport <class_Viewport>` in eine andere Rendering-Oberfläche übergehen kann, werden einige Rendering-Eigenschaften verfügbar gemacht, die von den Projekteinstellungen abweichen können. Der erste ist MSAA; Sie können für jeden :ref:`Viewport <class_Viewport>` eine andere MSAA-Stufe verwenden; Das Standardverhalten ist DEAKTIVIERT. Sie können auch einen :ref:`Viewport <class_Viewport>` HDR verwenden lassen. HDR ist sehr nützlich, wenn Sie Werte in der Textur speichern möchten, die außerhalb des Bereichs von 0,0 bis 1,0 liegen.
es: Debido al hecho de que el :ref:`Viewport <class_Viewport>` es una entrada a otra superficie de renderizado, expone unas cuantas propiedades de renderizado que pueden ser diferentes de la configuración del proyecto. La primera es MSAA; puedes elegir usar un nivel diferente de MSAA para cada :ref:`Viewport <class_Viewport>`; el comportamiento por defecto es DISABLED. También puedes establecer el :ref:`Viewport <class_Viewport>` para usar HDR, HDR es muy útil para cuando quieras almacenar valores en la textura que estén fuera del rango 0.0 - 1.0.
ja: :ref:`Viewport <class_Viewport>` は別のレンダリングサーフェスへの入り口であるという事実により、プロジェクト設定とは異なるいくつかのレンダリングプロパティを公開します。最初はMSAAです。\ :ref:`Viewport <class_Viewport>` ごとに異なるレベルのMSAAを使用することを選択できます。デフォルトの動作は無効です。HDRを使用するように :ref:`Viewport <class_Viewport>` を設定することもできます。HDRは、0.0〜1.0の範囲外のテクスチャに値を保存する場合に非常に役立ちます。

source: If you know how the :ref:`Viewport <class_Viewport>` is going to be used, you can set its Usage to either 3D or 2D. Godot will then restrict how the :ref:`Viewport <class_Viewport>` is drawn to in accordance with your choice; default is 3D. The 2D usage mode is slightly faster and uses less memory compared to the 3D one. It's a good idea to set the :ref:`Viewport <class_Viewport>`'s Usage property to 2D if your viewport doesn't render anything in 3D.
de: Wenn Sie bereits wissen wie ein :ref:`Viewport <class_Viewport>` verwendet wird, können Sie einstellen ob es entweder für 3D oder 2D genutzt werden soll. Godot wird dann einschränken, wie der :ref:`Viewport <class_Viewport>` gemäß Ihrer Wahl gezeichnet wird; Standard ist 3D. Der 2D-Nutzungsmodus ist etwas schneller und benötigt weniger Speicher als der 3D-Modus. Es ist eine gute Idee, die Nutzungs-Eigenschaft von :ref:`Viewport <class_Viewport>` auf 2D zu setzen, wenn Ihr Ansichtsfenster nichts in 3D rendert.
es: Si sabes cómo se va a usar el :ref:`Viewport <class_Viewport>`, puedes establecer su uso en 3D o 2D. Godot restringirá entonces cómo se dibuja el :ref:`Viewport <class_Viewport>` de acuerdo a tu elección; por defecto es 3D. El modo de uso 2D es ligeramente más rápido y utiliza menos memoria en comparación con el 3D. Es una buena idea establecer la propiedad de uso de :ref:`Viewport <class_Viewport>` a 2D si tu viewport no renderiza nada en 3D.
ja: :ref:`Viewport <class_Viewport>` の使用方法がわかっている場合、その使用法を3Dまたは2Dに設定できます。Godotは、選択に従って :ref:`Viewport <class_Viewport>` の描画方法を制限します。デフォルトは3Dです。2D使用モードは、3Dに比べてわずかに高速であり、使用するメモリも少なくなります。ビューポートが3Dで何もレンダリングしない場合は、\ :ref:`Viewport <class_Viewport>` のUsageプロパティを2Dに設定することをお勧めします。

source: If you need to render 3D shadows in the viewport, make sure to set the viewport's *Shadow Atlas Size* property to a value higher than 0. Otherwise, shadows won't be rendered. For reference, the Project Settings define it to 4096 by default.
de: Wenn Sie 3D-Schatten im Ansichtsfenster rendern müssen, stellen Sie sicher, dass die Eigenschaft *Schattenatlasgröße* des Ansichtsfensters auf einen Wert über 0 festgelegt ist. Andernfalls werden Schatten nicht gerendert. Als Referenz definieren die Projekteinstellungen standardmäßig 4096.
es: Si necesitas renderizar las sombras 3D en la ventana, asegúrate de configurar la propiedad *Shadow Atlas Size* de la ventana a un valor superior a 0. De lo contrario, las sombras no se renderizarán. Como referencia, la Configuración del proyecto lo define a 4096 por defecto.
ja: ビューポートで3Dシャドウをレンダリングする必要がある場合は、必ずビューポートの *Shadow Atlas Size* プロパティを0より大きい値に設定してください。それ以外の場合、シャドウはレンダリングされません。参考までに、プロジェクト設定ではデフォルトで4096に定義されています。

source: Godot also provides a way of customizing how everything is drawn inside :ref:`Viewports <class_Viewport>` using “Debug Draw”. Debug Draw allows you to specify one of four options for how the :ref:`Viewport <class_Viewport>` will display things drawn inside it. Debug Draw is disabled by default.
de: Godot bietet auch eine Möglichkeit, das Zeichnen innerhalb eines :ref:`Viewports <class_Viewport>` mithilfe von "Debug Draw" anzupassen . Mit Debug Draw können Sie eine von vier Optionen angeben, wie :ref:`Viewport <class_Viewport>` darin gezeichnete Objekte anzeigt. Debug Draw ist standardmäßig deaktiviert.
es: Godot también proporciona una forma de personalizar cómo se dibuja todo dentro :ref:`Viewports <class_Viewport>` usando "Debug Draw". Debug Draw permite especificar una de las cuatro opciones de cómo el :ref:`Viewport <class_Viewport>` mostrará las cosas dibujadas dentro de él. Debug Draw está desactivado por defecto.
ja: Godotは、「デバッグ描画」を使用して :ref:`Viewport <class_Viewport>` 内にすべてを描画する方法をカスタマイズする方法も提供します。デバッグ描画では、\ :ref:`Viewport <class_Viewport>` が内部に描画されたものを表示する方法について、4つのオプションのいずれかを指定できます。デバッグ描画はデフォルトで無効になっています。

source: *A scene drawn with Debug Draw disabled*
de: *Eine Szene mit deaktiviertem Debug Draw*
es: *Una escena dibujada con Debug Draw desactivado*
ja: *デバッグ描画を無効にして描画されたシーン*

source: The other three options are Unshaded, Overdraw, and Wireframe. Unshaded draws the scene without using lighting information so all the objects appear flatly colored the color of their albedo.
de: Die anderen drei Optionen sind Unschattiert, Überzeichnet und Drahtgitter. Unschattiert zeichnet die Szene ohne Verwendung von Beleuchtungsinformationen, sodass alle Objekte einfach in der Albedo-Farbe erscheinen.
es: Las otras tres opciones son sin sombra, sobregirado y alambrado. Unshaded dibuja la escena sin usar la información de la iluminación, así que todos los objetos aparecen coloreados de forma plana del color de su albedo.
ja: 他の3つのオプションは、シェーディングなし、オーバードロー、ワイヤーフレームです。シェーディングなしは、照明情報を使用せずにシーンを描画するため、すべてのオブジェクトはアルベドの色と同じ均一な色で表示されます。

source: *The same scene with Debug Draw set to Unshaded*
de: *Dieselbe Szene mit Debug Draw auf Unschattiert eingestellt*
es: *La misma escena con Debug Draw ajustada a Unshaded*
ja: *デバッグ描画がUnshadedに設定された同じシーン*

source: Overdraw draws the meshes semi-transparent with an additive blend so you can see how the meshes overlap.
de: Durch Überzeichnen werden die Meshes mit einer additiven Mischung halbtransparent gezeichnet, sodass die Meshes überlappt erscheinen.
es: El sobredimensionamiento dibuja las mallas semitransparentes con una mezcla de aditivos para poder ver cómo se superponen las mallas.
ja: Overdrawは、追加ブレンドを使用して半透明のメッシュを描画するため、メッシュがどのように重なり合っているかを確認できます。

source: *The same scene with Debug Draw set to Overdraw*
de: *Dieselbe Szene mit Debug Draw auf Überzeichnet eingestellt*
es: *La misma escena con Debug Draw puesta en Overdraw*
ja: *デバッグ描画をOverdrawに設定した同じシーン*

source: Lastly, Wireframe draws the scene using only the edges of triangles in the meshes.
de: Zuletzt zeichnet Drahtgitter die Szene nur mit den Dreieckskanten in den Meshes.
es: Por último, Wireframe dibuja la escena usando sólo los bordes de los triángulos en las mallas.
ja: 最後に、Wireframeはメッシュ内の三角形のエッジのみを使用してシーンを描画します。

source: The effects of the Wireframe mode are only visible in the editor, not while the project is running.
de: Die Auswirkungen des Drahtgitter-Modus sind nur im Editor sichtbar, nicht während das Projekt ausgeführt wird.
es: Los efectos del modo Wireframe sólo son visibles en el editor, no mientras el proyecto está en marcha.
ja: ワイヤフレームモードの効果は、プロジェクトの実行中ではなく、エディタでのみ表示されます。

source: Render target
de: Ziel rendern
es: Renderizar el objetivo
ja: レンダーターゲット

source: When rendering to a :ref:`Viewport <class_Viewport>`, whatever is inside will not be visible in the scene editor. To display the contents, you have to draw the :ref:`Viewport's <class_Viewport>` :ref:`ViewportTexture <class_ViewportTexture>` somewhere. This can be requested via code using (for example):
de: Beim Rendern in einem :ref:`Viewport <class_Viewport>` wird nichts was sich im Szeneneditor befindet angezeigt. Um den Inhalt anzuzeigen, müssen Sie irgendwo die :ref:`ViewportTexture <class_ViewportTexture>` im :ref:`Viewports <class_Viewport>`zeichnen. Dies kann per Code angefordert werden mit (zum Beispiel):
es: Al renderizar a un :ref:`Viewport <class_Viewport>`, lo que esté dentro no será visible en el editor de escenas. Para mostrar el contenido, tienes que dibujar el :ref:`Viewport's <class_Viewport>` :ref:`ViewportTexture <class_ViewportTexture>` en algún lugar. Esto se puede solicitar mediante un código usando (por ejemplo):
ja: :ref:`Viewport <class_Viewport>` にレンダリングする場合、内部のものはシーンエディタに表示されません。内容を表示するには、\ :ref:`Viewport <class_Viewport>` :ref:`ViewportTexture <class_ViewportTexture>` をどこかに描画する必要があります。これは、次のコードを使用してリクエストできます(例):

source: Or it can be assigned in the editor by selecting "New ViewportTexture"
de: Oder es kann im Editor durch Auswahl von "Neue ViewportTextur" zugewiesen werden
es: O se puede asignar en el editor seleccionando "New ViewportTexture"
ja: または、「新規ViewportTexture」を選択してエディタで割り当てることができます

source: and then selecting the :ref:`Viewport <class_Viewport>` you want to use.
de: und wählen Sie dann den gewünschten :ref:`Viewport <class_Viewport>` aus.
es: y luego seleccionando el :ref:`Viewport <class_Viewport>` que quieres usar.
ja: そして、使用したい :ref:`Viewport <class_Viewport>` を選択します。

source: Every frame, the :ref:`Viewport <class_Viewport>`'s texture is cleared away with the default clear color (or a transparent color if :ref:`Transparent Bg<class_Viewport_property_transparent_bg>` is set to ``true``). This can be changed by setting :ref:`Clear Mode<class_Viewport_property_render_target_clear_mode>` to Never or Next Frame. As the name implies, Never means the texture will never be cleared, while next frame will clear the texture on the next frame and then set itself to Never.
de: In jedem Frame wird die Textur des :ref:`Viewport <class_Viewport>` mit der standardmäßigen Lösch-Farbe gelöscht (oder eine transparente Farbe, wenn :ref:`Transparent Bg <class_Viewport_property_transparent_bg>` auf ``true`` gesetzt ist). Dies kann geändert werden, indem :ref:`Clear Mode<class_Viewport_property_render_target_clear_mode>` auf Niemals oder Nächster Frame gesetzt wird. Wie der Name schon sagt bedeutet Niemals, dass die Textur niemals gelöscht wird, während Nächster Frame die Textur im nächsten Frame löscht und sich dann auf Niemals setzt.
es: Cada cuadro, la textura de :ref:`Viewport <class_Viewport>` se borra con el color claro por defecto (o un color transparente si :ref:`Transparent Bg<class_Viewport_property_transparent_bg>` se establece en ``true``). Esto se puede cambiar poniendo :ref:`Clear Mode<class_Viewport_property_render_target_clear_mode>` en Never o Next Frame. Como su nombre lo indica, Never significa que la textura nunca se borrará, mientras que el siguiente cuadro borrará la textura en el siguiente cuadro y luego se establecerá en Never.

source: By default, re-rendering of the :ref:`Viewport <class_Viewport>` happens when the :ref:`Viewport <class_Viewport>`'s :ref:`ViewportTexture <class_ViewportTexture>` has been drawn in a frame. If visible, it will be rendered; otherwise, it will not. This behavior can be changed to manual rendering (once), or always render, no matter if visible or not. This flexibility allows users to render an image once and then use the texture without incurring the cost of rendering every frame.
de: Standardmäßig erfolgt das erneute Rendern des :ref:`Viewport <class_Viewport>` wenn die :ref:`ViewportTexture <class_ViewportTexture>` des :ref:`Viewport <class_Viewport>` in einem Frame gezeichnet wurde. Wenn sichtbar wird es gerendert, andernfalls eben nicht. Dieses Verhalten kann geändert werden in manuelles rendern (einmal) oder immer rendern, unabhängig ob es sichtbar ist oder nicht. Diese Flexibilität ermöglicht es Benutzern, ein Bild einmal zu rendern und dann die Textur zu verwenden, ohne die Kosten für das Rendern in jedem Frame zu verursachen.
es: Por defecto, la renderización de :ref:`Viewport <class_Viewport>` ocurre cuando el :ref:`Viewport <class_Viewport>`'s :ref:`ViewportTexture <class_ViewportTexture>` ha sido dibujado en un marco. Si es visible, se renderizará; de lo contrario, no lo hará. Este comportamiento puede cambiarse a renderizado manual (una vez), o siempre renderizado, sin importar si es visible o no. Esta flexibilidad permite a los usuarios renderizar una imagen una vez y luego usar la textura sin incurrir en el costo de renderizar cada fotograma.
ja: デフォルトでは、\ :ref:`Viewport <class_Viewport>`の :ref:`Viewport <class_Viewport>` の :ref:`ViewportTexture <class_ViewportTexture>` がフレームに描画されたときに、\ :ref:`Viewport <class_Viewport>` の再レンダリングが行われます。表示されている場合、レンダリングされます。それ以外の場合はそうなりません。この動作は、手動レンダリング(1回)に変更することも、表示するかどうかに関係なく常にレンダリングすることもできます。この柔軟性により、ユーザーはイメージを一度レンダリングしてから、すべてのフレームをレンダリングするコストをかけずにテクスチャを使用できます。

source: Make sure to check the Viewport demos! Viewport folder in the demos archive available to download, or https://github.com/godotengine/godot-demo-projects/tree/master/viewport
de: Sehen Sie sich unbedingt die Viewport-Demos an! Der Viewport-Ordner im Demo-Archiv ist hier zum Herunterladen verfügbar: https://github.com/godotengine/godot-demo-projects/tree/master/viewport
es: ¡Asegúrate de revisar las demos de Viewport! Carpeta Viewport en el archivo de demos disponible para descargar, o https://github.com/godotengine/godot-demo-projects/tree/master/viewport
ja: ビューポートのデモを必ず確認してください！ダウンロード可能なデモアーカイブのビューポートフォルダ、または次 のURL https://github.com/godotengine/godot-demo-projects/tree/master/viewport

source: Translation status
es: Estado de traducción
ja: 翻訳ステータス
