Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/rendering/viewports.po
Languages: de, es, ja

source: Using Viewports
de: Verwenden von Ansichtsfenstern (Viewports)
es: Usando Viewports

source: Introduction
de: Einführung
es: Introducción
ja: はじめに

source: Think of a :ref:`Viewport <class_Viewport>` as a screen onto which the game is projected. In order to see the game, we need to have a surface on which to draw it; that surface is the Root :ref:`Viewport <class_Viewport>`.
de: Stellen Sie sich ein :ref:`Viewport <class_Viewport>` als einen Bildschirm vor, auf den das Spiel projiziert wird. Um das Spiel zu sehen brauchen wir eine Oberfläche auf der wir es zeichnen können. Diese Oberfläche ist das Wurzel-:ref:`Viewport <class_Viewport>`.
es: Piensa en las :ref:`Viewports <class_Viewport>` como una pantalla en la que se proyecta el juego. Para ver el juego necesitamos tener una superficie sobre la que dibujarlo, esta superficie es el Root :ref:`Viewport <class_Viewport>`(nodo raíz).
ja: :ref:`Viewport <class_Viewport>` は、ゲームが投影されるスクリーンと考えてください。ゲームを見るためには、それを描くための表面が必要です。その表面がルート :ref:`Viewport <class_Viewport>` です。

source: :ref:`Viewports <class_Viewport>` can also be added to the scene so that there are multiple surfaces to draw on. When we are drawing to a :ref:`Viewport <class_Viewport>` that is not the Root, we call it a render target. We can access the contents of a render target by accessing its corresponding :ref:`texture <class_ViewportTexture>`. By using a :ref:`Viewport <class_Viewport>` as a render target, we can either render multiple scenes simultaneously or we can render to a :ref:`texture <class_ViewportTexture>` which is applied to an object in the scene, for example a dynamic skybox.
de: :ref:`Viewports <class_Viewport>` können der Szene auch hinzugefügt werden, sodass mehrere Oberflächen zum Zeichnen vorhanden sind. Wenn wir auf einem :ref:`Viewport <class_Viewport>` zeichnen das nicht die Wurzel ist, nennen wir es ein Renderziel. Wir können auf den Inhalt eines Renderziels zugreifen, indem wir hierauf :ref:`texture <class_ViewportTexture>` zugreifen. Wenn Sie ein :ref:`Viewport <class_Viewport>` als Renderziel verwenden, können Sie entweder mehrere Szenen gleichzeitig rendern, oder wir können ein :ref:`texture <class_ViewportTexture>` rendern, das auf ein Objekt in der Szene angewendet wird, zum Beispiel eine dynamische Skybox.
es: Los :ref:`Viewports <class_Viewport>` también se puede añadir a la escena para que haya múltiples superficies sobre las que dibujar. Cuando estamos dibujando a un :ref:`Viewport <class_Viewport>` que no es el Root lo llamamos un render target(objetivo de renderizado). Podemos acceder al contenido de un render target accediendo a su correspondiente :ref:`Texture <class_ViewportTexture>`. Usando un :ref:`Viewport <class_Viewport>` como objetivo de render podemos renderizar múltiples escenas simultáneamente o podemos renderizar a una :ref:`Texture <class_ViewportTexture>` que se aplica a un objeto de la escena, por ejemplo un skybox dinámico.
ja: :ref:`Viewports <class_Viewport>` をシーンに追加して、複数のサーフェスを描画することもできます。ルートではない :ref:`Viewport <class_Viewport>` に描画する場合、それをレンダーターゲットと呼びます。対応する :ref:`texture <class_ViewportTexture>` にアクセスすることで、レンダーターゲットのコンテンツにアクセスできます。\ :ref:`Viewport <class_Viewport>` をレンダーターゲットとして使用することにより、複数のシーンを同時にレンダーするか、シーンのオブジェクトに適用される :ref:`texture <class_ViewportTexture>` にレンダーできますが、その例が動的なスカイボックスです。

source: :ref:`Viewports <class_Viewport>` have a variety of use cases, including:
de: :ref:`Viewports <class_Viewport>` haben viele Nutzungsmöglichkeiten, inklusive:
es: Los :ref:`Viewports <class_Viewport>` tienen una variedad de casos de uso, incluyendo:
ja: :ref:`Viewports <class_Viewport>` には、次のようなさまざまなユースケースがあります:

source: Rendering 3D objects within a 2D game
de: Rendern von 3D-Objekten in einem 2D-Spiel
es: Renderización de objetos 3D dentro de un juego 2D
ja: 2Dゲーム内での3Dオブジェクトのレンダリング

source: Rendering 2D elements in a 3D game
de: Rendern von 2D-Elementen in einem 3D-Spiel
es: Renderizar elementos 2D en un juego 3D
ja: 3Dゲームでの2D要素のレンダリング

source: Rendering dynamic textures
de: Dynamische Texturen rendern
es: Renderizado de texturas dinámicas
ja: 動的テクスチャのレンダリング

source: Generating procedural textures at runtime
de: Prozedurale Texturen zur Laufzeit generieren
es: Generación de texturas de procedimiento en tiempo de ejecución
ja: 実行時の手続き型テクスチャの生成

source: Rendering multiple cameras in the same scene
de: Rendern mehrerer Kameras in derselben Szene
es: Renderizado de varias cámaras en la misma escena
ja: 同じシーンを複数のカメラでレンダリングする

source: What all these use cases have in common is that you are given the ability to draw objects to a texture as if it were another screen and can then choose what to do with the resulting texture.
de: Allen diesen Anwendungsfällen ist gemeinsam, dass Sie Objekte auf eine Textur zeichnen können als wäre es ein anderer Bildschirm und dann auswählen können, was mit der resultierenden Textur geschehen soll.
es: Lo que todos estos casos de uso tienen en común es que se da la capacidad de dibujar objetos a una textura como si fuera otra pantalla y luego puedes elegir qué hacer con la textura resultante.
ja: これらすべてのユースケースに共通することは、あたかも別の画面であるかのようにテクスチャにオブジェクトを描画する機能が与えられ、結果のテクスチャをどうするかを選択できることです。

source: Input
de: Eingang
es: Entrada
ja: 入力

source: :ref:`Viewports <class_Viewport>` are also responsible for delivering properly adjusted and scaled input events to all their children nodes. Typically, input is received by the nearest :ref:`Viewport <class_Viewport>` in the tree, but you can set :ref:`Viewports <class_Viewport>` not to receive input by checking 'Disable Input' to 'on'; this will allow the next nearest :ref:`Viewport <class_Viewport>` in the tree to capture the input.
de: :ref:`Viewports <class_Viewport>` sind auch dafür verantwortlich, dass alle untergeordneten Nodes ordnungsgemäß angepasste und skalierte Eingabeereignisse erhalten. In der Regel wird die Eingabe vom nächsten :ref:`Viewport <class_Viewport>` im Baum empfangen, aber Sie können festlegen, dass :ref:`Viewports <class_Viewport>` keine Eingabe empfangen, indem Sie 'Disable Input' auf 'on' aktivieren; Dadurch kann der nächstgelegene :ref:`Viewport <class_Viewport>` im Baum die Eingabe erfassen.
es: Los :ref:`Viewports <class_Viewport>` son también responsables de entregar eventos de entrada correctamente ajustados y escalados a todos sus nodos hijos. Típicamente la entrada es recibida por el :ref:`Viewport <class_Viewport>` más cercano en el árbol, pero puedes establecer :ref:`Viewports <class_Viewport>` para que no reciba entradas al marcar 'Disable Input' en `activado`, esto permitirá que el siguiente :ref:`Viewport <class_Viewport>` más cercano en el árbol capture la entrada.
ja: :ref:`Viewports <class_Viewport>` は、適切に調整およびスケーリングされた入力イベントをすべての子ノードに配信する役割も果たします。通常、入力はツリー内の最も近い :ref:`Viewport <class_Viewport>` によって受信されますが、 'Disable Input' を 'on' にチェックすることで入力を受信しないように :ref:`Viewports <class_Viewport>` を設定できます。これにより、ツリー内の次に近い :ref:`Viewport <class_Viewport>` が入力をキャプチャできるようになります。

source: For more information on how Godot handles input, please read the :ref:`Input Event Tutorial<doc_inputevent>`.
de: Für weitere Informationen dazu, wie Godot Eingaben verarbeitet, siehe :ref:`InputEvent Tutorial<doc_inputevent>`.
es: Para más información sobre cómo maneja Godot las entradas, por favor lee el :ref:`Tutorial de Eventos de Entrada<doc_inputevent>`.
ja: Godotが入力を処理する方法の詳細については、\ :ref:`入力イベントチュートリアル<doc_inputevent>` をお読みください。

source: Listener
es: Oyente
ja: リスナー

source: Godot supports 3D sound (in both 2D and 3D nodes); more on this can be found in the :ref:`Audio Streams Tutorial<doc_audio_streams>`. For this type of sound to be audible, the :ref:`Viewport <class_Viewport>` needs to be enabled as a listener (for 2D or 3D). If you are using a custom :ref:`Viewport <class_Viewport>` to display your :ref:`World <class_World>`, don't forget to enable this!
de: Godot unterstützt 3D Sound (sowohl in 2D als auch in 3D Nodes). Weitere Informationen hierzu finden Sie im :ref:`Audio Streams Anleitung <doc_audio_streams>`. Damit diese Art von Sound zu hören ist, muss :ref:`Viewport <class_Viewport>` als Listener aktiviert sein (für 2D oder 3D). Wenn Sie ein benutzerdefiniertes :ref:`Viewport <class_Viewport>` verwenden, um Ihre :ref:`Welt <class_World>` anzuzeigen, vergessen Sie nicht, dies zu aktivieren!
es: Godot soporta el sonido 3D (tanto en nodos 2D como 3D); más sobre esto se puede encontrar en el :ref:`Audio Streams Tutorial<doc_audio_streams>`. Para que este tipo de sonido sea audible, el :ref:`Viewport <class_Viewport>` debe estar habilitado como oyente (para 2D o 3D). Si estás usando un :ref:`Viewport <class_Viewport>` personalizado para mostrar tu :ref:`World <class_World>`, ¡no te olvides de habilitarlo!
ja: Godotは3Dサウンドをサポートしています(2Dおよび3Dノードの両方で)。詳細については、\ :ref:`オーディオストリームチュートリアル<doc_audio_streams>` を参照してください。このタイプのサウンドを聞き取るには、\ :ref:`Viewport <class_Viewport>` をリスナーとして有効にする必要があります(2Dまたは3Dの場合)。カスタム :ref:`Viewport <class_Viewport>` を使用して :ref:`World <class_World>` を表示している場合、これを有効にすることを忘れないでください！

source: Cameras (2D & 3D)
de: Kameras (2D & 3D)
es: Cámaras (2D y 3D)
ja: カメラ(2Dおよび3D)

source: When using a :ref:`Camera <class_Camera>` / :ref:`Camera2D <class_Camera2D>`, cameras will always display on the closest parent :ref:`Viewport <class_Viewport>` (going towards the root). For example, in the following hierarchy:
de: Bei Verwendung von :ref:`Camera <class_Camera>` / :ref:`Camera2D <class_Camera2D>` werden Kameras immer auf dem nächstgelegenen übergeordneten Element angezeigt :ref:`Viewport <class_Viewport>` (in Richtung Wurzel). Zum Beispiel in der folgenden Hierarchie:
es: Cuando se usa una :ref:`Camera <class_Camera>` / :ref:`Camera2D <class_Camera2D>`, las cámaras siempre se mostrarán en el padre más cercano :ref:`Viewport <class_Viewport>` (yendo hacia la raíz). Por ejemplo, en la siguiente jerarquía:
ja: :ref:`Camera <class_Camera>` / :ref:`Camera2D <class_Camera2D>` を使用する場合、カメラは常に最も近い親である :ref:`Viewport <class_Viewport>` に表示されます(ルートに向かって)。たとえば、次の階層では:

source: CameraA will display on the Root :ref:`Viewport <class_Viewport>` and it will draw MeshA. CameraB will be captured by the :ref:`Viewport <class_Viewport>` Node along with MeshB. Even though MeshB is in the scene hierarchy, it will still not be drawn to the Root :ref:`Viewport <class_Viewport>`. Similarly MeshA will not be visible from the :ref:`Viewport <class_Viewport>` node because :ref:`Viewport <class_Viewport>` nodes only capture nodes below them in the hierarchy.
de: CameraA wird im Wurzel :ref:`Viewport <class_Viewport>` angezeigt und zeichnet MeshA. CameraB wird vom :ref:`Viewport <class_Viewport>`-Node zusammen mit MeshB erfasst. Obwohl sich MeshB in der Szenenhierarchie befindet, wird es dennoch nicht im Wurzel :ref: `Viewport <class_Viewport>` gezeichnet. In ähnlicher Weise ist MeshA vom :ref:`Viewport <class_Viewport>`-Node nicht sichtbar, da :ref:`Viewport <class_Viewport>`-Nodes nur Nodes unter ihnen in der Hierarchie erfassen.
es: La cámaraA aparecerá en la raíz :ref:`Viewport <class_Viewport>` y dibujará MeshA. La cámaraB será capturada por el nodo :ref:`Viewport <class_Viewport>` junto con MeshB. Aunque MeshB está en la jerarquía de la escena, no será dibujada en el Root :ref:`Viewport <class_Viewport>`. Del mismo modo, MeshA no será visible desde el nodo :ref:`Viewport <class_Viewport>` porque los nodos :ref:`Viewport <class_Viewport>` sólo capturan los nodos que están debajo de ellos en la jerarquía.
ja: CameraAはルート :ref:`Viewport <class_Viewport>` に表示され、MeshAを描画します。CameraBは、MeshBとともに :ref:`Viewport <class_Viewport>` ノードによってキャプチャされます。MeshBはシーン階層内にありますが、ルート :ref:`Viewport <class_Viewport>` には描画されません。同様に、MeshAは :ref:`Viewport <class_Viewport>` ノードからは表示されません。これは、\ :ref:`Viewport <class_Viewport>` ノードが階層内でその下のノードのみをキャプチャするためです。

source: There can only be one active camera per :ref:`Viewport <class_Viewport>`, so if there is more than one, make sure that the desired one has the "current" property set, or make it the current camera by calling:
de: Es kann nur eine aktive Kamera pro :ref:`Viewport <class_Viewport>` geben. Wenn also mehr als eine vorhanden ist, stellen Sie sicher, dass für die gewünschte Kamera die Eigenschaft "current" festgelegt ist, oder machen Sie sie zur aktuellen Kamera, indem Sie Folgendes aufrufen:
es: Sólo puede haber una cámara activa por :ref:`Viewport <class_Viewport>`, así que si hay más de una, asegúrate de que la deseada tiene la propiedad "actual" establecida, o hazla la cámara actual llamando:
ja: アクティブなカメラは :ref:`Viewport <class_Viewport>` につき1つしか存在できないため、複数ある場合は、目的のカメラに "current" プロパティが設定されていることを確認するか、次の呼び出しで現在のカメラにします:

source: By default, cameras will render all objects in their world. In 3D, cameras can use their :ref:`cull_mask <class_Camera_property_cull_mask>` property combined with the :ref:`VisualInstance's <class_VisualInstance>` :ref:`layer <class_VisualInstance_property_layers>` property to restrict which objects are rendered.
de: Standardmäßig rendern Kameras alle Objekte in ihrer Welt. In 3D können Kameras ihre Eigenschaft :ref:`cull_mask <class_Camera_property_cull_mask>` in Kombination mit der Eigenschaft :ref:`VisualInstance <class_VisualInstance>` :ref:`layer <class_VisualInstance_property_layers>` verwenden, um zu beschränken, welche Objekte gerendert werden.
es: Por defecto, las cámaras renderizarán todos los objetos de su mundo. En 3D, las cámaras pueden usar su propiedad :ref:`cull_mask <class_Camera_property_cull_mask>` combinada con la propiedad :ref:`VisualInstance's <class_VisualInstance>` :ref:`layer <class_VisualInstance_property_layers>` para restringir qué objetos se renderizan.
ja: デフォルトでは、カメラはワールド内のすべてのオブジェクトをレンダリングします。 3Dでは、カメラは :ref:`cull_mask <class_Camera_property_cull_mask>` プロパティを :ref:`VisualInstance's <class_VisualInstance>` :ref:`layer <class_VisualInstance_property_layers>` プロパティと組み合わせて使用して、レンダリングするオブジェクトを制限できます。

source: Scale & stretching
de: Skalieren & Dehnen
es: Escalado y estiramiento
ja: スケールとストレッチ

source: :ref:`Viewports <class_Viewport>` have a "size" property, which represents the size of the :ref:`Viewport <class_Viewport>` in pixels. For :ref:`Viewports <class_Viewport>` which are children of :ref:`ViewportContainers <class_viewportcontainer>`, these values are overridden, but for all others, this sets their resolution.
de: :ref:`Viewports <class_Viewport>` haben eine "size"-Eigenschaft, die die Größe des :ref:`Viewport <class_Viewport>` in Pixel darstellt. Für :ref:`Viewports <class_Viewport>` die untergeordnete Elemente von :ref:`ViewportContainers <class_viewportcontainer>` sind, werden diese Werte überschrieben, für alle anderen wird jedoch ihre Auflösung festgelegt.
es: El :ref:`Viewport <class_Viewport>` tiene una propiedad "size", la que representa el tamaño del :ref:`Viewport <class_Viewport>` en pixeles. Para :ref:`Viewport <class_Viewport>` que son hijos de un ref:`ViewportContainer <class_viewportcontainer>`, esos valores son sobreescritos pero esto define su resolución.
ja: :ref:`Viewports <class_Viewport>` には "size" プロパティがあり、これは :ref:`Viewport <class_Viewport>` のサイズをピクセル単位で表します。\ :ref:`ViewportContainers <class_viewportcontainer>` の子である :ref:`Viewports <class_Viewport>` の場合、これらの値はオーバーライドされますが、他のすべての場合、これにより解像度が設定されます。

source: It is also possible to scale the 2D content and make the :ref:`Viewport <class_Viewport>` resolution different from the one specified in size, by calling:
de: Es ist auch möglich den 2D Inhalt zu skalieren und die :ref:`Viewport <class_Viewport>` Auflösung von der in der Größe angegebenen Auflösung zu unterscheiden, indem Sie Folgendes aufrufen:
es: También es posible escalar el contenido 2D y hacer que la resolución :ref:`Viewport <class_Viewport>` sea diferente de la especificada en el tamaño, llamando:
ja: 次を呼び出して、2Dコンテンツをスケーリングし、\ :ref`Viewport <class_Viewport>` の解像度をサイズで指定した解像度と異なるものにすることもできます:

source: The root :ref:`Viewport <class_Viewport>` uses this for the stretch options in the project settings. For more information on scaling and stretching visit the :ref:`Multiple Resolutions Tutorial <doc_multiple_resolutions>`
de: Der Wurzel :ref:`Viewport <class_Viewport>` verwendet dies für die Stretch-Optionen in den Projekteinstellungen. Weitere Informationen zum Skalieren und Dehnen finden Sie in der :ref:`Anleitung für mehrere Auflösungen <doc_multiple_resolutions>`.
es: La raíz :ref:`Viewport <class_Viewport>` utiliza esto para las opciones de estiramiento en la configuración del proyecto. Para más información sobre escalado y estiramiento visite el Tutorial de Múltiples Resoluciones :ref:`Multiple Resolutions Tutorial <doc_multiple_resolutions>`
ja: ルート :ref:`Viewport <class_Viewport>` は、プロジェクト設定のストレッチオプションにこれを使用します。スケーリングとストレッチの詳細については、次をご覧ください。\ :ref:`Multiple Resolutions Tutorial <doc_multiple_resolutions>`

source: Worlds
de: Welten
es: Mundos
ja: ワールド

source: For 3D, a :ref:`Viewport <class_Viewport>` will contain a :ref:`World <class_World>`. This is basically the universe that links physics and rendering together. Spatial-based nodes will register using the :ref:`World <class_World>` of the closest :ref:`Viewport <class_Viewport>`. By default, newly created :ref:`Viewports <class_Viewport>` do not contain a :ref:`World <class_World>` but use the same as their parent :ref:`Viewport <class_Viewport>` (the root :ref:`Viewport <class_Viewport>` always contains a :ref:`World <class_World>`, which is the one objects are rendered to by default). A :ref:`World <class_World>` can be set in a :ref:`Viewport <class_Viewport>` using the "world" property, and that will separate all children nodes of that :ref:`Viewport <class_Viewport>` from interacting with the parent :ref:`Viewport's <class_Viewport>` :ref:`World <class_World>`. This is especially useful in scenarios where, for example, you might want to show a separate character in 3D imposed over the game (like in StarCraft).
de: Für 3D enthält ein :ref:`Viewport <class_Viewport>` eine :ref:`World <class_World>`. Dies ist im Grunde das Universum, das Physik und Rendering miteinander verbindet. Raumbasierte Nodes registrieren sich mit :ref:`World <class_World>` des nächstgelegenen :ref:`Viewport <class_Viewport>`. Standardmäßig enthält das neu erstellte Verzeichnis :ref:`Viewports <class_Viewport>` keine :ref:`World <class_World>`, verwendet jedoch dasselbe wie das übergeordnete :ref:`Viewport <class_Viewport>` Element (der Wurzel :ref:` Viewport <class_Viewport> `enthält immer eine :ref:` World <class_World> `, welches das Objekt ist, für das standardmäßig gerendert wird). Eine :ref:`World <class_World>` kann in einem :ref:`Viewport <class_Viewport>` mithilfe der Eigenschaft "world" festgelegt werden. Dadurch werden alle untergeordneten Nodes dieses :ref:`Viewport <class_Viewport>` von Interaktionen mit dem übergeordneten Element :ref:`Viewport <class_Viewport>` :ref:`World <class_World>` getrennt. Dies ist besonders nützlich in Szenarien, in denen Sie beispielsweise einen separaten Charakter in 3D anzeigen möchten, der über das Spiel festgelegt wurde (wie in StarCraft).
es: Para 3D, un :ref:`Viewport <class_Viewport>` contendrá un :ref:`World <class_World>`. Este es básicamente el universo que une la física y la representación juntos. Los nodos de base espacial se registrarán usando el :ref:`World <class_World>` del :ref:`Viewport <clase_Viewport>` más cercano. Por defecto, los :ref:`Viewports <class_Viewport>` recién creados no contienen un :ref:`World <class_World>` sino que usan el mismo que su padre :ref:`Viewport <class_Viewport>` (la raíz :ref:`Viewport <class_Viewport>` siempre contiene un :ref:`World <class_World>`, que es al que se renderizan los objetos por defecto). Un :ref:`World <class_World>` puede establecerse en un :ref:`Viewport <class_Viewport>` usando la propiedad "world", y eso separará a todos los nodos hijos de ese :ref:`Viewport <class_Viewport>` de la interacción con el padre :ref:`Viewport's <class_Viewport>` :ref:`World <class_World>`. Esto es especialmente útil en escenarios donde, por ejemplo, podrías querer mostrar un personaje separado en 3D impuesto sobre el juego (como en StarCraft).

source: As a helper for situations where you want to create :ref:`Viewports <class_Viewport>` that display single objects and don't want to create a :ref:`World <class_World>`, :ref:`Viewport <class_Viewport>` has the option to use its own :ref:`World <class_World>`. This is useful when you want to instance 3D characters or objects in a 2D :ref:`World <class_World2D>`.
de: Als Hilfsmittel für Situationen, in denen Sie ein :ref:`Viewport <class_Viewport>`, der einzelne Objekte anzeigen und keine :ref:`World <class_World>` erstellen möchten, hat :ref:`Viewport <class_Viewport>` die Möglichkeit eine eigene :ref:`World <class_World>` zu verwenden. Dies ist nützlich, wenn Sie 3D Zeichen oder Objekte in einer 2D :ref:`World <class_World2D>` Instanz instanziieren möchten.
es: Como ayudante para situaciones en las que se quiera crear :ref:`Viewports <class_Viewport>` que muestren objetos individuales y no se quiera crear un :ref:`World <class_World>`, :ref:`Viewport <class_Viewport>` tiene la opción de usar su propio :ref:`World <class_World>`. Esto es muy útil cuando se desea crear personajes u objetos 3D en un 2D :ref:`World <class_World2D>`.
ja: 単一のオブジェクトを表示する :ref:`Viewport <class_Viewport>` を作成し、\ :ref:`World <class_World>`\ 、\ :ref:`Viewport <class_Viewport>` を作成したくない状況のヘルパーとして独自の :ref:`World <class_World>` を使用するオプションがあります。これは、2D\ :ref:`World <class_World2D>` で3Dキャラクターまたはオブジェクトをインスタンス化する場合に便利です。

source: For 2D, each :ref:`Viewport <class_Viewport>` always contains its own :ref:`World2D <class_World2D>`. This suffices in most cases, but in case sharing them may be desired, it is possible to do so by setting the :ref:`Viewport's <class_Viewport>` :ref:`World2D <class_World2D>` manually.
de: Für 2D enthält jeder :ref:`Viewport <class_Viewport>` immer ein eigenes :ref:`World2D <class_World2D>`. Dies reicht in den meisten Fällen aus, aber falls eine gemeinsame Nutzung gewünscht wird, können Sie dies manuell durch :ref:`Viewport <class_Viewport>` :ref:`World2D <class_World2D>` festlegen.
es: Para 2D, cada :ref:`Viewport <class_Viewport>` siempre contiene su propio :ref:`World2D <class_World2D>`. Esto es suficiente en la mayoría de los casos, pero en caso de que se desee compartirlo, es posible hacerlo configurando el :ref:`Viewport's <class_Viewport>` :ref:`World2D <class_World2D>` manualmente.
ja: 2Dの場合、各 :ref:`Viewport <class_Viewport>` には常にそれ自身の :ref:`World2D <class_World2D>` が含まれます。ほとんどの場合これで十分ですが、それらを共有したい場合は、\ :ref:`Viewport <class_Viewport>` :ref:`World2D <class_World2D>` を手動で設定することで可能です。

source: For an example of how this works, see the demo projects `3D in 2D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_in_2d>`_ and `2D in 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/2d_in_3d>`_ respectively.
de: Ein Beispiel dafür finden Sie in den Demo-Projekten `3D in 2D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_in_2d>`_ und `2D in 3D <https : //github.com/godotengine/godot-demo-projects/tree/master/viewport/2d_in_3d> `_.
es: Para un ejemplo de cómo funciona esto, ver los proyectos de demostración `3D en 2D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_in_2d>`_ y `2D en 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/2d_in_3d>`_ respectivamente.
ja: これがどのように機能するかの例については、デモプロジェクト `3D in 2D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/3d_in_2d>`_ および `2D in 3D <https://github.com/godotengine/godot-demo-projects/tree/master/viewport/2d_in_3d> `_ があります。

source: Capture
de: Aufnahme
es: Captura
ja: キャプチャ
