Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/assets/importing_audio_samples.po
Languages: ru, uk

source: Importing audio samples
ru: Importing audio samples (импорт звуковых образцов)
uk: Імпорт аудіо нарізків

source: Supported files
ru: Поддерживаемые файлы
uk: Підтримувані файли

source: Godot provides three options to import your audio data: WAV, Ogg Vorbis and MP3.
ru: Godot предоставляет три основных варианта импорта ваших аудиоданных: WAV, Ogg Vorbis и MP3.
uk: Godot пропонує три основні варіанти імпорту аудіоданих: WAV, Ogg Vorbis і MP3.

source: Each has different advantages.
ru: Каждый из них имеет различные преимущества.
uk: Кожен має різні переваги.

source: WAV files use raw data or light compression (IMA-ADPCM). They are lightweight on the CPU to play back (hundreds of simultaneous voices in this format are fine). The downside is that they take up a lot of disk space.
ru: Файлы WAV используют необработанные данные или лёгкое сжатие(IMA-ADPCM). Они легковесны для CPU при воспроизведении (сотни одновременных голосов в этом формате - норма). Недостатком является то, что они занимают много места на диске.
uk: Файли WAV використовують необроблені дані або легке стиснення (IMA-ADPCM). Вони легкі на процесорі для відтворення (сотні одночасних голосів у цьому форматі є чудовими). Недоліком є те, що вони займають багато місця на диску.

source: Ogg Vorbis files use a stronger compression that results in much smaller file size, but require significantly more processing power to play back.
ru: Файлы Ogg Vorbis используют более сильное сжатие, что приводит к гораздо меньшему размеру файла, но требует значительно большей вычислительной мощности для воспроизведения.
uk: Файли Ogg Vorbis використовують більш сильне стиснення, що призводить до набагато меншого розміру файлу, але для відтворення потрібна значно більша потужність обробки.

source: MP3 files use better compression than WAV with IMA-ADPCM, but worse than Ogg Vorbis. This means that a MP3 file with roughly equal quality to Ogg Vorbis will be significantly larger. On the bright side, MP3 requires less CPU usage to play back compared to Ogg Vorbis. This makes MP3 useful for mobile and HTML5 projects where CPU resources are limited, especially when playing multiple compressed sounds at the same time (such as long ambient sounds).
ru: MP3 файлы используют сжатие лучше чем WAV c IMA-ADPCM, но хуже чем Ogg Vorbis. Это подразумевает, что MP3 файл с похожим качеством Ogg Vorbis будет существенно больше. C другой стороны MP3 меньше использует процессор, чтобы воспроизводиться по сравнению с Ogg Vorbis.Это делает MP3 полезным на мобильных устройствах и сайтах(HTML5), где ресурсы процессора ограничены, особенно когда проигрывается много сжатых звуков в одно время(такие как долгие звуки окружения).
uk: Файли MP3 використовують краще стиснення, ніж WAV з IMA-ADPCM, але гірше, ніж Ogg Vorbis. Це означає, що файл MP3 із приблизно рівною якістю з Ogg Vorbis буде значно більшим. З іншого боку, MP3 вимагає менше використання процесора для відтворення, ніж Ogg Vorbis. Це робить MP3 корисним для мобільних проєктів та проєктів HTML5, де ресурси процесора обмежені, особливо при одночасному відтворенні кількох стиснених звуків (наприклад, довгих звуків навколишнього середовища).

source: Here is a comparative chart.
ru: Вот сравнительная диаграмма.
uk: Ось порівняльна діаграма.

source: Format
ru: Формат
uk: Формат

source: 1 second of audio
ru: 1 секунда звука
uk: 1 секунда аудіо

source: WAV 24-bit, 96 kHz, stereo
ru: WAV 24-bit, 96 kHz, стерео
uk: 24-бітовий WAV, 96 кГц, стерео

source: WAV 16-bit, 44 kHz, mono
ru: WAV 16-bit, 44 kHz, моно
uk: 16-бітовий WAV, 44 кГц, моно

source: WAV 16-bit, IMA-ADPCM, mono
ru: WAV 16-bit, IMA-ADPCM, моно
uk: 16-бітовий WAV, IMA-ADPCM, моно

source: MP3 192 Kb/s, stereo
ru: MP3 192 Kb/s, стерео
uk: MP3 192 Kb/s, стерео

source: 24 KB
ru: 24 килобайта

source: Ogg Vorbis 128 Kb/s, stereo
ru: Ogg Vorbis 128 Kb/s, стерео
uk: Ogg Vorbis 128 Kb/s, стерео

source: Ogg Vorbis 96 Kb/s, stereo
ru: Ogg Vorbis 96 Kb/s, стерео
uk: Ogg Vorbis 96 Kb/s, стерео

source: Consider using WAV for short and repetitive sound effects, and Ogg Vorbis for music, speech, and long sound effects.
ru: Рассмотрите возможность использования WAV для коротких и повторяющихся звуковых эффектов и Ogg Vorbis для музыки, речи и длинных звуковых эффектов.
uk: Старайтеся використовувати WAV для коротких та повторюваних звукових ефектів, а Ogg Vorbis - для музики, мови та довгих звукових ефектів.

source: Best practices
ru: Лучшие практики
uk: Кращі практики

source: Godot has an :ref:`extensive bus system <doc_audio_buses>` with built-in effects. This saves SFX artists the need to add reverb to the sound effects, reducing their size greatly and ensuring correct trimming. Say no to SFX with baked reverb!
ru: Godot имеет :ref:`обширную bus-систему <doc_audio_buses>` со встроенными эффектами. Это избавляет мастеров SFX от необходимости добавлять реверберацию к звуковым эффектам, значительно уменьшая их размер и обеспечивая правильную обрезку. Скажи "нет" SFX с запечённой реверберацией!
uk: Godot має :ref:`розгалужену систему <doc_audio_buses>` із вбудованими ефектами. Це позбавляє виконавців SFX необхідності додавати реверберацію до звукових ефектів, значно зменшуючи їх розмір та забезпечуючи правильне обрізання. Скажіть ні SFX із запеченим ревербератором!

source: As you can see above, sound effects become huge with reverb added.
ru: Как вы можете видеть выше, звуковые эффекты становятся огромными с добавлением реверберации.
uk: Як ви бачите вище, звукові ефекти стають величезними з додаванням реверберації.

source: Trimming
ru: Тримминг
uk: Обрізання

source: One issue that happens often is that the waveform is exported with long silences at the beginning and at the end. These are inserted by DAWs when saving to a waveform, increase their size unnecessarily and add latency to the moment they are played back.
ru: Одна из часто возникающих проблем заключается в том, что сигнал экспортируется с длинными паузами в начале и в конце. Они вставляются DAW при сохранении формы волны, излишне увеличивают их размер и увеличивают задержку в момент воспроизведения.
uk: Часто трапляється, що форма хвилі експортується з довгими тишами на початку та в кінці. Вони вставляються за допомогою DAW під час збереження у формі хвилі, збільшують розмір без необхідності та додають затримку до моменту відтворення.

source: Importing as WAV with the **Trimming** option enabled solves this.
ru: Импорт в формате WAV с включенной опцией **Trimming** решает эту проблему.
uk: Імпорт в якості WAV з увімкненою опцією **Trimming** (Обрізання) вирішує цю проблему.

source: Looping
ru: Зацикливание (Looping)
uk: Цикл

source: Godot supports looping in the samples (tools such as Sound Forge or Audition can add loop points to WAV files). This is useful for sound effects, such as engines, machine guns etc. Ping-pong looping is also supported.
ru: Godot поддерживает создание зацикливания в семплах (такие инструменты, как Sound Forge или Audition, могут добавлять точки зацикливания в файлы WAV). Это полезно для звуковых эффектов, таких как двигатели, пулемёты и т.д. Также поддерживается зацикливание пинг-понг.
uk: Godot підтримує циклічність у семплах (нарізках) (такі інструменти, як Sound Forge або Audition, можуть додавати точки циклу до файлів WAV). Це корисно для таких звукових ефектів, як двигуни, кулемети тощо. Також підтримується цикл пінг-понгу.

source: As an alternative, the Import dock has a **Loop** option that enables looping for the entire sample when importing.
ru: В качестве альтернативы в панели импорта есть опция **Loop**, которая включает зацикливание для всего образца при импорте.
uk: Як альтернатива, панель Імпорт має опцію **Loop** (Цикл), яка дозволяє циклічно використовувати весь семпл (нарізок) при імпорті.
