Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/assets/importing_images.po
Languages: es

source: Importing images
es: Importando imágenes

source: Supported image formats
es: Formatos de imagen soportados

source: Godot can import the following image formats:
es: Godot soporta los siguientes formatos de imagen:

source: BMP (``.bmp``) - No support for 16-bit per pixel images. Only 1-bit, 4-bit, 8-bit, 24-bit, and 32-bit per pixel images are supported.
es: BMP (``.bmp``) - No ofrece soporte para imágenes 16-bit per pixel. Sólo imágenes de 1-bit, 4-bit, 8-bit, 24-bit, y 32-bit per pixel son soportadas.

source: DirectDraw Surface (``.dds``) - If mipmaps are present in the texture, they will be loaded directly. This can be used to achieve effects using custom mipmaps.
es: DirectDraw Surface (``.dds``) - Si hay mipmaps presente en la textura, serán cargados directamente. Esto puede ser usado para conseguir efectos usando mipmaps personalizados.

source: OpenEXR (``.exr``) - Supports HDR (highly recommended for panorama skies).
es: OpenEXR (``.exr``) - Soporta HDR (altamente recomendado para cielos panorámicos).

source: Radiance HDR (``.hdr``) - Supports HDR (highly recommended for panorama skies).
es: Radiance HDR (``.hdr``) - Soporta HDR (altamente recomendado para cielos panorámicos).

source: JPEG (``.jpg``, ``.jpeg``) - Doesn't support transparency per the format's limitations.
es: JPEG (``.jpg``, ``.jpeg``) - No soporta transparencia ddebido a las limitaciones del formato.

source: PNG (``.png``) - Precision is limited to 8 bits per channel upon importing (no HDR images).
es: PNG (``.png``) - La precisión está limitada a 8 bits por canal cuando se importa (no imágenes HDR).

source: SVG (``.svg``, ``.svgz``) - SVGs are rasterized using `NanoSVG <https://github.com/memononen/nanosvg>`__ when importing them. Support is limited; complex vectors may not render correctly. For complex vectors, rendering them to PNGs using Inkscape is often a better solution. This can be automated thanks to its `command-line interface <https://wiki.inkscape.org/wiki/index.php/Using_the_Command_Line#Export_files>`__.
es: SVG (``.svg``, ``.svgz``) - Los SVG son rasterizados usando `NanoSVG <https://github.com/memononen/nanosvg>`__ cuando se los importa. El soporte es limitado, vectores complejos pueden no renderizarse correctamente. Para vectores complejos, renderizarlos a PNG usando Inkscape es normalmente una mejor solución. Esto puede ser automatizado gracias a su `interfaz de línea de comandos <https://wiki.inkscape.org/wiki/index.php/Using_the_Command_Line#Export_files>`__.

source: If you've compiled the Godot editor from source with specific modules disabled, some formats may not be available.
es: Si has compilado el editor de Godot desde el fuente con módulos específicos deshabilitados, algunos formatos pueden no estar disponibles.

source: Importing textures
es: Importando texturas

source: The default action in Godot is to import images as textures. Textures are stored in video memory and can't be accessed directly. This is what makes drawing them efficient.
es: El comportamiento predeterminado en Godot es importar imágenes como texturas. Las texturas se almacenan en la memoria de video y no se puede acceder directamente. Esto es lo que hace que sean eficientes.

source: Import options are vast:
es: Hay múltiples opciones de importación :

source: Detect 3D
es: Detectar 3D

source: This option makes Godot be aware of when a texture (which is imported for 2D as default) is used in 3D. If this happens, setting are changed so the texture flags are friendlier to 3D (mipmaps, filter and repeat become enabled and compression is changed to VRAM). Texture is also reimported automatically.
es: Esta opción hace que Godot tenga en cuenta cuándo una textura (que se importa para 2D como valor predeterminado) se usa en 3D. Si esto sucede, la configuración se cambia para que los indicadores de textura sean más amigables con 3D (los mipmaps, filtro y repetición se habilitan y la compresión se cambia a VRAM). La textura también se reimporta automáticamente.

source: Compression
es: Compresión

source: Images are one of the largest assets in a game. To handle them efficiently, they need to be compressed. Godot offers several compression methods, depending on the use case.
es: Las imágenes son uno de los recursos que más ocupan en un juego. Para manejarlos de manera eficiente, se necesita comprimirlos. Godot ofrece varios métodos de compresión, dependiendo de como se usen.

source: Compress Mode
es: Modos de compresión

source: **VRAM Compression:** This is the most common compression mode for 3D assets. Size on disk is reduced and video memory usage is also decreased considerably (usually by a factor between 4 and 6). This mode should be avoided for 2D as it exhibits noticeable artifacts.
es: **Compresión VRAM:** Este es el modo de compresión más común para los recursos 3D. El tamaño del archivo en el disco se reduce y el uso de la memoria de video también se reduce considerablemente (normalmente en un factor entre 4 y 6). Este modo debe ser evitado para 2D ya que puede producir artefactos visibles.

source: **Lossless Compression:** This is the most common compression mode for 2D assets. It shows assets without any kind of artifacting, and disk compression is decent. It will use considerably more amount of video memory than VRAM Compression, though. This is also the recommended setting for pixel art.
es: **Compresión sin pérdida:** Esta es la compresión más común para los recursos en 2D. Muestra las imágenes sin ningún tipo de defecto, y la compresión en el disco es decente. Sin embargo, usará una cantidad considerablemente mayor de memoria de video que VRAM. Esta es recomendada para pixel art.

source: **Lossy Compression:** This is a good choice for large 2D assets. It has some artifacts, but less than VRAM and the file size is several times lower compared to Lossless or Uncompressed. Video memory usage isn't decreased by this mode; it's the same as with Lossless Compression or Uncompressed.
es: **Lossy Compression:** Esta es una buena elección para assets 2D grandes. Tiene algunos defectos pero ocupa menos VRAM y el tamaño de archivo es muchas veces menor comparado a Lossless o Uncompressed. El uso de memoria de video no es decrementado por este modo, es lo mismo que Lossless o Uncompressed.

source: **Uncompressed:** Only useful for formats that can't be compressed (such as raw float images).
es: **Sin compresión:** Sólo es útil para archivos de formatos que no se pueden comprimir (como imágenes raw float).

source: In this table, each of the four options are described together with their advantages and disadvantages (|good| = best, |bad| = worst):
es: En esta tabla, se describen cada una de las cuatro opciones junto con sus ventajas y desventajas (|good| = Mejor, |bad| = Peor):

source: Uncompressed
es: Sin comprimir

source: Compress Lossless (PNG)
es: Compresión sin pérdida (PNG)

source: Compress Lossy (WebP)
es: Compresión con pérdidas (WebP)

source: Compress VRAM
es: Compresion VRAM

source: Description
es: Descripción

source: Stored as raw pixels
es: Guardado como pixeles sin procesar

source: Stored as PNG
es: Guardado como PNG

source: Stored as WebP
es: Guardado como WebP

source: Stored as S3TC/BC or PVRTC/ETC depending on platform
es: Guardado como S3TC/BC o PVRTC/ETC, según plataforma

source: Size on Disk
es: Tamaño en disco

source: |bad| Large
es: |bad| Grande

source: |regular| Small
es: |regular| Pequeño

source: |good| Very Small
es: |good| Muy pequeño

source: Memory Usage
es: Uso de la memoria

source: |good| Small
es: |good| Pequeña

source: Performance
es: Rendimiento

source: |good| Fast
es: |good| Rápido

source: Quality Loss
es: Pérdida de calidad

source: |good| None
es: |good| Nada

source: |regular| Slight
es: |regular| Ligero

source: |bad| Moderate
es: |bad| Regular

source: Load Time
es: Tiempo de carga

source: |bad| Slow
es: |bad| Lenta

source: HDR Mode
es: Modo HDR

source: Godot supports high dynamic range textures (as .HDR or .EXR). These are mostly useful as high dynamic range equirectangular panorama skies (the internet has plenty if you search for them), which replace Cubemaps in Godot 2.x. Modern PCs support the BC6H VRAM format, but there are still plenty that do not.
es: Godot admite texturas de alto rango dinámico (high dynamic range, como .HDR o .EXR). Estos son principalmente útiles como cielos panoramicos equirectanculares de alto rango dinámico (Internet tiene mucho de si los buscas), estos reemplazan a Cubemaps de Godot 2.x. PC modernas admiten el formato BC6H VRAM, pero aún hay muchas que no lo hacen.

source: If you want Godot to ensure full compatibility in terms of the kind of textures, enable the "Force RGBE" option.
es: Si quieres que Godot garantice la compatibilidad completa para todo tipo de texturas, activa la opción "Forzar RGBE".

source: Normal Map
es: Mapa de Normales

source: When using a texture as normal map, only the red and green channels are required. Given regular texture compression algorithms produce artifacts that don't look that nice in normal maps, the RGTC compression format is the best fit for this data. Forcing this option to "Enabled" will make Godot import the image as RGTC compressed. By default, it's set to "Detect", which means that if the texture is ever used as a normal map, it will be changed to "Enabled" and reimported automatically.
es: Cuando se utiliza una textura como mapa de normales, solo se requieren los canales rojo y verde. Dado que los algoritmos de compresión de texturas regulares producen artefactos (errores) que no se ven tan bien en los mapas de normales, el formato de compresión RGTC es el más adecuado para estos datos. Al forzar esta opción a "Activado", Godot importará la imagen como RGTC comprimida. De forma predeterminada, se establece en "Detect", lo que significa que si la textura se utiliza alguna vez como un mapa normal, se cambiará a "Activado" y se volverá a importar automáticamente.

source: Note that RGTC compression affects the resulting normal map image. You will have to adjust custom shaders that use the normal map to take this into account.
es: Nota que la compresión RGTC afecta el mapa de normales resultante. Puedes tener que ajustar shaders personalizados para que usan el mapa de normales para tener esto en cuenta.

source: Godot requires the normal map to use the X+, Y- and Z+ coordinates. In other words, if you've imported a material made to be used with another engine, you may have to convert the normal map so its Y axis is flipped. Otherwise, the normal map direction may appear to be inverted on the Y axis.
es: Godot requiere que el mapa de normales use coordenadas X+, Y- y Z+. En otras palabras, si has importado un material hecho para ser usado en otro motor, tal vez debas convertir el mapa de normales así el eje Y queda invertido. De otro modo la dirección del mapa de normales aparecerá invertido en el eje Y.

source: More information about normal maps (including a coordinate order table for popular engines) can be found `here <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.
es: Más información sobre mapa de normales (incluyendo la tabla de orden de coordenadas para motores populares) se puede encontrar `aquí <http://wiki.polycount.com/wiki/Normal_Map_Technical_Details>`__.

source: Flags
es: Indicadores

source: There are plenty of settings that can be toggled when importing an image as a texture, depending on the use case.
es: Hay una gran cantidad de configuraciones que se pueden alternar cuando se importa una imagen como una textura, dependiendo de cada caso.

source: Repeat
es: Repetición

source: This setting is most commonly used in 3D, and is therefore generally disabled in 2D. It sets UV coordinates going beyond the 0,0 - 1,1 range to "loop".
es: Esta configuración se usa comúnmente en 3D y generalmente está desactivada en 2D. Hace que las coordenadas UV vayan más allá del rango de 0,0 - 1,1 para "repetirse".

source: Repeating can optionally be set to mirrored mode.
es: La repetición se puede configurar opcionalmente en modo reflejado.

source: Filter
es: Filtro

source: When pixels become larger than the screen pixels, this option enables linear interpolation for them. The result is a smoother (less blocky) texture. This setting can be commonly used in 2D and 3D, but it's usually disabled when making pixel perfect games.
es: Cuando los píxeles se vuelven más grandes que los píxeles de la pantalla, estas opciones permiten la interpolación lineal entre ellos. El resultado es una textura más suave (menos pixelada). Esta configuración se puede usar comúnmente en 2D y 3D, pero generalmente está desactivada al hacer juegos pixelados.

source: When pixels become smaller than the screen, mipmaps kick in. This helps reduce the grainy effect when shrinking the textures. Keep in mind that, in older hardware (GLES2, mainly mobile), there are some requirements to use mipmaps:
es: Cuando los píxeles se vuelven más pequeños que la pantalla, aparecen los mipmaps. Esto ayuda a reducir el efecto granulado al reducir las texturas. Tenga en cuenta que, en hardware antiguo (GLES2, principalmente móvil), existen algunos requisitos para usar mipmaps:

source: Texture width and height must be powers of 2
es: La altura y anchura de la textura deben ser potencias de 2

source: Repeat must be enabled
es: Repetir debe estar activada

source: Keep in mind the above when making phone games and applications, want to aim for full compatibility, and need mipmaps.
es: Ten en cuenta lo anterior al hacer juegos y aplicaciones para móviles, quiere la compatibilidad total y necesita utilizar mipmaps.

source: When doing 3D, mipmap should be turned on, as this also improves performance (smaller versions of the texture are used for objects further away).
es: Al trabajar en 3D, debe activarse mipmaps ya que también mejora el rendimiento (las versiones más pequeñas de la textura se utilizan para objetos más alejados).

source: Anisotropic
es: Anisótropo

source: When textures are near parallel to the view (like floors), this option makes them have more detail by reducing blurriness.
es: Cuando las texturas son casi paralelas a la vista (como los pisos), esta opción les permite tener más detalles al reducir la borrosidad.

source: Godot uses Linear colorspace when rendering 3D. Textures mapped to albedo or detail channels need to have this option turned on in order for colors to look correct. When set to "Detect" mode, the texture will be marked as SRGB when used in albedo channels.
es: Godot usa el espacio de color lineal al renderizar 3D. Las texturas mapeadas en los canales de albedo o de detalles necesitan tener esta opción activada para que los colores se muestren correctamente. Cuando se configura en el modo "Detect", la textura se marcará como SRGB cuando se use en los canales del albedo.

source: Process
es: Procesos

source: Some special processes can be applied to images when imported as textures.
es: Algunos procesos especiales se pueden aplicar a las imágenes cuando se importan como texturas.

source: This puts pixels of the same surrounding color in transition from transparency to non transparency. It helps mitigate the outline effect when exporting images from Photoshop and the like.
es: Esto coloca píxeles del mismo color circundante pasando de transparente a no transparente. Ayuda a mitigar el efecto de contorno al exportar imágenes desde Photoshop y similares.

source: It's a good idea to leave it on by default, unless specific values are needed.
es: Es una buena idea dejarlo activado por defecto, a menos que se necesiten valores específicos.

source: Premultiplied Alpha
es: Premult Alpha

source: An alternative to fix darkened borders is to use premultiplied alpha. By enabling this option, the texture will be converted to this format. Keep in mind that a material will need to be created that uses the PREMULT ALPHA blend mode on canvas items that need it.
es: Una alternativa para corregir los bordes oscurecidos es usar alfa premultiplicado. Activando esta opción, la textura se convertirá a este formato. Ten en cuenta que habrá que crear un material que utilice el modo de mezcla PREMULT ALPHA en los elementos del lienzo que lo necesiten.

source: HDR as sRGB
es: HDR como sRGB

source: A few HDR files are broken and contain sRGB color data. It is advised not to use them, but, in the worst-case scenario, toggling this option on will make them look right.
es: Algunos archivos HDR están rotos y contienen datos de color sRGB. Se aconseja no utilizarlos, pero, en el peor de los casos, alternar esta opción los hará parecer correctos.

source: Invert Color
es: Color invertido

source: Reverses the image's color. This is useful, for example, to convert a height map generated by external programs to depth map to use with :ref:`doc_spatial_material`.
es: Invierte el color de la imagen. Esto es útil, por ejemplo, para convertir un mapa de altura generado por programas externos a un mapa de profundidad para usar con :ref:`doc_spatial_material`.

source: Scale
es: Escala
