Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/kinematic_character_2d.po
Languages: de, es, fr, ja, pt_br, ru, zh_cn

source: **Note: As mentioned before in the physics tutorial, the physics engine can't handle scale on most types of shapes (only collision polygons, planes and segments work), so always change the parameters (such as radius) of the shape instead of scaling it. The same is also true for the kinematic/rigid/static bodies themselves, as their scale affects the shape scale.**
de: **Hinweis: Wie bereits in der Physik-Anleitung erwähnt, kann die Physik-Engine die Skalierung für die meisten Arten von Formen nicht verarbeiten (nur Kollisionspolygone, Ebenen und Segmente funktionieren). Ändern Sie daher stattdessen immer die Parameter (z.B. den Radius) der Form anstatt sie zu skalieren. Gleiches gilt auch für die kinematischen/starren/statischen Körper selbst, da ihre Skalierung die Formsgröße beeinflusst.**
es: **Nota: Como se mencionó anteriormente en el tutorial de física, el motor de física no puede manejar la escala en la mayoría de los tipos de formas (sólo funcionan los polígonos de colisión, planos y segmentos), así que cambia siempre los parámetros (como el radio) de la forma en lugar de escalarla. Lo mismo ocurre con los cuerpos cinemáticos/rígidos/estáticos, ya que su escala afecta a la escala de la forma.**
fr: **Note : Comme mentionné précédemment dans le tutoriel sur la physique, le moteur physique ne peut pas gérer l'échelle sur la plupart des types de formes (seuls les polygones de collision, les plans et les segments fonctionnent), donc changez toujours les paramètres (comme le rayon) de la forme au lieu de l'échelle. Il en va de même pour les corps cinématiques/rigides/statiques eux-mêmes, car leur échelle affecte l'échelle des formes.**
ja: **注: 物理のチュートリアルで前述したように、物理エンジンはほとんどの種類の形状のスケールを処理できないため(コリジョンポリゴン、プレーン、セグメントのみが機能します)、シェイプのパラメータ(半径など)を拡大縮小するのではなく、常に値を変更してください。スケールが形状のスケールに影響するため、同じことがキネマティック/リジッド/スタティックボディ自体にも当てはまります。**
pt_br: **Observação: como mencionado anteriormente no tutorial de física, o engine de física não pode lidar com a escala na maioria dos tipos de formas (somente polígonos de colisão, planos e segmentos funcionam), portanto, sempre altere os parâmetros (como o raio) da forma em vez de dimensioná-la. O mesmo também é verdade para os próprios corpos cinemáticos/rígidos/estáticos, pois sua escala afeta a escala da forma.**
ru: **Внимание: Как упоминалось выше в учебном пособии по физике, модуль физики не может обрабатывать масштаб на большинстве типов форм (работают только многоугольники столкновений, плоскости и сегменты), поэтому всегда изменяйте параметры (например, радиус) формы вместо её масштабирования. То же самое справедливо и для самих кинематических/жёстких/статических тел, поскольку их масштаб влияет на масштаб формы.**
zh_cn: **注意: 正如之前在物理教程中提到的, 物理引擎无法处理大多数类型形状的缩放, 只有碰撞多边形, 平面和段才有效, 所以, 总是改变形状的半径等参数, 而不是缩放它. 对于运动体或刚性体或静态体本身也是如此, 因为它们的比例会影响形状的比例.**

source: Now, create a script for the character, the one used as an example above should work as a base.
de: Erstellen Sie nun ein Skript für den Charakter. Das oben als Beispiel verwendete Skript sollte als Basis dienen.
es: Ahora crea un script para el personaje, el que se usa como ejemplo anterior debería funcionar como base.
fr: Maintenant, créez un script pour le personnage, celui utilisé comme exemple ci-dessus devrait servir de base.
ja: ここで、キャラクターのスクリプトを作成します。上記の例として使用したスクリプトがベースとして機能するはずです。
pt_br: Agora, crie um script para o personagem, o usado como exemplo acima deve servir de base.
ru: Теперь создайте скрипт для персонажа, который использовался в качестве примера выше и должен работать, как изначально.
zh_cn: 现在, 为这个角色创建一个脚本, 上面作为例子的那个脚本可以作为基础.

source: Finally, instance that character scene in the tilemap, and make the map scene the main one, so it runs when pressing play.
de: Instanzieren Sie schließlich diese Charakterszene in der TileMap und machen Sie die Kartenszene zur Hauptszene, damit sie beim drücken von Wiedergabe ausgeführt wird.
es: Por último, instancia la escena del personaje en el tilemap, y haz que la escena del mapa sea la principal, para que se ejecute al presionar play.
fr: Enfin, instanciez cette scène personnage dans la tilemap, et faites de la tilemap la scène principale, de sorte qu'elle s'exécute lorsque vous appuyez sur play.
ja: 最後に、タイルマップでそのキャラクターシーンをインスタンス化し、マップシーンをメインのシーンにします。再生を押すと実行されます。
pt_br: Por fim, crie uma instância dessa cena de personagem no tilemap e torne a cena do mapa a principal, para que seja executada ao pressionar o play.
ru: Наконец, инстанцируйте эту сцену персонажа в tilemap и сделайте сцену карты главной, чтобы она запускалась при нажатии на воспроизведение.
zh_cn: 最后, 实例化tilemap中的角色场景, 并使地图场景成为主场景, 因此在按下播放时运行.

source: Moving the kinematic character
de: Den kinematischen Charakter bewegen
es: Moviendo el personaje cinemático
fr: Déplacer le personnage cinématique
ja: キネマティック キャラクタの移動
pt_br: Movendo o personagem cinemático
ru: Перемещение кинематического персонажа
zh_cn: 移动动态角色

source: Go back to the character scene, and open the script, the magic begins now! Kinematic body will do nothing by default, but it has a useful function called :ref:`KinematicBody2D.move_and_collide() <class_KinematicBody2D_method_move_and_collide>`. This function takes a :ref:`Vector2 <class_Vector2>` as an argument, and tries to apply that motion to the kinematic body. If a collision happens, it stops right at the moment of the collision.
de: Gehen Sie zurück zur Charakterszene und öffnen das Skript, die Magie beginnt jetzt! Der kinematische Körper führt standardmäßig nichts aus, verfügt jedoch über eine nützliche Funktion namens :ref:`KinematicBody2D.move_and_collide() <class_KinematicBody2D_method_move_and_collide>`. Diese Funktion verwendet ein :ref:`Vector2 <class_Vector2>` als Argument und versucht diese Bewegung auf den kinematischen Körper anzuwenden. Wenn eine Kollision auftritt, stoppt sie genau zum Zeitpunkt der Kollision.
ja: キャラクターシーンに戻り、スクリプトを開くと、魔法が始まります！ キネマティックボディはデフォルトでは何もしませんが、\ :ref:`KinematicBody2D.move_and_collide() <class_KinematicBody2D_method_move_and_collide>` という便利な関数があります。 この関数は、\ :ref:`Vector2 <class_Vector2>` を引数として取り、その運動を キネマティックボディに適用しようとします。 衝突が発生した場合、衝突の瞬間に停止します。

source: So, let's move our sprite downwards until it hits the floor:
de: Bewegen wir also unser Sprite nach unten, bis es auf dem Boden aufschlägt:
es: Entonces, movamos nuestro sprite hacia abajo hasta que toque el suelo:
fr: Déplaçons notre sprite vers le bas jusqu'à ce qu'il touche le sol :
ja: それでは、スプライトが床に当たるまで下に移動しましょう:
pt_br: Então, vamos mover nosso sprite para baixo até atingir o chão:
ru: Итак, давайте сдвинем наш спрайт вниз, пока он не ударится об пол:
zh_cn: 所以, 让我们向下移动我们的精灵, 直到它撞上地板:

source: The result is that the character will move, but stop right when hitting the floor. Pretty cool, huh?
de: Das Ergebnis ist, dass sich der Charakter bewegt, aber beim Aufprall auf den Boden anhält. Ziemlich cool, oder?
es: El resultado es que el personaje se moverá, pero se detendrá justo cuando golpee el suelo. Bastante genial, ¿no?
fr: Il en résulte que le personnage bouge, mais s'arrête pile lorsqu'il touche le sol. Plutôt cool, hein ?
ja: その結果、キャラクターは移動しますが、床に当たるとすぐに停止します。 かなりクールですね？
pt_br: O resultado é que o personagem vai se mover, mas parar ao bater no chão. Bem legal, né?
ru: В результате персонаж двигается, но останавливается прямо при ударе о пол. Довольно круто, да?
zh_cn: 结果是角色会移动, 但在击中地板时会停止. 很酷, 对吧？

source: The next step will be adding gravity to the mix, this way it behaves a little more like a regular game character:
de: Der nächste Schritt besteht darin, dem Ganzen Schwerkraft zu verleihen. Auf diese Weise verhält es sich ein wenig mehr wie ein normaler Spielcharakter:
es: El siguiente paso será añadir gravedad a la combinación, de esta manera se comporta de una manera más parecida a la de un personaje real de un juego:
fr: La prochaine étape sera d'ajouter de la gravité au mélange, de cette façon il se comporte un peu plus comme un personnage de jeu ordinaire :
ja: 次のステップでは、ミックスに重力を追加します。これにより、通常のゲームキャラクターのように動作します:
pt_br: O próximo passo será adicionar gravidade à mistura, de forma que ela se comporte um pouco mais como um personagem normal do jogo:
ru: Следующим шагом будет добавление гравитации к миксу, путь он ведет себя немного ближе к обычному игровому персонажу:
zh_cn: 下一步将加入重力, 这样一来, 它的行为就更像一个常规的游戏角色:

source: Now the character falls smoothly. Let's make it walk to the sides, left and right when touching the directional keys. Remember that the values being used (for speed at least) are pixels/second.
de: Jetzt fällt der Charakter sanft nach unten. Lassen Sie ihn zur Seite gehen, links und rechts, durch drücken der Richtungstasten. Denken Sie daran, dass die verwendeten Werte (zumindest für die Geschwindigkeit) Pixel/Sekunde sind.
es: Ahora el personaje cae suavemente. Hagamos que camine hacia los lados, izquierda y derecha, cuando se presionen las teclas de dirección. Recuerda que los valores utilizados (al menos para la velocidad) son píxeles/segundo.
fr: Maintenant, que le personnage tombe en douceur. Faisons-le marcher sur les côtés, à gauche et à droite en touchant les touches directionnelles. Rappelez-vous que les valeurs utilisées (pour la vitesse au moins) sont en pixels/seconde.
ja: これでキャラクターがスムーズに落ちます。 方向キーをタッチして、左右に歩いてみましょう。(少なくとも速度の場合)使用されている値はピクセル/秒であることに注意してください。
pt_br: Agora o personagem cai sem problemas. Vamos fazê-lo andar para os lados, esquerda e direita ao tocar nas teclas direcionais. Lembre-se de que os valores usados (pelo menos para velocidade) são pixels/segundo.
ru: Теперь персонаж плавно падает. Давайте заставим его идти в стороны, влево и вправо при нажатии на клавиши управления. Следует помнить, что используемые значения (по крайней мере для скорости) составляют пикселы в секунду.
zh_cn: 现在人物平滑下落. 我们让它向两边行走, 在按下方向键时向左或向右. 记住, 正在使用的值(至少对于速度)单位是像素/秒.

source: This adds simple walking support by pressing left and right:
de: Dies fügt eine einfache Gehhilfe hinzu, indem Sie nach links und rechts drücken:
ja: これにより、左右キーを押すことで簡単な歩行サポートが追加されます:

source: And give it a try.
de: Und probieren Sie es aus.
es: E inténtalo.
fr: Et essayez-le.
ja: そして、それを試してみてください。
pt_br: E experimente.
ru: И попробуем.
zh_cn: 试一试.

source: This is a good starting point for a platformer. A more complete demo can be found in the demo zip distributed with the engine, or in the https://github.com/godotengine/godot-demo-projects/tree/master/2d/kinematic_character.
de: Dies ist ein guter Ausgangspunkt für einen Plattformer. Eine vollständigeres Beispiel finden Sie in der mit der Engine verteilten Demo-Zip-Datei oder unter https://github.com/godotengine/godot-demo-projects/tree/master/2d/kinematic_character.
es: Este es un buen punto de partida para un juego de plataformas. Se puede encontrar una demostración más completa en el zip de demostración distribuido con el motor, o en https://github.com/godotengine/godot-demo-projects/tree/master/2d/kinematic_character.
fr: C'est un bon point de départ pour un plateformer. Une démo plus complète se trouve dans le zip de démonstration distribué avec le moteur, ou sur le site https://github.com/godotengine/godot-demo-projects/tree/master/2d/kinematic_character.
ja: これはプラットフォーマーにとって良い出発点です。 より完全なデモは、エンジンとともに配布されるデモzip、または https://github.com/godotengine/godot-demo-projects/tree/master/2d/kinematic_character にあります。
pt_br: Este é um bom ponto de partida para um jogo de plataforma. Uma demonstração mais completa pode ser encontrada no zip de demonstração distribuído com o mecanismo ou no https://github.com/godotengine/godot-demo-projects/tree/master/2d/kinematic_character.
ru: Это хорошая отправная точка для платформера. Более полную демонстрацию можно найти в demo zip, распространяемом вместе с движком, или в https://github.com/godotengine/godot-demo-projects/tree/master/2d/kinematic_character.
zh_cn: 这是平台游戏的良好起点. 可以在随引擎分发的演示zip中找到更完整的演示, 或者在https://github.com/godotengine/godot-demo-projects/tree/master/2d/kinematic_character中找到.

source: Translation status
es: Estado de traducción
fr: État de la traduction
pt_br: Progresso da Tradução
ru: Статус перевода
zh_cn: 翻译状态
