Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/kinematic_character_2d.po
Languages: de, es, fr, ja, pt_br, ru, zh_cn

source: Kinematic character (2D)
de: Kinematischer Charakter (2D)
es: Personaje cinemático (2D)
fr: Caractère cinématique (2D)
ja: キネマティックキャラクター(2D)
pt_br: Personagem cinemático (2D)
ru: Кинематический персонаж (2D)
zh_cn: 运动学角色（2D）

source: Introduction
de: Einführung
es: Introducción
ja: はじめに
pt_br: Introdução
ru: Введение
zh_cn: 前言

source: Yes, the name sounds strange. "Kinematic Character". What is that? The reason for the name is that, when physics engines came out, they were called "Dynamics" engines (because they dealt mainly with collision responses). Many attempts were made to create a character controller using the dynamics engines, but it wasn't as easy as it seemed. Godot has one of the best implementations of dynamic character controller you can find (as it can be seen in the 2d/platformer demo), but using it requires a considerable level of skill and understanding of physics engines (or a lot of patience with trial and error).
de: Ja, der Name klingt seltsam: "Kinematischer Charakter". Was ist das? Der Grund für den Namen ist, dass als Physik-Engines herauskamen, sie "Dynamics"-Engines genannt wurden (weil sie sich hauptsächlich mit Kollisionsreaktionen befassten). Es wurden viele Versuche unternommen mithilfe der Dynamik-Engines einen Charakter-Controller zu erstellen, aber es war nicht so einfach wie es schien. Godot verfügt über eine der besten Implementierungen des dynamischen Character Controller, die Sie finden können (wie in dem 2D/Platformer-Beispiel zu sehen ist), aber die Verwendung erfordert ein beträchtliches Maß an Geschick und Verständnis für Physik-Engines (oder viel Geduld beim ausprobieren).
es: Sí, el nombre suena extraño. "Personaje Cinemático". ¿Qué es eso? La razón es que cuando aparecieron los motores de físicas, fueron llamados motores de "Dinámicas" (porque tratan principalmente con respuestas de colisiones). Se llevaron a cabo muchos intentos para crear un controlador de personajes utilizando los motores de dinámicas, pero no fue tan fácil como parecía. Godot tiene una de las mejores implementaciones de controlador de personajes dinámicos (como puede verse en la demo 2d/plataformas), pero usarlo requiere un considerable nivel de habilidad y conocimiento de motores de físicas (o mucha paciencia con el ensayo y error).
fr: Oui, le nom semble étrange. "Personnage cinématique". Qu'est-ce que c'est que ça ? La raison pour ce nom est que, lorsque les moteurs physiques sont apparus, ils étaient appelés moteurs "dynamiques" (parce qu'ils s'occupaient principalement des réactions de collisions). Beaucoup de tentatives ont été faites pour créer un contrôleur de personnage qui utilise les moteurs dynamiques, mais ce n'était pas aussi facile que ça en avait l'air. Godot a l'une des meilleures implémentations de contrôleur de personnage dynamique que vous pouvez trouver (comme vous pouvez le voir dans la démo de jeu de plateforme 2d), mais l'utiliser demande un niveau de compétence considérable ainsi qu'une bonne connaissance des moteurs physiques (ou beaucoup de patience avec des essais et des erreurs).
ja: はい、奇妙な名前に聞こえますね。「キネマティック・キャラクター」それは、何ですか？名前の理由は、物理エンジンが出てきたときに、それらが(主に衝突応答を扱ったため)「ダイナミクス」エンジンと呼ばれたからです。ダイナミクスエンジンを使ってキャラクターコントローラーを作ろうとする試みは数多く行われましたが、思ったほど簡単ではありませんでした。Godotには、(2d/platformerのデモで見ることができるように)色々と発見できるダイナミックキャラクターコントローラーの最高の実装の1つがありますが、それを使用するには、かなりのレベルのスキルと物理エンジンの理解(または試行錯誤の忍耐)が必要です。
pt_br: Sim, o nome soa estranho. "Personagem cinemático". O que é aquilo? A razão para o nome é que, quando os motores de física surgiram, eles eram chamados de motores "Dinâmicos" (porque lidavam principalmente com respostas de colisão). Muitas tentativas foram feitas para criar um controlador de personagem usando os motores de dinâmica, mas não foi tão fácil quanto parecia. Godot tem uma das melhores implementações de controlador de personagem dinâmico que você pode encontrar (como pode ser visto na demo 2d/platformer), mas usá-lo requer um nível considerável de habilidade e compreensão dos motores de física (ou muita paciência com testes e erro).
ru: Да, название звучит странно. «Кинематический персонаж». Что это? Причина такого названия в том, что когда появились физические движки, они назывались движками динамики (потому что они работали в основном с реакцией на столкновения). Было предпринято много попыток создать контроллер персонажа, используя движки динамики, но это оказалось не так просто, как казалось. Godot имеет одну из лучших реализаций динамического контроллера персонажа, которую вы можете найти (это можно увидеть в демонстрации 2d/платформера), но ее использование требует значительного уровня мастерства и понимания физических движков (или большого терпения на пробы и ошибки).
zh_cn: 是的，名字听起来很奇怪。“运动学角色”是什么东西？使用这个名称的原因是物理引擎问世之处，它们被称为“动力学（Dynamics）”引擎（因为它们主要处理碰撞响应）。人们做了许多尝试，想使用动力学引擎创建角色控制器，但它并不像看起来那么容易。Godot 拥有你能找到的最好的动力学角色控制器（可以在 2d/platformer 演示中查看），但使用它需要相当高水平的技能和对物理引擎的理解（或者对试验和试错有足够的耐心）。

source: Some physics engines, such as Havok seem to swear by dynamic character controllers as the best option, while others (PhysX) would rather promote the kinematic one.
de: Einige Physik-Engines wie Havok scheinen auf dynamische Charakter-Controller als beste Option zu schwören, während andere (PhysX) eher die kinematische bevorzugen würden.
es: Algunos motores de física como Havok parecen apostar por los controladores de personaje dinámico como la mejor alternativa, mientras que otros (PhysX) prefieren promover los de personaje cinemático.
fr: Certains moteurs physiques, comme Havok, semblent considérer les contrôleurs de personnages dynamiques comme la meilleure option, alors que d'autres (PhysX) promeuvent plutôt les contrôleurs cinématiques.
ja: Havokなどの一部の物理エンジンは、最適なオプションとしてダイナミックキャラクターコントローラーに誓いをたてているように見えますが、他の物理エンジン(PhysX)は、むしろキネマティックコントローラーを促進します。
pt_br: Alguns motores de física, como o Havok, parecem defender os controladores de personagens dinâmicos como a melhor opção, enquanto outros (PhysX) preferem promover o cinemático.
ru: Некоторые физические движки, такие, как Havok, преподносят динамические контроллеры персонажей как лучший вариант, в то же время как другие (PhysX), напротив, продвигают только кинематику.
zh_cn: 像 Havok 这样的物理引擎似乎认为力学角色控制器是最好的选择，而其他物理引擎（PhysX）则更愿意推广运动学（Kinematic）的角色控制器。

source: So, what is the difference?:
de: Also, was ist der Unterschied?:
es: Entonces, ¿cuál es la diferencia?:
fr: Et donc, quelle est la différence ? :
ja: だから、違いは何ですか？:
pt_br: Então, qual é a diferença?:
ru: Так, а в чём разница?:
zh_cn: 那么区别是什么呢？：

source: A **dynamic character controller** uses a rigid body with an infinite inertia tensor. It's a rigid body that can't rotate. Physics engines always let objects move and collide, then solve their collisions all together. This makes dynamic character controllers able to interact with other physics objects seamlessly, as seen in the platformer demo. However, these interactions are not always predictable. Collisions can take more than one frame to be solved, so a few collisions may seem to displace a tiny bit. Those problems can be fixed, but require a certain amount of skill.
de: Ein **dynamischer Character Controller** verwendet einen starren Körper mit einem unendlichen Trägheitstensor. Es ist ein starrer Körper, der sich nicht drehen kann. Physik-Engines lassen Objekte immer bewegen und kollidieren und lösen dann all ihre Kollisionen zusammen aus. Auf diese Weise können dynamische Character Controller nahtlos mit anderen Physikobjekten interagieren, wie in dem Platformer-Beispiel gezeigt. Diese Wechselwirkungen sind jedoch nicht immer vorhersehbar. Es kann mehr als einen Frame dauern, bis Kollisionen ausgelöst sind. Einige Kollisionen scheinen sich also geringfügig zu verschieben. Diese Probleme können behoben werden, erfordern jedoch ein gewisses Maß an Geschicklichkeit.
es: Un **controlador de personaje dinámico** utiliza un cuerpo rígido con tensor de inercia infinita. Básicamente, es un cuerpo rígido que no puede rotar. Los motores de física siempre dejan que los objetos se muevan y colisionen, después resuelven sus colisiones todas juntas. Esto hace que los controladores de personaje dinámico sean capaces de interactuar con otros objetos físicos sin inconvenientes, como se ve en la demo del juego de plataformas. Sin embargo estas interacciones no son siempre predecibles. Las colisiones pueden tardar más de un frame en ser resueltas, así que unas pocas colisiones pueden verse desplazadas un poquito. Esos problemas pueden solucionarse, pero requieren de cierta habilidad.
fr: Un **contrôleur de personnage dynamique** utilise un corps rigide avec un tenseur d'inertie infini. En fait, cela veut simplement dire que le corps rigide ne peut pas tourner. Les moteurs physiques laissent toujours les objets entrer en collision, puis résolvent leurs collisions tous ensemble. Cela fait que le contrôleur de personnage dynamique peut interagir avec d'autres objets physiques sans problème, comme on peut le voir dans la démo du jeu de plateforme. Cependant, ces interactions ne sont pas toujours prévisibles. Les collisions peuvent aussi prendre plus qu'une trame pour être résolues, donc quelques collisions peuvent sembler être un petit peu déplacées. Ces problèmes peuvent être résolus, mais demandent un certain niveau de compétence.
ja: **ダイナミックキャラクターコントローラー**\ は、無限慣性テンソルを持つリジットボディを使用します。 回転できないリジットボディです。 物理エンジンは常にオブジェクトの移動と衝突を許可し、その後、すべて一緒に衝突を解決します。これにより、ダイナミックキャラクターコントローラーは、プラットフォーマーデモで見られるように、他の物理オブジェクトとシームレスに対話できます。 ただし、これらの相互作用は常に予測できるとは限りません。 衝突は解決するために複数のフレームを必要とする可能性があるため、いくつかの衝突はわずかにずれているように見える場合があります。 これらの問題は修正できますが、ある程度のスキルが必要です。
pt_br: Um **controlador dinâmico de personagem** usa um corpo rígido com um tensor de inércia infinito. É um corpo rígido que não pode girar. Os motores de física sempre permitem que os objetos se movam e colidam, então resolvem suas colisões todas juntas. Isso torna os controladores de personagem dinâmicos capazes de interagir perfeitamente com outros objetos físicos, como visto na demonstração do jogo de plataforma. No entanto, essas interações nem sempre são previsíveis. As colisões podem levar mais de um quadro para serem resolvidas, então algumas colisões podem parecer deslocar um pouquinho. Esses problemas podem ser corrigidos, mas requerem uma certa habilidade.
ru: **Динамический контроллер персонажа** использует твёрдое тело с бесконечным тензором инерции. Это твёрдое тело, которое не может вращаться. Физические движки всегда позволяют объектам двигаться и сталкиваться, а затем решают их столкновения разом. Это делает динамические контроллеры персонажей способными бесшовно взаимодействовать с другими объектами физики, как показано в демо-версии платформера. Однако, эти взаимодействия не всегда предсказуемы. Столкновения могут длиться более одного кадра для завершения расчётов, и несколько столкновений могут оказаться смещёнными на несколько бит. Эти проблемы могут быть устранены, но требуют определенной квалификации.
zh_cn: **动力学角色控制器**\ 使用的是一个具有无限惯性张量的刚体。这是一个不能旋转的刚体. 物理引擎总是让物体移动和碰撞, 然后一并解决它们的碰撞. 这使得动态角色控制器能够与其他物理对象无缝交互, 就像在平台游戏演示中看到的那样. 然而, 这些互动并不总是可预测的. 碰撞可能需要多于一帧的时间来解决, 所以几个碰撞可能看起来会有很小的位移. 这些问题是可以解决的, 但需要一定的技巧.

source: A **kinematic character controller** is assumed to always begin in a non-colliding state, and will always move to a non-colliding state. If it starts in a colliding state, it will try to free itself like rigid bodies do, but this is the exception, not the rule. This makes their control and motion a lot more predictable and easier to program. However, as a downside, they can't directly interact with other physics objects, unless done by hand in code.
de: Es wird angenommen, dass ein **kinematischer Character Controller** immer in einem nicht kollidierenden Zustand beginnt und sich immer zu einen nicht kollidierenden Zustand bewegt. Wenn es in einem kollidierenden Zustand beginnt, wird es versuchen, sich wie starre Körper zu befreien, aber dies ist die Ausnahme, nicht die Regel. Dies macht ihre Steuerung und Bewegung viel vorhersehbarer und einfacher zu programmieren. Als Nachteil können sie jedoch nicht direkt mit anderen Physikobjekten interagieren, es sei denn, dies erfolgt manuell im Code.
es: Un **controlador cinemático de personaje** asume siempre en un estado de no colisión, y siempre se moverá a un estado de no colisión. Si comienza en un estado de colisión, intentará liberarse como lo hacen los cuerpos rígidos, pero esta es la excepción, no la regla. Esto hace que su control y movimiento sean mucho más predecibles y fáciles de programar. Sin embargo, como desventaja, no pueden interactuar directamente con otros objetos de la física, a menos que se haga a mano en código.
fr: Un **contrôleur de personnage cinématique** est toujours considéré comme commençant dans un état sans collision, et va toujours aller vers un état sans collision. S'il commence dans un état de collision, il essaiera de se libérer tout seul comme les corps rigides le font, mais c'est une exception, pas la règle. Cela fait que leur contrôle et leur mouvement sont beaucoup plus prévisibles et plus faciles à programmer. Par contre, l'inconvénient est qu'ils ne peuvent pas interagir directement avec les autres objets physiques, à moins que cela ne soit fait à la main dans le code.
ja: **キネマティックキャラクターコントローラー**\ は、常に非衝突状態で始まり、常に非衝突状態に移行すると想定されています。 衝突状態で開始した場合、リジットボディのように自身を解放しようとしますが、これは例外であり、ルールではありません。 これにより、制御と動作がより予測可能になり、プログラムが簡単になります。 ただし、欠点としては、コードで手動で行わない限り、他の物理オブジェクトと直接やり取りすることはできません。
pt_br: Presume-se que um **controlador de caractere cinemático** comece sempre em um estado sem colisão e sempre se moverá para um estado sem colisão. Se começar em estado de colisão, tentará se libertar como fazem os corpos rígidos, mas esta é a exceção, não a regra. Isso torna seu controle e movimento muito mais previsível e fácil de programar. No entanto, como desvantagem, eles não podem interagir diretamente com outros objetos físicos, a menos que sejam feitos à mão em código.
ru: Предполагается, что **контроллер кинематических персонажей** всегда начинает в состоянии отсутствия столкновений и всегда переходит в состояние отсутствия столкновений. Если он начнёт в состоянии столкновения, то он попытается освободиться, как это делают твёрдые тела, но это исключение, а не правило. Это делает управление им и движение гораздо более предсказуемыми и более простыми в программировании. Однако, как недостаток, он не может напрямую взаимодействовать с другими физическими объектами, если это не делается вручную в коде.
zh_cn: **运动学角色控制器**\ 总是假设以非碰撞状态开始，并将总是移动到非碰撞状态。如果它开始时处于碰撞状态, 将像刚体一样尝试释放自己, 但这是特例, 而不是规则. 这使得它们的控制和运动更可预测, 更容易编程. 然而, 有一个缺点, 它们不能直接与其他物理对象交互, 除非在代码中手动完成.

source: This short tutorial will focus on the kinematic character controller. Basically, the old-school way of handling collisions (which is not necessarily simpler under the hood, but well hidden and presented as a nice and simple API).
de: Diese kurze Anleitung konzentriert sich auf den kinematischen Charakter-Controller. Grundsätzlich die altmodische Art, mit Kollisionen umzugehen (was unter der Haube nicht unbedingt einfacher ist, aber gut versteckt und als nette und einfache API präsentiert).
ja: この短いチュートリアルでは、キネマティックキャラクターコントローラーに焦点を当てます。 基本的に、衝突を処理する昔ながらの方法です(内部では必ずしも単純ではないが、よく隠されており、素晴らしくシンプルなAPIとして提示されています)。

source: Physics process
de: Physikprozess
es: Proceso físico
fr: Processus physique
pt_br: Processo físico
ru: Обработка физики
zh_cn: 物理过程处理

source: To manage the logic of a kinematic body or character, it is always advised to use physics process, because it's called before physics step and its execution is in sync with physics server, also it is called the same amount of times per second, always. This makes physics and motion calculation work in a more predictable way than using regular process, which might have spikes or lose precision if the frame rate is too high or too low.
de: Um die Logik eines kinematischen Körpers oder Charakters zu verwalten wird immer empfohlen einen Physikprozess zu verwenden, da dieser vor dem Physikschritt aufgerufen wird und seine Ausführung mit dem Physikserver synchronisiert ist. Außerdem wird er immer gleich oft pro Sekunde aufgerufen. Dadurch funktionieren Physik und Bewegungsberechnung vorhersehbarer als bei normalen Prozessen, die Spitzen aufweisen oder an Genauigkeit verlieren können, wenn die Bildrate zu hoch oder zu niedrig ist.
es: Para manejar la lógica de un personaje o cuerpo cinemático, siempre se aconseja utilizar el proceso de la física, ya que es llamado antes del paso de la física y su ejecución está sincronizada con el servidor de física, también siempre es llamado la misma cantidad de veces por segundo. Esto hace que la física y el cálculo de movimiento funcionen de una manera más predecible que el proceso normal, que puede tener picos o perder precisión si la frecuencia de imagen es demasiado alta o demasiado baja.
fr: Pour gérer la logique d'un corps ou d'un personnage cinématique, il est toujours conseillé d'utiliser le processus physique, car il est appelé avant l'étape physique et son exécution est synchronisée avec le serveur physique, il est aussi appelé le même nombre de fois par seconde, toujours. Cela rend la physique et le calcul de mouvement plus prévisibles que l'utilisation du processus régulier, qui peut avoir des pics ou perdre en précision si la fréquence d'images est trop élevée ou trop faible.
ja: キネマティックボディまたはキャラクターのロジックを管理するには、常に物理プロセスを使用することをお勧めします。これは、物理ステップの前に呼び出され、その実行が物理サーバーと同期しているため、常に毎秒同じ回数とも呼ばれるためです。 これにより、通常のプロセスを使用するよりも物理学と動きの計算が予測可能な方法で機能します。フレームレートが高すぎたり低すぎたりするとスパイクが発生したり、精度が低下したりします。
pt_br: Para gerenciar a lógica de um corpo ou personagem cinemático, é sempre aconselhável usar o processo de física, pois é chamado antes da simulação de física e sua execução está em sincronia com o servidor de física, também é chamado a mesma quantidade de vezes por segundo, sempre. Isso faz com que a física e o cálculo de movimento funcionem de maneira mais previsível do que usando o processo regular, que pode ter picos ou perder a precisão se a taxa de quadros for muito alta ou muito baixa.
ru: Чтобы управлять логикой кинематического тела или персонажа, всегда рекомендуется использовать процесс обработки физики, потому что он вызывается перед шагом физики и его выполнение находится в синхронизации с сервером физики, а также вызов производится одинаковое количество раз в секунду, всегда. Это делает работу по расчёту физики и движения более предсказуемой, чем при использовании обычного процесса, который может иметь всплески или потерять точность, если частота кадров слишком высока или слишком низка.
zh_cn: 为了管理运动物体或角色的逻辑, 总是建议使用物理过程处理, 因为它在物理步骤之前被调用并且它的执行与物理服务器同步, 它也被以被每秒相同的次数调用. 这使得物理和运动计算以比使用常规过程处理更可预测的方式工作, 如果帧速率太高或太低, 则可能具有尖峰或丢失精度.

source: Scene setup
de: Eine Szene einrichten
es: Configuración de la escena
fr: Configuration de la scène
ja: シーンの設定
pt_br: Configuração da cena
ru: Настройка сцены
zh_cn: 场景设置

source: To have something to test, here's the scene (from the tilemap tutorial): :download:`kbscene.zip <files/kbscene.zip>`. We'll be creating a new scene for the character. Use the robot sprite and create a scene like this:
de: Zum testen, hier eine Szene (aus der TileMap-Anleitung) :: download: `kbscene.zip <files/kbscene.zip>`. Wir werden eine neue Szene für den Charakter erstellen. Verwenden Sie das Roboter-Sprite und erstellen Sie eine Szene wie folgt:
ja: テスト用に、ここにシーンがあります(タイルマップチュートリアルから): :download:`kbscene.zip <files / kbscene.zip>`\ 。 キャラクターの新しいシーンを作成します。 ロボットスプライトを使用して、次のようなシーンを作成します:

source: You'll notice that there's a warning icon next to our CollisionShape2D node; that's because we haven't defined a shape for it. Create a new CircleShape2D in the shape property of CollisionShape2D. Click on <CircleShape2D> to go to the options for it, and set the radius to 30:
de: Sie werden feststellen, dass sich neben unserem CollisionShape2D-Node ein Warnsymbol befindet. Das liegt daran, dass wir keine Form dafür definiert haben. Erstellen Sie eine neue CircleShape2D in der Shape-Eigenschaft von CollisionShape2D. Klicken Sie auf <CircleShape2D>, um zu den entsprechenden Optionen zu gelangen, und setzen Sie den Radius auf 30:
es: Notarás que hay un icono de advertencia junto al nodo CollisionShape2D, esto es porque no hemos definido una forma para él. Crea un nuevo CircleShape2D en la propiedad shape de CollisionShape2D. Haz clic en <CircleShape2D> para ir a las opciones correspondientes, y establece el radio en 30:
fr: Vous remarquerez qu'il y a une icône d'avertissement à côté de notre nœud CollisionShape2D ; c'est parce que nous n'avons pas défini de forme pour lui. Créez un nouveau CircleShape2D dans la propriété de forme de CollisionShape2D. Cliquez sur <CircleShape2D> pour accéder aux options correspondantes, et réglez le rayon sur 30 :
ja: CollisionShape2Dノードの横に警告アイコンがあります。 それは、形状を定義していないためです。 CollisionShape2Dのshapeプロパティで新しいCircleShape2Dを作成します。 <CircleShape2D>をクリックしてオプションに移動し、半径を30に設定します:
pt_br: Você notará que há um ícone de aviso próximo ao nosso nó CollisionShape2D; isso porque não definimos uma forma para ele. Crie um novo CircleShape2D na propriedade de forma de CollisionShape2D. Clique em <CircleShape2D> para acessar as opções e defina o raio como 30:
ru: Вы заметите, что рядом с нашим узлом CollisionShape2D есть значок предупреждения; это потому, что мы не определили форму для него. Создайте новый CircleShape2D в свойстве формы CollisionShape2D. Нажмите кнопку < CircleShape2D >, чтобы перейти к его параметрам, и установите радиус, равный 30:
zh_cn: 你会注意到, 在 "二维碰撞形状 "(CollisionShape2D)节点旁边有一个警告图标；那是因为我们还没有定义它的形状. 在" 二维碰撞形状"(CollisionShape2D)的形状属性中创建一个新的二维圆形形状(CircleShape2D). 点击 <二维圆形形状>(CircleShape2D)进入选项, 将半径设置为30:
