Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_kinematic_body_2d.po
Languages: de, es, fr, ja, ko, ru, zh_cn

source: This parameter is the maximum number of collisions before the body stops moving. Setting it too low may prevent movement entirely.
de: Dieser Parameter gibt die maximale Anzahl von Kollisionen an, bevor der Körper aufhört sich zu bewegen. Wenn Sie es zu niedrig einstellen, kann dies die Bewegung vollständig verhindern.
es: Este es el número máximo de colisiones que se detectarán antes de que el cuerpo pare de moverse. Ponerlo demasiado bajo puede impedir el movimiento por completo.
fr: Ce paramètre est le nombre maximum de collisions avant que le corps s'arrête de bouger. Le mettre à une valeur trop basse peut complètement empêcher le mouvement.
ja: このパラメーターは、ボディが移動を停止するまでの衝突の最大数です。 設定が低すぎると、動きが完全に妨げられる場合があります。
ru: Этот параметр задаёт максимальное число столкновений перед тем, как тело остановится. Слишком маленькое значение может полностью остановить перемещение.
zh_cn: 这个参数是物体停止移动前的最大碰撞次数. 设置太低可能会完全阻止移动.

source: ``floor_max_angle`` - *default value:* ``0.785398`` (in radians, equivalent to ``45`` degrees)
de: ``floor_max_angle`` - *Standardwert:* ``0.785398`` (in Radiant, entspricht ``45`` Grad)
es: ``floor_max_angle`` - *valor por defecto:* ``0.785398`` (en radianes, equivalente a ``45`` grados)
fr: ``floor_max_angle`` - *valeur par défaut:* ``0.785398`` (en radians, équivalent à ``45`` degrés)
ja: ``floor_max_angle`` - *デフォルト値:* ``0.785398`` (ラジアンで、\ ``45`` 度に相当)
ko: ``floor_max_angle`` - *기본 값:* ``0.785398`` (라디안에서는, ``45``\ 도와 같습니다)
ru: ``floor_max_angle`` — *значение по умолчанию:* ``0.785398`` (в радианах, эквивалентно ``45`` градусам)
zh_cn: ``floor_max_angle`` - *默认值:* ``0.785398`` (以弧度表示, 相当于 ``45`` 度)

source: This parameter is the maximum angle before a surface is no longer considered a "floor."
de: Dieser Parameter ist der maximale Winkel, bevor eine Oberfläche nicht mehr als "Boden" betrachtet wird.
es: Es el ángulo máximo antes de que una superficie deje de ser considerada un "suelo."
fr: Ce paramètre est l'angle maximum avant qu'une surface ne soit plus considérée comme un "sol."
ja: このパラメータは、サーフェスが「床」と見なされなくなる前の最大角度です。
ru: Этот параметр - максимальный угол, после которого поверхность перестает считаться "полом"
zh_cn: 这是表面不再被视为 "地板" 之前的最大角度

source: ``infinite_inertia`` - *default value:* ``true``
de: ``infinite_inertia`` - *Standardwert:* ``true``
es: ``infinite_inertia`` - *valor por defecto:* ``true``
fr: ``infinite_inertia`` - *valeur par défaut :* ``true``
ru: ``infinite_inertia`` — *значение по умолчанию:* ``true``
zh_cn: ``infinite_inertia`` - *默认值:* ``true``

source: When this parameter is ``true``, the body can push :ref:`RigidBody2D <class_RigidBody2D>` nodes, ignoring their mass, but won't detect collisions with them. If it's ``false`` the body will collide with rigid bodies and stop.
de: Wenn dieser Parameter ``true`` ist, kann der Körper :ref:`RigidBody2D <class_RigidBody2D>`-Nodes verschieben (wobei deren Masse ignoriert wird), jedoch keine Kollisionen mit ihnen erkennen. Wenn es ``false`` ist, kollidiert der Körper mit starren Körpern und stoppt.
es: Cuando este parámetro es ``true``, el cuerpo puede empujar nodos :ref:`RigidBody2D <class_RigidBody2D>`, ignorando su masa, pero no detectará colisiones con ellos. Si es ``false`` el cuerpo colisionará con cuerpos rígidos y se detendrá.
fr: Lorsque ce paramètre est ``true``, le corps peut pousser :ref:`RigidBody2D <class_RigidBody2D>` des nœuds, en ignorant leur masse, mais ne détectera pas les collisions avec eux. S'il est ``false``, le corps entre en collision avec les corps rigides et s'arrête.
ru: Если этот параметр ``true``, то тело может толкать узлы :ref:`RigidBody2D <class_RigidBody2D>`, игнорируя их массу, но без обнаружения столкновений с ними. Если этот параметр ``false``, тело столкнется с твёрдым телом и остановится.
zh_cn: 当这个参数为 ``true`` 时, 本体可以推动 :ref:`RigidBody2D <class_RigidBody2D>` 节点, 忽略其质量, 不会检测到与它们的碰撞. 如果是 ``false``, 本体会与刚体发生碰撞而停止.

source: This method adds some additional functionality to ``move_and_slide()`` by adding the ``snap`` parameter. As long as this vector is in contact with the ground, the body will remain attached to the surface. Note that this means you must disable snapping when jumping, for example. You can do this either by setting ``snap`` to ``Vector2.ZERO`` or by using ``move_and_slide()`` instead.
de: Diese Methode fügt ``move_and_slide()`` einige zusätzliche Funktionen hinzu, indem der Parameter ``snap`` hinzugefügt wird. Solange dieser Vektor mit dem Boden in Kontakt steht, bleibt der Körper an der Oberfläche haften. Beachten Sie, dass Sie daher das Einrasten deaktivieren müssen, beispielsweise beim Springen. Sie können hierfür entweder ``snap`` auf ``Vector2.ZERO`` setzen oder stattdessen ``move_and_slide()`` verwenden.
es: Este método añade algunas funcionalidades adicionales a ``move_and_slide()`` agregando el parámetro ``snap``. Siempre que este vector esté en contacto con el suelo, el cuerpo permanecerá unido a la superficie. Ten en cuenta que esto significa que debes deshabilitar el snap por ejemplo, al saltar. Puedes hacer esto configurando ``snap`` a ``Vector2.ZERO`` o usando ``move_and_slide()`` en su lugar.
fr: Cette méthode ajoute une fonctionnalité en plus à ``move_and_slide()`` en ajoutant le paramètre ``snap``. Tant que ce vecteur est en contact avec le sol, le corps restera attaché à la surface. Notez que cela veut dire qu'il faut désactiver cette fonctionnalité pendant un saut, par exemple. Vous pouvez faire cela soit en ajustant la valeur de ``snap`` à ``Vector2.ZERO`` ou en utilisant ``move_and_slide()`` à la place.
ru: Этот метод добавляет некоторые дополнительный функционал к ``move_and_slide()``, добавляя параметр ``snap``. Пока этот вектор находится в контакте с землей, тело будет оставаться прикрепленным к поверхности. Обратите внимание — это означает, что Вы должны отключить привязывание, например, когда прыгаете. Для этого можно установить ``snap`` в ``Vector2.ZERO`` или использовать ``move_and_slide()``.
zh_cn: 这个方法通过添加 ``sap`` 参数, 给 ``move_and_slide()`` 增加了一些额外的功能. 只要这个向量与地面接触, 物体就会保持在表面上. 注意, 这意味着你必须在例如跳跃时禁用捕捉. 你可以将 ``sap`` 设置为 ``Vector2.ZERO`` 或者使用 ``move_and_slide()`` 代替.

source: Detecting collisions
de: Kollisionen erkennen
es: Detectando colisiones
fr: Détection des collisions
ru: Определение столкновений
zh_cn: 检测碰撞

source: When using ``move_and_collide()`` the function returns a ``KinematicCollision2D`` directly, and you can use this in your code.
de: Bei Verwendung von ``move_and_collide()`` gibt die Funktion direkt eine ``KinematicCollision2D`` zurück, die Sie in Ihrem Code verwenden können.
es: Al usar ``move_and_collide()`` la función retorna un ``KinematicCollision2D`` directamente, y puedes usarlo en tu código.
fr: Lorsque vous utilisez ``move_and_collide()``, la fonction retourne directement un ``KinematicCollision2D``, et vous pouvez l'utiliser dans votre code.
ru: При использовании ``move_and_collide()`` функция напрямую возвращает ``KinematicCollision2D``, и это можно использовать в коде.
zh_cn: 当使用 ``move_and_collide()`` 时, 函数直接返回一个 ``KinematicCollision2D`` , 你可以在代码中使用这个.

source: When using ``move_and_slide()`` it's possible to have multiple collisions occur, as the slide response is calculated. To process these collisions, use ``get_slide_count()`` and ``get_slide_collision()``:
de: Bei Verwendung von ``move_and_slide()`` können mehrere Kollisionen auftreten, wenn die Antwort berechnet wird. Verwenden Sie zum Verarbeiten dieser Kollisionen ``get_slide_count()`` und ``get_slide_collision()``:
es: Al usar ``move_and_slide()`` es posible que se produzcan múltiples colisiones, ya que es calculada la respuesta al deslizamiento. Para procesar estas colisiones, utiliza ``get_slide_count()`` y ``get_slide_collision()``:
fr: En utilisant ``move_and_slide()``, il est possible que plusieurs collisions se produisent, car la réponse du glissement est calculée. Pour traiter ces collisions, utilisez ``get_slide_count()`` et ``get_slide_collision()`` :
ru: При использовании ``move_and_slide()`` возможно возникновение нескольких столкновений, пока вычисляется ответ для скольжения. Для обработки этих столкновений используйте ``get_slide_count()`` и ``get_slide_collision()``:
zh_cn: 当使用 ``move_and_slide()`` 时, 有可能发生多次碰撞, 因为滑动响应是计算出来的. 要处理这些碰撞, 使用 ``get_slide_count()`` 和 ``get_slide_collision()``:

source: `get_slide_count()` only counts times the body has collided and changed direction.
de: `get_slide_count()` zählt nur, wenn der Körper kollidiert ist und die Richtung geändert hat.
fr: `get_slide_count()` ne compte que les fois où le corps est entré en collision et a changé de direction.
ru: `get_slide_count()` считает только те моменты, когда тело сталкивалось и изменяло направление.
zh_cn: `get_slide_count()` 只计算物体碰撞和改变方向的次数.

source: See :ref:`KinematicCollision2D <class_KinematicCollision2D>` for details on what collision data is returned.
de: Siehe :ref:`KinematicCollision2D <class_KinematicCollision2D>` für Details darüber, welche Kollisionsdaten zurückgegeben werden.
es: Mira :ref:`KinematicCollision2D <class_KinematicCollision2D>` para más detalles sobre que datos de colisión son retornados.
fr: Voir :ref:`KinematicCollision2D <class_KinematicCollision2D>` pour plus de détails sur les données de collision renvoyées.
ru: Подробные сведения о том, какие данные о столкновениях возвращаются, см. в разделе :ref:`KinematicCollision2D <class_KinematicCollision2D>`.
zh_cn: 关于返回哪些碰撞数据, 请参见 :ref:`KinematicCollision2D <class_KinematicCollision2D>` .

source: Which movement method to use?
de: Welche Bewegungsmethode soll verwendet werden?
es: ¿Cuál método de movimiento hay que usar?
fr: Quelle méthode de mouvement utiliser ?
ja: 使用する移動方法は？
ko: 어떤 이동 메서드를 사용해야 할까요?
ru: Какой метод перемещения следует использовать?
zh_cn: 使用哪种运动方式？

source: A common question from new Godot users is: "How do you decide which movement function to use?" Often, the response is to use ``move_and_slide()`` because it's "simpler," but this is not necessarily the case. One way to think of it is that ``move_and_slide()`` is a special case, and ``move_and_collide()`` is more general. For example, the following two code snippets result in the same collision response:
de: Eine häufige Frage von neuen Godot-Benutzern lautet: "Wie entscheiden Sie, welche Bewegungsfunktion verwendet werden soll?" Oft lautet die Antwort ``move_and_slide()`` weil es "einfacher" ist, aber dies ist nicht unbedingt der Fall. Eine Möglichkeit sich das vorzustellen ist, dass ``move_and_slide()`` ein Sonderfall und ``move_and_collide()`` allgemeiner ist. Die folgenden zwei Codefragmente führen beispielsweise zu derselben Kollisionsantwort:
es: Una duda común para los usuarios nuevos de Godot es: "¿Cómo decidir qué función de movimiento usar?". Frecuentemente, la respuesta es usar ``move_and_slide()`` porque es más "simple", pero esto no quiere decir que siempre sea así. Un modo de verlo es que ``move_and_slide()`` es un caso especial, y ``move_and_collide()`` es más general. Para poner un ejemplo, los siguientes dos fragmentos de código producen la misma respuesta a colisiones:
fr: Une question courante chez les nouveaux utilisateurs de Godot est : "Comment décider quelle fonction de mouvement utiliser ?" Souvent, la réponse est d'utiliser ``move_and_slide()`` parce qu'elle est plus "simple", mais ce n'est pas nécessairement le cas. Une façon d'y réfléchir est de se dire que ``move_and_slide()`` est un cas spécial, et ``move_and_collide()`` est plus général. Par exemple, les deux extraits de code ci-dessous conduisent à la même réaction à la collision :
ja: 新しいGodotユーザーからの一般的な質問は、「どの移動関数を使用するのかを、どのように決めればいいですか？」というものですが、 多くの場合、その答えは 「より簡単」な ``move_and_slide()`` を使用することですが、必ずしも全てがそうではありません。 判断をする一つの方法は、\ ``move_and_slide()`` は特殊なケースであり、\ move_and_collide()`` はより一般的であるということです。 たとえば、次の2つのコードスニペットは同じ衝突応答になります:
ru: Основной вопрос от новых пользователей Godot: «Как определить, какую функцию движения использовать?» Часто ответ заключается в использовании ``move_and_slide()``, потому что это «проще», но это не обязательно так. Один из способов думать об этом заключается в том, что ``move_and_slide()`` является частным случаем, а ``move_and_collide()`` — более общим. Например, следующие два фрагмента кода приводят к одной и той же реакции на столкновение:
zh_cn: Godot新用户的一个常见问题是:"你如何决定使用哪个移动函数？" 通常, 回答是使用 ``move_and_slide()`` , 因为它 "更简单" , 但情况不一定如此. 有一种思路是, ``move_and_slide()`` 是一种特殊情况, 而 ``move_and_collide()`` 更通用. 例如, 下面两个代码片段的结果是相同的碰撞响应:

source: Anything you do with ``move_and_slide()`` can also be done with ``move_and_collide()``, but it might take a little more code. However, as we'll see in the examples below, there are cases where ``move_and_slide()`` doesn't provide the response you want.
de: Alles was Sie mit ``move_and_slide()`` tun, kann auch mit ``move_and_collide()`` ausgeführt werden, es kann jedoch etwas mehr Code erforderlich sein. Wie wir in den folgenden Beispielen sehen werden gibt es Fälle, in denen ``move_and_slide()`` nicht die gewünschte Antwort liefert.
es: Cualquier cosa hecha con ``move_and_slide()`` se puede hacer también con ``move_and_collide()``, pero puede requerir un poco más de código. Sin embargo, como veremos en los siguientes ejemplos, hay casos en los que ``move_and_slide()`` no provee la respuesta deseada.
fr: Tout ce qui peut être fait avec ``move_and_slide()`` peut aussi être fait avec ``move_and_collide()``, mais cela peut demander un peu plus de code. Néammoins, comme nous allons le voir dans les exemples ci-dessous, il y a des cas où ``move_and_slide()`` ne donne pas le résultat voulu.
ja: ``move_and_slide()`` で行うことはすべて ``move_and_collide()`` でもできますが、もう少しコードが必要になる場合があります。 ただし、以下の例で見るように、 ``move_and_slide()`` が希望する応答を提供しない場合があります。
ko: ``move_and_slide()``\ 로 하는 것을 ``move_and_collide()``\ 또한 할 수 있습니다, 하지만 좀 더 많은 코드를 갖습니다. 하지만 아래에서 예제를 보면, ``move_and_slide()``\ 가 원하는 응답을 제공하지 않는 경우도 있습니다.
ru: Все, что Вы делаете с помощью ``move_and_slide()``, также может быть сделано с помощью ``move_and_collide()``, но это может потребовать немного больше кода. Однако, как мы увидим в примерах ниже, есть случаи, когда ``move_and_slide()`` не предоставляет возможности реализовать реакцию, которая нам нужна.
zh_cn: 您用 ``move_and_slide()`` 做的任何事情都可以用 ``move_and_collide()`` 来完成, 但它可能需要更多的代码. 但是, 正如我们在下面的示例中将看到的, 有些情况下 ``move_and_slide()`` 不能提供您想要的响应.

source: In the example above, we assign the velocity that ``move_and_slide()`` returns back into the ``velocity`` variable. This is because when the character collides with the environment, the function recalculates the speed internally to reflect the slowdown.
de: Im obigen Beispiel weisen wir die Geschwindigkeit zu, die ``move_and_slide()`` in die Variable ``velocity`` übergibt. Dies liegt daran, dass die Funktion die Geschwindigkeit intern neu berechnet, wenn das Zeichen mit der Umgebung kollidiert, um die Verlangsamung widerzuspiegeln.
es: En el ejemplo de arriba, asignamos la velocidad que retorna ``move_and_slide()`` a la variable ``velocity``. Esto se debe a que cuando el personaje colisiona con el entorno, la función internamente vuelve a calcular la velocidad para reflejar la desaceleración.
fr: Dans l'exemple ci-dessus, nous attribuons la vitesse que ``move_and_slide()`` renvoie dans la variable ``velocity``. En effet, lorsque le personnage entre en collision avec l'environnement, la fonction recalcule la vitesse en interne pour refléter le ralentissement.
ja: 上記の例では、\ ``move_and_slide()`` が ``velocity`` 変数に戻す速度を割り当てます。 これは、キャラクターが環境と衝突すると、関数が速度を内部的に再計算してスローダウンを反映するためです。
ru: В приведенном выше примере мы сохраняем скорость, которую возвращает ``move_and_slide()``, обратно в переменную ``velocity``. Это нужно потому, что при столкновении персонажа с окружением функция внутри пересчитывает скорость, чтобы отразить замедление.
zh_cn: 在上面的例子中, 我们将 ``move_and_slide()`` 返回的速度赋值给 ``velocity`` 变量. 这是因为当角色与环境发生碰撞时, 函数会在内部重新计算速度, 以反映减速的情况.

source: For example, if your character fell on the floor, you don't want it to accumulate vertical speed due to the effect of gravity. Instead, you want its vertical speed to reset to zero.
de: Wenn Ihr Charakter beispielsweise auf den Boden gefallen ist, möchten Sie nicht, dass er aufgrund der Schwerkraft eine vertikale Geschwindigkeit erreicht. Stattdessen soll die vertikale Geschwindigkeit auf Null zurückgesetzt werden.
es: Por ejemplo, si tu personaje se cae al suelo, no quieres que este acumule velocidad vertical por efecto de la gravedad. En vez de eso, quieres que su velocidad vertical sea restablecida a cero.
fr: Par exemple, si votre personnage est tombé au sol, vous ne voulez pas qu'il accumule de la vitesse verticale à cause de l'effet de la gravité. Au lieu de cela, vous souhaitez que sa vitesse verticale soit remise à zéro.
ja: たとえば、キャラクターが床に落ちた場合、重力の影響により垂直速度を蓄積することは望ましくありません。 代わりに、垂直速度をゼロにリセットする必要があります。
ru: Например, если Ваш персонаж упал на пол, Вы не хотите, чтобы он накапливал вертикальную скорость из-за эффекта гравитации. Вместо этого необходимо, чтобы его вертикальная скорость была обнулена.
zh_cn: 例如, 如果角色倒在地上, 不希望它因为重力的影响而积累垂直速度, 而希望它的垂直速度重置为零.

source: ``move_and_slide()`` may also recalculate the kinematic body's velocity several times in a loop as, to produce a smooth motion, it moves the character and collides up to five times by default. At the end of the process, the function returns the character's new velocity that we can store in our ``velocity`` variable, and use on the next frame.
de: ``move_and_slide()`` kann die Geschwindigkeit des kinematischen Körpers auch mehrmals in einer Schleife neu berechnen, da er den Charakter bewegt und standardmäßig bis zu fünf Mal kollidiert, um eine gleichmäßige Bewegung zu erzeugen. Am Ende des Prozesses gibt die Funktion die neue Geschwindigkeit des Charakters zurück, die wir in unserer Variablen ``velocity`` speichern und im nächsten Frame verwenden können.
es: ``move_and_slide()`` también puede recalcular la velocidad del cuerpo cinemático varias veces en un bucle ya que, para producir un movimiento suave, mueve al personaje y colisiona hasta cinco veces por defecto. Al final del proceso, la función devuelve la nueva velocidad del personaje que podemos almacenar en nuestra variable ``velocity``, y usarla en el siguiente frame.
fr: ``move_and_slide()`` peut aussi recalculer la vitesse du corps cinématique plusieurs fois dans une boucle car, pour produire un mouvement fluide, il déplace le personnage et entre en collision jusqu'à cinq fois par défaut. À la fin du processus, la fonction renvoie la nouvelle vitesse du personnage que nous pouvons stocker dans notre variable ``velocity`` et utiliser lors de la trame suivante.
ja: ``move_and_slide()`` は、キネマティックボディの速度をループ内で数回再計算し、スムーズなモーションを生成するために、キャラクターを移動し、デフォルトで最大5回衝突する場合があります。 プロセスの最後で、関数は ``velocity`` 変数に保存し、次のフレームで使用できるキャラクターの新しい速度を返します。
ru: ``move_and_slide()`` также может пересчитывать скорость кинематического тела несколько раз в цикле, так как для создания плавного движения он перемещает персонажа и сталкивается до пяти раз по умолчанию. В конце процесса функция возвращает новую скорость персонажа, которую можно сохранить в нашей переменной ``velocity`` и использовать в следующем кадре.
zh_cn: ``move_and_slide()`` 还可以在循环中多次重新计算运动体的速度, 为了产生一个平滑的运动, 它默认会移动角色, 并碰撞5次, 在这个过程结束时, 函数返回角色的新速度, 可以将其存储在 ``velocity`` 变量中, 并在下一帧中使用.

source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples
ja: 例
ko: 예제
ru: Примеры
zh_cn: 示例

source: To see these examples in action, download the sample project: :download:`using_kinematic2d.zip <files/using_kinematic2d.zip>`.
de: Um diese Beispiele in Aktion zu sehen, laden Sie das Beispielprojekt herunter: :download:`using_kinematic2d.zip <files/using_kinematic2d.zip>`.
es: Para ver estos ejemplos en funcionamiento, descarga el proyecto: :download:`using_kinematic2d.zip <files/using_kinematic2d.zip>`.
fr: Pour voir des exemples en action, téléchargez le projet de test : :download:`using_kinematic2d.zip <files/using_kinematic2d.zip>`.
ja: これらの例を実際に見るには、サンプルプロジェクトをダウンロードします: :download:`using_kinematic2d.zip <files/using_kinematic2d.zip>`\ 。
ko: 실제 예제를 보기 위해, 샘플 프로젝트를 다운로드 하세요: :download:`using_kinematic2d.zip <files/using_kinematic2d.zip>`.
ru: Чтобы увидеть эти примеры в действии, загрузите образец проекта: :download:`using_kinematic2d.zip <files/using_kinematic2d.zip>`.
zh_cn: 要查看这些示例, 请下载示例项目: :download:`using_kinematic2d.zip <files/using_kinematic2d.zip>`.

source: Movement and walls
de: Bewegung und Wände
es: Movimiento y paredes
fr: Mouvement et murs
ja: 動きと壁
ko: 이동과 벽
ru: Перемещение и стены
zh_cn: 移动和墙壁

source: If you've downloaded the sample project, this example is in "BasicMovement.tscn".
de: Wenn Sie das Beispielprojekt heruntergeladen haben, befindet sich dieses Beispiel in "BasicMovement.tscn".
es: Si has descargado el proyecto, este ejemplo está en la escena "BasicMovement.tscn".
fr: Si vous avez téléchargé le projet de test, cet exemple est dans "BasicMovement.tscn".
ja: サンプルプロジェクトをダウンロードした場合、この例は"BasicMovement.tscn"にあります。
ko: 샘플 프로젝트를 다운로드 했다면, 이 예제는 "BasicMovement.tscn"입니다.
ru: Если Вы загрузили образец проекта, то этот пример находится в файле «BasicMovent.tscn».
zh_cn: 如果你已经下载了示例项目, 这个例子在 "BasicMovement.tscn" 中.
