Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_kinematic_body_2d.po
Languages: de, es, fr, ja, ko, ru, zh_cn

source: For this example, add a ``KinematicBody2D`` with two children: a ``Sprite`` and a ``CollisionShape2D``. Use the Godot "icon.png" as the Sprite's texture (drag it from the Filesystem dock to the *Texture* property of the ``Sprite``). In the ``CollisionShape2D``'s *Shape* property, select "New RectangleShape2D" and size the rectangle to fit over the sprite image.
de: Fügen Sie in diesem Beispiel einen ``KinematicBody2D`` mit zwei untergeordneten Elementen hinzu: ein ``Sprite`` und ein ``CollisionShape2D``. Verwenden Sie das Godot "icon.png" als Sprite-Textur (ziehen Sie es aus dem Dateisystem-Dock in die *Textur*-Eigenschaft des ``Sprite``). Wählen Sie in der Eigenschaft *Shape* von ``CollisionShape2D`` die Option "NewRectangleShape2D" aus und passen Sie das Rechteck so an, dass es über das Sprite-Bild passt.
es: Para este ejemplo, añade un ``KinematicBody2D`` con dos hijos: un ``Sprite`` y un ``CollisionShape2D``. Usa el "icon.png" de Godot como textura del Sprite (arrástralo desde el panel de Sistema de Archivos a la propiedad *Texture* del ``Sprite``). En la propiedad *Shape* de ``CollisionShape2D``, selecciona "Nuevo RectangleShape2D" y redimensiona el rectángulo para que quepa sobre la imagen del sprite.
fr: Pour cet exemple, ajoutez un ``KinematicBody2D`` avec deux enfants : une ``Sprite`` et une ``CollisionShape2D``. Utilisez l'icône de Godot "icon.png" comme texture pour la Sprite (faites glisser depuis le Système de fichiers vers la propriété *Texture* de la ``Sprite``). Dans la propriété *Shape* de la ``CollisionShape2D``, sélectionnez "Nouveau RectangleShape2D" and redimensionnez le rectangle pour remplir l'image de la Sprite.
ja: この例では、\ ``Sprite`` と ``CollisionShape2D`` の2つの子を持つ ``KinematicBody2D`` を追加します。 Godot "icon.png"をSpriteのテクスチャとして使用します(ファイルシステムドックから ``Sprite`` の *Texture* プロパティにドラッグします)。\ ``CollisionShape2D`` の *Shape* プロパティで、「新規 RectangleShape2D」を選択し、スプライト画像に収まるように長方形のサイズを変更します。
ko: 이 예시에서 ``KinematicBody2D``\ 를 두 자식과 함께 추가합니다: ``Sprite``\ 와 ``CollisionShape2D``\ 입니다. Godot "icon.png"를 Sprite의 텍스쳐 속성으로 사용합니다 (파일 시스템 독에서 ``Sprite``\ 의 *Texture* 속성으로 끌어다 놓으십시오). ``CollisionShape2D``\ 의 *Shape* 속성에서 "New RectangleShape2D"를 선택하고 스프라이트 이미지에 맞게 사각형 크기를 조정합니다.
ru: В этом примере добавьте ``KinematicBody2D`` с двумя дочерними элементами: ``Sprite`` и ``CollisionShape2D``. Используйте иконку Godot «icon.png» в качестве текстуры Sprite (перетащите её из дока файловой системы в свойство ``Texture`` нашего ``Sprite``). В свойстве ``Shape`` в ``CollisionShape2D`` выберите «Новый RectangleShape2D» и установите размер прямоугольника, чтобы он заполнил всё изображение спрайта.
zh_cn: 在这个例子中, 添加一个 ``KinematicBody2D`` , 有两个子级: ``Sprite`` 和 ``CollisionShape2D`` . 使用Godot "icon.png" 作为Sprite的纹理, 将其从文件系统栏拖到 ``Sprite`` 的 *Texture* 属性. 在 ``CollisionShape2D`` 的 *Shape* 属性中, 选择 "New RectangleShape2D" , 并将矩形的大小调整到适合sprite图像的大小.

source: See :ref:`doc_2d_movement` for examples of implementing 2D movement schemes.
de: Beispiele für die Implementierung von 2D-Bewegungsmuster finden Sie unter :ref:`doc_2d_movement`.
es: Ver :ref:`doc_2d_movement` para más ejemplos de técnicas para implementar movimiento en 2D.
fr: Voir :ref:`doc_2d_movement` pour des exemples d'implémentation de systèmes de mouvement 2D.
ja: 2D移動スキームの実装例については、\ :ref:`doc_2d_movement` を参照してください。
ko: 2D 이동 구조를 구현하는 예제는 :ref:`doc_2d_movement`\ 를 참고하세요.
ru: Посмотрите :ref:`doc_2d_movement` примеры реализации 2D схем движения.
zh_cn: 有关实现2D移动方案的示例, 请参阅 :ref:`doc_2d_movement` .

source: Attach a script to the KinematicBody2D and add the following code:
de: Hängen Sie ein Skript an KinematicBody2D an und fügen Sie den folgenden Code hinzu:
es: Anexa un script al KinematicBody2D y agrega el siguiente código:
fr: Attachez un script au KinematicBody2D et ajoutez le code suivant :
ja: KinematicBody2Dにスクリプトをアタッチし、次のコードを追加します:
ko: KinematicBody2D에 스크립트를 붙이고 다음의 코드를 추가하세요:
ru: Присоедините скрипт к KinematicBody2D и добавьте следующий код:
zh_cn: 将脚本附加到KinematicBody2D并添加以下代码:

source: Run this scene and you'll see that ``move_and_collide()`` works as expected, moving the body along the velocity vector. Now let's see what happens when you add some obstacles. Add a :ref:`StaticBody2D <class_StaticBody2D>` with a rectangular collision shape. For visibility, you can use a sprite, a Polygon2D, or turn on "Visible Collision Shapes" from the "Debug" menu.
de: Wenn Sie diese Szene ausführen, werden Sie sehen, dass ``move_and_collide()`` wie erwartet funktioniert und den Körper entlang des Geschwindigkeitsvektors bewegt. Nun wollen wir sehen was passiert, wenn Sie einige Hindernisse hinzufügen. Fügen Sie ein :ref:`StaticBody2D <class_StaticBody2D>` mit einer rechteckigen Kollisionsform hinzu. Zur besseren Sichtbarkeit können Sie ein Sprite oder ein Polygon2D verwenden oder "Sichtbare Kollisionsformen" im Menü "Debuggen" aktivieren.
es: Ejecuta esta escena y verás que ``move_And_collide()`` funciona como es esperado, moviendo el cuerpo a lo largo de lo indicado por el vector velocidad. Ahora veamos qué sucede cuando agregas algunos obstáculos. Coloca un :ref:`StaticBody2D <class_StaticBody2D>` con una CollisionShape2D rectangular. Para visualizarlo puedes utilizar un Sprite, un Polygon2D o activa la opción "Ver Formas de Colisión" del menú "Depurar".
fr: Jouez la scène et vous verrez que ``move_and_collide()`` marche comme prévu et bouge le corps le long du vecteur de vitesse. Maintenant voyons ce qui se passe quand on ajoute des obstacles. Ajoutez un :ref:`StaticBody2D <class_StaticBody2D>` avec une forme de collision rectangulaire. Pour la rendre visible, vous pouvez utiliser une Sprite, un Polygon2D, ou bien activer l'option "Formes de collision visibles" du menu "Débogage".
ja: このシーンを実行すると、\ ``move_and_collide()`` が期待どおりに動作し、ボディが速度ベクトルに沿って移動することがわかります。 障害物を追加するとどうなるか見てみましょう。 長方形の衝突形状を持つ :ref:`StaticBody2D <class_StaticBody2D>` を追加します。 可視性を確保するには、SpriteまたはPolygon2Dを使用するか、「デバッグ」メニューから「コリジョン形状の表示」をオンにします。
ko: 이 씬을 실행하고 ``move_and_collide()``\ 가 예상대로, 바디가 속도 벡터를 따라 움직이는 것을 볼 수 있습니다. 이제 장애물을 추가하면 어떻게 되는지 봅시다. 직사각형 충돌 모양을 가진 :ref:`StaticBody2D <class_StaticBody2D>`\ 를 추가합니다. 가시성을 위해, 스프라이트, Polygon2D, 혹은 "디버그" 메뉴에서 "충돌 모양 보이기"를 키면 됩니다.
ru: Запустите сцену и Вы увидите, что ``move_and_collide()`` работает, как ожидалось, перемещая тело вдоль вектора скорости. Теперь давайте посмотрим, что происходит, когда Вы добавляете некоторые препятствия. Добавьте :ref:`StaticBody2D <class_StaticBody2D>` с прямоугольной формой столкновения. Для визуализации Вы можете использовать спрайт, Polygon2D, или включить «Видимые Формы Столкновения» из меню «Отладка».
zh_cn: 运行这个场景, 您会看到 ``move_and_collide()`` 按预期工作, 沿着速度向量方向移动物体. 现在让我们看看当您添加一些障碍时会发生什么. 添加一个具有矩形碰撞形状的 :ref:`StaticBody2D <class_StaticBody2D>` . 为了可见性, 您可以使用精灵,Polygon2D, 或从 "调试" 菜单中打开 "可见碰撞形状".

source: Run the scene again and try moving into the obstacle. You'll see that the ``KinematicBody2D`` can't penetrate the obstacle. However, try moving into the obstacle at an angle and you'll find that the obstacle acts like glue - it feels like the body gets stuck.
de: Führen Sie die Szene erneut aus und versuchen Sie, sich in das Hindernis zu bewegen. Sie werden sehen, dass der ``KinematicBody2D`` das Hindernis nicht durchdringen kann. Wenn Sie jedoch versuchen sich schräg in das Hindernis zu bewegen, werden Sie feststellen, dass das Hindernis wie Klebstoff wirkt - es fühlt sich an, als würde der Körper stecken bleiben.
es: Ejecuta la escena nuevamente e intenta moverte contra el obstáculo, verás que el ``KinematicBody2D`` no puede penetrarlo. Ahora intenta moverte contra un obstáculo con la superficie en ángulo y verás que se "adhiere" en el obstáculo, como si estuviese atascado.
fr: Jouez la scène de nouveau et essayez de bouger vers les obstacles. Vous verrez que le ``KinematicBody2D`` ne peut pas les traverser. Néammoins, essayez de bouger vers les obstacles avec un angle et vous verrez qu'ils agissent comme de la colle ; il semble que le corps se coince.
ja: シーンを再度実行し、障害物に移動してみてください。\ ``KinematicBody2D`` が障害物を貫通できないことがわかります。 ただし、障害物に斜めに移動してみてください。障害物が接着剤のように機能することがわかります。ボディが立ち往生しているように感じます。
ko: 씬을 다시 실행하고 장애물로 움직여 봅니다. ``KinematicBody2D``\ 가 장애물을 통과하지 못하는 것을 볼 수 있습니다. 하지만 장애물 안으로 움직이려고 하면 장애물이 풀처럼 행동하는 것을 찾을 수 있습니다 - 바디가 끼어있는 느낌이 듭니다.
ru: Запустите сцену еще раз и попытайтесь двигаться в препятствие. Вы увидите, что ``KinematicBody2D`` не может проникнуть в него. Теперь попробуйте двигаться в препятствие под углом, и обнаружите, что препятствие действует как клей — ощущение, что тело застревает.
zh_cn: 再次运行场景并尝试移动到障碍物中. 您会看到 ``KinematicBody2D`` 无法穿透障碍物. 但是, 尝试以某个角度进入障碍物, 您会发现障碍物就像胶水一样 - 感觉物体被卡住了.

source: This happens because there is no *collision response*. ``move_and_collide()`` stops the body's movement when a collision occurs. We need to code whatever response we want from the collision.
de: Dies geschieht, weil es keine *Kollisionsantwort* gibt. ``move_and_collide()`` stoppt die Bewegung des Körpers, wenn eine Kollision auftritt. Wir müssen jede gewünschte Antwort auf die Kollision codieren.
es: Esto sucede porque no hay *respuesta a la colisión*, ``move_and_collide()`` detiene el movimiento cuando ocurre una colisión. Tenemos que programar la respuesta que queremos cuando eso sucede.
fr: Cela arrive parce qu'il n'y a pas de *réaction à la collision*. ``move_and_collide()`` arrête le mouvement du corps quand une collision se produit. On doit coder n'importe quelle réaction que l'on veut pour cette collision.
ja: これは、\ *collision response * がないために発生します。\ ``move_and_collide()`` は衝突が発生したときに体の動きを止めます。 衝突からの応答をコーディングする必要があります。
ko: 이것은 *충돌 응답*\ 이 없기 때문에 발생한 것입니다. ``move_and_collide()``\ 는 충돌이 발생할 때 바디의 움직임을 멈춥니다. 충돌로부터 원하는 어떤 응답이라도 코딩해야 합니다.
ru: Это происходит из-за отсутствия *реакции на столкновение*. ``move_and_collide()`` останавливает движение тела при столкновении. Нам нужно кодировать любую реакцию, которую мы хотим получить после столкновения.
zh_cn: 发生这种情况是因为没有 *碰撞响应* . ``move_and_collide()`` 在碰撞发生时停止物体的运动. 我们需要编写我们想要的碰撞响应.

source: Try changing the function to ``move_and_slide(velocity)`` and running again. Note that we removed ``delta`` from the velocity calculation.
de: Versuchen Sie die Funktion in "move_and_slide (velocity)" zu ändern und erneut auszuführen. Beachten Sie, dass wir ``delta`` aus der Geschwindigkeitsberechnung entfernt haben.
es: Intenta cambiar la función a ``move_and_slide(velocity)`` y ejecútala nuevamente. Notar que se ha quitado ``delta`` del cálculo del parámetro velocity.
fr: Essayez de changer la fonction en ``move_and_slide(velocity)`` et de rejouer la scène. Notez qu'on a enlevé le ``delta`` du calcul de la vitesse.
ja: 関数を ``move_and_slide(velocity)`` に変更して、もう一度実行してみてください。 速度計算から ``delta`` を削除していることに注意してください。
ko: 함수를 ``move_and_slide(velocity)``\ 로 변경하고 다시 실행합니다. 우리는 속도 계산에서 ``delta``\ 를 제거했습니다.
ru: Попробуйте изменить функцию на ``move_and_slide(velocity)`` и запустить снова. Обратите внимание, что из расчета скорости была удалена ``delta``.
zh_cn: 尝试将函数更改为 ``move_and_slide(velocity)`` 并再次运行. 请注意, 我们从速度计算中删除了 "delta".

source: ``move_and_slide()`` provides a default collision response of sliding the body along the collision object. This is useful for a great many game types, and may be all you need to get the behavior you want.
de: ``move_and_slide()`` bietet eine Standardkollisionsantwort, bei der der Körper entlang des Kollisionsobjekts verschoben wird. Dies ist nützlich für sehr viele Spieltypen und kann schon alles sein was Sie benötigen, um das gewünschte Verhalten zu erreichen.
es: ``move_and_slide()`` provee una respuesta a colisión por defecto haciendo que el cuerpo se deslice a lo largo del objeto impactado. Esto es útil para muchos tipos de juegos y puede que sea todo lo necesario para obtener el comportamiento deseado.
fr: ``move_and_slide()`` fournit une réaction à la collision par défaut en faisant glisser le corps le long de l'objet de la collision. C'est utile pour beaucoup de types de jeux, et il est possible que ce soit le seul comportement dont vous ayez besoin.
ja: ``move_and_slide()`` は、コリジョンオブジェクトに沿ってボディをスライドさせるデフォルトの衝突応答を提供します。 これは非常に多くの種類のゲームに有用であり、必要な動作を得るために必要なものすべてである場合があります。
ko: ``move_and_slide()``\ 는 다비가 충돌 객체를 따라 미끄러지는 기본 충돌 응답을 제공합니다. 이것은 아주 많은 게임 유형에 유용하고, 원하는 행동을 얻을 때 필요할 수도 있습니다.
ru: ``move_and_slide()`` обеспечивает реакцию на столкновения по умолчанию при скольжении тела вдоль объекта столкновения. Это применимо для большого количества типов игр, и может быть достаточным, чтобы получить то поведение, которое Вы хотите.
zh_cn: ``move_and_slide()`` 提供了一个沿碰撞对象滑动物体的默认碰撞响应. 这对于许多游戏类型都很有用, 并且可能是获得所需行为所需的全部内容.

source: Bouncing/reflecting
de: Abprallen/Reflektieren
es: Rebote/reflejo
fr: Rebondissement/réflexion
ja: 反発/反射
ko: 튕김/반사
ru: Отскок/отражение
zh_cn: 弹跳/反射

source: What if you don't want a sliding collision response? For this example ("BounceandCollide.tscn" in the sample project), we have a character shooting bullets and we want the bullets to bounce off the walls.
de: Was ist, wenn Sie keine gleitende Kollisionsreaktion wünschen? In diesem Beispiel ("BounceandCollide.tscn" im Beispielprojekt) haben wir einen Charakter, der Geschosse abschießt und wir möchten, dass diese Geschosse von den Wänden abprallen.
es: ¿Qué sucede si no quieres una respuesta a colisión tipo deslizar? Para este ejemplo (ver "BounceandCollide.tscn" en el mismo proyecto), tenemos un personaje disparando balas y queremos que las balas reboten al golpear las paredes.
fr: Et si vous ne vouliez pas de réponse de collision glissante ? Pour cet exemple ("BounceandCollide.tscn" dans le projet de test), nous avons un personnage qui tire des balles et nous voulons que ces balles rebondissent sur les murs.
ja: スライドする衝突応答は必要ない場合はどうしますか？ この例(サンプルプロジェクトの"BounceandCollide.tscn")には、弾丸を発射するキャラクターがあり、弾丸が壁から跳ね返るようにする必要があります。
ko: 미끄러지는 충돌 응답을 원하지 않으면 어떻게 해야 할까요? (샘플 프로젝트에 있는 "BounceandCollide.tscn") 이 예제의 경우, 총을 쏘는 캐릭터가 있고 총알이 벽에 튕겨 나가게 하고 싶습니다.
ru: Что, если Вам не нужна реакция на скользящее столкновение? К примеру («BounceandCollide.tscn» в проекте с примерами), у нас есть персонаж, стреляющий пулями, и мы хотим, чтобы пули отскакивали от стен.
zh_cn: 如果您不想要滑动碰撞响应怎么办？ 对于这个示例(示例项目中的 "BounceandCollide.tscn"), 我们有一个角色射击子弹, 我们希望子弹从墙上反弹.

source: This example uses three scenes. The main scene contains the Player and Walls. The Bullet and Wall are separate scenes so that they can be instanced.
de: In diesem Beispiel werden drei Szenen verwendet. Die Hauptszene enthält den Spieler und die Wände. Die Geschosse und die Wand sind separate Szenen, damit sie instanziiert werden können.
es: Este ejemplo utiliza tres escenas, la escena principal contiene el Player (jugador) y las Walls (paredes), las Bullet (balas) y paredes son escenas separadas que pueden ser instanciadas.
fr: Cet exemple utilise trois scènes, La scène principale contient le joueur (Player) et les murs (Walls). La balle (Bullet) et le mur (Wall) sont des scènes séparées pour pouvoir être instanciés.
ja: この例では、3つのシーンを使用しています。 メインシーンには、プレイヤーと壁が含まれています。 BulletとWallは別々のシーンであるため、インスタンス化できます。
ko: 이 예제는 세 개의 씬을 사용합니다. 메인 씬은 Player와 Wall을 갖고 있습니다. Bullet과 Wall은 분리된 씬으로 그들은 인스턴스 할 수 있습니다.
ru: В этом примере используются три сцены. Основная сцена содержит персонажа и стены. Bullet и Wall — это отдельные сцены, чтобы их можно было инстанцировать.
zh_cn: 此示例使用三个场景. 主场景包含游戏角色和墙壁. 子弹和墙是单独的场景, 以便它们可以实例化.

source: The Player is controlled by the `w` and `s` keys for forward and back. Aiming uses the mouse pointer. Here is the code for the Player, using ``move_and_slide()``:
de: Der Spieler wird über die Tasten `w` und `s` für Vorwärts und Rückwärts gesteuert. Zum Zielen wird der Mauszeiger verwendet. Hier ist der Code für den Spieler mit ``move_and_slide()``:
es: Player es controlado con las teclas `w` y `s` para moverse hacia adelante y hacia atrás, se apunta con el puntero del ratón. Este es el código de Player, usando ``move_and_slide()``:
fr: Le joueur est contrôlé avec les touches `w` et `s` pour avancer et reculer. La visée se fait avec le pointeur de la souris. Voici le code du joueur, qui utilise ``move_and_slide()`` :
ja: プレイヤーは\ ``w`` および ``s`` キーで前後に制御されます。 照準はマウスポインターを使用します。 プレイヤーのコードは、\ ``move_and_slide()`` を使用しています:
ko: Player는 `w`\ 와 `s`\ 키로 조작하며 각각 앞뒤로 움직입니다. 마우스로 조준합니다. 이것이 ``move_and_slide()``\ 를 사용하는 Player 코드입니다:
ru: Персонаж управляется клавишами `w` и `s` для движения вперёд и назад. Для прицеливания используется указатель мыши. Ниже приведен код персонажа с использованием ``move_and_slide()``:
zh_cn: 游戏角色由 `w` 和 `s` 键控制前进和后退. 瞄准使用鼠标指针. 这是游戏角色的代码, 使用 ``move_and_slide()`` :

source: And the code for the Bullet:
de: Und der Code für das Geschoss:
es: Y el código para Bullet:
fr: Et le code de la balle :
ja: そして、弾丸のコード:
ko: 그리고 Bullet을 위한 코드입니다:
ru: И код для пули:
zh_cn: 子弹的代码:

source: The action happens in ``_physics_process()``. After using ``move_and_collide()``, if a collision occurs, a ``KinematicCollision2D`` object is returned (otherwise, the return is ``Nil``).
de: Die Aktion erfolgt in ``_physics_process()``. Nach Verwendung von ``move_and_collide()`` wird bei einer Kollision ein ``KinematicCollision2D``-Objekt zurückgegeben (andernfalls lautet die Rückgabe ``Nil``).
es: La acción sucede en ``_physics_process()``. Si sucede una colisión después de utilizar ``move_and_collide()``, la función retornará un objeto ``KinematicCollision2D`` (de otro modo retornará ``null``).
fr: L'action se passe dans ``_physics_process()``. Après avoir utilisé ``move_and_collide()``, si une collision s'est produite, un objet ``KinematicCollision2D`` est retourné (sinon, la valeur de retour est ``Nil``).
ja: アクションは ``_physics_process()`` で発生します。\ ``move_and_collide()`` を使用した後、衝突が発生した場合、\ ``KinematicCollision2D`` オブジェクトが返されます(そうでない場合、戻り値は ``Nil`` です)。
ko: 동작은 ``_physics_process()``\ 에서 발생합니다. ``move_and_collide()``\ 를 사용한 이후, 충돌이 발생하면, ``KinematicCollision2D`` 객체는 반환됩니다 (그렇지 않으면, ``Nil``\ 을 반환합니다).
ru: Работа происходит в ``_physics_process()``. Вызов ``move_and_collide()``, если были столкновения, возвращает объект ``KinematicCollision2D``; в противном случае возвращается значение ``Nil``.
zh_cn: 动作发生在 ``_physics_process()`` 中. 在使用 ``move_and_collide()`` 后, 如果发生碰撞, 将返回一个 ``KinematicCollision2D`` 对象, 否则, 返回 ``Nil`` .

source: If there is a returned collision, we use the ``normal`` of the collision to reflect the bullet's ``velocity`` with the ``Vector2.bounce()`` method.
de: Wenn es eine zurückgegebene Kollision gibt, verwenden wir das ``normal`` der Kollision, um die Geschwindigkeit ``velocity`` des Geschosses mit der ``Vector2.bounce()``-Methode widerzuspiegeln.
es: Si retorna un objeto, usaremos la ``normal`` de la colisión para reflejar la ``velocity`` de Bullet con le método ``Vector2.bounce()``.
fr: Si une collision est retournée, on utilise la normale de la collision pour faire se réfléchir la vitesse des balles ``velocity`` avec la méthode ``Vector2.bounce()``.
ja: 返されたコリジョンがある場合、コリジョンの ``normal`` を使用して\ ``Vector2.bounce()`` メソッドで弾丸の ``velocity`` を反映します。
ko: 반환된 충돌이 있다면, 우리는 충돌의 ``normal``\ 을 사용해 ``Vector2.bounce()`` 메서드로 총알의 ``velocity``\ 를 반사합니다.
ru: Если есть столкновение, мы используем его ``normal`` для отражения ``velocity`` пули с помощью метода ``Vector2.bounce()``.
zh_cn: 如果有一个返回的碰撞, 我们使用碰撞的 ``normal`` 来反映子弹的 ``velocity`` 和 ``Vector2.bounce()`` 方法.

source: If the colliding object (``collider``) has a ``hit`` method, we also call it. In the example project, we've added a flashing color effect to the Wall to demonstrate this.
de: Wenn das kollidierende Objekt (``collider``) eine ``hit`` Methode hat, rufen wir es auch auf. Im Beispielprojekt haben wir der Wand einen blinkenden Farbeffekt hinzugefügt, um dies zu demonstrieren.
es: Si el objeto que colisiona tiene un método ``hit`` también lo llamaremos. En el proyecto agregamos un efecto de destello de color a Wall para demostrar esto.
fr: Si l'objet de la collision (``collider``) a une méthode ``hit``, on l'appelle aussi. Dans le projet d'exemple, on a ajouté un effet de couleur clignotante au mur pour montrer cela.
ja: 衝突するオブジェクト(``collider``) に ``hit`` メソッドがある場合、それも呼び出します。 サンプルプロジェクトでは、これを示すために壁に点滅する色の効果を追加しました。
ko: 충돌 객체 (``collider``)가 ``hit`` 메서드를 가진다면, 또한 그것을 호출합니다. 예제 프로젝트에서는, 이를 설명하기 위해 Wall에 반짝이는 색상 효과를 추가했습니다.
ru: Если у сталкивающегося объекта (``collider``) есть метод ``hit``, мы также вызываем и его. В проекте примера мы добавили эффект цветной вспышки на стене, чтобы это продемонстрировать.
zh_cn: 如果碰撞对象( ``collider`` )有一个 ``hit`` 方法, 我们也调用它. 在示例项目中, 我们为墙壁添加了一个颜色闪烁效果来演示这一点.

source: Platformer movement
de: Plattformer Bewegungen
es: Movimiento de juego de plataformas
fr: Mouvement de jeu de plateforme
ja: プラットフォームの動き
ko: 플랫포머 움직임
ru: Перемещения в платформере
zh_cn: 平台运动

source: Let's try one more popular example: the 2D platformer. ``move_and_slide()`` is ideal for quickly getting a functional character controller up and running. If you've downloaded the sample project, you can find this in "Platformer.tscn".
de: Versuchen wir ein weiteres beliebtes Beispiel: den 2D-Plattformer. ``move_and_slide()`` ist ideal um schnell einen funktionierenden Charakter-Controller zum Laufen zu bringen. Wenn Sie das Beispielprojekt heruntergeladen haben, finden Sie es in "Platformer.tscn".
es: Intentemos hacer un ejemplo más popular: El juego de plataformas 2D. ``move_and_slide()`` es ideal para tener rápidamente un controlador de personaje funcional. Si has descargado el proyecto de ejemplo, lo podrás encontrar en "Platformer.tscn".
fr: Essayons un autre exemple populaire : le jeu de plateforme 2D. ``move_and_slide()`` est idéal pour obtenir rapidement un contrôleur de personnage fonctionnel. Si vous avez téléchargé le projet de test, vous pouvez trouver cela dans "Platformer.tscn".
ja: もう1つの一般的な例を試してみましょう。2Dプラットフォーマーです。\ ``move_and_slide()`` は、機能するキャラクターコントローラーを素早く起動して実行するのに理想的です。 サンプルプロジェクトをダウンロードした場合は、"Platformer.tscn"で見つけることができます。
ko: 인기있는 예제를 하나 더 들어보겠습니다: 2D 플랫포머 입니다. ``move_and_slide()``\ 가 빠르게 기능의 캐릭터 조작을 얻고 실행시키기에 이상적입니다. 샘플 프로젝트를 다운로드 했다면, "Platformer.tscn"에서 이것을 찾을 수 있습니다.
ru: Попробуем еще один популярный пример: 2D платформер. ``move_and_slide()`` идеально подходит для быстрого получения функционала прыжка и бега персонажа. Если Вы загрузили проект с примерами, то можете найти его в «Platformer.tscn».
zh_cn: 让我们尝试一个更流行的示例:2D平台游戏. ``move_and_slide()`` 非常适合快速启动和运行功能字符控制器. 如果您已下载示例项目, 可以在 "Platformer.tscn" 中找到它.
