Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_kinematic_body_2d.po
Languages: de, es, fr, ja, ko, ru, zh_cn

source: For this example, we'll assume you have a level made of ``StaticBody2D`` objects. They can be any shape and size. In the sample project, we're using :ref:`Polygon2D <class_Polygon2D>` to create the platform shapes.
de: In diesem Beispiel wird davon ausgegangen, dass Sie eine Ebene aus ``StaticBody2D``-Objekten haben. Sie können jede Form und Größe haben. Im Beispielprojekt verwenden wir :ref:`Polygon2D <class_Polygon2D>` um die Plattformformen zu erstellen.
es: Para este ejemplo, asumiremos que tienes un nivel hecho de objetos ``StaticBody2D``, estos pueden ser de cualquier forma y tamaño. En el proyecto utilizamos :ref:`Polygon2D <class_Polygon2D>` para crear las figuras de las plataformas.
fr: Pour cet exemple, nous allons supposer que vous avez déjà créé des objets ``StaticBody2D``. Ils peuvent être de n'importe quelle forme et de n'importe quelle taille. Dans ce projet d'exemple, nous allons utiliser :ref:`Polygon2D <class_Polygon2D>` pour créer des formes de plateformes.
ja: この例では、レベルが ``StaticBody2D`` オブジェクトで構成されていると仮定します。 任意の形状とサイズを使用できます。 サンプルプロジェクトでは、\ :ref:`Polygon2D <class_Polygon2D>` を使用してプラットフォームの形状を作成しています。
ko: 이 예제를 위해,.``StaticBody2D`` 객체로 만들어진 레벨이 있다고 가정합니다. 어떤 모양이나 크기가 될 수 있습니다. 샘플 프로젝트에서, 우리는 플랫폼 모양을 만들기 위해 :ref:`Polygon2D <class_Polygon2D>`\ 를 사용합니다.
ru: В этом примере предполагается, что уровень создан из объектов ``StaticBody2D``. Они могут быть любой формы и размера. В проекте примера мы используем :ref:`Polygon2D <class_Polygon2D>` для создания форм платформ.
zh_cn: 对于这个示例, 我们假设您有一个由 ``StaticBody2D`` 对象构成的级别. 它们可以是任何形状和大小. 在示例项目中, 我们使用 :ref:`Polygon2D <class_Polygon2D>` 来创建平台形状.

source: Here's the code for the player body:
de: Hier ist der Code für den Spielerkörper:
es: Este es el código para el jugador:
fr: Voici le code pour le corps du joueur :
ja: プレイヤーの本体のコードは次のとおりです:
ko: 플레이어 바디를 위한 코드입니다:
ru: Вот код для тела игрока:
zh_cn: 这是游戏角色物体的代码:

source: When using ``move_and_slide()``, the function returns a vector representing the movement that remained after the slide collision occurred. Setting that value back to the character's ``velocity`` allows us to move up and down slopes smoothly. Try removing ``velocity =`` and see what happens if you don't do this.
de: Bei Verwendung von ``move_and_slide()`` gibt die Funktion einen Vektor zurück, der die Bewegung darstellt, die nach dem Auftreten der Gleit-Kollision verblieben ist. Wenn Sie diesen Wert auf die Geschwindigkeit ``velocity`` des Charakters zurücksetzen, können wir uns reibungslos auf und ab bewegen. Versuchen Sie ``velocity =`` zu entfernen und sehen Sie was passiert, wenn Sie dies nicht tun.
es: Cuando se utiliza la función ``move_and_slide()``, esta retorna un vector que representa el movimiento que quedó después que la colisión con deslizamiento ocurriera. Asignando este de vuelta a la ``velocity`` del personaje nos permite un movimiento suave hacia arriba y hacia abajo en las pendientes. Prueba quitar ``velocity =`` y observa lo que sucede.
fr: Quand on utilise ``move_and_slide()``, la fonction renvoie un vecteur qui représente le mouvement restant après que la collision glissante s'est produite. Assigner cette valeur à la vitesse du personnage ``velocity`` permet de le déplacer en douceur en montant et en descendant des pentes. Essayez d'enlever ``velocity =`` pour voir ce qu'il se passe si vous ne le faites pas.
ja: ``move_and_slide()`` を使用すると、この関数は、スライド衝突が発生した後に残った動きを表すベクトルを返します。 その値をキャラクターの ``velocity`` に戻すことで、斜面をスムーズに上下できます。\ ``velocity = `` を削除して、これを行わないとどうなるかを確認してください。
ru: При использовании ``move_and_slide()`` функция возвращает вектор, представляющий движение, оставшееся после скользящего столкновения. Сохраняя это значение обратно в ``velocity``персонажа, мы можем плавно двигаться вверх и вниз. Попробуйте удалить ``velocity =`` и посмотреть, что произойдет, когда Вы этого не делаете.
zh_cn: 当使用 ``move_and_slide()`` 时, 该函数返回一个向量, 代表滑动碰撞发生后剩余的运动. 将该值设置返回角色的 ``velocity`` , 我们就可以顺利地在斜坡上和斜坡下移动. 试着去掉 ``velocity =`` , 看看如果不这样做会发生什么.

source: Also note that we've added ``Vector2(0, -1)`` as the floor normal. This vector points straight upward. As a result, if the character collides with an object that has this normal, it will be considered a floor.
de: Beachten Sie auch, dass wir ``Vector2(0, -1)`` als Bodennormal hinzugefügt haben. Dieser Vektor zeigt gerade nach oben. Wenn der Charakter mit einem Objekt kollidiert, das diese Normalität aufweist, wird dies als Boden betrachtet.
es: Nota también que hemos agregado ``Vector2(0,-1)`` como normal del suelo. Este es un vector que apunta hacia arriba. Esto significa que, si el personaje colisiona con un objeto que tiene esta normal, será considerado como suelo.
fr: Notez aussi que nous avons ajouté ``Vector2(0, -1)`` comme normale du sol. C'est le vecteur qui pointe directement vers le haut. Cela veut dire que si le personnage entre en collision avec un objet qui a cette normale, celui-ci sera considéré comme le sol.
ja: また、フロアの法線として ``Vector2(0, -1)`` を追加したことに注意してください。 このベクトルはまっすぐ上を指します。 その結果、キャラクターがこの法線を持つオブジェクトと衝突した場合、そのオブジェクトは床と見なされます。
ru: Также обратите внимание, что мы добавили ``Vector2 (0, -1)`` в качестве нормали к полу. Этот вектор указывает прямо вверх. В результате, если персонаж сталкивается с объектом, имеющим эту нормаль, объект будет считаться полом.
zh_cn: 同时注意, 我们已经添加了 ``Vector2(0, -1)`` 作为地板法线. 这是向上指向的向量. 因此, 如果角色与具有该法线的物体相撞, 它将被视为地板.

source: Using the floor normal allows us to make jumping work, using ``is_on_floor()``. This function will only return ``true`` after a ``move_and_slide()`` collision where the colliding body's normal is within 45 degrees of the given floor vector. You can control the maximum angle by setting ``floor_max_angle``.
de: Die Verwendung der Bodennormalen ermöglicht es uns mittels ``is_on_floor()`` zu springen. Diese Funktion gibt erst nach einer Kollision mit ``move_and_slide()`` ein ``true`` zurück, wenn die Normalen des kollidierenden Körpers innerhalb von 45 Grad des angegebenen Bodenvektors liegen. Sie können den maximalen Winkel steuern, indem Sie ``floor_max_angle`` einstellen.
es: Usando la normal del suelo nos permite que funcione el salto, utilizando ``is_in_floor()``. Esta función solo retornará ``true`` después de una colisión usando ``move_and_slide()`` siempre que la normal del cuerpo colisionado esté dentro de 45 grados de diferencia del vector indicado como suelo. Puedes controlar el ángulo máximo estableciendo un ``floor_max_angle``.
fr: Utiliser la normale du sol nous permet de faire marcher le saut, en utilisant ``is_on_floor()``. Cette fonction ne renvoie ``true`` qu'après une collision de ``move_and_slide()`` où la normale du corps qui a collisionné est dans les 45 degrés du vecteur de sol donné. Vous pouvez contrôler l'angle maximum en ajustant le paramètre ``floor_max_angle``.
ja: フロア法線を使用すると、\ ``is_on_floor()`` を使用してジャンプ作業を行うことができます。 この関数は、衝突する物体の法線が与えられた床ベクトルの45度以内にある ``move_and_slide()`` 衝突後にのみ ``true`` を返します。\ ``floor_max_angle`` を設定することで最大角度を制御できます。
ru: Использование нормали пола позволяет нам реализовать прыжки, используя ``is_on_floor()``. Эта функция возвращает значение ``true`` только после такого столкновения ``move_and_slide()``, при котором нормаль тела столкновения находится в пределах 45 градусов от заданного вектора пола. Можно управлять максимальным углом, задав ``floor_max_angle``.
zh_cn: 使用地板法线, 我们可以使用 ``is_on_floor()`` 来使跳跃工作. 这个函数只有在发生 ``move_and_slide()`` 碰撞后, 碰撞体的法线在给定的地板向量45度以内时才会返回 ``true`` . 你可以通过设置 ``floor_max_angle`` 来控制最大角度.

source: This angle also allows you to implement other features like wall jumps using ``is_on_wall()``, for example.
de: Mit diesem Winkel können Sie auch andere Funktionen wie Wandsprünge implementieren, indem Sie beispielsweise ``is_on_wall()`` verwenden.
es: Este ángulo también te permite implementar otras características como saltos en paredes usando ``is_on_wall()``, por ejemplo.
fr: Cela permet aussi d'implémenter d'autres fonctionnalités comme les sauts de murs en utilisant ``is_on_wall()``, par exemple.
ja: この角度により、たとえば ``is_on_wall()`` を使用して壁ジャンプなどの他の機能を実装することもできます。
ru: Этот угол также позволяет реализовать другие функции, такие как прыжки от стены, используя, например, ``is_on_wall()``.
zh_cn: 这个角度也允许你使用 ``is_on_wall()`` 实现其他功能, 比如墙面跳跃.

source: Translation status
de: Übersetzungsstatus
fr: État de la traduction
ru: Translation status (статус перевода)
zh_cn: 翻译状态

source: Godot offers a number of collision objects to provide both collision detection and response. Trying to decide which one to use for your project can be confusing. You can avoid problems and simplify development if you understand how each of them works and what their pros and cons are. In this tutorial, we'll look at the :ref:`KinematicBody2D <class_KinematicBody2D>` node and show some examples of how it can be used.
ko: Godot은 충돌 감지와 반응성을 모두 제공하기 위해 많은 충돌 객체를 제공합니다. 프로젝트에 사용할 항목을 결정하는 것은 혼란스러울 수 있습니다. 각각의 작동 방식 및 장단점이 무엇인지 이해한다면 문제를 피하고 개발을 간소화할 수 있습니다. 이 튜토리얼에서는 :ref:`KinematicBody2D <class_KinematicBody2D>` 노드를 살펴보고 사용 방법에 대한 몇 가지 예를 보여 드리겠습니다.

source: ``KinematicBody2D`` is for implementing bodies that are to be controlled via code. They detect collisions with other bodies when moving, but are not affected by engine physics properties, like gravity or friction. While this means that you have to write some code to create their behavior, it also means you have more precise control over how they move and react.
ko: ``KinematicBody2D``\ 는 코드로 통제되는 바디를 구현하기 위한 것입니다. 움직일 때, 다른 바디와의 충돌을 감지하지만, 중력이나 마찰과 같은 물리 엔진 특성에 의해 영향을 받지 않습니다. 이것은 당신이 그것들의 행동을 만들어내기 위해 몇 개의 코드를 써야 한다는 것이기도 하지만, 반대로 그것들이 어떻게 움직이고 반응하는지 더 정확히 제어할 수 있다는 것을 의미합니다.

source: When moving a ``KinematicBody2D``, you should not set its ``position`` property directly. Instead, you use the ``move_and_collide()`` or ``move_and_slide()`` methods. These methods move the body along a given vector and will instantly stop if a collision is detected with another body. After a KinematicBody2D has collided, any *collision response* must be coded manually.
ko: ``KinematicBody2D``\ 를 움직일 때 ``position`` 속성을 직접 설정해서는 안 됩니다. 대신 ``move_and_collide()`` 또는 ``move_and_slide()`` 메서드를 사용해야 합니다. 이러한 방법은 주어진 벡터를 따라 바디가 이동하며 충돌이 감지될 경우 즉시 중지됩니다. KinematicBody2D가 충돌한 후에는 *충돌 응답*\ 을 수동으로 코딩해야 합니다.

source: Kinematic body movement should only be done in the ``_physics_process()`` callback.
ko: 키네마틱 바디의 움직임은 ``_physics_process()`` 콜백으로 이루어져야 합니다.

source: The ``move_and_slide()`` method is intended to simplify the collision response in the common case where you want one body to slide along the other. This is especially useful in platformers or top-down games, for example.
ko: ``move_and_slide()`` 메서드는 충돌 응답을 한 바디가 다른 바디를 따라 미끄러지는 일반적인 경우에서 단순화 하기 위한 것입니다. 이것은 특히, 예를 들어 플랫포머나 탑뷰 게임에서 유용합니다.

source: ``floor_normal`` - *default value:* ``Vector2( 0, 0 )``
ko: ``floor_normal`` - *기본 값:* ``Vector2( 0, 0 )``

source: This parameter allows you to define what surfaces the engine should consider to be the floor. Setting this lets you use the ``is_on_floor()``, ``is_on_wall()``, and ``is_on_ceiling()`` methods to detect what type of surface the body is in contact with. The default value means that all surfaces are considered walls.
ko: 이 매개변수는 엔진이 바닥이라고 생각하는 표면을 정의할 수 있습니다. 이것을 설정하면 ``is_on_floor()``, ``is_on_wall()``, 그리고 ``is_on_ceiling()`` 메서드를 사용할 수 있고, 어떤 타입의 표면이 바디와 닿았는지 감지할 수 있습니다. 기본 값으로 모든 표면은 벽으로 간주되는 것을 뜻합니다.

source: ``slope_stop_min_velocity`` - *default value:* ``5``
ko: ``slope_stop_min_velocity`` - *기본 값:* ``5``

source: This is the minimum velocity when standing on a slope. This prevents a body from sliding down a slope when standing still.
ko: 이것은 경사면에 서있을 수 있는 최소 속도입니다. 이것으로 서있는 상태일 때 바디가 경사면에 미끄러져 내려가는 것을 방지합니다.

source: ``max_bounces`` - *default value:* ``4``
ko: ``max_bounces`` - *기본 값:* ``4``

source: This is the maximum number of collisions before the body stops moving. Setting this too low may prevent movement entirely.
ko: 이것은 바디가 멈추기 전 충돌의 최대 수입니다. 너무 낮게 설정하면 움직임이 완전히 차단될 수 있습니다.

source: This is the maximum angle before a surface is no longer considered a "floor".
ko: 이것은 표면이 더 이상 "바닥"으로 인식되지 않는 최대 각도입니다.

source: This method adds some additional functionality to ``move_and_slide()`` by adding the ``snap`` parameter. As long as this vector is in contact with the ground, the body will remain attached to the surface. Note that this means you must disable snapping when jumping, for example. You can do this either by setting ``snap`` to ``Vector2(0, 0)`` or by using ``move_and_slide()`` instead.
ko: 이 메서드는 ``move_and_slide()``\ 에 ``snap`` 매개변수를 넣어 추가적인 기능성을 줍니다. 이 벡터가 바닥과 접촉하면, 바디는 표면에 붙은 채로 유지합니다. 이는 고정 상태를 점프 같은 것으로 비활성화 해야함을 의미합니다. ``snap``\ 을 ``Vector2(0, 0)``\ 로 설정하거나 ``move_and_slide()``\ 를 사용하면 됩니다.

source: A common question from new Godot users is: "How do you decide which movement function to use?" Often, the response is to use ``move_and_slide()`` because it's "simpler", but this is not necessarily the case. One way to think of it is that ``move_and_slide()`` is a special case, and ``move_and_collide()`` is more general. For example, the following two code snippets result in the same collision response:
ko: 새로운 Godot 사용자로부터 흔한 질문이 있습니다: "어떻게 어떤 이동 함수를 사용하는 지를 결정하나요?" 자주하는 대답은 ``move_and_slide()``\ 를 사용하라는 것인데, "더 쉽기" 때문입니다, 그러나 반드시 그런 것은 아닙니다. 생각을 해보자면 ``move_and_slide()``\ 는 특별한 경우, 그리고 ``move_and_collide()``\ 는 더 일반적인 것입니다. 예를 들어 두 개의 코드 단문은 값은 충돌 응답 결과가 나타납니다:

source: When using ``move_and_slide()``, the function returns a vector representing the movement that remained after the slide collision occurred. Setting that value back to the character's ``velocity`` allows us to smoothly move up and down slopes. Try removing ``velocity =`` and see what happens if you don't do this.
ko: ``move_and_slide()``\ 를 사용할 때, 함수는 슬라이드 충돌이 발생한 이후 움직임을 나타내는 벡터를 반환합니다. 값을 캐릭터의 ``velocity``\ 에 설정하면 부드럽게 위 아래 경사면을 움직입니다. ``velocity =``\ 를 삭제하고 이것을 하지 않으면 어떤 일이 발생하는 지 봅시다.

source: Also note that we've added ``Vector2(0, -1)`` as the floor normal. This is a vector pointing straight upward. This means that if the character collides with an object that has this normal, it will be considered a floor.
ko: 또한 ``Vector2(0, -1)``\ 를 바닥 노멀로 추가하는 것입니다. 이것은 벡터가 위쪽으로 향하게 합니다. 즉 캐릭터가 이 노멀을 가진 객체와 충돌하면, 바닥으로 인식할 것입니다.

source: Using the floor normal allows us to make jumping work, using ``is_on_floor()``. This function will only return ``true`` after a ``move_and_slide()`` collision where the colliding body's normal is within 45 degrees of the given floor vector (this can be adjusted by setting ``floor_max_angle``).
ko: 바닥 노멀을 사용하면, ``is_on_floor()``\ 를 사용해 점프 작업을 만들 수 있습니다. 이 함수는 ``move_and_slide()`` 충돌 이후 충돌한 바디의 노말이 주어진 바닥 벡터의 45도 이내라면 항상 ``참``\ 을 반환합니다 (``floor_max_angle``\ 을 설정해서 조정할 수 있습니다).

source: This also allows you to implement other features (like wall jumps) using ``is_on_wall()``, for example.
ko: 이를 통해 (벽 점프와 같은) 다른 기능들도 ``is_on_wall()``\ 를 사용해 구현할 수 있습니다.
