Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/physics/using_kinematic_body_2d.po
Languages: de, es, fr, ja, ko, ru, zh_cn

source: Using KinematicBody2D
de: Verwenden von KinematicBody2D
es: Usando KinematicBody2D
fr: Utiliser KinematicBody2D
ja: KinematicBody2Dの使用
ko: KinematicBody2D 사용하기
ru: Использование KinematicBody2D
zh_cn: 使用 KinematicBody2D

source: Introduction
de: Einführung
es: Introducción
ja: はじめに
ko: 소개
ru: Введение
zh_cn: 前言

source: Godot offers several collision objects to provide both collision detection and response. Trying to decide which one to use for your project can be confusing. You can avoid problems and simplify development if you understand how each of them works and what their pros and cons are. In this tutorial, we'll look at the :ref:`KinematicBody2D <class_KinematicBody2D>` node and show some examples of how to use it.
de: Godot bietet mehrere Kollisionsobjekte an, um sowohl Kollisionserkennung als auch Reaktion zu ermöglichen. Der Versuch, zu entscheiden, welches für Ihr Projekt verwendet werden soll, kann verwirrend sein. Sie können Probleme vermeiden und die Entwicklung vereinfachen, wenn Sie verstehen, wie sie funktionieren und welche Vor- und Nachteile sie haben. In dieser Anleitung sehen wir uns den :ref:`KinematicBody2D <class_KinematicBody2D>` Node an und zeigen einige Beispiele für dessen Verwendung.
es: Godot ofrece una variedad de objetos de colisión para proveer detección y respuesta a colisiones. Tratar de decidir cuál usar para tu proyecto puede ser confuso. Puedes evitar problemas y simplificar el desarrollo si comprendes cómo funciona cada uno de ellos y cuáles son sus pros y contras. En este tutorial, veremos el nodo :ref:`KinematicBody2D <class_KinematicBody2D>` y mostraremos algunos ejemplos de cómo usarlos.
fr: Godot offre un certain nombre d'objets de collision pour assurer à la fois la détection et la réponse aux collisions. Essayer de décider lequel utiliser pour votre projet peut prêter à confusion. Vous pouvez éviter les problèmes et simplifier le développement si vous comprenez comment chacun d'eux fonctionne et quels sont leurs avantages et leurs inconvénients. Dans ce tutoriel, nous allons regarder le nœud :ref:`KinematicBody2D <class_KinematicBody2D>` et montrer quelques exemples de son utilisation.
ja: Godotは、衝突の検出と応答の両方を提供するいくつかのコリジョンオブジェクトを提供します。 プロジェクトに使用するものを決定しようとすると、混乱する可能性があります。 それぞれがどのように機能し、それぞれの長所と短所を理解していれば、問題を回避して開発を簡素化できます。 このチュートリアルでは、\ :ref:`KinematicBody2D <class_KinematicBody2D>` ノードを見て、その使用方法の例を示します。
ru: Godot предлагает несколько объектов столкновения для обеспечения как обнаружения столкновения, так и реакций. Решить, какой из них лучше использовать в Вашем проекте, может быть затруднительно. Избежать проблем и упростить разработку можно, если понять, как работает каждый из них и каковы его достоинства и недостатки. В этом учебном пособии мы рассмотрим узел :ref:`KinematicBody2D <class_KinematicBody2D>` и покажем несколько примеров его использования.
zh_cn: Godot提供了几种碰撞对象来提供碰撞检测和响应. 试图决定在你的项目中使用哪一个可能会让你感到困惑. 如果你了解它们中的每一个是如何工作的, 以及它们的优点和缺点是什么, 你就可以避免问题并简化开发. 在本教程中, 我们将查看 :ref:`KinematicBody2D <class_KinematicBody2D>` 节点, 并展示一些如何使用它的例子.

source: This document assumes you're familiar with Godot's various physics bodies. Please read :ref:`doc_physics_introduction` first.
de: In diesem Dokument wird davon ausgegangen, dass Sie mit den verschiedenen physikalischen Körpern von Godot vertraut sind. Bitte lesen Sie zuerst :ref:`doc_physics_introduction`.
es: Este documento asume que los varios cuerpos físicos de Godot te son familiares. Por favor lee primero :ref:`doc_physics_introduction`.
fr: Ce document suppose que vous connaissez les différents corps physiques de Godot. Veuillez d'abord lire :ref:`doc_physics_introduction`.
ja: このドキュメントは、あなたがGodotのさまざまな物理ボディに精通していることを前提としています。最初に :ref:`doc_physics_introduction` をお読みください。
ko: 이 문서는 당신이 Godot의 다양한 물리 바디에 대해 잘 알고 있다고 가정합니다. 먼저 :ref:`doc_physics_introduction`\ 를 읽어주세요.
ru: Этот документ предполагает, что вы знакомы с различными физическими телами Godot. Сначала прочитайте :ref:`doc_physics_introduction`.
zh_cn: 本文假设您熟悉Godot中的各种物理体. 否则请先阅读 :ref:`doc_physics_introduction` .

source: What is a kinematic body?
de: Was ist ein beweglicher Körper?
es: ¿Qué es un cuerpo cinemático?
fr: Qu'est-ce qu'un kinematic body ?
ja: キネマティック(kinematic)ボディとは何ですか?
ko: 키네마틱 바디란 무엇인가?
ru: Что такое кинематическое тело?
zh_cn: 什么是运动体？

source: ``KinematicBody2D`` is for implementing bodies that are controlled via code. Kinematic bodies detect collisions with other bodies when moving, but are not affected by engine physics properties, like gravity or friction. While this means that you have to write some code to create their behavior, it also means you have more precise control over how they move and react.
de: ``KinematicBody2D`` dient zur Implementierung von Körpern, die über Code gesteuert werden. Kinematische Körper erkennen Kollisionen mit anderen Körpern, wenn sie sich bewegen, werden jedoch nicht von physikalischen Eigenschaften der Engine wie Schwerkraft oder Reibung beeinflusst. Dies bedeutet, dass Sie Code schreiben müssen, um ihr Verhalten zu erstellen, aber Sie haben auch eine genauere Kontrolle darüber, wie sie sich bewegen und reagieren.
es: ``KinematicBody2D`` está para implementar cuerpos que serán controlados por código. Pueden detectar colisiones con otros cuerpos cuando se mueven, pero no son afectados por propiedades del motor de físicas como la gravedad o fricción. Esto quiere decir que deberás escribir algo de código para crear su comportamiento, pero también significa que podrás tener un control más preciso sobre cómo se mueven y reaccionan.
fr: ``KinematicBody2D`` est destiné à l'implémentation de corps qui doivent être contrôlés par code. Ils détectent les collisions avec d'autres corps en mouvement, mais ne sont pas affectés par les propriétés physiques du moteur, comme la gravité ou la friction. Bien que cela signifie que vous devez écrire du code pour créer leur comportement, cela signifie également que vous avez un contrôle plus précis sur la façon dont ils bougent et réagissent.
ja: ``KinematicBody2D``は、コードで制御されるボディを実装するためのものです。 キネマティックボディは、移動時に他のボディとの衝突を検出しますが、重力や摩擦などのエンジンの物理特性の影響を受けません。 これは、動作を作成するためにコードを記述する必要があることを意味しますが、それらがどのように動き、反応するかをより正確に制御できることも意味します。
ru: ``KinematicBody2D`` предназначен для реализации тел, которые управляются с помощью кода. Кинематические тела обнаруживают столкновения с другими телами при движении, но на них не влияют свойства физики движка, такие, как сила тяжести или трение. Это значит, что Вы должны написать код, чтобы определить их поведение, а так же то, что у Вас есть более точный контроль над тем, как они движутся и реагируют.
zh_cn: ``KinematicBody2D`` 用于实现通过代码控制的物体. 运动体在移动时可以检测到与其他物体的碰撞, 但不受引擎物理属性的影响, 比如重力或摩擦. 虽然这意味着你必须编写一些代码来创建它们的行为, 但这也意味着你可以更精确地控制它们如何移动和反应.

source: A `KinematicBody2D` can be affected by gravity and other forces, but you must calculate the movement in code. The physics engine will not move a `KinematicBody2D`.
de: Ein `KinematicBody2D` kann durch die Schwerkraft und andere Kräfte beeinflusst werden, aber Sie müssen die Bewegung im Code berechnen. Die Physik-Engine bewegt keinen `KinematicBody2D`.
es: Un `KinematicBody2D` no puede ser afectado por la gravedad y otras fuerzas, deberás calcular su movimiento por código. El motor de física no moverá un `KinematicBody2D`.
fr: Un `KinematicBody2D` peut être affecté par la gravité et d'autres forces, mais vous devez calculer le mouvement en code. Le moteur physique ne déplace pas un `KinematicBody2D`.
ja: ``KinematicBody2D`` は重力やその他の力の影響を受ける可能性がありますが、コードで動きを計算する必要があります。 物理エンジンは ``KinematicBody2D`` を移動しません。
ko: `KinematicBody2D`\ 는 중력과 다른 힘에 의해 영향을 받을 수 있지만 코드로 움직임을 계산해야 합니다. 물리 엔진이 `KinematicBody2D`\ 를 움직이게 하진 않습니다.
ru: На `KinematicBody2D` могут влиять сила тяжести и другие силы, но Вы должны рассчитать перемещение в коде. Физический движок не будет перемещать `KinematicBody2D` сам.
zh_cn: `KinematicBody2D` 可以受到重力和其他力的影响, 但您必须在代码中计算它的运动. 物理引擎不会移动 `KinematicBody2D`.

source: Movement and collision
de: Bewegung und Kollisionen
es: Movimiento y Colisión
fr: Mouvement et collision
ja: 動きと衝突
ko: 이동과 충돌
ru: Движение и столкновения
zh_cn: 运动与碰撞

source: When moving a ``KinematicBody2D``, you should not set its ``position`` property directly. Instead, you use the ``move_and_collide()`` or ``move_and_slide()`` methods. These methods move the body along a given vector and instantly stop if a collision is detected with another body. After a KinematicBody2D has collided, any *collision response* must be coded manually.
de: Wenn Sie einen ``KinematicBody2D`` verschieben, sollten Sie seine ``position``-Eigenschaft nicht direkt festlegen. Stattdessen verwenden Sie die Methoden ``move_and_collide()`` or ``move_and_slide()``. Diese Methoden bewegen den Körper entlang eines bestimmten Vektors und stoppen sofort, wenn eine Kollision mit einem anderen Körper erkannt wird. Nachdem ein KinematicBody2D kollidiert ist, muss jede *Kollisionsantwort* manuell codiert werden.
es: Cuando mueves un ``KinematicBody2D`` no debes cambiar su propiedad ``position`` directamente. En lugar de eso , debes usar los métodos ``move_And_collide()`` o ``move_and_slide()``. Estos métodos mueven el cuerpo a lo largo de un vector dado y se detendrán inmediatamente si se detecta una colisión con otro cuerpo. Luego de que un KinematicBody2D ha colisionado, cualquier *respuesta a colisión* deberá ser manejada manualmente.
fr: Lorsque vous déplacez un ``KinematicBody2D``, vous ne devez pas définir directement sa propriété ``position``. Au lieu de cela, vous utilisez les méthodes ``move_and_collide()`` ou ``move_and_slide()``. Ces méthodes déplacent le corps le long d'un vecteur donné et s'arrêtent instantanément si une collision est détectée avec un autre corps. Après la collision d'un KinematicBody2D, toute *réponse à la collision* doit être codée manuellement.
ja: ``KinematicBody2D`` を移動する場合は、\ ``position`` プロパティを直接設定しないでください。代わりに、\ ``move_and_collide()`` または ``move_and_slide()`` メソッドを使用します。これらのメソッドは、特定のベクトルに沿ってボディを移動し、別のボディとの衝突が検出された場合は即座に停止します。KinematicBody2D が衝突した後、\ *衝突応答* を手動でコーディングする必要があります。
ru: При перемещении ``KinematicBody2D`` не следует устанавливать его свойство ``position`` напрямую. Вместо этого используются методы ``move_and_collide()`` или ``move_and_slide()``. Эти методы перемещают тело вдоль заданного вектора и мгновенно останавливаются, если обнаруживается столкновение с другим телом. После столкновения KinematicBody2D любая *реакция на столкновение* должна быть закодирована вручную.
zh_cn: 当移动一个 ``KinematicBody2D`` 时, 你不应该直接设置它的 ``position`` 属性, 而是使用 ``move_and_collide()`` 或 ``move_and_slide()`` 方法. 这些方法沿着给定的向量移动物体, 如果检测到与另一个体发生碰撞, 则立即停止. 在KinematicBody2D发生碰撞后, 任何 *碰撞响应* 必须手动编码.

source: You should only do Kinematic body movement in the ``_physics_process()`` callback.
de: Sie sollten kinematische Körperbewegungen nur in der ``_physics_process()`` Funktion ausführen.
es: Sólo debes hacer el movimiento del Kinematic Body en la llamada de ``_physics_process()``.
fr: Le mouvement du KinematicBody2D ne doit se faire que dans la méthode de rappel ``_physics_process()``.
ja: ``_physics_process()`` コールバックでのみキネマティックボディの動きを行う必要があります。
ru: Вы должны перемещать кинематическое тело только в обратном вызове ``_physics_process()``.
zh_cn: 你应该只在 ``_physics_process()`` 回调中做Kinematic物体运动.

source: The two movement methods serve different purposes, and later in this tutorial, you'll see examples of how they work.
de: Die beiden Bewegungsmethoden dienen unterschiedlichen Zwecken. Später in dieser Anleitung sehen Sie Beispiele für deren Funktionsweise.
es: Ambos métodos de movimiento tienen diferentes propósitos, y más adelante se mostrarán ejemplos de cómo funcionan.
fr: Les deux méthodes de mouvement ont des objectifs différents, et plus loin dans ce tutoriel, vous verrez des exemples de leur fonctionnement.
ja: 2つの移動方法の目的は異なります。このチュートリアルの後半では、それらの動作方法の例を参照します。
ko: 두 개의 이동 메서드는 다른 목적을 지닙니다, 그리고 이 튜토리얼 이후에, 어떻게 작동하는 지에 대한 예제를 볼 것입니다.
ru: Два метода перемещения служат разным целям, и далее в этом учебном пособии Вы увидите примеры их работы.
zh_cn: 这两种运动方法有不同的作用, 在后面的教程中, 你会看到它们如何工作的例子.

source: This method takes one parameter: a :ref:`Vector2 <class_Vector2>` indicating the body's relative movement. Typically, this is your velocity vector multiplied by the frame timestep (``delta``). If the engine detects a collision anywhere along this vector, the body will immediately stop moving. If this happens, the method will return a :ref:`KinematicCollision2D <class_KinematicCollision2D>` object.
de: Diese Methode verwendet einen Parameter: a :ref:`Vector2 <class_Vector2>`, der die relative Bewegung des Körpers angibt. In der Regel ist dies Ihr Geschwindigkeitsvektor multipliziert mit dem Frame-Zeitschritt (``Delta``). Wenn die Engine irgendwo entlang dieses Vektors eine Kollision feststellt, hört der Körper sofort auf sich zu bewegen. In diesem Fall gibt die Methode ein :ref:`KinematicCollision2D <class_KinematicCollision2D>` Objekt zurück.
es: Este método toma un sólo parámetro: un :ref:`Vector2 <class_Vector2>` que indica el movimiento relativo del cuerpo. Típicamente, este es tu vector velocidad multiplicado por el timestep del frame actual (``delta``). Si el motor detecta una colisión en cualquier parte del trayecto indicado por el vector, el cuerpo se detendrá inmediatamente. Si esto sucede, el método retorna un objeto :ref:`KinematicCollision2D <class_KinematicCollision2D>`.
fr: Cette méthode prend un paramètre : a :ref:`Vector2 <class_Vector2>` indiquant le mouvement relatif du corps. Typiquement, c'est votre vecteur de vitesse multiplié par le pas de temps de l'image (``delta``). Si le moteur détecte une collision le long de ce vecteur, le corps s'arrête immédiatement. Si cela se produit, la méthode retournera un objet :ref:`KinematicCollision2D <class_KinematicCollision2D>`.
ja: このメソッドは1つのパラメーターを取ります: ボディの相対的な動きを示す :ref:`Vector2 <class_Vector2>`\ 。 通常、これは速度ベクトルにフレームタイムステップ(``delta``)を掛けたものです。 エンジンがこのベクトルに沿ったどこかで衝突を検出すると、ボディはすぐに動きを停止します。 この場合、メソッドは :ref:`KinematicCollision2D <class_KinematicCollision2D>` オブジェクトを返します。
ko: 이 메서드는 하나의 매개 변수를 가집니다: 바디의 상대적인 움직임을 나타내는 :ref:`Vector2 <class_Vector2>`\ 입니다. 일반적으로, 이것은 속도 벡터에 프레임 타임 스텝 (``delta``)을 곱한 것입니다. 엔진이 이 벡터를 따라 어느 곳이든 충돌을 감지하면, 바디는 즉시 이동을 멈춥니다. 이 경우, 메서드는 :ref:`KinematicCollision2D <class_KinematicCollision2D>` 객체를 반환합니다.
ru: Этот метод принимает один параметр: :ref:`Vector2 <class_Vector2>`, указывающий относительное перемещение тела. Обычно это вектор скорости, умноженный на временной интервал кадра (``delta``). Если движок обнаружит столкновение где-либо вдоль этого вектора, тело немедленно прекратит движение. Если это произойдет, метод вернет объект :ref:`KinematicCollision2D <class_KinematicCollision2D>`.
zh_cn: 这个方法有一个 :ref:`Vector2 <class_Vector2>` 参数以表示物体的相对运动. 通常, 这是您的速度向量乘以帧时间步长( ``delta`` ). 如果在沿着此向量方向的任何位置, 引擎检测到碰撞, 则物体将立即停止移动. 如果发生这种情况, 该方法将返回 :ref:`KinematicCollision2D <class_KinematicCollision2D>` 对象.

source: ``KinematicCollision2D`` is an object containing data about the collision and the colliding object. Using this data, you can calculate your collision response.
de: ``KinematicCollision2D`` ist ein Objekt, das Daten über die Kollision und das kollidierende Objekt enthält. Mit diesen Daten können Sie Ihre Kollisionsantwort berechnen.
es: ``KinematicCollision2D`` es un objeto que contiene datos sobre la colisión y el objeto con el cual se colisiona. Utiliza estos datos para calcular la respuesta a la colisión.
fr: ``KinematicCollision2D`` est un objet contenant des données sur la collision et l'objet entrant en collision. À l'aide de ces données, vous pouvez calculer votre réaction en cas de collision.
ja: ``KinematicCollision2D`` は、衝突とコリジョンオブジェクトに関するデータを含むオブジェクトです。 このデータを使用して、衝突応答を計算できます。
ko: ``KinematicCollision2D``\ 는 충돌과 충돌하는 객체에 대한 정보를 담고 있는 객체입니다. 이 정보로, 충돌 응답을 계산할 수 있습니다.
ru: ``KinematicCollision2D`` — это объект, содержащий данные о столкновении и сталкивающемся объекте. С помощью этих данных можно вычислить реакцию на столкновение.
zh_cn: ``KinematicCollision2D`` 是一个包含碰撞和碰撞对象数据的对象. 使用这些数据, 你可以计算出你的碰撞响应.

source: The ``move_and_slide()`` method is intended to simplify the collision response in the common case where you want one body to slide along the other. It is especially useful in platformers or top-down games, for example.
de: Die Methode ``move_and_slide()`` soll die Kollisionantwort in dem allgemeinen Fall vereinfachen, in dem ein Körper entlang des anderen gleiten soll. Es ist zum Beispiel besonders nützlich bei Plattformspielen oder Top-Down-Spielen.
es: El método ``move_and_slide()`` tiene como objetivo simplificar la respuesta a colisiones en el caso común donde quieres que un cuerpo se deslice sobre otro. Este es particularmente útil en juegos de plataformas o de vista superior, por ejemplo.
fr: La méthode ``move_and_slide()`` est destinée à simplifier la réponse de collision dans le cas courant où vous voulez qu'un corps glisse le long de l'autre. Ceci est particulièrement utile dans les jeux de plates-formes ou les jeux top-down, par exemple.
ja: ``move_and_slide()`` メソッドは、一方のボディをもう一方のボディに沿ってスライドさせたいという一般的なケースで衝突応答を単純化することを目的としています。 たとえば、プラットフォーマーやトップダウンゲームで特に役立ちます。
ru: Метод ``move_and_slide()`` предназначен для упрощения реализации реакции на столкновение в типовом случае, когда требуется, чтобы одно тело скользило по другому. Это особенно полезно в платформерах, или играх с видом сверху, например.
zh_cn: ``move_and_slide()`` 方法旨在简化常见情况下的碰撞响应, 即你希望一个物体沿着另一个物体滑动. 例如, 在平台游戏或自上而下的游戏中, 它特别有用.

source: ``move_and_slide()`` automatically calculates frame-based movement using ``delta``. Do *not* multiply your velocity vector by ``delta`` before passing it to ``move_and_slide()``.
de: ``move_and_slide()`` berechnet automatisch die Frame-basierte Bewegung mit ``delta``. Multiplizieren Sie Ihren Geschwindigkeitsvektor *nicht* mit ``delta``, bevor Sie ihn an ``move_and_slide()`` übergeben.
es: ``move_and_slide()`` calcula automáticamente el movimiento por fotogramas usando ``delta``. *No* multipliques tu vector de velocidad por ``delta`` antes de pasarlo a ``move_and_slide()``.
fr: ``move_and_slide()`` calcule automatiquement le mouvement basé sur les frames en utilisant ``delta``. Ne multipliez *pas* votre vecteur de vitesse par ``delta`` avant de le passer à ``move_and_slide()``.
ja: ``move_and_slide()`` は ``delta`` を使用してフレームベースの動きを自動的に計算します。 速度ベクトルを ``delta`` で乗算\ *ぜず*\ に ` move_and_slid()`` に渡します。
ko: ``move_and_slide()``\ 는 ``delta``\ 를 사용하여 프레임 기반 이동을 자동으로 계산합니다. ``delta``\ 를 ``move_and_slide()``\ 에 전달하기 전에 속도 벡터를 곱하면 *안됩니다*.
ru: ``move_and_slide()`` автоматически вычисляет перемещение на основе кадров, используя ``delta``. *Не* умножайте вектор скорости на``delta`` перед передачей его в ``move_and_slide()``.
zh_cn: ``move_and_slide()`` 使用 ``delta`` 自动计算基于帧的运动. 在将速度向量传递给 ``move_and_slide()`` 之前, 请 *不要* 将速度向量乘以 ``delta``.

source: In addition to the velocity vector, ``move_and_slide()`` takes a number of other parameters allowing you to customize the slide behavior:
de: Zusätzlich zum Geschwindigkeitsvektor verwendet ``move_and_slide()`` eine Reihe weiterer Parameter, mit denen Sie das Gleitverhalten anpassen können:
es: Además del vector velocidad, ``move_and_slide()`` acepta otros parámetros para personalizar el comportamiento del deslizamiento:
fr: En plus du vecteur de vitesse, ``move_and_slide()`` prend un certain nombre d'autres paramètres vous permettant de personnaliser le comportement du glissement :
ja: 速度ベクトルに加えて、\ ``move_and_slide()`` は他の多くのパラメーターを取り、スライドの動作をカスタマイズできます:
ko: 속도 벡터 뿐만 아니라, ``move_and_slide()``\ 는 많은 다른 매개변수를 가지고 있어서 슬라이드 행동을 커스터마이징 할 수 있습니다:
ru: В дополнение к вектору скорости ``move_and_slide()`` принимает ряд других параметров, позволяющих настроить поведение скольжения:
zh_cn: 除了速度向量之外, ``move_and_slide()`` 还有许多其他参数, 允许您自定义滑动行为:

source: ``up_direction`` - *default value:* ``Vector2( 0, 0 )``
de: ``up_direction`` - *Standardwert:* ``Vector2( 0, 0 )``
es: ``up_direction`` - *valor por defecto:* ``Vector2( 0, 0 )``
fr: ``up_direction`` - *valeur par défaut :* ``Vecteur2( 0, 0 )``
ru: ``up_direction`` — *значение по умолчанию:* ``Vector2( 0, 0 )``
zh_cn: ``up_direction`` - *默认值:* ``Vector2( 0, 0 )``

source: This parameter allows you to define what surfaces the engine should consider being the floor. Setting this lets you use the ``is_on_floor()``, ``is_on_wall()``, and ``is_on_ceiling()`` methods to detect what type of surface the body is in contact with. The default value means that all surfaces are considered walls.
de: Mit diesem Parameter können Sie festlegen, welche Oberflächen die Engine als Boden betrachten soll. Wenn Sie dies einstellen, können Sie die Methoden ``is_on_floor()``, ``is_on_wall()`` und ``is_on_ceiling()`` verwenden um festzustellen, mit welcher Art von Oberfläche der Körper in Kontakt steht. Der Standardwert bedeutet, dass alle Oberflächen als Wände betrachtet werden.
es: Este parámetro permite definir qué superficies debe considerar como suelo el motor de físicas. Al establecerlo puedes utilizar los métodos ``is_on_floor()`` (si está en el suelo), ``is_on_wall()`` (si está en la pared) , y ``is_on_ceiling()`` (si está en el techo) para detectar el tipo de superficie con la que hay contacto. El valor por defecto significa que todas las superficies son consideradas paredes.
fr: Ce paramètre vous permet de définir quelles surfaces le moteur doit considérer comme étant le sol. Cette option vous permet d'utiliser les méthodes ``is_on_floor()``, ``is_on_wall()`` et ``is_on_ceiling()`` pour détecter avec quel type de surface le corps est en contact. La valeur par défaut signifie que toutes les surfaces sont considérées comme des murs.
ja: このパラメーターを使用すると、エンジンが床と見なすサーフェスを定義できます。 これを設定すると、\ ``is_on_floor()``\ 、\ ``is_on_wall()``\ 、および ``is_on_ceiling()`` メソッドを使用して、ボディが接触している表面のタイプを検出できます。 デフォルト値は、すべてのサーフェスが壁と見なされることを意味します。
ru: Этот параметр позволяет определить, какие поверхности движок должен считать полом. Установка этого параметра позволяет использовать методы ``is_on_floor()``, ``is_on_wall()`` и ``is_on_ceiling()`` для определения типа поверхности, с которой контактирует тело. Значение по умолчанию означает, что все поверхности считаются стенами.
zh_cn: 这个参数允许你定义哪些表面应该被引擎视为地板. 设置这个参数可以让你使用 ``is_on_floor()`` , ``is_on_wall()`` 和 ``is_on_ceiling()`` 方法来检测物体接触的表面类型. 默认值意味着所有的表面都被认为是墙壁.

source: ``stop_on_slope`` - *default value:* ``false``
de: ``stop_on_slope`` - *Standardwert:* ``false``
es: ``stop_on_slope`` - *valor por defecto:* ``false``
fr: ``stop_on_slope`` - *valeur par défaut :* ``false``
ru: ``stop_on_slope`` — *значение по умолчанию:* ``false``
zh_cn: ``stop_on_slope`` - *默认值:* ``false``

source: This parameter prevents a body from sliding down slopes when standing still.
de: Dieser Parameter verhindert, dass ein Körper im Stillstand die Hänge hinunterrutscht.
es: Este parámetro evita que un cuerpo se deslice por las pendientes cuando está detenido.
fr: Ce paramètre empêche un corps de glisser sur les pentes lorsqu'il est à l'arrêt.
ru: Этот параметр предотвращает скольжение тела по склонам, когда оно стоит.
zh_cn: 该参数可以防止物体站立不动时从斜坡上滑落.

source: ``max_slides`` - *default value:* ``4``
de: ``max_slides`` - *Standardwert:* ``4``
es: ``max_slides`` - *valor por defecto:* ``4``
fr: ``max_slides`` - *valeur par défaut :* ``4``
ru: ``max_slides`` — *значение по умолчанию:* ``4``
zh_cn: ``max_slides`` - *默认值:* ``4``
