Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_basics.po
Languages: cs, de, ko

source: As you can see, functions normally in global scope in GDScript like Godot's ``print`` function are available in the ``GD`` class which is part of the ``Godot`` namespace. For a list of methods in the ``GD`` class, see the class reference pages for :ref:`@GDScript <class_@gdscript>` and :ref:`@GlobalScope <class_@globalscope>`.
cs: Jak vidíte, funkce normálně dostupné v GDScript globálně jako např. funkce ``print`` , jsou k dispozici ve třídě ``GD``, která je součástí namespace ``Godot``. Seznam metod třídy ``GD`` najdete na stránkách reference tříd :ref:`@GDScript <class_@gdscript>` a :ref:`@GlobalScope <class_@globalscope>`.
de: Wie Sie sehen können, sind Funktionen, die normalerweise in GDScript im globalen Geltungsbereich liegen (wie Godots Funktion ``print``) in der Klasse ``GD`` verfügbar, die Teil des Namenraums ``Godot`` ist. Eine Liste der Methoden in der Klasse ``GD`` finden Sie auf den Klassenreferenzseiten für :ref:`@GDScript <class_@gdscript>` und :ref:`@GlobalScope <class_@globalscope>`.
ko: 보시다시피, Godot의 ``print`` 함수와 마찬가지로 GDScript에서 함수는 기본적으로 전역 범위에 있기 때문에 ``Godot`` 네임스페이스의 일부분인 ``GD`` 클래스에서 사용할 수 있습니다. ``GD`` 클래스에서의 메서드 목록을 보려면, :ref:`@GDScript <class_@gdscript>`\ 와 :ref:`@GlobalScope <class_@globalscope>`\ 에서 클래스 참조 페이지를 참고하세요.

source: Keep in mind that the class you wish to attach to your node should have the same name as the ``.cs`` file. Otherwise, you will get the following error and won't be able to run the scene: *"Cannot find class XXX for script res://XXX.cs"*
cs: Mějte na paměti, že třída, kterou chcete připojit k uzlu, by měla mít stejné jméno jako soubor ``.cs``. V opačném případě se zobrazí následující chyba a nebude'možné scénu spustit: *"Nelze najít třídu XXX pro skript res://XXX.cs"*
de: Beachten Sie, dass die an Ihren Node anzuhängende Klasse denselben Namen wie die Datei ``.cs`` haben sollte. Andernfalls wird der folgende Fehler angezeigt und die Szene kann nicht ausgeführt werden: *"Klasse XXX für Skript res://XXX.cs kann nicht gefunden werden"*
ko: 노드에 붙이고 싶은 클래스 이름이 ``.cs`` 파일과 동일해야 한다는 사실을 명심하세요. 그렇지 않으면, 다음과 같은 오류를 받게 되며 씬을 실행할 수 없을 것입니다: *"스크립트 res://XXX.cs에서 클래스 XXX를 찾을 수 없음"*

source: General differences between C# and GDScript
cs: Obecné rozdíly mezi jazyky C# a GDScript
de: Allgemeine Unterschiede zwischen C# und GDScript
ko: C#과 GDScript와의 일반적인 차이

source: The C# API uses ``PascalCase`` instead of ``snake_case`` in GDScript/C++. Where possible, fields and getters/setters have been converted to properties. In general, the C# Godot API strives to be as idiomatic as is reasonably possible.
cs: API C# používá ``PascalCase`` místo ``snake_case`` v jazyce GDScript/C++. Kde to bylo možné, byla pole(field) a gettery/settery převedeny na vlastnosti(property). Obecně se rozhraní C# Godot API snaží být co nejvíce idiomatické, jak je to jen rozumně možné.
de: Die C# API verwendet in GDScript und C++ ``PascalCase`` anstelle von ``snake_case``. Nach Möglichkeit wurden Felder und Getter/Setter in Eigenschaften konvertiert. Im Allgemeinen ist die C# Godot API bestrebt, so idiomatisch wie möglich zu sein.
ko: GDScript/C++에서는 ``snake_case``\ 를 쓰지만 C# API는 ``PascalCase``\ 를 씁니다. 가능하면 공백과 getters/setters이 속성으로 변환됩니다. 일반적으로 C# Godot API는 합리적으로 가능한 것처럼 관용적이도록 노력합니다.

source: For more information, see the :ref:`doc_c_sharp_differences` page.
cs: Další informace naleznete na stránce :ref:`doc_c_sharp_differences`.
de: Für mehr Informationen über Events, siehe die Seite :ref:`doc_inputevent`.
ko: 더 자세한 내용은, :ref:`doc_c_sharp_differences` 페이지를 참고하세요.

source: You need to (re)build the project assemblies whenever you want to see new exported variables or signals in the editor. This build can be manually triggered by clicking the word **Build** in the top right corner of the editor. You can also click **Mono** at the bottom of the editor window to reveal the Mono panel, then click the **Build Project** button.
cs: Je třeba (znovu) sestavit projektu, kdykoli chcete vidět nové exportované proměnné nebo signály v editoru. Toto sestavení lze spustit ručně kliknutím na nápis **Build** v pravém horním rohu editoru. Můžete také kliknout na tlačítko **Mono** v dolní části okna editoru, čímž se zobrazí panel Mono, a poté kliknout na tlačítko **Sestavit projekt**.
de: Sie müssen die Projekt-Assemblies (neu) bauen, wenn Sie neue exportierte Variablen oder Signale im Editor sehen möchten. Dieser Build kann manuell ausgelöst werden, indem Sie auf das Wort **Build** in der oberen rechten Ecke des Editors klicken. Sie können auch unten im Editor-Fenster auf **Mono** klicken, um das Mono-Panel einzublenden, und dann auf die Schaltfläche **Projekt bauen** klicken.

source: You will also need to rebuild the project assemblies to apply changes in "tool" scripts.
cs: Budete také muset znovu sestavit sestavy projektu, abyste mohli použít změny ve skriptech "tool".
de: Sie müssen auch die Projektzusammenschnitte neu erstellen, um Änderungen in "Tool" -Skripten anzuwenden.

source: Current gotchas and known issues
cs: Aktuální problémy a známé potíže
de: Aktuelle Fehler und bekannte Probleme
ko: 현재 문제와 알려진 문제

source: As C# support is quite new in Godot, there are some growing pains and things that need to be ironed out. Below is a list of the most important issues you should be aware of when diving into C# in Godot, but if in doubt, also take a look over the official `issue tracker for Mono issues <https://github.com/godotengine/godot/labels/topic%3Amono>`_.
cs: Jelikož je podpora jazyka C# v systému Godot poměrně nová, je potřeba vyřešit některé problémy růstu a další trochu doladit. Níže je uveden seznam nejdůležitějších problémů, o kterých byste měli vědět, když se ponoříte do jazyka C# v Godotu, ale pokud máte pochybnosti, podívejte se také na oficiální `issue tracker pro problémy Mono <https://github.com/godotengine/godot/labels/topic%3Amono>`_.
de: Da die C# Unterstützung in Godot ziemlich neu ist, gibt es noch einige Dinge die beseitigt werden müssen. Nachstehend finden Sie eine Liste dieser wichtigsten Probleme, die Sie beim Eintauchen in C# in Godot beachten sollten. Im Zweifelsfall sollten Sie sich jedoch auch den offiziellen Mono Problem-Tracker ansehen. <https://github.com/godotengine/godot/labels/topic%3Amono>`_.
ko: C# 지원이 Godot에서 꽤 새롭기 때문에, 성장통이 있고 다듬어야 할 곳이 여전히 있습니다. 아래에는 중요한 문제 목록으로 Godot에서 C#으로 갈아탈 때 명심해야 합니다, 하지만 의심스러운 점이 있다면 공식 `Mono 이슈를 위한 이슈 트래커 <https://github.com/godotengine/godot/labels/topic%3Amono>`_\ 를 살펴보세요.

source: Writing editor plugins is possible, but it is currently quite convoluted.
cs: Psaní zásuvných modulů editoru je možné, ale v současné době je poměrně složité.
de: Editor Plugins zu schreiben ist möglich, aber zur Zeit ziemlich verworren.
ko: 편집기 플러그인을 작성하는 것은 가능하지만, 현재로썬 상당히 복잡합니다.

source: State is currently not saved and restored when hot-reloading, with the exception of exported variables.
cs: Stav se v současné době neukládá a neobnovuje při načítání za chodu, s výjimkou exportovaných proměnných.
de: Der Status wird derzeit beim Hot-Reloading nicht gespeichert und wiederhergestellt, mit Ausnahme der exportierten Variablen.
ko: 내보낸 변수를 제외하고, 현재 상태는 핫 리로드 중일 때 저장되고 복원되지 않습니다.

source: Attached C# scripts should refer to a class that has a class name that matches the file name.
cs: Připojené skripty C# by měly odkazovat na třídu, jejíž název odpovídá názvu souboru.
de: Angehängte C# Skripte sollten sich auf eine Klasse beziehen, deren Klassenname mit dem Dateinamen übereinstimmt.
ko: 첨부된 C# 스크립트가 파일 이름과 일치하는 클래스 이름을 가진 클래스를 참조해야 합니다.

source: There are some methods such as ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` and signal connection method ``Connect()`` that rely on Godot's ``snake_case`` API naming conventions. So when using e.g. ``CallDeferred("AddChild")``, ``AddChild`` will not work because the API is expecting the original ``snake_case`` version ``add_child``. However, you can use any custom properties or methods without this limitation.
cs: Existují některé metody, například ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` a způsob připojení signálu ``Connect()``, které jsou založeny na Godotově ``snake_case`` konvencí pojmenování API. Takže při použití např. ``CallDeferred("AddChild")``, ``AddChild`` nebude fungovat, protože API očekává původní ``snake_case`` verzi ``add_child``. Můžete však používat libovolné vlastní vlastnosti nebo metody bez tohoto omezení.
de: Es gibt einige Methoden wie ``Get()``/``Set()``, ``Call()``/``CallDeferred()`` und die Signalverbindungsmethode ``Connect()`` die sich auf Godots ``snake_case`` API-Namenskonventionen stützen. Wenn also z.B. ``CallDeferred("AddChild")`` genutzt wird, funktioniert ``AddChild`` nicht, da die API die ursprüngliche ``snake_case``-Version von ``add_child`` erwartet. Sie können jedoch alle benutzerdefinierten Eigenschaften oder Methoden ohne diese Einschränkung verwenden.
ko: Godot 의 ``snake_case" API 명명 규칙에 의존하는 ``Get ()"/"Set()" "Call()"/"CallDeferred()"와" 시그널 연결 메서드 ``Connect()"와 같은 방법이 있습니다. 그러므로 예를 들어 ``CallDeferred"("AddChild")를 사용할 때 ``AddChild"는 API가 원래의 ``snake_case" 버전의 ``add_child"를 기대하기 때문에 작동하지 않을 것입니다. 그러나 당신은 이러한 제한 없이 모든 맞춤 속성이나 메서드를 사용할 수 있습니다.

source: Exporting Mono projects is supported for desktop platforms (Linux, Windows and macOS), Android, HTML5, and iOS. The only platform not supported yet is UWP.
cs: Export projektů Mono je podporován pro desktopové platformy (Linux, Windows a macOS), Android, HTML5 a iOS. Jedinou platformou, která zatím není podporována, je UWP.
de: Das Exportieren von Mono-Projekten wird für Desktop-Plattformen (Linux, Windows und macOS), Android, HTML5 und iOS unterstützt. Die einzige noch nicht unterstützte Plattform ist UWP.

source: Performance of C# in Godot
cs: Výkon C# v Godot
de: Die Leistung von C# in Godot
ko: Godot에서 C#의 퍼포먼스

source: According to some preliminary `benchmarks <https://github.com/cart/godot3-bunnymark>`_, the performance of C# in Godot — while generally in the same order of magnitude — is roughly **~4×** that of GDScript in some naive cases. C++ is still a little faster; the specifics are going to vary according to your use case. GDScript is likely fast enough for most general scripting workloads. C# is faster, but requires some expensive marshalling when talking to Godot.
cs: Podle některých předběžných `benchmarků <https://github.com/cart/godot3-bunnymark>`_ je výkon jazyka C# v Godotu - ačkoli se obecně pohybuje ve stejném řádu - v některých naivních případech zhruba **~4×** vyšší než výkon jazyka GDScript. C++ je stále o něco rychlejší; specifika se budou lišit podle případu použití. GDScript je pravděpodobně dostatečně rychlý pro většinu obecných skriptovacích úloh. Jazyk C# je rychlejší, ale při komunikaci se systémem Godot vyžaduje nákladný marshalling (převod objektů c# do formátu vhodného pro Godot.
de: Nach einigen vorläufigen `Leistungstests <https://github.com/cart/godot3-bunnymark>`_ ist die Leistung von C# in Godot - obwohl im Allgemeinen in der gleichen Größenordnung - ungefähr **~4×** so hoch wie von GDScript in einigen Fällen. C++ ist immer noch etwas schneller; Die Einzelheiten variieren je nach Anwendungsfall. GDScript ist wahrscheinlich schnell genug für die meisten allgemeinen Arbeitsbelastungen eines Skripts. C# ist schneller, erfordert jedoch teures Marshalling, wenn Sie mit Godot sprechen.
ko: 일부 예비 `벤치마크 <https://github.com/cart/godot3-bunnymark>`_\ 에 따르면, Godot에서 C#의 퍼포먼스는 — 일반적으로 같은 순서의 크기에서 — 순수한 경우에서 대략 GDScript의 **~4x**\ 입니다. C++이 아직 조금 더 빠릅니다; 하지만 세부 사항은 사용하는 경우에 따라 다릅니다. GDScript는 대부분의 일반적인 스크립팅 작업에 충분히 빠릅니다. C#이 더 빠르지만, Godot과 대화하려면 비용이 큰 마샬링(marshalling)이 필요합니다.

source: Using NuGet packages in Godot
cs: Používání balíčků NuGet v Godot
de: NuGet Pakete in Godot nutzen
ko: Godot에서 NuGet 패키지 사용하기

source: `NuGet <https://www.nuget.org/>`_ packages can be installed and used with Godot, as with any C# project. Many IDEs are able to add packages directly. They can also be added manually by adding the package reference in the ``.csproj`` file located in the project root:
cs: `Balíčky NuGet <https://www.nuget.org/>`_ lze instalovat a používat s Godotem stejně jako s jakýmkoli jiným projektem v jazyce C#. Mnoho IDE umí balíčky přidávat přímo. Lze je také přidat ručně vložením odkazu na balíček do souboru ``.csproj`` umístěného v kořenovém adresáři projektu:
de: `NuGet <https://www.nuget.org/>`_ Pakete können wie jedes C# Projekt mit Godot installiert und verwendet werden. Viele IDEs können Pakete direkt hinzufügen. Sie können auch manuell hinzugefügt werden, indem die Paketreferenz in die Datei ``.csproj`` in der Projekt-Wurzel eingefügt wird:
ko: `NuGet <https://www.nuget.org/>`_ 패키지를 설치하여 프로젝트처럼, Godot와 사용할 수 있습니다. 많은 IDE는 직접 패키지를 추가할 수 있습니다. 또한 프로젝트 루트에 있는 ``.csproj`` 파일에 패키지 참조를 수동으로 추가할 수 있습니다:

source: As of Godot 3.2.3, Godot automatically downloads and sets up newly added NuGet packages the next time it builds the project.
cs: Od Godot 3.2.3 Godot automaticky stahuje a nastavuje nově přidané balíčky NuGet při následném sestavení projektu.
de: Ab Godot 3.2.3 lädt Godot automatisch neu hinzugefügte NuGet-Pakete herunter und richtet sie ein, wenn das Projekt das nächste Mal kompiliert wird.
ko: Godot 버전 3.2.3부터는 프로젝트를 빌드한 후 새로 추가된 NuGet 패키지를 자동으로 다운로드 및 설정합니다.

source: Profiling your C# code
cs: Profilování kódu C#
de: Einen C# Code in Form bringen
ko: C# 코드 프로파일링

source: `Mono log profiler <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ is available for Linux and macOS. Due to a Mono change, it does not work on Windows currently.
cs: `Profilovač protokolu Mono <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ je k dispozici pro systémy Linux a MacOS. Kvůli změně v systému Mono v současné době nefunguje ve Windows.
de: Der `Mono log profiler <https://www.mono-project.com/docs/debug+profile/profile/profiler/>` ist für Linux und macOS verfügbar. Wegen einer Mono Änderung funktioniert das Programm für Windows im Moment nicht.
ko: Linux와 MaxOS에서는 `Mono 로그 프로파일러 <https://www.mono-project.com/docs/debug+profile/profile/profiler/>`_ 를 지원합니다. Windows에서는 Mono의 변경으로 현재 로그 프로파일러 사용이 불가능합니다.

source: External Mono profiler like `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ can be used as described `here <https://github.com/godotengine/godot/pull/34382>`_.
cs: Externí profiler Mono, například `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_, lze použít, jak je popsáno `zde <https://github.com/godotengine/godot/pull/34382>`_.
de: Externe Mono Profiler wie `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ können wie `hier <https://github.com/godotengine/godot/pull/34382>`_ beschrieben benutzt werden.
ko: 다른 Mono 프로파일러로는 `JetBrains dotTrace <https://www.jetbrains.com/profiler/>`_ 을 사용 할 수 있습니다. 해당 설명 - `here <https://github.com/godotengine/godot/pull/34382>`_.

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
ko: 번역 상태

source: Prerequisites
de: Voraussetzungen
ko: 준비사항

source: Example
de: Beispiel
ko: 예제
