Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_features.po
Languages: de, es, ko, ru, uk, zh_cn, zh_tw

source: C# features
de: C# Merkmale
es: Características de C#
ko: C# 기능
ru: Особенности C#
uk: Особливості C#
zh_cn: C# 特征
zh_tw: C# 功能

source: This page provides an overview of the commonly used features of both C# and Godot and how they are used together.
de: Diese Seite bietet einen Überblick über die häufig verwendeten Funktionen von C# und Godot und wie sie zusammen verwendet werden.
es: Esta página provee un resumen acerca de las características comunmente utilizadas en C# y Godot y cómo son usadas.
ko: 이 페이지는 C#과 Godot에서 일반적으로 사용되는 기능과 어떻게 이 둘이 함께 사용되는 지에 대한 개요입니다.
ru: На этой странице представлен обзор наиболее часто используемых функций C# и Godot, а также того, как они используются вместе.
uk: На цій сторінці ви знайдете огляд часто використовуваних функцій як C#, так і Godot, та способів їх спільного використання.
zh_cn: 本页概述了C#和Godot的常用特征以及它们如何一起使用.
zh_tw: 本頁簡介了 C# 與 Godot 常見的功能，以及該如何互相配合。

source: Type conversion and casting
de: Typumwandlung und Casting
es: Conversión de tipo y casting
ko: 형 변환(Type conversion)과 캐스팅(casting)
ru: Превращение типов и кастинг
uk: Перетворення типів і кастинг
zh_cn: 类型转换和强制转换
zh_tw: 型別轉換

source: C# is a statically typed language. Therefore, you can't do the following:
de: C# ist eine statische Programmiersprache, daher ist dies hier nicht möglich:
es: C# es un lenguaje estáticamente tipado, por lo tanto, no puedes hacer lo siguiente:
ko: C#은 정적으로 타입형 언어입니다. 그러므로 다음을 할 수 없습니다:
ru: C# - это статически типизированный язык. Следовательно, вы не можете сделать следующее:
uk: C# - це статично типізована мова. Тому ви не можете зробити наступне:
zh_cn: C#是一种静态类型语言. 因此, 您无法执行以下操作:
zh_tw: C# 是靜態型別語言。所以，無法這麼做：

source: The method ``GetNode()`` returns a ``Node`` instance. You must explicitly convert it to the desired derived type, ``Sprite`` in this case.
de: Die Methode ``GetNode()`` liefert eine ``Node`` Instance. Diese muss nun in den gewünschten abgeleiteten Typ konvertiert werden , ``Sprite`` in diesem Fall.
es: El método ``GetNode()`` retorna una instancia ``Node``. Se debe convertir explícitamente al tipo derivado deseado, ``Sprite`` en este caso.
ko: ``Node`` 인스턴스를 반환하는 ``GetNode()`` 메서드. ``Sprite``\ 의 경우, 원하는 파생 타입을 명시적으로 변환해야 합니다.
ru: Метод ``GetNode()`` возвращает экземпляр ``Node``. Вы должны однозначно преобразовать его в желаемый производный тип, ``Sprite`` в данном случае.
uk: Метод ``GetNode()`` повертає екземпляр ``Node``. Ви явно повинні перетворити його в потрібний похідний тип, у цьому випадку ``Sprite``.
zh_cn: 方法 ``GetNode()`` 返回一个 ``Node`` 实例. 在这种情况下, 你必须将其显式转换为所需的派生类型, ``Sprite``.
zh_tw: ``GetNode()`` 方法會回傳 ``Node`` 實體。必須要明確將回傳值轉換為所需要的型別，在此例中為 ``Sprite`` 。

source: For this, you have various options in C#.
de: Hierfür gibt es verschiedene Möglichkeiten in C#.
es: Para esto, hay varias opciones en C#.
ko: 이를 위해, C#에서는 다양한 설정이 있습니다.
ru: Для этого в C# имеются различные опции.
uk: Для цього у вас є різні варіанти в C#.
zh_cn: 为此, 在C#中有多种选择.
zh_tw: 為此，在 C# 中有各種選項。

source: **Casting and Type Checking**
de: **Casting und Typprüfung**
es: **Casting & Chequeo de Tipo**
ko: **캐스트(Cast)와 타입 체크(Type Check)하기**
ru: **Приведение и проверка типа**
uk: **Приведення та перевірка типу**
zh_cn: **强制转换和类型检查**
zh_tw: **型別轉換與型別檢查**

source: Throws ``InvalidCastException`` if the returned node cannot be cast to Sprite. You would use it instead of the ``as`` operator if you are pretty sure it won't fail.
de: Löst ``InvalidCastException`` aus, wenn der zurückgegebene Node nicht in Sprite umgewandelt werden kann. Sie können es anstelle des Operators ``as`` verwenden, wenn Sie sich sicher sind, dass es nicht fehlschlagen wird.
es: Lanza ``InvalidCastException`` si el valor retornado no puede ser convertido a Sprite. Se utiliza en lugar del operador ``as`` si se está seguro que no fallará.
ko: 반환된 노드를 Sprite로 캐스트 할 수 없는 경우 ``InvalidCastException``\ 을 발생시킵니다. 실패하지 않는다고 확신하면 ``as`` 연산자 대신에 그것을 사용할 것입니다.
ru: Выдает `` InvalidCastException``, если возвращаемый узел не может быть приведен к Sprite. Вы можете использовать его вместо оператора `` as``, если уверены, что он не потерпит неудачу.
uk: Повертає ``InvalidCastException`` якщо повернутий вузол неможливо перетворити в Sprite. Ви можете використовувати його замість оператора ``as``, тільки, якщо впевнені, що він не викине помилку.
zh_cn: 如果返回的节点无法转换为Sprite, 则抛出 ``InvalidCastException`` . 如果您非常确定它不会失败, 您可以使用它而不是 ``as`` 运算符.
zh_tw: 使用這種方式時，若回傳的結果無法轉換為 Sprite 的話會拋出 ``InvalidCastException`` 。若非常確定不會失敗的話，可以使用這種方式來代替 ``as`` 運算子。

source: **Using the AS operator**
de: **Nutzen des AS Operators**
es: **Utilizando el operador AS**
ko: **AS 연산자 사용하기**
ru: ** Использование оператора AS **
uk: **Використання оператора AS**
zh_cn: **使用AS运算符**
zh_tw: **使用 AS 運算子**

source: The ``as`` operator returns ``null`` if the node cannot be cast to Sprite, and for that reason, it cannot be used with value types.
de: Der ``as`` Operator liefert ``null`` falls der Node nicht als Sprite genutzt werden kann, daher kann es nicht mit Wert Typen genutzt werden.
es: El operador ``as`` retorna ``null`` si el nodo no puede ser convertido a Sprite, y por esta razón no puede ser usado en tipos "valor".
ko: 노드가 Sprite로 캐스트 될 수 없다면 ``as`` 연산자는 null을 반환합니다, 그렇기 때문에 값 타입과는 함께 사용될 수 없습니다.
ru: Оператор ``as`` возвращает ``null``, если узел не может быть приведен к Sprite, и по этой причине его нельзя использовать с типами значений.
uk: Оператор ``as`` повертає ``null``, якщо вузол не може бути переведений в Sprite, і з цієї причини він не може використовуватися з типами значень.
zh_cn: 如果节点无法转换为 ``Sprite``, 则 ``as`` 运算符返回 ``null``, 因此它不能与值类型一起使用.
zh_tw: ``as`` 算子會在節點無法轉換為 Sprite 時回傳 ``null`` ，因此，無法與實值型別一起使用。

source: **Using the generic methods**
de: **Nutzen der allgemeinen Methoden**
es: **Utilizando métodos genéricos**
ko: **일반 메서드 사용하기**
ru: ** Использование универсальных методов **
uk: **Використання загальних методів**
zh_cn: **使用泛型方法**
zh_tw: **使用泛型方法**

source: Generic methods are also provided to make this type conversion transparent.
de: Es werden auch generische Methoden bereitgestellt, um diese Typkonvertierung transparent zu machen.
es: Los métodos genéricos se proveen para hacer la conversión de tipo transparente.
ko: 일반 메서드는 이 타입 변환을 투명하게 만들기 위해 제공됩니다.
ru: Общие методы также предоставляются, чтобы сделать это преобразование типов прозрачным.
uk: Також передбачені загальні методи, щоб зробити перетворення цього типу прозорим.
zh_cn: 还提供了泛型方法以使该类型转换透明.
zh_tw: 也可以使用泛型方法來透明轉換型別。

source: ``GetNode<T>()`` casts the node before returning it. It will throw an ``InvalidCastException`` if the node cannot be cast to the desired type.
de: ``GetNode<T>()`` wandelt den Node um, bevor er zurückgegeben wird. Es wird eine ``InvalidCastException`` ausgelöst, wenn der Node nicht in den gewünschten Typ umgewandelt werden kann.
es: ``GetNode<T>()`` realiza un casting del nodo antes de retornarlo. Lanzará una ``InvalidCastException`` si el nodo no puede ser convertido al tipo deseado.
ko: ``GetNode<T>()``\ 은 반환하기 전에 노드를 캐스트 합니다. 노드가 원하는 타입으로 캐스트 되지 않는다면 ``InvalidCastException``\ 을 발생시킵니다.
ru: ``GetNode<T>()`` преобразует узел перед его возвратом. Он выдаст ``InvalidCastException``, если узел не может быть приведен к нужному типу.
uk: ``GetNode<T>()`` переводить вузол перед поверненням. Він видасть, ``InvalidCastException`` якщо вузол не може бути приведений до бажаного типу.
zh_cn: ``GetNode <T>()`` 在返回之前强制转换节点. 如果节点无法强制转换为所需类型, 它将抛出一个 ``InvalidCastException``.
zh_tw: ``GetNode<T>()`` 可以在執行前就轉換節點型別。當節點無法轉換為需要的型別是，會拋出 ``InvalidCastException`` 。

source: ``GetNodeOrNull<T>()`` uses the ``as`` operator and will return ``null`` if the node cannot be cast to the desired type.
de: ``GetNodeOrNull<T>()`` verwendet den Operator ``as`` und gibt ``null`` zurück, wenn der Node nicht in den gewünschten Typ umgewandelt werden kann.
es: ``GetNodeOrNull<T>()`` usa el operador ``as`` y retornará ``null`` si el nodo no puede ser convertido al tipo deseado.
ko: ``GetNodeOrNull<T>()``\ 는 ``as`` 연산자를 사용하고 노드가 원하는 타입으로 캐스트 되지 않는다면 ``null``\ 을 반환합니다.
ru: ``GetNodeOrNull<T>()`` использует оператор ``as`` и вернет ``null``, если узел не может быть приведен к нужному типу.
uk: ``GetNodeOrNull<T>()`` використовує оператор ``as`` і поверне ``null``, якщо вузол неможливо перетворити на потрібний тип.
zh_cn: ``GetNodeOrNull <T>()`` 使用 ``as`` 运算符, 如果节点无法强制转换为所需类型, 则返回 ``null``.
zh_tw: ``GetNodeOrNull<T>()`` 會使用 ``as`` 運算子，且會在節點無法轉換為需要的型別時回傳 ``null`` 。

source: **Type checking using the IS operator**
de: **Typprüfung mit dem IS-Operator**
es: **Chequeo de tipo usando el operador IS**
ko: **IS 연산자를 사용하여 타입 체크하기**
ru: ** Проверка типа с использованием оператора IS **
uk: **Перевірка типу за допомогою оператора IS**
zh_cn: **使用IS运算符进行类型检查**
zh_tw: **使用 IS 運算子來進行型別檢查**

source: To check if the node can be cast to Sprite, you can use the ``is`` operator. The ``is`` operator returns false if the node cannot be cast to Sprite, otherwise it returns true.
de: Um zu überprüfen, ob der Node in Sprite umgewandelt werden kann, können Sie den Operator ``is`` verwenden. Der Operator ``is`` gibt "false" zurück, wenn der Node nicht in Sprite umgewandelt werden kann, andernfalls gibt er "true" zurück.
es: Para comprobar si un nodo puede ser convertido a Sprite, puedes usar el operador ``is``. Este operador retorna false si el nodo no puede ser convertido a Sprite, de otro modo, retorna true.
ko: 노드가 Sprite로 캐스트 되도록 체크하기 위해, ``is`` 연산자를 사용할 수 있습니다. Sprite가 캐스트 되지 않는다면 ``is`` 연산자는 거짓을 반환하고, 그렇지 않으면 참을 반환합니다.
ru: Чтобы проверить, может ли узел быть приведен к Sprite, вы можете использовать оператор ``is``. Оператор ``is`` возвращает false, если узел не может быть приведен к Sprite, в противном случае он возвращает true.
uk: Щоб перевірити, чи можна перевести вузол у Sprite, можна скористатися оператором ``is``. Оператор ``is`` повертає false, якщо вузол не може бути приведений до Sprite, в іншому випадку він повертає true.
zh_cn: 要检查节点是否可以强制转换为 ``Sprite``, 可以使用 ``is`` 运算符. 如果节点无法转换为 ``Sprite``, 则 ``is`` 运算符返回 ``false``, 否则返回 ``true``.
zh_tw: 若要檢查節點是否可被轉換為 Sprite，可以使用 ``is`` 運算子。``is`` 運算子會在無法將節點轉換為 Sprite 時回傳 false，否則將回傳 true。

source: For more advanced type checking, you can look into `Pattern Matching <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
de: Weitere Informationen zur Typprüfung finden Sie unter `Pattern Matching <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
es: Para tipos avanzados de comprobaciones, puedes mirar `Pattern Matching <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
ko: 더 많은 고급 타입 체크하기의 경우, `패턴 일치 <https://docs.microsoft.com/ko-kr/dotnet/csharp/pattern-matching>`_\ 에서 찾아볼 수 있습니다.
ru: Для более сложной проверки типов вы можете посмотреть в `Сопоставление шаблонов <https://docs.microsoft.com/ru-ru/dotnet/csharp/pattern-matching>`_.
uk: Більш просунуту перевірку типу ви можете подивитись у `Відповідність шаблонів <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
zh_cn: 对于更高级的类型检查, 你可以查看 `模式匹配 <https://docs.microsoft.com/en-us/dotnet/csharp/pattern-matching>`_.
zh_tw: 有關更多型別檢查，請參考 `模式比對 <https://docs.microsoft.com/zh-tw/dotnet/csharp/pattern-matching>`_ 。

source: C# signals
de: C# Signale
es: Señales en C#
ko: C# 시그널
ru: Сигналы C#
uk: Сигнали C#
zh_cn: C# 信号
zh_tw: C# 訊號

source: For a complete C# example, see the **Handling a signal** section in the step by step :ref:`doc_scripting` tutorial.
de: Ein vollständiges C# Beispiel finden Sie im Abschnitt **Behandeln eines Signals** in der Schritt-für-Schritt-Anleitung :ref:`doc_scripting`.
es: Para ejemplos completos de C#, ver la sección **Manipulando una señal** en el tutorial paso a paso :ref:`doc_scripting`.
ko: 완전한 C# 예제를 위해, 단계별 :ref:`doc_scripting` 튜토리얼에서 **시그널 다루기**\ 를 참고하세요.
ru: Для полного C# примера см. Раздел ** Обработка сигнала ** в пошаговом руководстве :ref:`doc_scripting`.
uk: Повний приклад C# дивіться у розділі **Обробка сигналу** у покроковому посібнику :ref:`doc_scripting`.
zh_cn: 有关完整的C#示例, 请参阅逐步 :ref:`doc_scripting` 教程中的 **处理信号** 部分.
zh_tw: 完整的 C# 例子請參考按部就班 :ref:`doc_scripting` 教學中的 **處理訊號** 一節。

source: Declaring a signal in C# is done with the ``[Signal]`` attribute on a delegate.
de: Das Deklarieren eines Signals in C# erfolgt mit dem Attribut ``[Signal]`` eines Beauftragten.
es: Una señal en C# se declara mediante el atributo ``[Signal]`` en un delegate.
ko: C#에서 시그널 선언은 델리게이트(delegate)에서 ``[Signal]`` 속성으로 됩니다.
ru: Объявление сигнала в C# выполняется с помощью атрибута ``[Signal]`` делегата.
uk: Оголошення сигналу в C# робиться з атрибутом ``[Signal]`` на делегаті.
zh_cn: 在C#中声明一个信号是通过一个 ``delegate`` 上的 ``[Signal]`` 特性完成的.
zh_tw: 在 C# 中，可在 Delegate 上加上 ``[Signal]`` 屬性來宣告訊號。

source: These signals can then be connected either in the editor or from code with ``Connect``. If you want to connect a signal in the editor, you need to (re)build the project assemblies to see the new signal. This build can be manually triggered by clicking the “Build” button at the top right corner of the editor window.
de: Diese Signale können dann entweder im Editor oder aus Code mit ``Connect`` verbunden werden. Wenn Sie ein Signal im Editor verbinden möchten, müssen Sie die Projektassemblys (neu) erstellen, um das neue Signal anzuzeigen. Dieser Build kann manuell ausgelöst werden, indem Sie auf die Schaltfläche "Build" in der oberen rechten Ecke des Editorfensters klicken.
es: Estas señales pueden ser conectadas en el editor o desde el código con "Connect". Si quieres conectar una señal en el editor, necesitas (re)construir los ensamblajes del proyecto para ver la nueva señal. Esta construcción puede ser activada manualmente haciendo clic en el botón "Build" en la esquina superior derecha de la ventana del editor.
ko: 위 시그널들은 에디터 혹은 코드 내에서 ``Connect`` 메소드를 이용해 연결할 수 있습니다. 에디터에서 시그널을 연결할 때, 프로젝트 구성물(assembly) 를 다시 빌드해야 추가된 시그널을 확인할 수 있습니다. 에디터 창 우측 상단 모퉁이의 "Build" 버튼을 눌러 직접 빌드할 수 있습니다.
ru: Эти сигналы затем могут быть подключены либо в редакторе, либо из кода с помощью `` Connect``. Если вы хотите подключить сигнал в редакторе, вам нужно собрать проект, чтобы увидеть новый сигнал. Эту сборку можно запустить вручную, нажав кнопку «Построить» в верхнем правом углу окна редактора.
uk: Ці сигнали можуть бути потім підключені або в редакторі, або з коду за допомогою ``Connect``. Якщо ви хочете підключити сигнал в редакторі, вам потрібно (пере)скласти збірку проєктів, щоб побачити новий сигнал. Цю збірку можна вручну запустити, натиснувши кнопку «Створити» (“Build”) у верхньому правому куті вікна редактора.
zh_cn: 这些信号可以在编辑器或者在代码中使用 ``Connect`` 进行连接. 如果想在编辑器中连接一个信号, 你需要(重新)生成项目组件才能看到这个新的信号. 生成操作可以点击 编辑窗口右上角的 "Build" 按钮手动触发.
zh_tw: 接著這些訊號便可以在編輯器中或使用 ``Connect` 來在程式碼中進行連接。若像在編輯器中連接訊號，則需要建置 (或重新建置) 專案組件才能看到新的訊號。可以通過點擊編輯器視窗右上角的 [建置] 按鈕來手動觸發建置。

source: Emitting signals is done with the ``EmitSignal`` method.
de: Das Senden von Signalen erfolgt mit der Methode ``EmitSignal``.
es: Las señales se emiten con el método ``EmitSignal``.
ko: ``EmitSignal`` 메서드로 시그널을 방출할 수 있습니다.
ru: Излучение сигналов осуществляется методом ``EmitSignal``.
uk: Випромінювання сигналів проводиться методом ``EmitSignal``.
zh_cn: 发射信号是通过 ``EmitSignal`` 方法完成的.
zh_tw: 使用 ``EmitSignal`` 方法來送出訊號。

source: Notice that you can always reference a signal name with the ``nameof`` keyword (applied on the delegate itself).
de: Beachten Sie, dass Sie einen Signalnamen immer mit dem Schlüsselwort ``nameof`` referenzieren können (angewendet auf den Beauftragten selbst).
es: Tener en cuenta que se puede hacer referenciar a una señal con la palabra clave ``nameof`` (aplicado al delegate).
ko: ``nameof`` 키워드로 항상 시그널 이름을 참조할 수 있다는 것을 명심하세요 델리게이트 자체에 적용됨).
ru: Обратите внимание, что вы всегда можете сослаться на имя сигнала используя ключевое слово ``nameof`` (применяется к самому делегату).
uk: Зауважте, що ви завжди можете посилатись на ім'я сигналу за допомогою ключового слова ``nameof`` (застосованого до самого делегата).
zh_cn: 请注意, 你始终可以使用 ``nameof`` 关键字引用信号名称(应用于 ``委托(delegate)`` 本身).
zh_tw: 請注意，可以使用 ``nameof`` 關鍵字來參照訊號名稱 (套用於 delegate 自身)。

source: It is possible to bind values when establishing a connection by passing a Godot array.
de: Es ist möglich, beim Verbindungsaufbau Werte zu binden, indem ein Godot-Array übergeben wird.
ru: Возможно связывать значения при установке соединения передавая массив Godot.
uk: Можна встановити прив'язку значень при встановленні з'єднання, передавши масив Godot.
zh_cn: 在建立连接时，可以通过传递一个Godot数组来绑定值。

source: Signals support parameters and bound values of all the `built-in types <https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ and Classes derived from :ref:`Godot.Object <class_Object>`. Consequently, any ``Node`` or ``Reference`` will be compatible automatically, but custom data objects will need to extend from `Godot.Object` or one of its subclasses.
de: Signale unterstützen Parameter und sind an alle Werte der `eingebauten Typen <https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ und den Klassen :ref:`Godot.Object <class_Object>`, aus denen sie übernommen sind, gebunden. Daraus folgend, sind ``Nodes`` oder ``Referenzen`` automatisch kompatibel. Eigene Datenobjekte müssen an `Godot.Object` oder einer seiner Unterklassen anbauen.
es: Las señales soportan parámetros y valores vinculados de todos los `tipos built-in <https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ y clases derivadas de :ref:`Godot.Object <class_Object>`. Consecuentemente, cualquier ``Node`` o ``Reference`` será compatible automaticamente, pero objetos de datos personalizados deberán extender de `Godot.Object` o alguna de sus subclases.
ko: 시그널은 매개변수를 지원하고, 모든 `내장 타입 <https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>`_\ 의 값들과 :ref:`Godot.Object <class_Object>`\ 에서 파생된 클래스들을 묶습니다. 결과적으로, 모든 ``Node``\ 나 ``Reference``\ 는 자동으로 호환될 것이지만, 맞춤 데이터 오브젝트는 `Godot.Object`\ 나 그 하위 클래스에서 확장해야 할 것입니다.
ru: Сигналы поддерживают параметры и связанные значения всех `встроенных типов <https://docs.microsoft.com/ru-ru/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ и Классов, полученных из :ref:`Godot.Object <class_Object>`. Следовательно, любой ``Node`` или ``Reference`` будут совместимы автоматически, но пользовательские объекты данных должны наследоваться из `Godot.Object` или одного из его подклассов.
uk: Сигнали підтримують параметри та зв'язані значення всіх `вбудованих типів <https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ та класів, похідних від :ref:`Godot.Object <class_Object>`. Отже, будь-який Node, або Reference, буде сумісний автоматично, але користувацькі об'єкти даних потрібно буде поширити з `Godot.Object`, або одного з його підкласів.
zh_cn: 信号支持所有 `内置类型 <https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ 的参数和绑定值, 以及从 :ref:`Godot.Object <class_Object>` 派生的类. 因此, 任何 ``Node`` 或 ``Reference`` 将自动兼容, 但是自定义数据对象将需要从 ``Godot.Object`` 或其子类之中扩展.
zh_tw: 訊號支援參數與繫結所有 `內建型別s <https://docs.microsoft.com/zh-tw/dotnet/csharp/language-reference/keywords/built-in-types-table>`_ 與繼承 :ref:`Godot.Object <class_Object>` 的值。因此，任何 ``Node`` 或 ``Reference`` 都自動相容，但自定資料物件則需要繼承 ``Godot.Object`` 或其任一子類別。

source: Finally, signals can be created by calling ``AddUserSignal``, but be aware that it should be executed before any use of said signals (with ``Connect`` or ``EmitSignal``).
de: Abschließend, Signale können durchs aufrufen von ``AddUserSignal`` erstellt werden, jedoch seien sie vorsichtig, dass dies durchgeführt, bevor das betroffene Signal benutzt wird (durch ``Connect`` oder ``EmitSignal``).
es: Finalmente, las señales pueden ser creadas llamando ``AddUserSinal``, pero tener en cuenta que debe ser ejecutado antes de la utilización de dicha señal (con ``Connect`` o ``EmitSignal``).
ko: 마침내, 시그널은 ``AddUserSignal``\ 로 호출하는 것으로 생성될 수 있지만, 시그널을 사용하기 전에 실행되어야 한다는 것을 명심하세요 (``Connect``\ 나 ``EmitSignal``\ 로 말이죠).
ru: Наконец, сигналы могут быть созданы путем вызова `` AddUserSignal``, но имейте в виду, что он должен выполниться перед любым использованием указанных сигналов (с помощью `` Connect`` или `` EmitSignal``).
uk: Нарешті, сигнали можна створити за допомогою виклику ``AddUserSignal``, але пам'ятайте, що він повинен бути виконаний перед будь-яким використанням зазначених сигналів (з ``Connect``, або ``EmitSignal``).
zh_cn: 最后, 可以通过调用 ``AddUserSignal`` 来创建信号, 但要注意它应该在使用所述信号之前执行(使用 ``Connect`` 或 ``EmitSignal``).
zh_tw: 最後，可以通過 ``AddUserSignal`` 來建立訊號。但請注意 AddUserSignal 應該在 (通過 ``Connect`` 或 ``EmitSignal``) 使用前執行。

source: Preprocessor defines
de: Präprozessor Festlegungen
es: Defines de preprocesador
ko: 전처리기 지시문
ru: Препроцессорные определения
uk: Preprocessor визначення
zh_cn: 预处理器符号定义
zh_tw: 定義前置處理器

source: Godot has a set of defines that allow you to change your C# code depending on the environment you are compiling to.
de: Godot verfügt über eine Reihe von Definitionen, mit denen Sie Ihren C# Code abhängig von der Umgebung in die Sie kompilieren ändern können.
es: Godot tiene un conjunto de definiciones que le permiten cambiar su código C# dependiendo del entorno en el que esté compilando.
ko: Godot은 컴파일하는 환경에 따라 C# 코드를 변경할 수 있도록 여러 전처리기 지시문을 제공합니다.
ru: Godot имеет набор определений, которые позволяют изменять код C# в зависимости от среды, в которую вы компилируете.
uk: У Godot є набір визначень, які дозволяють змінювати ваш C# код залежно від середовища.
zh_cn: 为了能够根据目标编译环境改变 C# 代码，Godot 提供了一组符号定义。
zh_tw: Godot 中有一系列的定義，可以用來依據編譯環境來更改 C# 程式碼。

source: If you created your project before Godot 3.2, you have to modify or regenerate your `csproj` file to use this feature (compare ``<DefineConstants>`` with a new 3.2+ project).
de: Wenn Sie Ihr Projekt vor Godot 3.2 erstellt haben, müssen Sie Ihre `csproj` Datei ändern oder neu generieren, um diese Funktion zu verwenden (vergleichen Sie ``<DefineConstants>`` mit einem neuen 3.2+ -Projekt).
es: Si creaste tu proyecto antes de Godot 3.2, tienes que modificar o regenerar tu archivo `csproj` para usar esta característica (compara ``<DefineConstants>`` con un nuevo proyecto 3.2+).
ko: Godot 3.2 버전 이전에 프로젝트를 생성했다면, `csproj` 파일을 수정하거나 재생성해야 이 기능(``<DefineConstants>`` 를 3.2 이후의 프로젝트와 비교해보십시오)을 사용할 수 있습니다.
ru: Если вы создали свой проект до Godot 3.2, вам придется изменить или регенерировать свой файл `csproj`, чтобы использовать эту функцию (сравните ``<DefineConstants>`` с новым проектом 3.2+).
uk: Якщо ви створили свій проєкт до Godot 3.2, ви повинні змінити, або відновити ваш файл `csproj`, щоб використовувати цю функцію (порівняйте ``<DefineConstants>`` з новим проєктом 3.2+).
zh_cn: 如果是Godot 3.2之前创建的项目, 你需要修改或重新生成你的 `csproj` 文件来使用这个功能(可与一个3.2+新项目中的 ``<DefineConstants>`` 相对比).
zh_tw: 若是在 Godot 3.2 版前建立的專案，則需要更改或重新產生 **csproj** 來使用本功能 (請對照 3.2+ 版專案中的 ``<DefineConstants>`` )。

source: Examples
de: Beispiele
es: Ejemplos
ko: 예제
ru: Примеры
uk: Приклади
zh_cn: 示例
zh_tw: 範例

source: For example, you can change code based on the platform:
de: Sie können beispielsweise den Code basierend auf der Plattform ändern:
es: Por ejemplo, puedes cambiar el código basado en la plataforma:
ko: 예를 들어, 다음과 같이 플랫폼에 따라 코드를 변경할 수 있습니다:
ru: Например, вы можете изменять код в зависимости от платформы:
uk: Наприклад, ви можете змінити код на основі платформи:
zh_cn: 例如, 你可以根据平台更改代码:
zh_tw: 例如，可以依據平台來更改程式碼：
