Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_basics.po
Languages: cs, de, ko

source: C# basics
cs: Základy C#
de: C# Grundlagen
ko: C# 기초

source: Introduction
cs: Úvod
de: Einführung
ko: 소개

source: C# support is a new feature available since Godot 3.0. As such, you may still run into some issues, or find spots where the documentation could be improved. Please report issues with C# in Godot on the `engine GitHub page <https://github.com/godotengine/godot/issues>`_, and any documentation issues on the `documentation GitHub page <https://github.com/godotengine/godot-docs/issues>`_.
cs: Podpora jazyka C# je nová funkce dostupná od verze Godot 3.0. Proto můžete stále narazit na některé problémy nebo najít místa, kde by dokumentace mohla být vylepšena. Problémy s jazykem C# v systému Godot nahlaste prosím na `straně GitHub <https://github.com/godotengine/godot/issues>`_ a případné problémy s dokumentací na `straně GitHub <https://github.com/godotengine/godot-docs/issues>`_.
de: C# Unterstützung ist eine neue Funktion, die seit Godot 3.0 verfügbar ist. Daher können immer noch Probleme auftreten oder Stellen gefunden werden, an denen die Dokumentation verbessert werden könnte. Bitte melden Sie Probleme mit C# in Godot auf `engine GitHub page <https://github.com/godotengine/godot/issues>`_, und alle Dokumentations Probleme auf `documentation GitHub page <https://github.com/godotengine/godot-docs/issues>`_.
ko: C# 지원은 Godot 3.0의 새로운 기능입니다. 따라서, 실행 중 여전히 문제가 발생할 수 있고, 문서를 개선할 수 있는 부분을 발견할 수도 있습니다. `엔진 Github 페이지 <https://github.com/godotengine/godot/issues>`_\ 에서 Godot의 C#관련 문제들을 보고해주세요. 그리고 문서상의 문제는`문서 Github 페이지 <https://github.com/godotengine/godot-docs/issues>`_\ 에서 보고해주세요.

source: This page provides a brief introduction to C#, both what it is and how to use it in Godot. Afterwards, you may want to look at :ref:`how to use specific features <doc_c_sharp_features>`, read about the :ref:`differences between the C# and the GDScript API <doc_c_sharp_differences>` and (re)visit the :ref:`Scripting section <doc_scripting>` of the step-by-step tutorial.
cs: Na této stránce najdete stručný úvod do jazyka C#, a to jak do jeho podstaty, tak do jeho použití v Godotu. Poté se můžete podívat na :ref:`jak používat konkrétní funkce <doc_c_sharp_features>`, přečíst si o :ref:`rozdílech mezi rozhraním API jazyka C# a GDScript <doc_c_sharp_differences>` a (znovu)navštívit :ref:`sekci Skriptování <doc_scripting>` v tutoriálu Krok za krokem.
de: Diese Seite bietet eine kurze Einführung in C#, sowohl was es ist als auch wie man es in Godot benutzt. Danach möchten Sie vielleicht etwas über die :ref:`Verwendung bestimmter Funktionen <doc_c_sharp_features>` lesen und über die :ref:`Unterschiede zwischen der C# und der GDScript API <doc_c_sharp_differences>`, sowie auf die Seite :ref:`Scripting section <doc_scripting>` der Schritt-für-Schritt-Anleitung schauen.
ko: 이 페이지는 C#에 대한 간단한 소개와 그것이 무엇인지, 그리고 그것을 Godot에서 사용하는 방법을 제공합니다. 그런 다음, :ref:`특정 기능을 사용하는 방법 <doc_c_sharp_features>`\ 을 원한다면, :ref:`C# 과 GDScript API의 차이점 <doc_c_sharp_differences>`\ 에 대해 읽고 단계별 튜토리얼의 :ref:`스크립팅 섹션 <doc_scripting>`\ 을 (다시) 확인하세요.

source: C# is a high-level programming language developed by Microsoft. In Godot, it is implemented with the Mono 6.x .NET framework, including full support for C# 8.0. Mono is an open source implementation of Microsoft's .NET Framework based on the ECMA standards for C# and the Common Language Runtime. A good starting point for checking its capabilities is the `Compatibility <http://www.mono-project.com/docs/about-mono/compatibility/>`_ page in the Mono documentation.
cs: C# je vysokoúrovňový programovací jazyk vyvinutý společností Microsoft. V Godotu je implementován pomocí Mono 6.x .NET, včetně plné podpory jazyka C# 8.0. Mono je open source implementace Microsoft'NET založená na standardech ECMA pro jazyk C# a Common Language Runtime. Dobrým výchozím bodem pro ověření jeho možností je `Stránka o kompatibilitě <http://www.mono-project.com/docs/about-mono/compatibility/>`_ v dokumentaci k Mono.
de: C# ist eine von Microsoft entwickelte High-Level Programmiersprache. In Godot wird es mit dem Mono 6.x .NET-Framework implementiert, einschließlich der vollständigen Unterstützung für C# 8.0. Mono ist eine Open Source-Implementierung von Microsoft .NET Framework, die auf den ECMA-Standards für C# und der Common Language Runtime basiert. Ein guter Ausgangspunkt für die Überprüfung der Funktionen ist die Seite `Compatibility <http://www.mono-project.com/docs/about-mono/compatibility/>`_ in der Mono-Dokumentation.
ko: C#은 Microsoft가 개발한 하이 레벨 프로그래밍 언어 입니다. Godot에서는 Mono 6.x .NET framework로 구현되었으며, C# 8.0을 완전 지원합니다. Mono는 Microsoft의 .NET Framework의 오픈 소스로 C#과 Common Language Runtime을 위한 ECMA 표준을 기반으로 구현되었습니다. 호환성을 확인하기 위한 좋은 시작점으로 Mono 문서에 있는 `호환성<http://www.mono-project.com/docs/about-mono/compatibility/>`_ 을 살펴보세요.

source: This is **not** a full-scale tutorial on the C# language as a whole. If you aren't already familiar with its syntax or features, see the `Microsoft C# guide <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ or look for a suitable introduction elsewhere.
cs: Toto je **není** plnohodnotný tutorial celého jazyka C# . Pokud ještě nejste obeznámeni s jeho syntaxí nebo funkcemi, podívejte se do `Průvodce Microsoft C# <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ nebo se poohlédněte po jiném vhodném úvodním materiálu.
de: Dies ist **keine** umfassende Anleitung zur Sprache C# im Ganzen. Wenn Sie mit der Syntax oder den Funktionen von C# noch nicht vertraut sind, lesen Sie den `Microsoft C# Ratgeber <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_ oder suchen Sie an anderer Stelle nach einer geeigneten Einführung.
ko: 이것은 C# 언어 전체에 대한 본격적인 튜토리얼이 **아닙니다**. 문법이나 기능에 익숙하지 않다면 `Microsoft C# 가이드 <https://docs.microsoft.com/en-us/dotnet/csharp/index>`_\ 를 보거나 다른 적합한 설명을 찾아보세요.

source: Setting up C# for Godot
cs: Nastavení jazyka C# pro Godot
de: C# für Godot einrichten
ko: Godot에 C# 설치하기

source: From Godot 3.2.3 onwards, installing Mono SDK is not a requirement anymore, except it is required if you are building the engine from source.
cs: Od verze Godot 3.2.3 již není instalace Mono SDK podmínkou, je pouze vyžadována, pokud kompilujete engine ze zdrojových kódů.
de: Ab Godot 3.2.3 ist die Installation des Mono SDK keine Voraussetzung mehr, außer wenn Sie die Engine selbst kompilieren.
ko: Godot 3.2.3 부터는, 엔진 소스 코드를 빌드할 것이 아니라면 Mono SDK를 설치할 필요가 없습니다.

source: Additional notes
cs: Dodatečné poznámky
de: Zusätzliche Anmerkungen
ko: 추가 정보

source: Be sure to install the 64-bit version of the SDK(s) if you are using the 64-bit version of Godot.
cs: Pokud používáte 64bitovou verzi Godotu, nezapomeňte nainstalovat 64bitovou verzi SDK.
de: Stellen Sie sicher, dass Sie die 64-Bit-Version des SDKs installieren, wenn Sie die 64-Bit-Version von Godot verwenden.
ko: 64-bit 버전의 Godot을 사용하고 있다면 64-bit 버전의 SDK를 설치해야 합니다.

source: If you are building Godot from source, install the latest stable version of `Mono <https://www.mono-project.com/download/stable/>`__, and make sure to follow the steps to enable Mono support in your build as outlined in the :ref:`doc_compiling_with_mono` page.
cs: Pokud sestavujete Godot ze zdrojových kódů, nainstalujte nejnovější stabilní verzi `Mono <https://www.mono-project.com/download/stable/>`__ a ujistěte se, že postupujete podle kroků pro zapnutí podpory Mono ve vašem sestavení, jak je popsáno na stránce :ref:`doc_compiling_with_mono`.
de: In Ihrer Godot-Version muss die Mono-Unterstützung aktiviert sein. Laden Sie daher unbedingt die **Mono-Version** von Godot herunter. Wenn Sie Godot aus dem Quellcode erstellen, befolgen Sie die Schritte, um die Mono-Unterstützung in Ihrem Build zu aktivieren, wie auf der Seite :ref:`doc_compiling_with_mono` beschrieben.
ko: Godot을 소스에서 빌드할 생각이라면, 안정(stable) 버전중 최신의 `Mono <https://www.mono-project.com/download/stable/>`__ 를 설치하고 :ref:`doc_compiling_with_mono` 페이지의 설명을 따라 진행하십시오.

source: Configuring an external editor
cs: Konfigurace externího editoru
de: Einen externen Editor konfigurieren
ko: 외부 편집기 설정

source: C# support in Godot's built-in script editor is minimal. Consider using an external IDE or editor, such as `Visual Studio Code <https://code.visualstudio.com/>`__ or MonoDevelop. These provide autocompletion, debugging, and other useful features for C#. To select an external editor in Godot, click on **Editor → Editor Settings** and scroll down to **Mono**. Under **Mono**, click on **Editor**, and select your external editor of choice. Godot currently supports the following external editors:
cs: Podpora jazyka C# v integrovaném editoru skriptů Godot' je minimální. Zvažte použití externího IDE nebo editoru, například `Visual Studio Code <https://code.visualstudio.com/>`__ nebo MonoDevelop. Ty poskytují automatické dokončování, ladění a další užitečné funkce pro jazyk C#. Chcete-li v Godotu vybrat externí editor, klikněte na **Editor → Nastavení editoru** a přejděte dolů na **Mono**. V části **Mono** klikněte na **Editor** a vyberte zvolený externí editor. Godot v současné době podporuje následující externí editory:
de: Die C# Unterstützung in Godots Skripteditor ist minimal. Verwenden Sie eine externe IDE oder einen externen Editor, z.B. `Visual Studio Code <https://code.visualstudio.com/>`_ oder MonoDevelop. Diese bieten Autovervollständigung, Debugging und andere nützliche Funktionen für C#. Um einen externen Editor in Godot auszuwählen, klicken Sie auf **Editor → Editoreinstellungen** und scrollen nach unten zu **Mono**. Klicken Sie unter **Mono** auf **Editor** und wählen Sie den gewünschten externen Editor aus. Godot unterstützt derzeit die folgenden externen Editoren:
ko: Godot의 스크립트 편집기에서 C# 지원은 최소한입니다. `Visual Studio Code <https://code.visualstudio.com/>`_\ 나 MonoDevelop과 같은 외부 IDE나 편집기를 사용하는 것을 고려해보세요. 이들은 자동 완성, 디버깅 및 C#을 위한 기타 유용한 기능이 제공됩니다. Godot에서 외부 편집기를 선택하려면, **편집기 → 편집기 설정**\ 으로 가서 **Mono**\ 로 내려갑니다. **Mono**\ 에서 **Editor**\ 를 클릭하면 외부 편집기를 선택하는 페이지가 나타납니다. Godot이 지원하는 외부 편집기는 다음과 같습니다:

source: Visual Studio for Mac
cs: Visual Studio pro Mac
de: Visual Studio für Mac

source: See the following sections for how to configure an external editor:
cs: Postup konfigurace externího editoru naleznete v následujících částech:
de: In den folgenden Abschnitten erfährt man, wie man einen externen Editor konfiguriert:
ko: 외부 편집기를 설정하는 방법은 아래 구획들을 확인하십시오:

source: After reading the "Prerequisites" section, you can download and install `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.
cs: Po přečtení části "Předpoklady" si můžete stáhnout a nainstalovat `JetBrains Rider <https://www.jetbrains.com/rider/download>`__.
de: Nachdem der Abschnitt "Voraussetzungen" gelesen wurde, können man `JetBrains Rider <https://www.jetbrains.com/rider/download>`__ herunterladen und installieren.
ko: "준비사항" 구획을 읽은 후, `JetBrains Rider <https://www.jetbrains.com/rider/download>`__ 를 설치할 수 있습니다.

source: In Godot's **Editor → Editor Settings** menu:
cs: V nabídce Godot **Editor → Nastavení editoru**:
de: In Godots **Editor → Editoreinstellungen** Menü:
ko: Godot의 **편집기 → 편집기 설정** 메뉴에서:

source: Set **Mono** -> **Editor** -> **External Editor** to **JetBrains Rider**.
cs: Nastavte **Mono** -> **Editor** -> **Externí editor** na **JetBrains Rider**.
de: Setzen Sie **Mono** -> **Editor** -> **Externer Editor** auf **JetBrains Rider**.
ko: **Mono** -> **Editor** -> **External Editor** 를 **JetBrains Rider** 로 설정.

source: Set **Mono** -> **Builds** -> **Build Tool** to **dotnet CLI**.
cs: Nastavte **Mono** -> **Builds** -> **Build Tool** na **dotnet CLI**.
de: Stellen Sie **Mono** -> **Builds** -> **Build Tool** auf **dotnet CLI**.
ko: **Mono** -> **Builds** -> **Build Tool** 을 **dotnet CLI** 로 설정.

source: In Rider:
cs: V Rideru:
ko: Rider 에서:

source: Set **MSBuild version** to **.NET Core**.
cs: Nastavte **verzi MSBuild** na **.NET Core**.
de: Setzen Sie **MSBuild-Version** auf **.NET Core**.
ko: **MSBuild version** 을 **.NET Core** 로 설정.

source: Install the **Godot support** plugin.
cs: Nainstalujte zásuvný modul **Godot support**.
de: Installiere **Godot Support** Plugin.
ko: **Godot support** 플러그인을 설치.

source: After reading the "Prerequisites" section, you can download and install `Visual Studio Code <https://code.visualstudio.com/download>`__ (aka VS Code).
cs: Po přečtení části "Předpoklady" si můžete stáhnout a nainstalovat `Visual Studio Code <https://code.visualstudio.com/download>`__ (alias VS Code).
de: Nachdem der Abschnitt "Voraussetzungen" gelesen wurde, kann man `Visual Studio Code <https://code.visualstudio.com/download>`__ (alias VS Code) herunterladen und installieren.
ko: "준비사항" 구획을 읽은 후, `Visual Studio Code <https://code.visualstudio.com/download>`__ (VS Code)를 설치할 수 있습니다.

source: Set **Mono** -> **Editor** -> **External Editor** to **Visual Studio Code**.
cs: Nastavte **Mono** -> **Editor** -> **Externí editor** na **Visual Studio Code**.
de: Stellen Sie **Mono** -> **Editor** -> **Externer Editor** auf **Visual Studio Code**.
ko: **Mono** -> **Editor** -> **External Editor** 를 **Visual Studio Code** 로 설정.

source: In Visual Studio Code:
cs: V aplikaci Visual Studio Code:
de: Visual Studio Code:
ko: Visual Studio Code에서:

source: Install the `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__ extension.
cs: Nainstalujte rozšíření `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__.
de: Installieren Sie die Erweiterung `C# <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__.
ko: `C# 확장 프로그램 <https://marketplace.visualstudio.com/items?itemName=ms-dotnettools.csharp>`__ 을 설치하십시오.

source: Install the `Mono Debug <https://marketplace.visualstudio.com/items?itemName=ms-vscode.mono-debug>`__ extension.
cs: Nainstalujte rozšíření `Mono Debug <https://marketplace.visualstudio.com/items?itemName=ms-vscode.mono-debug>`__.
de: Installieren Sie die Erweiterung `Mono Debug <https://marketplace.visualstudio.com/items?itemName=ms-vscode.mono-debug>`__.
ko: `Mono Debug 확장 프로그램 <https://marketplace.visualstudio.com/items?itemName=ms-vscode.mono-debug>`__ 을 설치하십시오.

source: Install the `C# Tools for Godot <https://marketplace.visualstudio.com/items?itemName=neikeq.godot-csharp-vscode>`__ extension.
cs: Nainstalujte rozšíření `C# Tools for Godot <https://marketplace.visualstudio.com/items?itemName=neikeq.godot-csharp-vscode>`__.
de: Installieren Sie die Erweiterung `C# Tools for Godot <https://marketplace.visualstudio.com/items?itemName=neikeq.godot-csharp-vscode>`__.
ko: `C# Tools for Godot 확장 프로그램 <https://marketplace.visualstudio.com/items?itemName=neikeq.godot-csharp-vscode>`__ 을 설치하십시오.

source: If you are using Linux you need to install the `Mono SDK <https://www.mono-project.com/download/stable/#download-lin>`__ for the C# tools plugin to work.
cs: Pokud používáte Linux, musíte si nainstalovat `Mono SDK <https://www.mono-project.com/download/stable/#download-lin>`__, aby zásuvný modul nástrojů C# fungoval.
de: Wenn Sie Linux benutzen, müssen Sie das `Mono SDK <https://www.mono-project.com/download/stable/#download-lin>` installieren, damit die C# Tools funktionieren.
ko: Linux를 사용한다면 C# 플러그인을 사용하기 위해 `Mono SDK <https://www.mono-project.com/download/stable/#download-lin>`__ 를 설치해야 합니다.

source: To configure a project for debugging open the Godot project folder in VS Code. Go to the Run tab and click on **Add Configuration...**. Select **C# Godot** from the dropdown menu. Open the ``tasks.json`` and ``launch.json`` files that were created. Change the executable setting in ``launch.json`` and command settings in ``tasks.json`` to your Godot executable path. Now, when you start the debugger in VS Code, your Godot project will run.
cs: Chcete-li nakonfigurovat projekt pro ladění, otevřete složku projektu Godot ve VS Code. Přejděte na kartu Spustit a klikněte na **Přidat konfiguraci...**. Z rozbalovací nabídky vyberte **C# Godot**. Otevřete následně nově vytvořené soubory ``tasks.json`` a ``launch.json`` . Změňte cesty pro spustitelný soubor v ``launch.json`` a pro spouštěný příkaz v ``tasks.json`` na cestu ke k vašemu spustitelnému souboru Godota. Když nyní zahájíte ladění ve VS Code, provede se pro váš aktuální projekt Godot.

source: Visual Studio (Windows only)
cs: Visual Studio (pouze pro Windows)
de: Visual Studio (nur Windows)
ko: Visual Studio(Windows만 가능)

source: Download and install the latest version of `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__. Visual Studio will include the required SDKs if you have the correct workloads selected, so you don't need to manually install the things listed in the "Prerequisites" section.
cs: Stáhněte a nainstalujte nejnovější verzi `Visual Studia <https://visualstudio.microsoft.com/downloads/>`__. Visual Studio bude obsahovat požadované sady SDK, pokud máte vybrané správné pracovní úlohy, takže nemusíte'ručně instalovat věci uvedené v části "Předpoklady".
de: Laden Sie die neueste Version von `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__ herunter und installieren Sie sie. Visual Studio enthält die erforderlichen SDKs, wenn Sie die richtigen Workloads ausgewählt haben, sodass Sie die im Abschnitt "Voraussetzungen" aufgeführten Dinge nicht manuell installieren müssen.
ko: 최신 버전의 `Visual Studio <https://visualstudio.microsoft.com/downloads/>`__ 를 설치하십시오. 올바른 워크로드를 선택했다면 Visual Studio 내에 필요한 SDK가 포함되어있을 것이므로, "준비사항" 구획에 설명된 것들을 직접 설치하지 않아도 됩니다.

source: While installing Visual Studio, select these workloads:
cs: Při instalaci aplikace Visual Studio vyberte tyto pracovní úlohy:
de: Einschränkungen beim Installieren von Visual Studio:
ko: Visual Studio를 설치할 때, 다음 워크로드를 선택하십시오:

source: Mobile development with .NET
cs: Mobilní vývoj s .NET
de: Mobile Entwicklung mit .NET

source: .NET Core cross-platform development
cs: Vývoj napříč platformami v prostředí .NET Core
de: Plattformübergreifende .NET Core-Entwicklung

source: Set **Mono** -> **Editor** -> **External Editor** to **Visual Studio**.
cs: Nastavte **Mono** -> **Editor** -> **Externí editor** na **Visual Studio**.
de: Stellen Sie **Mono** -> **Editor** -> **Externer Editor** auf **Visual Studio**.
ko: **Mono** -> **Editor** -> **External Editor** 를 **Visual Studio** 로 설정.

source: Creating a C# script
cs: Vytvoření skriptu C#
de: Erstellen eines C# Skripts
ko: C# 스크립트 만들기

source: After you successfully set up C# for Godot, you should see the following option when selecting **Attach Script** in the context menu of a node in your scene:
cs: Po úspěšném nastavení jazyka C# v Godot byste měli při výběru akce **Připojit skript** v kontextové nabídce uzlu vaší scény vidět následující možnost:
de: Nachdem Sie C# für Godot erfolgreich eingerichtet haben, sollte die folgende Option angezeigt werden, wenn Sie im Kontextmenü eines Nodes in Ihrer Szene **Skript anhängen** auswählen:
ko: Godot용 C# 을 성공적으로 설정한 후, 씬의 노드 메뉴에서 **스크립트 붙이기** 를 눌렀을 때, 다음 설정이 표시되어야 합니다:

source: Note that while some specifics change, most concepts work the same when using C# for scripting. If you're new to Godot, you may want to follow the tutorials on :ref:`doc_scripting` at this point. While some places in the documentation still lack C# examples, most concepts can be transferred easily from GDScript.
cs: Všimněte si, že ačkoli se některá specifika mění, většina konceptů skriptování funguje stejně i při použití jazyka C#. Pokud'jste v Godotu nováčkem, můžete v tomto bodě sledovat i návody na :ref:`doc_scripting`. Na některých místech dokumentace sice stále chybí příklady v jazyce C#, ale většinu postupů lze snadno přenést z jazyka GDScript.
de: Beachten Sie, dass sich einige Details ändern, die meisten Konzepte jedoch bei Verwendung von C# für die Skripterstellung gleich funktionieren. Wenn Sie Godot noch nicht kennen, wäre diese Anleitungen interessant :ref:`doc_scripting`. Während an einigen Stellen in der Dokumentation noch C# Beispiele fehlen, können die meisten Konzepte problemlos aus GDScript übertragen werden.
ko: 일부 세부 사항이 변경되는 동안, 대부분의 작업은 스크립팅을 C#으로 하는 것과 동일합니다. Godot를 처음 접해보신다면, 이 시점에서 :ref:`doc_scripting` 튜토리얼을 정독하시는 것이 좋습니다. 문서의 일부는 C# 예제가 부족하지만, 대부분은 일찍이 GDScript에서 옮길 수 있습니다.

source: Project setup and workflow
cs: Nastavení projektu a pracovní postup
de: Projekt Aufbau und Ablauf
ko: 프로젝트 설정과 작업 흐름

source: When you create the first C# script, Godot initializes the C# project files for your Godot project. This includes generating a C# solution (``.sln``) and a project file (``.csproj``), as well as some utility files and folders (``.mono`` and ``Properties/AssemblyInfo.cs``). All of these but ``.mono`` are important and should be committed to your version control system. ``.mono`` can be safely added to the ignore list of your VCS. When troubleshooting, it can sometimes help to delete the ``.mono`` folder and let it regenerate.
cs: Při vytváření prvního skriptu C# inicializuje Godot soubory potřebné pro váš C# projekt. To zahrnuje vygenerování C# řešení (``.sln``) a projektového souboru (``.csproj``), a také některých pomocných souborů a složek (``.mono`` a ``Properties/AssemblyInfo.cs``). Všechny tyto změny výjma ``.mono`` jsou důležité a měly by být zachyceny pomocí systému správy verzí. ``.mono`` lze bezpečně přidat do seznamu ignorovaných souborů vašeho systému VCS. Při řešení problémů může někdy pomoci odstranit složku ``.mono`` a nechat ji znovu přegenerovat.
de: Wenn Sie das erste C# Skript erstellen, initialisiert Godot die C# Projektdateien für Ihr Godot-Projekt. Dies umfasst das Generieren einer C# Lösung (``.sln``) und einer Projektdatei (``.csproj``) sowie einiger Dienstprogrammdateien und Ordner (``.mono`` und ``Properties/AssemblyInfo.cs ``). Alle diese außer ``.mono`` sind wichtig und sollten Ihrem Versionskontrollsystem zugewiesen werden. ``.mono`` kann sicher zur Ignorierliste Ihres VCS hinzugefügt werden. Bei der Fehlerbehebung kann es manchmal hilfreich sein den Ordner ``.mono`` zu löschen und neu generieren zu lassen.
ko: 첫 C# 스크립트를 생성하면, Godot는 Godot 프로젝트를 위한 C# 프로젝트 파일을 초기화합니다. 여기에는 C# 솔루션 (``.sin``)이나 프로젝트 파일 (``.csproj``) 뿐만 아니라, 일부 유용 파일과 폴더들 (``.mono``\ 와 ``Properties/AssemblyInfo.cs``)을 생성하는 것도 포함합니다. ``.mono``\ 를 제외하고는 모두 중요하므로 버전 관리 시스템에 유지해 두어야 합니다. ``.mono``\ 는 버전 관리 시스템의 무시 목록에 쉽게 추가할 수 있습니다. 문제를 해결할 때, ``.mono`` 폴더를 삭제하고 다시 만드는 것이 때로는 도움이 됩니다.

source: Here's a blank C# script with some comments to demonstrate how it works.
cs: Zde'je prázdný skript v jazyce C# s několika komentáři, které popisují jak funguje.
de: Hier ist ein leeres C# Skript mit einigen Kommentaren um die Arbeitsweise zu zeigen.
ko: 여기 동작을 설명하는 주석이 붙은 C# 스크립트가 있습니다.
