Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/scripting/c_sharp/c_sharp_features.po
Languages: de, es, ko, ru, uk, zh_cn, zh_tw

source: Or you can detect which engine your code is in, useful for making cross-engine libraries:
de: Oder Sie können erkennen in welcher Engine sich Ihr Code befindet, was für die Erstellung von Cross-Engine-Bibliotheken hilfreich ist:
es: O puedes detectar en qué motor está tu código, útil para hacer bibliotecas de motores cruzados:
ko: 혹은 여러분의 코드를 실행하는 엔진의 상태를 확인하는데 사용할 수도 있습니다. 크로스-엔진 라이브러리를 제작하는데 유용한 기능입니다:
ru: Или вы можете определить, в каком движке будет находиться ваш код, что полезно для создания кросс-движковых библиотек:
uk: Або ви можете виявити, в якому движку знаходиться ваш код, корисний для створення між-движкових бібліотек:
zh_cn: 或者你可以检测代码所在的引擎, 这对于制作跨引擎库很有用:
zh_tw: 或者也可以依據程式碼所在引擎來偵測，對於跨引擎函式庫來說很實用：

source: Full list of defines
de: Vollständige Liste von Definitionen
es: A continuación está la lista completa de hints
ko: 모든 지시문
ru: Полный список определений
uk: Повний список визначень
zh_cn: 完整的定义列表
zh_tw: 完整的定義列表

source: ``GODOT`` is always defined for Godot projects.
de: ``GODOT`` wird immer in den Godot Einstellungen definiert.
es: "GODOT" siempre está definido para los proyectos de Godot.
ko: ``GODOT`` 은 항상 Godot 프로젝트를 정의합니다.
ru: ``GODOT`` всегда объявлен в проектах Godot.
uk: ``GODOT`` завжди визначається для проєктів Godot.
zh_cn: 所有 Godot 项目都会定义 ``GODOT``\ 。
zh_tw: 在 Godot 中，永遠都有定義 ``GODOT`` 。

source: One of ``GODOT_64`` or ``GODOT_32`` is defined depending on if the architecture is 64-bit or 32-bit.
de: Ob ``GODOT_64`` oder ``GODOT_32`` definiert wird, ist abhängig von der Architektur 64-bit oder 32-bit.
es: Uno de ``GODOT_64`` o ``GODOT_32`` se define dependiendo de si la arquitectura es de 64 o 32 bits.
ko: 컴퓨터 환경이 64-bit인지 32-bit인지에 따라서 ``GODOT_64`` 와 ``GODOT_32`` 중 하나가 정의됩니다.
ru: Один из ``GODOT_64`` или ``GODOT_32`` определяется в зависимости от того, если архитектура будет 64-bit или 32-bit соответственно.
uk: ``GODOT_64``, або ``GODOT_32``, визначається залежно від того, чи архітектура 64-бітна, чи 32-бітна.
zh_cn: 根据架构是 64 位还是 32 位，会定义 ``GODOT_64`` 或 ``GODOT_32``\ 。
zh_tw: 依據目前架構是 64 位元還是 32 位元，會有定義 ``GODOT_64`` 或 ``GODOT_32`` 。

source: One of ``GODOT_X11``, ``GODOT_WINDOWS``, ``GODOT_OSX``, ``GODOT_ANDROID``, ``GODOT_IOS``, ``GODOT_HTML5``, or ``GODOT_SERVER`` depending on the OS. These names may change in the future. These are created from the ``get_name()`` method of the :ref:`OS <class_OS>` singleton, but not every possible OS the method returns is an OS that Godot with Mono runs on.
ko: 사용중인 운영체제의 종류에 따라서 ``GODOT_X11``, ``GODOT_WINDOWS``, ``GODOT_OSX``, ``GODOT_ANDROID``, ``GODOT_IOS``, ``GODOT_HTML5``, 또는 ``GODOT_SERVER`` 중 하나가 정의됩니다. 위 이름들은 후에 변경될 수 있습니다. 이들은 :ref:`OS <class_OS>` 싱글턴의 ``get_name()`` 메서드로 생성될 수 있지만, 메서드가 반환하는 모든 OS에서 Mono 버전 Godot이 실행될 수 있는 것은 아닙니다.
ru: Один из ``GODOT_X11``, ``GODOT_WINDOWS``, ``GODOT_OSX``, ``GODOT_ANDROID``, ``GODOT_IOS``, ``GODOT_HTML5``, или ``GODOT_SERVER`` определяется в зависимости от операционной системы. В будущем эти названия могут измениться. Они создаются из метода ``get_name()`` синглтона :ref:``OS <class_OS>``, но не каждая возможная ОС, возвращаемая методом, является ОС, на которой работает Godot с Mono.
zh_cn: 根据操作系统，会定义 ``GODOT_X11`` 、 ``GODOT_WINDOWS`` 、 ``GODOT_OSX`` 、 ``GODOT_ANDROID`` 、 ``GODOT_IOS`` 、 ``GODOT_HTML5`` 、 ``GODOT_SERVER`` 的其中之一，将来可能会更改这些名称。这些名称是根据 :ref:`OS <class_OS>` 单例的 ``get_name()`` 方法创建的，但这个函数所能够返回的操作系统并不是都能够运行使用 Mono 的 Godot。

source: When **exporting**, the following may also be defined depending on the export features:
de: Beim **Exportieren** kann Folgendes auch abhängig von den Exportfunktionen definiert werden:
es: Cuando se **exporta**, también se puede definir lo siguiente dependiendo de las características de la exportación:
ko: **내보내기** 를 할 때, 내보내기 기능에 따라서 아래의 것들이 정의될 수 있습니다:
ru: При **экспорте** также могут быть определены следующие параметры в зависимости от особенностей экспорта:
uk: Під час **експортування** також можна визначити наступне залежно від особливостей експорту:
zh_cn: 在 **导出** 时, 根据导出功能, 还可能定义以下内容:
zh_tw: **匯出** 時，根據匯出的功能也有下列定義：

source: One of ``GODOT_PC``, ``GODOT_MOBILE``, or ``GODOT_WEB`` depending on the platform type.
de: Je nach Plattformtyp eine von ``GODOT_PC``, ``GODOT_MOBILE`` oder ``GODOT_WEB``.
es: Una de ``GODOT_PC``, ``GODOT_MOBILE``, o ``GODOT_WEB`` dependiendo del tipo de plataforma.
ko: 플랫폼에 따라서 ``GODOT_PC``, ``GODOT_MOBILE``, 또는 ``GODOT_WEB`` 중 하나가 정의됩니다.
ru: Один из ``GODOT_PC``, ``GODOT_MOBILE``, или ``GODOT_WEB`` в зависимости от типа платформы.
uk: Залежно від типу платформи ``GODOT_PC``, ``GODOT_MOBILE``, або ``GODOT_WEB``.
zh_cn: ``GODOT_PC`` , ``GODOT_MOBILE`` 或 ``GODOT_WEB`` 中的一种, 取决于平台类型.
zh_tw: 依據平台類型，會定義 ``GODOT_PC``, ``GODOT_MOBILE`` 或 ``GODOT_WEB`` 其中一個。

source: One of ``GODOT_ARM64_V8A`` or ``GODOT_ARMEABI_V7A`` on Android only depending on the architecture.
de: Eine von ``GODOT_ARM64_V8A`` oder ``GODOT_ARMEABI_V7A`` auf Android je nach Architektur.
es: Uno de ``GODOT_ARM64_V8A`` o ``GODOT_ARMEABI_V7A`` en Android sólo dependiendo de la arquitectura.
ko: Android 아키텍처에 따라서 ``GODOT_ARM64_V8A`` 와 ``GODOT_ARMEABI_V7A`` 중 하나가 정의됩니다.
ru: Один из ``GODOT_ARM64_V8A`` или ``GODOT_ARMEABI_V7A`` на Android только в зависимости от архитектуры.
uk: ``GODOT_ARM64_V8A``, або ``GODOT_ARMEABI_V7A`` на Android, залежно від архітектури.
zh_cn: ``GODOT_ARM64_V8A`` 或 ``GODOT_ARMEABI_V7A`` 中的一个，仅在 Android 系统上，取决于架构。
zh_tw: 在 Android 上會依據架構定義 ``GODOT_ARM64_V8A`` or ``GODOT_ARMEABI_V7A`` 其中一個。

source: One of ``GODOT_ARM64`` or ``GODOT_ARMV7`` on iOS only depending on the architecture.
de: Einer von ``GODOT_ARM64`` oder ``GODOT_ARMV7`` unter iOS abhängig von der Architektur.
es: Uno de ``GODOT_ARM64`` o ``GODOT_ARMV7`` en iOS sólo dependiendo de la arquitectura.
ko: iOS의 아키텍처에 따라서 ``GODOT_ARM64`` 와 ``GODOT_ARMV7`` 중 하나가 정의됩니다.
ru: Один из ``GODOT_ARM64`` или ``GODOT_ARMV7`` на iOS только в зависимости от архитектуры.
uk: Або ``GODOT_ARM64``, або ``GODOT_ARMV7`` на iOS, залежно від архітектури.
zh_cn: ``GODOT_ARM64`` 或 ``GODOT_ARMV7`` 中的一个, 仅在iOS上, 取决于架构.
zh_tw: 在 iOS 上會依據架構定義 ``GODOT_ARM64`` or ``GODOT_ARMV7`` 其中一個。

source: Any of ``GODOT_S3TC``, ``GODOT_ETC``, and ``GODOT_ETC2`` depending on the texture compression type.
de: Je nach Texturkomprimierungstyp ``GODOT_S3TC``, ``GODOT_ETC`` und ``GODOT_ETC2``.
es: Cualquiera de ``GODOT_S3TC``, ``GODOT_ETC`` y ``GODOT_ETC2`` dependiendo del tipo de compresión de textura.
ko: 텍스처 압축 타입에 따라서 ``GODOT_S3TC``, ``GODOT_ETC``, 그리고 ``GODOT_ETC2`` 가 정의될 수 있습니다.
ru: Любой из ``GODOT_S3TC``, ``GODOT_ETC``, и ``GODOT_ETC2`` в зависимости от типа сжатия текстур.
uk: Будь що з ``GODOT_S3TC``, ``GODOT_ETC``, чи ``GODOT_ETC2``, залежно від типу стиснення текстури.
zh_cn: ``GODOT_S3TC`` , ``GODOT_ETC`` 和 ``GODOT_ETC2`` 中的任一种, 取决于纹理压缩类型.
zh_tw: 依據紋理貼圖壓縮類型，會定義 ``GODOT_S3TC``, ``GODOT_ETC`` 或 ``GODOT_ETC2``。

source: Any custom features added in the export menu will be capitalized and prefixed: ``foo`` -> ``GODOT_FOO``.
de: Alle benutzerdefinierten Funktionen, die im Exportmenü hinzugefügt werden, werden großgeschrieben und mit dem Präfix ``foo`` -> ``GODOT_FOO`` versehen.
es: Cualquier característica personalizada añadida en el menú de exportación se escribirá en mayúsculas y con el prefijo: ``foo`` -> ``GODOT_FOO``.
ko: 내보내기 메뉴에서 추가된 커스텀 기능은 다음과 같이 대문자화 된 후 접두사가 붙습니다: ``foo`` -> ``GODOT_FOO``.
ru: Любые пользовательские функции, добавленные в меню экспорта, будут написаны заглавными буквами и с префиксом: ``foo`` -> ``GODOT_FOO``.
uk: Будь-які користувацькі функції, додані в меню експорту, будуть написані великими літерами та матимуть префікс: ``foo`` -> ``GODOT_FOO``.
zh_cn: 所有在导出菜单中添加的自定义功能都会被大写并加上前缀: ``foo`` -> ``GODOT_FOO`` .
zh_tw: 所有從匯出選單中新增的自定功能都會被轉成大寫並加上前置詞： ``foo`` -> ``GODOT_FOO`` 。

source: To see an example project, see the OS testing demo: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
de: Zusätzlich zu dieser Dokumentation möchten Sie vielleicht auch einen Blick auf die verschieden `Godot Demoprojekte <https://github.com/godotengine/godot-demo-projects>`_ werfen.
es: Para ver un proyecto de ejemplo, revisa la demo de pruebas de SO: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
ko: 예제 프로젝트를 확인하려면 OS 테스트 데모를 확인하세요: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
ru: Чтобы увидеть пример проекта, см. демонстрационную версию тестирования ОС: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
uk: Щоб побачити приклад проєкту, дивіться демонстраційну версію тестування ОС: https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
zh_cn: 如果想要参考一个示例项目, 可以参考该OS测试demo:https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test
zh_tw: 若欲檢視範例專案，請參考作業系統示範專案： https://github.com/godotengine/godot-demo-projects/tree/master/misc/os_test

source: Translation status
es: Estado de traducción
ko: 번역 상태
ru: Translation status (статус перевода)
uk: Стан перекладу
zh_cn: 翻译状态
