Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/development/compiling/compiling_with_script_encryption_key.po
Languages: fr

source: Compiling with script encryption key
fr: Compilation avec une clé de cryptage des scripts

source: The export dialog gives you the option to encrypt your scripts with a 256-bit AES key when releasing your project. This will make sure your scripts are not stored in plain text and can not easily be ripped by some script kiddie.
fr: La boîte de dialogue d'exportation vous donne la possibilité de crypter vos scripts avec une clé AES 256 bits, lors de la livraison de votre projet. Cela garantira que vos scripts ne sont pas stockés en texte brut et ne peuvent pas être facilement extraits par certains script kiddie.

source: Of course, the key needs to be stored in the binary, but if it's compiled, optimized and without symbols, it would take some effort to find it.
fr: Bien sûr, la clé doit être stockée dans le binaire, mais si elle est compilée, optimisée et sans symboles, il faudrait un certain effort pour la trouver.

source: For this to work, you need to build the export templates from source, with that same key.
fr: Pour que cela fonctionne, vous devez créer les modèles d'exportation à partir des sources, avec cette même clé.

source: This will **not** work if you use official, precompiled export templates. It is absolutely **required** to compile your own export templates to use PCK encryption.
fr: Cela ne fonctionnera **pas** si vous utilisez des modèles d'export précompilés, officiels. Il est absolument **nécessaire** de compiler vos propres modèles d'export pour utiliser le chiffrement PCK.

source: Step by step
fr: Pas à pas

source: The output in ``godot.gdkey`` should be similar to:
fr: La sortie dans ``godot.gdkey`` devrait être similaire à :

source: You can generate the key without redirecting the output to a file, but that way you can minimize the risk of exposing the key.
fr: Vous pouvez générer la clé sans rediriger la sortie vers un fichier, mais de cette façon, vous pouvez minimiser le risque d'exposer la clé.

source: Set this key as environment variable in the console that you will use to compile Godot, like this:
fr: Définissez cette clé comme variable d'environnement dans la console que vous utiliserez pour compiler Godot, comme ceci :

source: Compile Godot export templates and set them as custom export templates in the export preset options.
fr: Compilez les modèles d'exportation Godot et définissez-les en tant que modèles d'exportation personnalisés dans les options d'exportation prédéfinies.

source: Export the project. The game should run with encrypted scripts now.
fr: Exporter le projet. Le jeu devrait maintenant fonctionner avec des scripts cryptés.

source: Troubleshooting
fr: Dépannage

source: If you get an error like below, it means the key wasn't properly included in your Godot build. Godot is encrypting the scripts during export, but can't read them at runtime.
fr: Si vous obtenez une erreur comme ci-dessous, cela veut dire que cette clé n'a pas été proprement inclue dans votre compilation de Godot. Godot crypte les scripts durant l'exportation, mais ne peut pas les lire lors de l'exécution.

source: Translation status
fr: État de la traduction
