Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/development/compiling/compiling_for_x11.po
Languages: fr, zh_cn

source: Compiling for X11 (Linux, \*BSD)
fr: Compilation pour X11 (Linux, \*BSD)
zh_cn: 为 X11 平台编译（Linux、\*BSD 操作系统）

source: Requirements
fr: Pré-requis
zh_cn: 需求

source: For compiling under Linux or other Unix variants, the following is required:
fr: Pour la compilation sous Linux ou d'autres variantes Unix, les éléments suivants sont requis :
zh_cn: 要在Linux或其他类Unix系统下进行编译, 需要满足以下条件:

source: GCC 7+ or Clang 6+.
fr: GCC 7+ ou Clang 6+.
zh_cn: GCC 7+ 或 Clang 6+.

source: SCons 3.0+ build system. If your distribution uses Python 2 by default, or you are using a version of SCons prior to 3.1.2, you will need to change the version of Python that SCons uses by changing the shebang (the first line) of the SCons script file to ``#! /usr/bin/python3``. Use the command ``which scons`` to find the location of the SCons script file.
fr: Système de compilation SCons 3.0+. Si votre distribution utilise Python 2 par défaut, ou si vous utilisez une version de SCons antérieure à 3.1.2, vous devrez changer la version de Python que SCons utilise en changeant le shebang (la première ligne) du fichier de script SCons en ``#! /usr/bin/python3``. Utilisez la commande ``which scons`` pour trouver l'emplacement du fichier de script SCons.
zh_cn: SCons 3.0+ 构建系统. 如果你的发行版默认使用Python 2, 或者你使用的是SCons 3.1.2之前的版本, 你需要通过修改SCons脚本文件的shebang (第一行)来改变SCons使用的Python版本, 改为 ``#!/usr/bin/python3``. 使用命令``which scons``来找到SCons脚本文件的位置.

source: pkg-config (used to detect the dependencies below).
fr: pkg-config (utilisé pour détecter les dépendances ci-dessous).
zh_cn: pkg-config（用于检测下面这些依赖库）。

source: X11, Xcursor, Xinerama, Xi and XRandR development libraries.
fr: Bibliothèques de développement X11, Xcursor, Xinerama, Xi et XRandR.
zh_cn: X11、Xcursor、Xinerama、Xi、XRandR 开发库。

source: MesaGL development libraries.
fr: Bibliothèques de développement MesaGL.
zh_cn: MesaGL 开发库。

source: ALSA development libraries.
fr: Bibliothèques de développement ALSA.
zh_cn: ALSA 开发库。

source: PulseAudio development libraries.
fr: Bibliothèques de développement PulseAudio.
zh_cn: PulseAudio 开发库。

source: *Optional* - libudev (build with ``udev=yes``).
fr: *Facultatif* - libudev (construit(build) avec ``udev=yes``).
zh_cn: *可选*\ ——libudev（使用 ``udev = yes`` 构建）。

source: *Optional* - yasm (for WebM SIMD optimizations).
fr: *Facultatif* - yasm (pour optimisations WebM SIMD).
zh_cn: *可选*\ ——yasm（用于 WebM SIMD 优化）。

source: For a general overview of SCons usage for Godot, see :ref:`doc_introduction_to_the_buildsystem`.
fr: Pour un aperçu général de l'utilisation de SCons pour Godot, voir :ref:`doc_introduction_to_the_buildsystem`.
zh_cn: 有关 Godot 的 SCons 用法的一般概述，请参阅 :ref:`doc_introduction_to_the_buildsystem`。

source: Distro-specific one-liners
fr: Lignes uniques spécifiques à la distribution
zh_cn: 针对各个发行版的单行命令

source: For audio support, you can optionally install ``pulseaudio``.
fr: Pour le support audio, vous pouvez optionnellement installer ``pulseaudio``.
zh_cn: 对于音频支持，你可以选择安装 ``pulseaudio``\ 。

source: Compiling
fr: Compilation
zh_cn: 编译

source: Start a terminal, go to the root dir of the engine source code and type:
fr: Démarrez un terminal, allez à la racine du code source du moteur et tapez :
zh_cn: 启动终端，然后进入引擎源代码的根目录，输入：

source: A good rule of thumb for the ``-j`` (*jobs*) flag, is to have at least as many threads compiling Godot as you have cores in your CPU, if not one or two more. Feel free to add the ``-j`` option to any SCons command you see below.
fr: Une bonne règle de base pour le drapeau ``-j`` (*jobs*), est d'avoir au moins autant de threads compilant Godot que de cœurs dans votre CPU, sinon un ou deux de plus. N'hésitez pas à ajouter l'option ``-j`` à n'importe quelle commande SCons que vous voyez ci-dessous.
zh_cn: ``-j`` (*jobs*)标志的一个好的经验法则是, 编译Godot的线程至少要与CPU中具有内核的线程数量一样多, 甚至不多于一个或两个. 随意将 ``-j`` 选项添加到下面显示的任何SCons命令中.

source: If all goes well, the resulting binary executable will be placed in the "bin" subdirectory. This executable file contains the whole engine and runs without any dependencies. Executing it will bring up the project manager.
fr: Si tout se passe bien, l'exécutable binaire résultant sera placé dans le sous-répertoire "bin". Ce fichier exécutable contient l'ensemble du moteur et fonctionne sans aucune dépendance. En l'exécutant, le gestionnaire de projet apparaîtra.
zh_cn: 如果一切顺利, 生成的二进制可执行文件将放在 `` bin`` 子目录中. 该可执行文件包含整个引擎, 并且运行时无需任何依赖项. 执行它将会启动项目管理器.

source: If you wish to compile using Clang rather than GCC, use this command:
fr: Si vous souhaitez compiler en utilisant Clang plutôt que GCC, utilisez cette commande :
zh_cn: 如果你希望使用 Clang 而不是 GCC 编译器, 可以使用这个命令:

source: Using Clang appears to be a requirement for OpenBSD, otherwise fonts would not build.
fr: L'utilisation de Clang semble être une exigence pour OpenBSD, sinon les polices de caractères ne seraient pas construites(build).
zh_cn: 使用Clang似乎是OpenBSD的要求, 否则字体将无法生成.

source: If you are compiling Godot for production use, then you can make the final executable smaller and faster by adding the SCons option ``target=release_debug``.
fr: Si vous compilez Godot pour une utilisation en production, alors vous pouvez rendre l'exécutable final plus petit et plus rapide en ajoutant l'option SCons ``target=release_debug``.
zh_cn: 如果您正在编译Godot用于生产用途, 那么您可以通过添加SCons选项 ``target=release_debug`` 来使最终的可执行文件更小更快.

source: If you are compiling Godot with GCC, you can make the binary even smaller and faster by adding the SCons option ``use_lto=yes``. As link-time optimization is a memory-intensive process, this will require about 7 GB of available RAM while compiling.
fr: Si vous compilez Godot avec GCC, vous pouvez rendre le binaire encore plus petit et plus rapide en ajoutant l'option SCons ``use_lto=yes``. L'optimisation du temps de connexion étant un processus gourmand en mémoire, cela nécessitera environ 7 Go de RAM disponible lors de la compilation.
zh_cn: 如果你用GCC编译Godot, 你可以通过添加SCons选项 ``use_lto=yes`` 来使可执行文件更小更快. 由于链接时优化是一个内存密集的过程, 在编译时需要大约7GB的可用内存.

source: If you want to use separate editor settings for your own Godot builds and official releases, you can enable :ref:`doc_data_paths_self_contained_mode` by creating a file called ``._sc_`` or ``_sc_`` in the ``bin/`` folder.
fr: Si vous souhaitez utiliser des paramètres d'édition séparés pour vos propres constructions Godot et vos versions officielles, vous pouvez activer :ref:`doc_data_paths_self_contained_mode` en créant un fichier appelé ``._sc_`` ou ``_sc_`` dans le dossier ``bin/``.
zh_cn: 如果你想为自己的 Godot 构建和官方发布使用单独的编辑器设置，你可以通过在 ``bin/`` 文件夹中创建一个名为 ``._sc_`` 或 ``_sc_`` 的文件来启用 :ref:`doc_data_paths_self_contained_mode`\ 。

source: Compiling a headless/server build
fr: Compilation d'une version sans headless/serveur
zh_cn: 编译无头/服务器构建

source: To compile a *headless* build which provides editor functionality to export projects in an automated manner, use::
fr: Pour compiler un build *headless* qui fournit la fonctionnalité d'éditeur pour exporter des projets de manière automatisée, utilisez :
zh_cn: 要编译\ *无头*\ 构建，支持编辑器的自动化导出项目功能，请使用： ::

source: To compile a debug *server* build which can be used with :ref:`remote debugging tools <doc_command_line_tutorial>`, use::
fr: Pour compiler un build de débogage *serveur* qui peut être utilisé avec :ref:`les outils de débogage à distance <doc_command_line_tutorial>`, utilisez : :
zh_cn: 如果要编译调试版本的\ *服务器*\ ，支持\ :ref:`远程调试工具 <doc_command_line_tutorial>`\ ，那么请使用： ::

source: To compile a *server* build which is optimized to run dedicated game servers, use::
fr: Pour compiler un build *serveur* qui est optimisé pour faire fonctionner des serveurs de jeu dédiés, utilisez :
zh_cn: 要编译一个经过优化以运行专用游戏的\ *服务器*\ 版本，请使用以下构建选项： ::

source: Building export templates
fr: Création de modèles d'exportation
zh_cn: 构建导出模板

source: Linux binaries usually won't run on distributions that are older than the distribution they were built on. If you wish to distribute binaries that work on most distributions, you should build them on an old distribution such as Ubuntu 16.04. You can use a virtual machine or a container to set up a suitable build environment.
fr: Les binaires Linux ne fonctionnent généralement pas sur des distributions plus anciennes que celle sur laquelle ils ont été construits(build). Si vous souhaitez distribuer des binaires qui fonctionnent sur la plupart des distributions, vous devez les construire(build) sur une ancienne distribution telle que Ubuntu 16.04. Vous pouvez utiliser une machine virtuelle ou un conteneur pour mettre en place un environnement de compilation approprié.
zh_cn: Linux二进制文件通常不会在早于其构建版本的发行版上运行. 如果您希望分发适用于大多数发行版的二进制文件, 则应在较旧的发行版(例如Ubuntu 16.04)上构建它们. 您可以使用虚拟机或容器来设置合适的构建环境.

source: To build X11 (Linux, \*BSD) export templates, run the build system with the following parameters:
fr: Pour construire(build) des modèles d'exportation X11 (Linux, \*BSD), exécutez le système de construction(build) avec les paramètres suivants :
zh_cn: 要构建X11(Linux, \*BSD)导出模板, 请使用以下参数运行构建系统:

source: (32 bits)
zh_cn: （32 位）

source: (64 bits)
zh_cn: （64 位）

source: Note that cross-compiling for the opposite bits (64/32) as your host platform is not always straight-forward and might need a chroot environment.
fr: Notez que la compilation croisée pour les bits opposés (64/32) à votre plate-forme hôte n'est pas toujours simple et peut nécessiter un environnement chroot.
zh_cn: 请注意, 与您的主机平台相反的位(64/32)交叉编译并不总是直接的, 并且可能需要chroot环境.

source: To create standard export templates, the resulting files must be copied to:
fr: Pour créer des modèles d'exportation standard, les fichiers résultants doivent être copiés vers :
zh_cn: 要创建标准导出模板, 必须将生成的文件复制到:

source: and named like this (even for \*BSD which is seen as "Linux X11" by Godot):
fr: et nommé ainsi (même pour \*BSD qui est considéré comme "Linux X11" par Godot) :
zh_cn: 并以此命名(即使对于\*BSD, 它也被Godot视为" Linux X11"):

source: However, if you are writing your custom modules or custom C++ code, you might instead want to configure your binaries as custom export templates here:
fr: Cependant, si vous écrivez vos modules personnalisés ou du code C++ personnalisé, vous pouvez plutôt configurer vos binaires comme modèles d'exportation personnalisés ici :
zh_cn: 此外, 如果要编写自定义模块或自定义C ++代码, 则可能需要在此处将二进制文件配置为自定义导出模板:

source: You don't even need to copy them, you can just reference the resulting files in the ``bin/`` directory of your Godot source folder, so the next time you build, you automatically have the custom templates referenced.
fr: Vous n'avez même pas besoin de les copier, vous pouvez simplement référencer les fichiers résultants dans le répertoire ``bin/`` de votre dossier source Godot, de sorte que la prochaine fois que vous construirez(build), vous aurez automatiquement les modèles personnalisés référencés.
zh_cn: 您甚至不需要复制它们, 只需引用在Godot源文件夹的 ``bin/`` 目录中生成的文件, 因此下次构建时, 将自动引用自定义模板.

source: Using Clang and LLD for faster development
fr: Utiliser Clang et LLD pour un développement plus rapide
zh_cn: 使用 Clang 和 LLD 可以加快开发速度

source: You can also use Clang and LLD to build Godot. This has two upsides compared to the default GCC + GNU ld setup:
fr: Vous pouvez également utiliser Clang et LLD pour construire(build) Godot. Cela présente deux avantages par rapport à la configuration par défaut de GCC + GNU ld :
zh_cn: 你也可以使用Clang和LD来构建Godot. 与默认的GCC + GNU ld设置相比, 这有两个好处:

source: LLD links Godot significantly faster compared to GNU ld or gold. This leads to faster iteration times.
fr: LLD relie(links) Godot beaucoup plus rapidement que GNU ld ou gold. Cela conduit à des temps d'itération plus rapides.
zh_cn: 与GNU ld或gold相比,LD链接Godot的速度明显更快. 这导致更快的迭代时间.

source: Clang tends to give more useful error messages compared to GCC.
fr: Clang a tendance à donner des messages d'erreur plus utiles que GCC.
zh_cn: 与GCC相比,Clang倾向于给出更多有用的错误信息.

source: To do so, install Clang and the ``lld`` package from your distribution's package manager then use the following SCons command::
fr: Pour ce faire, installez Clang et le paquet ``lld`` du gestionnaire de paquets de votre distribution puis utilisez la commande SCons suivante :
zh_cn: 为此，请从分发的包管理器中安装 Clang 和 ``lld`` 包，然后使用以下 SCons 命令： ::

source: After the build is completed, a new binary with a ``.llvm`` suffix will be created in the ``bin/`` folder.
fr: Une fois la compilation terminée, un nouveau binaire avec un suffixe ``.llvm`` sera créé dans le dossier ``bin/``.
zh_cn: 构建完成后，将在 ``bin/`` 文件夹中创建一个以 ``.llvm`` 为后缀的新的二进制文件。

source: It's still recommended to use GCC for production builds as they can be compiled using link-time optimization, making the resulting binaries smaller and faster.
fr: Il est toujours recommandé d'utiliser GCC pour les constructions builds de production car ils peuvent être compilés en utilisant l'optimisation du temps de liaison, ce qui rend les binaires résultants plus petits et plus rapides.
zh_cn: 仍然建议使用GCC进行生产构建, 因为它们可以使用链接时间优化进行编译, 使产生的二进制文件更小, 更快.

source: Using Pyston for faster development
fr: Utiliser Pyston pour un développement plus rapide
zh_cn: 使用 Pyston 加快开发速度

source: You can use `Pyston <https://www.pyston.org/>`__ to run SCons. Pyston is a JIT-enabled implementation of the Python language (which SCons is written in). It is currently only compatible with Linux. Pyston can speed up incremental builds significantly, often by a factor between 1.5× and 2×. Pyston can be combined with Clang and LLD to get even faster builds.
fr: Vous pouvez utiliser `Pyston <https://www.pyston.org/>`__ pour exécuter SCons. Pyston est une implémentation compatible JIT du langage Python (dans lequel SCons est écrit). Il n'est actuellement compatible qu'avec Linux. Pyston peut accélérer les constructions incrémentales de manière significative, souvent par un facteur compris entre 1,5× et 2×. Pyston peut être combiné avec Clang et LLD pour obtenir des constructions encore plus rapides.
zh_cn: 你可以使用 `Pyston <https://www.pyston.org/>`__ 来运行 SCons。Pyston 是一种利用了 JIT 的 Python 语言实现（SCons 就是使用 Python 编写的）。目前它只兼容 Linux。Pyston 可以显著加速增量构建，经常可以达到 1.5× 和 2× 倍。可以将 Pyston 与 Clang 和 LLD 组合，进行更快的构建。

source: Download the `latest portable Pyston release <https://github.com/pyston/pyston/releases/tag/pyston_2.3.2>`__.
zh_cn: 下载 `Pyston 的最新绿色版本 <https://github.com/pyston/pyston/releases/tag/pyston_2.3.2>`__\ 。

source: Extract the portable ``.tar.gz`` to a set location, such as ``$HOME/.local/opt/pyston/`` (create folders as needed).
fr: Extrayez le fichier portable ``.tar.gz`` vers un emplacement défini, tel que ``$HOME/.local/opt/pyston/`` (créez des dossiers si nécessaire).
zh_cn: 将绿色的 ``.tar.gz`` 解压到特定的位置，比如 `$HOME/.local/opt/pyston/`\ （必要时请创建文件夹）。

source: Use ``cd`` to reach the extracted Pyston folder from a terminal, then run ``./pyston -m pip install scons`` to install SCons within Pyston.
fr: Utilisez ``cd`` pour atteindre le dossier Pyston extrait depuis un terminal, puis exécutez ``./pyston -m pip install scons`` pour installer SCons dans Pyston.
zh_cn: 在命令行中，使用 ``cd`` 达到 Pyston 解压出的文件夹，然后运行 ``./pyston -m pip install scons``\ ，在 Pyston 中安装 SCons。

source: To make SCons via Pyston easier to run, create a symbolic link of its wrapper script to a location in your ``PATH`` environment variable::
fr: Pour faciliter l'exécution de SCons via Pyston, créez un lien symbolique de son script wrapper vers un emplacement de votre variable d'environnement ``PATH`` : :
zh_cn: 为了便于通过 Pyston 运行 SCons，请创建一个指向其封装脚本的符号链接，符号链接的位置必须在你的 ``PATH`` 环境变量中： ::

source: Instead of running ``scons <build arguments>``, run ``pyston-scons <build arguments>`` to compile Godot.
fr: Au lieu d'exécuter ``scons <build arguments>`, exécutez ``pyston-scons <build arguments>` pour compiler Godot.
zh_cn: 现在就不是执行 ``scons <构建参数>`` 了，要编译 Godot 请执行 ``pyston-scons <构建参数>``\ 。

source: If you can't run ``pyston-scons`` after creating the symbolic link, make sure ``$HOME/.local/bin/`` is part of your user's ``PATH`` environment variable.
fr: Si vous ne pouvez pas exécuter ``pyston-scons`` après avoir créé le lien symbolique, assurez-vous que ``HOME/.local/bin/`` fait partie de la variable d'environnement ``PATH`` de votre utilisateur.
zh_cn: 如果创建符号链接后无法执行 ``pyston-scons``\ ，请确定 ``$HOME/.local/bin/`` 是当前用户的 ``PATH`` 环境变量的一部分。

source: Translation status
fr: État de la traduction
zh_cn: 翻译状态

source: To get the Godot source code for compiling, see :ref:`doc_getting_source`.
fr: Pour récupérer le code source de Godot pour le compiler, voir :ref:`doc_getting_source`.
