Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/06.jump_and_squash.po
Languages: de, es, fr, pt_br, ru, uk, zh_cn

source: By default, all physics bodies and areas are set to both layer and mask ``0``. This means they all collide with each other.
de: Standardmäßig sind alle physikalischen Körper und Flächen sowohl auf Ebene als auch auf Maske ``0`` eingestellt. Das bedeutet, dass sie alle miteinander kollidieren.
fr: Par défaut, tous les corps physiques et les zones ont leur calque et masque définis à ``0``. Cela signifie qu'ils peuvent tous entrer en collision les uns avec les autres.
ru: По умолчанию все физические тела и области установлены как на слой, так и на маску ``0``. Это означает, что все они сталкиваются друг с другом.
uk: За замовчуванням для всіх фізичних тіл і областей встановлено як шар, так і маску, ``0``. Це означає, що всі вони стикаються один з одним.

source: In the *Main* scene, select the *Ground* node. In the *Inspector*, expand the *Collision* section. There, you can see the node's layers and masks as a grid of buttons.
de: Wählen Sie in der *Main* Szene den Knoten *Ground*. Erweitern Sie im *Inspector* den Abschnitt *Collision*. Dort sehen Sie die Ebenen und Masken des Knotens als ein Raster von Schaltflächen.
fr: Dans la scène *Main*, sélectionnez le nœud *Ground*. Dans l'*Inspecteur*, développez la section *Collision*. Ici, vous pouvez voir les calques et masques du nœud sous la forme d'une grille de boutons.
ru: В сцене *Main* выберите узел *Ground*. В инспекторе разверните раздел *Collision*. Там вы увидите слои и маски узла в виде сетки кнопок.
uk: На головній сцені *Main* виберіть вузол землі *Ground*. У розділі *Інспектор* розгорніть розділ *Collision (Зіткнення)*. Там ви можете побачити шари вузла та маски у вигляді сітки кнопок.

source: The ground is part of the world, so we want it to be part of the third layer. Click the lit button to toggle off the first *Layer* and toggle on the third one. Then, toggle off the *Mask* by clicking on it.
de: Der ausgewählte *Ground* ist Teil der Welt, also soll er Teil der dritten *Layer* Ebene sein. Klicken Sie auf die vorgehobene Schaltfläche, um die erste Ebene zu deaktivieren und die dritte Ebene zu aktivieren. Minimieren Sie die Anzeige, indem Sie sie anklicken.
fr: Le sol fait partie du monde, nous voulons donc qu'il fasse partie de la troisième couche. Cliquez sur le bouton allumé pour désactiver le premier *Layer*, puis activez le troisième. Ensuite, désactivez le *Mask* en cliquant dessus.
ru: Земля является частью мира, поэтому мы хотим, чтобы она была частью третьего слоя. Нажмите на кнопку с подсветкой, чтобы выключить первый слой *Layer* и включить третий. Затем отключите *Mask*, щёлкнув по ней.
uk: Земля є частиною світу, тому ми хочемо, щоб вона була частиною третього шару. Натисніть підсвічену кнопку *Layer* , щоб вимкнути перший шар і увімкнути третій. Потім вимкніть маску *Mask*, натиснувши таку ж кнопку.

source: As I mentioned above, the *Mask* property allows a node to listen to interaction with other physics objects, but we don't need it to have collisions. The *Ground* doesn't need to listen to anything; it's just there to prevent creatures from falling.
de: Wie ich bereits erwähnt habe, ermöglicht die Eigenschaft *Collision* der Node,auf die Interaktion mit anderen physikalischen Objekten zu hören, aber für Kollisionen brauchen wir diese nicht. Der *Ground* muss auf nichts hören; er ist nur da, um zu verhindern, dass Kreaturen herunterfallen.
fr: Comme mentionné ci-dessus, la propriété *Mask* permet à un nœud d'écouter les interactions avec les autres objets physiques, mais nous n'en avons pas besoin pour qu'il y ait des collisions. Le *Ground* n'a pas besoin d'écouter quoi que ce soit ; il est juste là pour empêcher les créatures de tomber.
ru: Как я уже упоминал, свойство *Mask* позволяет узлу слушать взаимодействие с другими физическими объектами, но нам не нужно, чтобы у него были столкновения. Свойству *Ground* не нужно ничего слушать; оно просто находится там, чтобы предотвратить падение существ.
uk: Як я вже згадував вище, властивість *Mask* дозволяє вузлу виявляти взаємодію з іншими фізичними об'єктами, але вона не потрібна для того, щоб бути предметом для зіткнення. Земля не повинна нічого виявляти; вона всього лише запобігає падінню істот.

source: Next up are the *Player* and the *Mob*. Open ``Player.tscn`` by double-clicking the file in the *FileSystem* dock.
de: Als nächstes sind *Player* und *Mob* dran. Öffnen Sie ``Player.tscn`` indem Sie im *Dateisystem*-Panel darauf doppel-klicken.
fr: Ensuite viennent le *Player* et le *Mob*. Ouvrez ``Player.tscn`` en double-cliquant sur le fichier dans le dock *Système de fichiers*.
ru: Далее следуют *Player* и *Mob*. Откройте ``Player.tscn``, дважды щёлкнув по файлу в панели *FileSystem*.
uk: Далі йдуть *Player* і *Mob*. Відкрийте ``Player.tscn``, двічі клацнувши файл на панелі *Файлова система*.

source: Select the *Player* node and set its *Collision -> Mask* to both "enemies" and "world". You can leave the default *Layer* property as the first layer is the "player" one.
de: Wählen Sie die Node *Player* und setzen Sie seine *Collision -> Mask* auf "enemies" und "world". Sie können die Standardeigenschaft *Layer* beibehalten, da die erste Ebene die des "Spielers" ist.
fr: Sélectionnez le nœud *Player* et définissez son *Collision -> Mask* sur "enemies" et "world". Vous pouvez laisser la propriété *Layer* par défaut car le premier calque est celui du "player".
ru: Выберите узел *Player* и установите его свойство *Collision -> Mask* на "enemies" и "world". Вы можете оставить свойство по умолчанию *Layer*, так как первый слой - это слой "игрока" (player).
uk: Виберіть вузол гравця *Player* та встановіть йому маску зіткнення *Collision -> Mask* як для "enemies", так і для "world". Ви можете залишити властивість *Layer* за замовчуванням, оскільки перший шар є "player".

source: Then, open the *Mob* scene by double-clicking on ``Mob.tscn`` and select the *Mob* node.
de: Öffnen Sie dann die *Mob*-Szene durch Doppelklick auf ``Mob.tscn`` und wählen Sie die *Mob* Node aus.
fr: Ensuite, ouvrez la scène *Mob* en double-cliquant sur ``Mob.tscn`` et sélectionnez le nœud *Mob*.
ru: Затем откройте сцену *Mob*, дважды щёлкнув на ``Mob.tscn`` и выбрав узел *Mob*.
uk: Потім відкрийте сцену *Mob*, двічі клацнувши по ``Mob.tscn`` і вибравши вузол *Mob*.

source: |image6|
pt_br: |imagem 6|
uk: Зображення

source: These settings mean the monsters will move through one another. If you want the monsters to collide with and slide against each other, turn on the "enemies" mask.
de: Diese Einstellungen bedeuten, dass sich die Monster durch einander durch bewegen können. Wenn Sie möchten, dass die Monster miteinander kollidieren und gegeneinander gleiten, schalten Sie die *Collosion -> Mask* auf "Feinde" zu.
fr: Ces paramètres signifient que les monstres se déplaceront les uns à travers les autres. Si vous voulez que les monstres collisionnent et glissent entre eux, activez le masque "enemies".
ru: Эти настройки означают, что монстры будут двигаться друг сквозь друга. Если вы хотите, чтобы монстры сталкивались и скользили друг по другу, включите маску "enemies".
uk: Ці налаштування означають, що монстри будуть рухатися один крізь одного. Якщо ви хочете, щоб монстри між собою, увімкніть маску "enemies".

source: Inside ``_physics_process()``, add the following code before the line where we called ``move_and_slide()``.
de: Innerhalb von ``_physics_process()`` fügen Sie den folgenden Code vor der Zeile ein, wo wir ``move_and_slide()`` aufgerufen haben.
fr: À l'intérieur de ``_physics_process()``, ajoutez le code suivant avant la ligne où nous avons appelé ``move_and_slide()``.
ru: Внутри ``_physics_process()``, добавьте следующий код перед строкой, где мы вызвали ``move_and_slide()``.
uk: Усередині ``_physics_process()`` додайте наступний код перед рядком, де ми викликаємо ``move_and_slide()``.

source: The ``is_on_floor()`` method is a tool from the ``KinematicBody`` class. It returns ``true`` if the body collided with the floor in this frame. That's why we apply gravity to the *Player*: so we collide with the floor instead of floating over it like the monsters.
de: Die Methode ``is_on_floor()`` ist ein Werkzeug der Klasse ``KinematicBody``. Sie gibt ``true`` zurück, wenn der KinematicBody-Körper in diesem Frame mit dem Boden kollidiert ist. Das ist der Grund, warum wir die Schwerkraft auf den *Player* anwenden. Damit kann die Klasse mit dem Boden kollidieren, anstatt über ihm zu schweben wie die Monster.
fr: La méthode ``is_on_floor()`` est un outil de la classe ``KinematicBody``. Elle retourne ``true`` si le corps a collisionné avec le sol pendant cette image. C'est pourquoi nous appliquons la gravité au *Player* : pour que nous soyons en collision avec le sol au lieu de flotter au-dessus comme les monstres.
ru: Метод ``is_on_floor()`` является инструментом класса ``KinematicBody``. Он возвращает значение ``true``, если тело столкнулось с полом в этом кадре. Вот почему мы применяем гравитацию к *Player* : так мы сталкиваемся с полом, а не парим над ним, как монстры.
uk: Метод ``is_on_floor()`` є інструментом з класу ``KinematicBody``. Він повертає ``true``, якщо тіло зіткнулося з підлогою в цьому кадрі. Ось чому ми застосовуємо гравітацію до гравця: ми стикаємося з підлогою, а не пливемо над нею, як монстри.

source: If the character is on the floor and the player presses "jump", we instantly give them a lot of vertical speed. In games, you really want controls to be responsive and giving instant speed boosts like these, while unrealistic, feel great.
de: Wenn die Figur auf dem Boden steht und der Spieler auf "springen" drückt, geben wir ihr sofort eine Menge vertikale Geschwindigkeit hinzu. In Spielen muss die Steuerung wirklich reaktionsschnell sein, und solche sofortigen Geschwindigkeitsschübe sind zwar unrealistisch, fühlen sich aber toll an.
fr: Si le personnage est sur le sol et que le joueur appuie sur "jump", nous lui donnons instantanément une grande vitesse verticale. Dans les jeux, il faut vraiment que les contrôles soient réactifs et donnent des accélérations instantanées comme celles-ci, bien que ça soit irréaliste, c'est agréable.
ru: Если персонаж стоит на полу и игрок нажимает кнопку "прыжок", мы мгновенно придаем ему большую вертикальную скорость. В играх очень важно, чтобы управление было отзывчивым, а такие мгновенные прибавки скорости, хотя и нереалистичны, но ощущаются отлично.
uk: Якщо персонаж знаходиться на підлозі і гравець натискає "jump", ми моментально даємо йому велику вертикальну швидкість. В іграх ви дійсно хочете, щоб елементи керування реагували і давали миттєві підвищення швидкості, як ці, при своїй нереалістичності, вони себе чудово проявляють.

source: Notice that the Y axis is positive upwards. That's unlike 2D, where the Y axis is positive downward.
de: Beachten Sie, dass die Y-Achse positiv nach oben verläuft. Das ist anders als in 2D, wo die Y-Achse positiv nach unten verläuft.
fr: Remarquez que l'axe Y est positif vers le haut. C'est différent de la 2D, où l'axe Y est positif vers le bas.
ru: Обратите внимание, что ось Y положительно направлена вверх. Это отличается от 2D, где ось Y положительно направлена вниз.
uk: Запримітьте, що вісь Y позитивна вгору. На відміну від 2D, де вісь Y позитивна вниз.

source: Open the scene ``Mob.tscn`` again and select the *Mob* node. Go to the *Node* dock on the right to see a list of signals. The *Node* dock has two tabs: *Signals*, which you've already used, and *Groups*, which allows you to assign tags to nodes.
de: Öffnen Sie die Szene ``Mob.tscn`` erneut und wählen Sie die Node *Mob*. Gehen Sie zum *Node*-Dock auf der rechten Seite, um eine Liste der Signale zu sehen. Das *Node*-Dock hat zwei Registerkarten: *Signale*, die Sie bereits verwendet haben, und *Gruppen*, mit denen Sie den Knoten Tags zuweisen können.
fr: Ouvrez à nouveau la scène ``Mob.tscn`` et sélectionnez le nœud *Mob*. Allez dans le dock *Nœud* sur la droite pour voir une liste de signaux. Le dock *Nœud* possède deux onglets : *Signaux*, que vous avez déjà utilisé, et *Groupes*, qui nous permet d'assigner des tags aux nœuds.
ru: Снова откройте сцену ``Mob.tscn`` и выберите узел *Mob*. Перейдите в панель *Node* справа, чтобы увидеть список сигналов. В панели *Node* есть две вкладки: *Signals*, которую вы уже использовали, и *Groups*, которая позволяет присваивать узлам теги.
uk: Відкрийте сцену ``Mob.tscn`` ще раз і виберіть вузол *Mob*. Перейдіть до панелі *Вузол* справа, щоб побачити список сигналів. Панель *Вузол* має дві вкладки: *Сигнали*, які ви вже використовували, і *Групи*, що дозволяє призначати вузлам теги.

source: Then, at the bottom of ``_physics_process()``, add the following loop. With ``move_and_slide()``, Godot makes the body move sometimes multiple times in a row to smooth out the character's motion. So we have to loop over all collisions that may have happened.
de: Fügen Sie dann am Ende von ``_physics_process()`` die folgende Schleife ein. Bei ``move_and_slide()`` lässt Godot die Node manchmal mehrmals hintereinander bewegen, um die Bewegung der Figur zu glätten. Wir müssen also eine Schleife über alle Kollisionen machen, die möglicherweise stattgefunden haben.
fr: Ensuite, en bas de ``_physics_process()``, ajoutez la boucle suivante. Avec ``move_and_slide()``, Godot fait parfois bouger le corps plusieurs fois de suite afin de fluidifier le mouvement du personnage. Nous devons donc boucler sur toutes les collisions qui ont pu se produire.
ru: Затем, в нижней части ``_physics_process()``, добавьте следующий цикл. В ``move_and_slide()``, Godot заставляет тело двигаться иногда несколько раз подряд, чтобы сгладить движение персонажа. Поэтому мы должны перебрать все столкновения, которые могли произойти.
uk: Потім у нижній частині ``_physics_process()`` додайте наступний цикл. За допомогою ``move_and_slide()``, Godot змушує тіло рухатися іноді кілька разів поспіль, щоб згладити рух персонажа. Отже, ми повинні опрацювати всі зіткнення, які могли статися.

source: The functions ``get_slide_count()`` and ``get_slide_collision()`` both come from the :ref:`KinematicBody<class_KinematicBody>` class and are related to ``move_and_slide()``.
de: Die Funktionen ``get_slide_count()`` und ``get_slide_collision()`` stammen beide aus der Klasse :ref:`KinematicBody<class_KinematicBody>` und sind mit ``move_and_slide()`` verbunden.
fr: Les fonctions ``get_slide_count()`` et ``get_slide_collision()`` viennent toutes les deux de la classe :ref:`KinematicBody<class_KinematicBody>` et sont liées à ``move_and_slide()``.
ru: Обе функции ``get_slide_count()`` и ``get_slide_collision()`` происходят из класса :ref:`KinematicBody<class_KinematicBody>` и связаны с ``move_and_slide()``.
uk: Функції ``get_slide_count()`` та ``get_slide_collision()`` походять з класу :ref:`KinematicBody<class_KinematicBody>` і пов'язані з ``move_and_slide()``.

source: ``get_slide_collision()`` returns a :ref:`KinematicCollision<class_KinematicCollision>` object that holds information about where and how the collision occurred. For example, we use its ``collider`` property to check if we collided with a "mob" by calling ``is_in_group()`` on it: ``collision.collider.is_in_group("mob")``.
de: `get_slide_collision()`` gibt ein :ref:`KinematicCollision<class_KinematicCollision>` Objekt zurück, das Informationen darüber enthält, wo und wie die Kollision stattgefunden hat. Wir verwenden zum Beispiel die Eigenschaft ``collider ``, um zu prüfen, ob wir mit einem "Mob" kollidiert sind, indem wir ``is_in_group()`` an ``collision.collider.is_in_group("mob")`` aufrufen.
fr: ``get_slide_collision()`` retourne un objet :ref:`KinematicCollision<class_KinematicCollision>` qui contient des informations sur le lieu et la manière dont la collision s'est produite. Par exemple, nous utilisons sa propriété ``collider`` pour vérifier si nous sommes entrés en collision avec un "mob", en appelant ``is_in_group()`` dessus : ``collision.collider.is_in_group("mob")``.
ru: ``get_slide_collision()`` возвращает объект :ref:`KinematicCollision<class_KinematicCollision>`, который содержит информацию о том, где и как произошло столкновение. Например, мы используем его свойство ``collider``, чтобы проверить, столкнулись ли мы с "мобом", вызвав на него ``is_in_group()``: ``collision.collider.is_in_group("mob")``.
uk: ``get_slide_collision()`` повертає об'єкт :ref:`KinematicCollision<class_KinematicCollision>`, який містить інформацію про те, де і як сталося зіткнення. Наприклад, ми використовуємо його властивість ``collider``, щоб перевірити, чи зіткнулися ми з "mob", викликаючи з неї ``is_in_group()``: ``collision.collider.is_in_group("mob")``.

source: To check that we are landing on the monster, we use the vector dot product: ``Vector3.UP.dot(collision.normal) > 0.1``. The collision normal is a 3D vector that is perpendicular to the plane where the collision occurred. The dot product allows us to compare it to the up direction.
fr: Pour vérifier que nous atterrissons sur le monstre, nous utilisons le produit scalaire de vecteurs : ``Vector3.UP.dot(collision.normal) > 0.1``. La normale de la collision est un vecteur 3D qui est perpendiculaire au plan sur lequel la collision s'est produite. Le produit scalaire nous permet de la comparer à la direction vers le haut.
ru: Чтобы проверить, что мы приземляемся на монстра, мы используем векторное скалярное произведение (dot product): ``Vector3.UP.dot(collision.normal) > 0.1``. Нормаль столкновения - это трёхмерный вектор, перпендикулярный плоскости, в которой произошло столкновение. Скалярное произведение позволяет нам сравнить его с направлением вверх.
uk: Щоб перевірити, чи ми приземляємося на монстра, ми використовуємо векторний точковий добуток: ``Vector3.UP.dot(collision.normal) > 0.1``. Нормальне зіткнення - це 3D-вектор, який перпендикулярний площині, де сталося зіткнення. Точковий добуток дозволяє порівняти його з напрямком вгору.

source: We are calling one undefined function, ``mob.squash()``. We have to add it to the Mob class.
de: Wir rufen eine undefinierte Funktion auf, ``mob.squash()``. Wir müssen sie der Klasse Mob hinzufügen.
fr: Nous appelons une fonction indéfinie, ``mob.squash()``. Nous devons l'ajouter à la classe Mob.
ru: Мы вызываем одну неопределённую функцию, ``mob.squash()``. Мы должны добавить её в класс Mob.
uk: Ми викликаємо ще одну невизначену функцію, ``mob.squash()``. Ми повинні додати її до класу Mob.

source: With that, you should be able to kill monsters by jumping on them. You can press :kbd:`F5` to try the game and set ``Main.tscn`` as your project's main scene.
de: Damit sollten Sie in der Lage sein, Monster zu töten, indem Sie auf sie springen. Sie können :kbd:`F5` drücken, um das Spiel auszuprobieren und ``Main.tscn`` als die Hauptszene deines Projekts einzustellen.
fr: Avec ceci, vous devriez pouvoir tuer les monstres en leur sautant dessus. Vous pouvez appuyer sur :kbd:`F5` pour essayer le jeu et définir ``Main.tscn`` comme la scène principale de votre projet.
ru: С помощью этого вы сможете убивать монстров, прыгая на них. Вы можете нажать :kbd:`F5`, чтобы попробовать игру и установить ``Main.tscn`` в качестве основной сцены вашего проекта.
uk: З цим, ви повинні бути в змозі вбивати монстрів, стрибаючи на них. Ви можете натиснути :kbd:`F5`, щоб спробувати гру і встановити ``Main.tscn`` в якості головної сцени вашого проекту.

source: image0
pt_br: imagem0

source: image1
pt_br: imagem1

source: image2
pt_br: imagem2

source: image3
pt_br: imagem3

source: image4
pt_br: imagem4

source: image5
pt_br: imagem5
