Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/06.jump_and_squash.po
Languages: de, es, fr, pt_br, ru, uk, zh_cn

source: Jumping and squashing monsters
de: Springen und Zerdrücken von Monstern
es: Saltando y aplastando monstruos
fr: Sauter et écraser les monstres
pt_br: Pulando e esmagando monstros
ru: Прыжки и раздавливание монстров
uk: Стрибання і розчавлювання монстрів
zh_cn: 跳跃与踩扁怪物

source: In this part, we'll add the ability to jump and squash the monsters. In the next lesson, we'll make the player die when a monster hits them on the ground.
es: En esta parte, agregaremos la capacidad de saltar y aplastar a los monstruos. En la siguiente lección, haremos que el jugador muera cuando un monstruo lo golpee en el suelo.
zh_cn: 在这一部分中，我们将添加跳跃、踩扁怪物的能力。在下一节课中，我们会让怪物在地面上击中玩家时让玩家死亡。

source: First, we have to change a few settings related to physics interactions. Enter the world of :ref:`physics layers <doc_physics_introduction_collision_layers_and_masks>`.
de: Zuerst müssen wir einige Einstellungen in Bezug auf physikalische Interaktionen ändern. Betreten Sie die Welt der :ref:`Physik-Layer<doc_physics_introduction_collision_layers_and_masks>`.
es: Primero, tenemos que cambiar algunas configuraciones relacionadas con las interacciones físicas. Ingresa al mundo de las :ref:`capas de física <doc_physics_introduction_collision_layers_and_masks>`.
fr: Tout d'abord, nous devons modifier quelques paramètres liés aux interactions physiques. Entrez dans le monde des :ref:`couches de physique <doc_physics_introduction_collision_layers_and_masks>`.
pt_br: Primeiro, temos que alterar algumas configurações relacionadas às interações físicas. Entre no mundo de :ref:'physics <doc_physics_introduction_collision_layers_and_masks>layers'.
ru: Во-первых, мы должны изменить несколько настроек, связанных с физическими взаимодействиями. Войдите в мир <doc_physics_introduction_collision_layers_and_masks>`.
uk: Спершу ми повинні змінити кілька налаштувань, пов'язаних з фізичними взаємодіями. Вступ до світу :ref:`фізичних шарів <doc_physics_introduction_collision_layers_and_masks>`.
zh_cn: 首先我们要修改一些物理交互相关的设置。请进入\ :ref:`物理层 <doc_physics_introduction_collision_layers_and_masks>`\ 的世界。

source: Controlling physics interactions
de: Steuerung der physikalischen Interaktionen
es: Controlando las interacciones fisicas
fr: Contrôler les interactions physiques
pt_br: Controlando as interações físicas
ru: Управление физическими взаимодействиями
uk: Контроль фізичних взаємодій
zh_cn: 控制物理交互

source: Physics bodies have access to two complementary properties: layers and masks. Layers define on which physics layer(s) an object is.
de: Physikalische Körper haben zugriff auf zwei komplementäre Eigenschaften: Ebenen und Masken. Ebenen definieren auf welcher/-n physikalischen Ebene(n) ein Objekt ist.
es: Los cuerpos físicos tienen acceso a dos propiedades complementarias: capas y máscaras. Las capas definen en qué capa(s) física(s) se encuentra un objeto.
fr: Les corps physiques ont accès à deux propriétés complémentaires : les calques et les masques. Les calques définissent sur quel(s) calque(s) physique se trouve un objet.
pt_br: Os corpos da física têm acesso a duas propriedades complementares: camadas e máscaras. As camadas definem em que camada(s) de física um objeto está.
ru: Физические тела имеют доступ к двум дополнительным свойствам: слоям и маскам. Слои определяют, на каком физическом слое (слоях) находится объект.
uk: Фізичні тіла мають доступ до двох додаткових властивостей: шарів і масок. Шари визначають, на яких фізичних шарах (шарі) знаходиться об'єкт.
zh_cn: 物理实体可以访问两个互补的属性：层和遮罩。层（Layer）定义的是该对象位于哪些物理层上。

source: Masks control the layers that a body will listen to and detect. This affects collision detection. When you want two bodies to interact, you need at least one to have a mask corresponding to the other.
de: Masken steuern die Ebenen, auf die ein Körper hört und die er erkennt. Dies wirkt sich auf die Kollisionserkennung aus. Wenn zwei Körper miteinander interagieren sollen, muss mindestens einer eine Maske haben, die dem anderen entspricht.
es: Las máscaras controlan las capas que un cuerpo escuchará y detectará. Esto afecta a la detección de colisiones. Cuando quieras que dos cuerpos interactúen, necesitas que al menos uno tenga una máscara correspondiente al otro.
fr: Les masques contrôlent les calques qu'un corps va écouter et détecter. Cela affecte la détection de collisions. Quand vous voulez que deux corps interagissent, il faut qu'au moins l'un d'entre eux ait un masque correspondant à l'autre.
pt_br: As máscaras controlam as camadas que um corpo irá escutar e detectar. Isto afeta a detecção de colisões. Quando se deseja que dois corpos interajam, é necessário que pelo menos um tenha uma máscara correspondente ao outro.
ru: Маски управляют слоями, которые будут воспринимать и обнаруживать тело. Это влияет на обнаружение столкновений. Когда вы хотите, чтобы два тела взаимодействовали, необходимо, чтобы хотя бы одно из них имело маску, соответствующую другому.
uk: Маски контролюють шари, які тіло буде слухати і виявляти. Маски впливають на виявлення зіткнень. Коли ви хочете, щоб два тіла взаємодіяли, вам потрібно принаймні одне з маскою, відповідною іншому.
zh_cn: 遮罩（Mask）控制的是该实体会监听并检测的层，会影响碰撞检测。希望两个实体能够发生交互时，你需要让其中至少一个的遮罩与另一个（的层）相对应。

source: If that's confusing, don't worry, we'll see three examples in a second.
de: Wenn das verwirrend ist, keine Sorge, wir werden gleich drei Beispiele sehen.
es: Si estés confundido, no preocupe, exploraramos tres ejemplos en uno momento.
fr: Si cela vous paraît confus, ne vous inquiétez pas, nous allons voir trois exemples dans une seconde.
pt_br: Se isso for confuso, não se preocupe, veremos três exemplos em um segundo.
ru: Если это вас смущает, не волнуйтесь, через секунду мы увидим три примера.
uk: Якщо ви заплуталися, не хвилюйтеся, ми побачимо три приклади за секунду.
zh_cn: 可能有点绕，但请别担心，我们马上就会看到三个例子。

source: The important point is that you can use layers and masks to filter physics interactions, control performance, and remove the need for extra conditions in your code.
de: Wichtig ist, dass Sie Ebenen und Masken verwenden können, um physikalische Interaktionen zu filtern, die Leistung zu steuern und um zusätzliche Bedingungen in Ihrem Code überflüssig zu machen.
es: El punto más importante es que pueda usar capas y mascarillas para filtrar interacciones de fisicas, controlar rendimiento, y eliminar requisitos por condiciones adicionales en su código.
fr: Le point important est que vous pouvez utiliser les calques et les masques pour filtrer les interactions physiques, contrôler les performances, et supprimer le besoin de conditions supplémentaires dans votre code.
pt_br: O ponto importante é que você pode usar camadas e máscaras para filtrar as interações físicas, controlar o desempenho e remover a necessidade de condições extras em seu código.
ru: Важным моментом является то, что вы можете использовать слои и маски для фильтрации физического взаимодействия, контроля производительности и устранения необходимости в дополнительных условиях в вашем коде.
uk: Важливим моментом є те, що ви можете використовувати шари та маски для фільтрації взаємодій фізики, контролю продуктивності та усунення необхідності додаткових умов у вашому коді.
zh_cn: 重要的知识点是，你能够使用层和遮罩来过滤物理交互、控制性能、让代码中不需要再做额外的条件检测。

source: By default, all physics bodies and areas are set to both layer and mask ``1``. This means they all collide with each other.
es: Por defecto, todos los cuerpos físicos y áreas están configurados tanto a capa como a máscara ``1``. Esto significa que todos ellos colisionan entre sí.
zh_cn: 默认情况下，所有物理体和区域的层和遮罩都被设成了 ``1``\ 。也就是说它们会互相碰撞。

source: Physics layers are represented by numbers, but we can give them names to keep track of what's what.
de: Physikalische Schichten werden durch Zahlen dargestellt, aber wir können ihnen Namen geben, um den Überblick darüber zu behalten, welche es sind.
es: Las capas físicas se representan mediante números, pero podemos darles nombres para llevar un registro de qué es qué.
fr: Les calques de physique sont représentés par des nombres, mais nous pouvons leur donner des noms pour garder une trace de qui est quoi.
pt_br: As camadas físicas são representadas por números, mas podemos dar-lhes nomes para acompanhar o que é o quê.
ru: Физические слои представлены числами, но мы можем дать им имена, чтобы отслеживать, что есть что.
uk: Шари фізики представлені числами, але ми можемо дати їм імена, щоб відстежувати їх вміст.
zh_cn: 物理层由数字表示，但我们也可以为它们命名，记录什么是什么。

source: Setting layer names
de: Ebenennamen festlegen
es: Ajustando el nombre de las capas
fr: Définition des noms de layer
pt_br: Definindo os nomes de camadas
ru: Установка имен слоев
uk: Встановлення назв шарів
zh_cn: 设置层名称

source: Let's give our physics layers a name. Go to *Project -> Project Settings*.
de: Geben wir unseren Physikebenen einen Namen. Gehen Sie zu *Projekt -> Projekteinstellungen*.
es: Vamos a darle nombre a nuestras capas físicas. Ve a *Proyecto -> Configuración del Proyecto*.
fr: Donnons un nom à nos calques de physique. Allez dans *Projet -> Paramètres du projet...*.
pt_br: Vamos dar um nome às nossas camadas físicas. Vá para *Projeto -> Configurações do Projeto*.
ru: Давайте дадим нашим физическим слоям имя. Перейдите в раздел *Project -> Project Settings* (Проект -> Настройки проекта).
uk: Давайте дамо нашим фізичним шарам назву. Перейдіть до *Проект -> Параметри проекту*.
zh_cn: 让我们来为物理层命名。打开\ *项目 -> 项目设置*\ 。

source: In the left menu, navigate down to *Layer Names -> 3D Physics*. You can see a list of layers with a field next to each of them on the right. You can set their names there. Name the first three layers *player*, *enemies*, and *world*, respectively.
de: Im linked Menü bis zum Eintrag *Ebenen Namen -> 3D Physik* navigieren. Dort ist eine Liste der Ebenen zu sehen, die mit einem Feld auf der rechten Seite versehen sind. In diese Felder werden die Bezeichnungen der Ebenen eingetragen. Dort sollten die ersten drei Ebenen *player*, *enemies* und *world* benannt werden.
es: En el menú de la izquierda, ve hacia abajo hasta *Nombres de Capas -> Física 3D*. Verás una lista de capas con un campo junto a cada una de ellas a la derecha. Puedes establecer sus nombres allí. Nombra las primeras tres capas como *player*, *enemies* y *world*, respectivamente.
fr: Dans le menu de gauche, naviguez jusqu'à *Layer Names -> 3D Physics*. Vous pouvez voir une liste de calques avec un champ à côté de chacun d'entre eux sur la droite. Vous pouvez définir leur nom ici. Nommez les trois premiers calques *player*, *enemies*, et *world*, respectivement.
pt_br: No menu à esquerda, navegue até *Nomes de Camada -> Física 3D*. Você pode ver uma lista de camadas com um campo ao lado de cada uma delas à direita. Você pode definir seus nomes lá. Nomeie as três primeiras camadas *jogador*, *inimigos* e *mundo*, respectivamente.
ru: В левом меню перейдите вниз по ссылке *Layer Names -> 3D Physics*. Справа вы увидите список слоёв с полем рядом с каждым из них. Там вы можете задать их имена. Назовите первые три слоя *player*, *enemies*, и *world*, соответственно.
uk: У лівому меню перейдіть до розділу *Layer Names -> 3D Physics*. Праворуч ви можете побачити список шарів з полем поруч з кожним з них. В цьому полі ви можете встановити їхні імена. Назвіть перші три шари *player*, *enemies*, і *world* відповідно.
zh_cn: 在左侧的菜单中，找到 *Layer Names -> 3D Physics*\ （层名称 -> 3D 物理）。你可以在右侧看到层的列表，每一层右侧都有一个字段，可以用来设置名称。将前三层分别命名为“player”“enemies”“world”（玩家、敌人、世界）。

source: Now, we can assign them to our physics nodes.
de: Jetzt können wir sie unseren Physik-Nodes zuweisen.
es: Ahora podemos asignarles estas capas a nuestros nodos físicos.
fr: Maintenant, nous pouvons les assigner à nos nœuds de physique.
pt_br: Agora, podemos atribuí-los aos nossos nós de física.
ru: Теперь мы можем назначить их нашим физическим узлам.
uk: Тепер ми можемо призначити їх нашим фізичним вузлам.
zh_cn: 现在，我们就可以将它们分配给我们的物理节点了。

source: Assigning layers and masks
de: Ebenen und Masken zuweisen
es: Asignando capas y máscaras
fr: Affectation des layers et des masks
pt_br: Atribuindo camadas e máscaras
ru: Назначение слоев и масок
uk: Призначення шарів і масок
zh_cn: 层和遮罩的分配

source: In the *Main* scene, select the ``Ground`` node. In the *Inspector*, expand the *Collision* section. There, you can see the node's layers and masks as a grid of buttons.
es: En la escena *Main*, selecciona el nodo ``Ground``. En el *Inspector*, expande la sección *Collision*. Allí podrás ver las capas y máscaras del nodo como una cuadrícula de botones.
zh_cn: 在 *Main* 场景中选中 ``Ground`` 节点。在\ *检查器*\ 中展开 *Collision*\ （碰撞）部分。你可以看到，该节点的层和遮罩在这里以按钮网格的形式排列。

source: The ground is part of the world, so we want it to be part of the third layer. Click the lit button to toggle **off** the first *Layer* and toggle **on** the third one. Then, toggle **off** the *Mask* by clicking on it.
es: El suelo forma parte del mundo, así que queremos que sea parte de la tercera capa. Haz clic en el botón iluminado para desactivar la primera *Capa* y activa la tercera. Luego, desactiva la *Máscara* haciendo clic en ella.
zh_cn: 地面是世界的一部分，所以我们希望它属于第三层。点击 *Layer* 中的第一个点亮的按钮将其\ **关闭**\ ，\ **打开**\ 第三层。然后点击\ **关闭** *Mask*\ 。

source: As mentioned before, the *Mask* property allows a node to listen to interaction with other physics objects, but we don't need it to have collisions. ``Ground`` doesn't need to listen to anything; it's just there to prevent creatures from falling.
es: Como se mencionó anteriormente, la propiedad *Mask* permite que un nodo escuche las interacciones con otros objetos físicos, pero no necesitamos que tenga colisiones. ``Ground`` no necesita escuchar nada; solo está ahí para evitar que las criaturas caigan.
zh_cn: 上面说到过，\ *Mask* 属性可以让节点监听与其他物理对象的交互，但它不是实现碰撞所必须的。\ ``Ground`` 不需要监听任何东西；它存在的意义是防止生物下落。

source: Note that you can click the "..." button on the right side of the properties to see a list of named checkboxes.
de: Beachten Sie, dass Sie auf die Schaltfläche "..." auf der rechten Seite der Eigenschaften klicken können, um eine Liste der benannten Kontrollkästchen anzuzeigen.
es: Ten en cuenta que puedes hacer clic en el botón "..." en el lado derecho de las propiedades para ver una lista de casillas de verificación con nombres.
fr: Notez que vous pouvez cliquer sur le bouton "..." à droite des propriétés pour voir une liste de cases à cocher nommées.
pt_br: Observe que você pode clicar no botão "..." no lado direito das propriedades para ver uma lista de caixas de seleção nomeadas.
ru: Обратите внимание, что вы можете нажать кнопку "..." в правой части свойств, чтобы увидеть список именованных флажков.
uk: Зверніть увагу, що ви можете натиснути кнопку "..." у правій частині властивостей, щоб переглянути список іменованих галочок.
zh_cn: 请注意，点击右侧的“...”按钮会将该属性以带名称的复选框的形式展示。

source: Next up are the ``Player`` and the ``Mob``. Open ``player.tscn`` by double-clicking the file in the *FileSystem* dock.
es: A continuación, están ``Player`` y ``Mob``. Abre ``player.tscn`` haciendo doble clic en el archivo en el panel *Sistema de Archivos*.
zh_cn: 接下来就是 ``Player`` 和 ``Mob``\ 。在\ *文件系统*\ 面板中双击打开 ``player.tscn`` 文件。

source: Select the *Player* node and set its *Collision -> Mask* to both "enemies" and "world". You can leave the default *Layer* property as it is, because the first layer is the "player" layer.
es: Selecciona el nodo *Player* y establece su propiedad *Collision -> Mask* tanto a "enemies" como a "world". Puedes dejar la propiedad *Layer* por defecto, ya que la primera capa es la capa "player".
zh_cn: 选中 *Player* 节点，将其 *Collision -> Mask* 设为“enemies”和“world”。\ *Layer* 属性可以保持默认，因为第一个层就是“player”层。

source: Then, open the *Mob* scene by double-clicking on ``mob.tscn`` and select the ``Mob`` node.
es: Luego, abre la escena del *Mob* haciendo doble clic en ``mob.tscn`` y selecciona el nodo ``Mob``.
zh_cn: 然后双击 ``mob.tscn`` 打开 *Mob* 场景，选中 ``Mob`` 节点。

source: Set its *Collision -> Layer* to "enemies" and unset its *Collision -> Mask*, leaving the mask empty.
de: Setzen Sie *Collision -> Layer* auf "Feinde" und entfernen sie alle Auswahlfelder in der *Collision -> Mask*. So dass die Masken leer bleiben.
es: Establece su propiedad *Colisión -> Capa* en "enemies" y desactiva su propiedad *Colisión -> Máscara*, dejando la máscara vacía.
fr: Définissez son *Collision -> Layer* sur "enemies" et désactivez son *Collision -> Mask*, laissant le masque vide.
pt_br: Configurar sua *Colisão -> Camada* para "inimigos" e desestabilizar sua *Colisão -> Máscara*, deixando a máscara vazia.
ru: Установите его *Collision -> Layer* на "enemies" и снимите его *Collision -> Mask*, оставив маску пустой.
uk: Встановіть йому *Collision -> Layer* на "enemies", а маску зіткнення *Collision -> Mask*, залишіть порожньою.
zh_cn: 将其 *Collision -> Layer* 设为“enemies”，然后取消 *Collision -> Mask* 的设置，让遮罩为空。

source: These settings mean the monsters will move through one another. If you want the monsters to collide with and slide against each other, turn **on** the "enemies" mask.
es: Estas configuraciones significan que los monstruos se moverán a través de los demás. Si deseas que los monstruos colisionen y se deslicen entre sí, **activa** la máscara "enemies".
pt_br: Estas configurações significam que os monstros se moverão uns através dos outros. Se você quiser que os monstros colidam e deslizem uns contra os outros, **ligue** a máscara de "inimigos".
zh_cn: 这些设置意味着怪物可以互相穿越。如果你希望怪物之间会发生碰撞和滑动，请\ **打开**\ “enemies”遮罩。

source: The mobs don't need to mask the "world" layer because they only move on the XZ plane. We don't apply any gravity to them by design.
de: Die Mobs brauchen die "Welt"-Ebene nicht zu maskieren, da sie sich nur auf der XZ-Ebene bewegen. Wir wenden keine Schwerkraft auf sie an.
es: Los enemigos no necesitan tener en cuenta la capa "world" porque solo se mueven en el plano XZ. No les aplicamos gravedad a propósito.
fr: Les mobs n'ont pas besoin de masquer le calque "world" car ils se déplacent seulement sur le plan XZ. Nous n'avons pas besoin de leur appliquer de gravité, par design.
pt_br: Os inimigos não precisam mascarar a camada "mundo" porque só se movem no plano XZ. Nós não aplicamos nenhuma gravidade a eles no desenvolvimento.
ru: Мобам не нужно маскировать слой "world", потому что они движутся только в плоскости XZ. Мы не применяем к ним гравитацию.
uk: Мобам не потрібна маска "world", тому що вони рухаються тільки на площині XZ. Ми не застосовуємо до них ніякої гравітації.
zh_cn: 小怪并不需要遮罩“world”层，因为它们只会沿着 XZ 平面移动。我们是故意不去为它们添加重力影响的。

source: Jumping
de: Springen
es: Saltando
fr: Sauter
pt_br: Pulando
ru: Прыжки
uk: Стрибки
zh_cn: 跳跃

source: The jumping mechanic itself requires only two lines of code. Open the *Player* script. We need a value to control the jump's strength and update ``_physics_process()`` to code the jump.
de: Die Sprungmechanik selbst erfordert nur zwei Codezeilen. Öffnen Sie das Skript *Player*. Wir brauchen einen Wert, um die Stärke des Sprungs zu kontrollieren, und aktualisieren ``_physics_process()``, um den Sprung zu erstellen.
es: La mecánica de salto en sí misma solo requiere dos líneas de código. Abre el script *Player*. Necesitamos un valor para controlar la fuerza del salto y actualiza ``_physics_process()`` para codificar el salto.
fr: La mécanique de saut ne nécessite que deux lignes de code. Ouvrez le script *Player*. Nous avons besoin d'une valeur pour contrôler la force de saut et de mettre à jour ``_physics_process()`` pour coder le saut.
pt_br: O próprio mecanismo de salto requer apenas duas linhas de código. Abra o script *Player*. Precisamos de um valor para controlar a força do salto e atualizar ``_physics_process()`` para codificar o salto.
ru: Сама механика прыжков требует всего двух строк кода. Откройте скрипт *Player*. Нам нужно значение для контроля силы прыжка и обновления ``_physics_process()`` для кодирования прыжка.
uk: Сам механізм стрибка вимагає всього двох рядків коду. Відкрийте скрипт гравця *Player*. Нам потрібно значення, щоб контролювати силу стрибка і оновлення ``_physics_process()``, щоб закодувати стрибок.
zh_cn: 跳跃机制本身只需要两行代码。打开 *Player* 脚本。我们需要一个值来控制跳跃的强度，并更新 ``_physics_process()`` 来对跳跃进行编码。

source: After the line that defines ``fall_acceleration``, at the top of the script, add the ``jump_impulse``.
de: Fügen sie am Anfang des Skripts nach der Zeile, die ``fall_acceleration`` definiert, ``jump_impulse`` ein.
es: Después de la línea que define ``fall_acceleration``, en la parte superior del script, agrega el ``jump_impulse``.
fr: Après la ligne qui définit ``fall_acceleration``, en haut du script, ajoutez le ``jump_impulse``.
pt_br: Após a linha que define ``fall_acceleration``, no topo do script, adicione o ``jump_impulse``.
ru: После строки, определяющей ``fall_acceleration``, в верхней части скрипта добавьте строку ``jump_impulse``.
uk: Після рядка, який визначає ``fall_acceleration``, у верхній частині скрипту, додайте ``jump_impulse``.
zh_cn: 在定义 ``fall_acceleration`` 这一行之后，在脚本的顶部，添加 ``jump_impulse``\ 。

source: Inside ``_physics_process()``, add the following code before the ``move_and_slide()`` codeblock.
es: Dentro de ``_physics_process()``, agrega el siguiente código antes de la línea donde llamamos a ``move_and_slide()``.
pt_br: Dentro de ``_physics_process()``, adicione o seguinte código antes do bloco de código ``move_and_slide()``.
zh_cn: 在 ``_physics_process()`` 内，请在调用 ``move_and_slide()`` 那块代码之前添加以下代码。

source: That's all you need to jump!
de: Das ist alles, was man zum Springen braucht!
es: ¡Eso es todo lo que necesitas para saltar!
fr: C'est tout ce dont vous avez besoin pour sauter !
pt_br: Isso é tudo que você precisa para pular!
ru: Это всё, что вам нужно для прыжка!
uk: Це все, що вам потрібно, для стрибка!
zh_cn: 这就是跳跃所需的所有东西！

source: The ``is_on_floor()`` method is a tool from the ``CharacterBody3D`` class. It returns ``true`` if the body collided with the floor in this frame. That's why we apply gravity to the *Player*: so we collide with the floor instead of floating over it like the monsters.
es: El método ``is_on_floor()`` es una herramienta de la clase ``CharacterBody3D``. Devuelve ``true`` si el cuerpo colisionó con el suelo en este fotograma. Por eso aplicamos gravedad al *Player*: para que colisionemos con el suelo en lugar de flotar sobre él como los monstruos.
pt_br: O método ``is_on_floor()`` é uma ferramenta da classe ``CharacterBody3D``. Ele retorna ``true`` se o corpo colidiu com o chão neste quadro. É por isso que aplicamos gravidade ao *Player*: para colidimos com o chão em vez de flutuar sobre ele como os monstros.
zh_cn: ``is_on_floor()`` 方法是来自 ``CharacterBody3D`` 类的工具。如果物体在这一帧中与地板发生碰撞返回 ``true``\ 。这就是为什么我们要对 *Player* 施加重力的原因：这样我们就会与地板相撞，而不是像怪物一样漂浮在地板上。

source: If the character is on the floor and the player presses "jump", we instantly give them a lot of vertical speed. In games, you really want controls to be responsive and giving instant speed boosts like these, while unrealistic, feels great.
es: Si el personaje está en el suelo y el jugador presiona "saltar", instantáneamente le damos una gran velocidad vertical. En los juegos, realmente quieres que los controles sean receptivos y dar aumentos de velocidad instantáneos como estos, aunque sean poco realistas, se sienten geniales.
pt_br: Se o personagem está no chão e o jogador pressiona "saltar", nós instantaneamente damos a eles muita velocidade vertical. Nos jogos, você realmente quer que os controles sejam responsivos e que dão aumentos instantâneos de velocidade como esses, embora irrealistas, são ótimos.
zh_cn: 如果角色在地板上并且玩家按下跳跃，立即给予角色较大的垂直速度，因为在游戏中，玩家通常希望控制能得到响应，就像这样提供的即时速度提升，虽然不切实际，但会令玩家感觉很好。
