Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/06.jump_and_squash.po
Languages: de, es, fr, pt_br, ru, uk, zh_cn

source: Notice that the Y axis is positive upwards. That's unlike 2D, where the Y axis is positive downwards.
es: Observa que el eje Y es positivo hacia arriba. Esto es diferente a los gráficos en 2D, donde el eje Y es positivo hacia abajo.
pt_br: Observe que o eixo Y é positivo para cima. Isso é diferente do 2D, onde o eixo Y é positivo para baixo.
zh_cn: 请注意，Y 轴的正方向是朝上的。这与 2D 有所不同， 2D的Y 轴的正方向是朝下的。

source: Squashing monsters
de: Monster zerquetschen
es: Aplastando monstruos
fr: Écraser les monstres
pt_br: Esmagando monstros
ru: Раздавить монстров
uk: Розчавлення монстрів
zh_cn: 踩扁怪物

source: Let's add the squash mechanic next. We're going to make the character bounce over monsters and kill them at the same time.
de: Fügen wir als Nächstes die Squash-Mechanik hinzu. Wir werden die Figur über Monster springen lassen und sie gleichzeitig töten.
es: A continuación, agreguemos la mecánica de aplastamiento. Vamos a hacer que el personaje rebote sobre los monstruos y los mate al mismo tiempo.
fr: Ajoutons ensuite la mécanique d'écrasement. Nous allons faire en sorte que le personnage rebondisse sur les monstres et les tue en même temps.
pt_br: Vamos adicionar a seguir a mecânica de esmagar. Vamos fazer o personagem saltar sobre os monstros e matá-los ao mesmo tempo.
ru: Далее добавим механику давки. Мы заставим персонажа подпрыгивать над монстрами и одновременно убивать их.
uk: Давайте додамо далі механізм розчавлення. Ми збираємося змусити персонажа відскакувати від монстрів і вбивати їх одночасно.
zh_cn: 接下来让我们来添加踩扁机制。我们会让玩家在怪物身上弹起，并同时消灭它们。

source: We need to detect collisions with a monster and to differentiate them from collisions with the floor. To do so, we can use Godot's :ref:`group <doc_groups>` tagging feature.
de: Wir müssen Kollisionen mit einem Monster erkennen und sie von Kollisionen mit dem Boden unterscheiden. Dazu können wir Godots :ref:`group <doc_groups>` Tagging-Funktionen verwenden.
es: Necesitamos detectar las colisiones con un monstruo y diferenciarlas de las colisiones con el suelo. Para hacerlo, podemos usar la función de etiquetado de grupos de Godot.
fr: Nous avons besoin de détecter les collisions avec un monstre et de les différencier des collisions avec le sol. Pour ça, nous pouvons utiliser la fonctionnalité de tags de :ref:`groupe <doc_groups>` de Godot.
pt_br: Precisamos detectar colisões com um monstro e diferenciá-las das colisões com o chão. Para fazer isso, podemos usar a funcionalidade de marcação :ref:`group <doc_groups>` do Godot.
ru: Нам нужно обнаружить столкновения с монстром и отличить их от столкновений с полом. Для этого мы можем использовать функцию тегов Godot :ref:`group <doc_groups>`.
uk: Нам потрібно виявити зіткнення з монстром і відрізнити їх від зіткнень з підлогою. Для цього ми можемо використовувати функцію тегування :ref:`груп <doc_groups>` Godot.
zh_cn: 我们需要检测与怪物的碰撞，并和与地板的碰撞相区分。要这么做，我们可以使用 Godot 的\ :ref:`分组 <doc_groups>`\ 标签功能。

source: Open the scene ``mob.tscn`` again and select the *Mob* node. Go to the *Node* dock on the right to see a list of signals. The *Node* dock has two tabs: *Signals*, which you've already used, and *Groups*, which allows you to assign tags to nodes.
es: Abre la escena ``mob.tscn`` nuevamente y selecciona el nodo *Mob*. Ve al panel *Nodo* a la derecha para ver una lista de señales. El panel de nodos tiene dos pestañas: *Señales*, que ya has utilizado, y *Grupos*, que te permite asignar etiquetas a los nodos.
pt_br: Abra a cena ``mob.tscn`` novamente e selecione o nó *Mob*. Vá para o painel *Nó* à direita para ver uma lista de sinais. O painel *Nó* tem duas guias: *Sinais*, que você já usou, e *Grupos*, que permite atribuir tags a nós.
zh_cn: 再次打开 ``mob.tscn`` 场景，选中 *Mob* 节点，就能在右侧的\ *Node*\ 面板中看到信号的列表。\ *Node*\ 面板有两个选项卡：你已经使用过的\ *Signals*\ ，以及\ *Groups*\ 它允许你为节点添加标签。

source: Click on it to reveal a field where you can write a tag name. Enter "mob" in the field and click the *Add* button.
de: Klicken Sie darauf, um ein Feld zu öffnen, in das Sie einen Tag-Namen eingeben können. Geben Sie "mob" in das Feld ein und klicken Sie auf die Schaltfläche *Hinzufügen*.
es: Haz clic en él para revelar un campo donde puedes escribir un nombre de etiqueta. Ingresa "mob" en el campo y haz clic en el botón *Agregar*.
fr: Cliquez dessus pour faire apparaître un champ où vous pouvez écrire un nom de tag. Entrez "mob" dans le champ et cliquez sur le bouton "Ajouter".
pt_br: Clique nele para abrir um campo onde você pode escrever um nome de tag. Digite "inimigo" no campo e clique no botão *Adicionar*.
ru: Щёлкните по нему, чтобы открыть поле, в котором можно написать имя тега. Введите в поле "mob" и нажмите кнопку *Add*.
uk: Натисніть на поле введення, щоб написати ім'я тега. Введіть в поле "mob" і натисніть кнопку *Додати*.
zh_cn: 单击这个选项卡就会出现一个输入框，可以填写标签的名称。在这个输入框中输入“mob”（小怪）并单击\ *添加*\ 按钮。

source: An icon appears in the *Scene* dock to indicate the node is part of at least one group.
de: Ein Symbol erscheint im *Szenen*-Dock, um anzuzeigen, dass der Knoten Teil mindestens einer Gruppe ist.
es: Aparece un icono en el panel de escenas para indicar que el nodo forma parte de al menos un grupo.
fr: Une icône apparaît dans le dock *Scène* pour indiquer que le nœud fait partie d'au moins un groupe.
pt_br: Um ícone aparece no painel *Cena* para indicar que o nó faz parte de pelo menos um grupo.
ru: В панели *Scene* появляется значок, указывающий на то, что узел является частью по крайней мере одной группы.
uk: У панелі *Сцена* з'являється значок, який вказує на те, що вузол є частиною принаймні однієї групи.
zh_cn: *场景*\ 面板中会出现一个图标，表示该节点至少处在一个分组之中。

source: We can now use the group from the code to distinguish collisions with monsters from collisions with the floor.
de: Wir können nun die Gruppe aus dem Code verwenden, um Kollisionen mit Monstern von Kollisionen mit dem Boden zu unterscheiden.
es: Ahora podemos usar el grupo desde el código para distinguir las colisiones con los monstruos de las colisiones con el suelo.
fr: Nous pouvons maintenant utiliser le groupe depuis le code pour distinguer les collisions des monstres des collisions avec le sol.
pt_br: Agora podemos usar o grupo do código para distinguir colisões com monstros de colisões com o chão.
ru: Теперь мы можем использовать группу из кода, чтобы отличить столкновения с монстрами от столкновений с полом.
uk: Тепер ми можемо використовувати групу в коді, щоб відрізнити зіткнення з монстрами від зіткнень з підлогою.
zh_cn: 我们现在就可以在代码中使用分组来区分与怪物的碰撞和与地板的碰撞了。

source: Coding the squash mechanic
de: Die Zerquetsch-Mechanik programmieren
es: Codificando la mecánica de aplastar
fr: Coder la mécanique d'écrasement
pt_br: Programando a mecânica de esmagar
ru: Кодирование механики давки
uk: Кодування механізму розчавлення
zh_cn: 编写踩扁机制

source: Head back to the *Player* script to code the squash and bounce.
es: Regresa al script *Player* para programar el aplastamiento y el rebote.
fr: Retournez au script *Player* pour coder l'écrasement et le rebond.
pt_br: Volte para o script *Player* para programar as ações de esmagar e saltar.
ru: Вернитесь к скрипту *Player*, чтобы закодировать давку и отскок.
uk: Поверніться до скрипта гравця *Player*, щоб закодувати розчавлення.
zh_cn: 回到 *Player* 脚本来编写踩扁和弹跳。

source: At the top of the script, we need another property, ``bounce_impulse``. When squashing an enemy, we don't necessarily want the character to go as high up as when jumping.
de: Am Anfang des Skripts brauchen wir eine weitere Variabel, ``bounce_impulse``. Wenn wir einen Feind zerquetschen, wollen wir nicht unbedingt, dass die Figur so hoch fliegt wie beim Springen.
es: En la parte superior del script, necesitamos otra propiedad llamada ``bounce_impulse``. Al aplastar a un enemigo, no queremos necesariamente que el personaje se eleve tan alto como cuando salta.
fr: En haut du script, nous avons besoin d'une autre propriété, ``bounce_impulse``. Lorsque nous écrasons un ennemi, nous ne voulons pas nécessairement que le personnage monte aussi haut que lors d'un saut.
pt_br: Na parte superior do script, precisamos de outra propriedade, ``bounce_impulse``. Ao esmagar um inimigo, não queremos necessariamente que o personagem vá tão alto quanto ao pular.
ru: В верхней части скрипта нам нужно еще одно свойство, ``bounce_impulse``. При раздавливании врага мы не обязательно хотим, чтобы персонаж поднимался так же высоко, как при прыжке.
uk: У верхній частині скрипту нам потрібна інша властивість, ``bounce_impulse``. Нам не потрібно, щоб при розчавленні ворога персонаж піднімався так високо, як при стрибках.
zh_cn: 在脚本顶部，我们需要添加一个属性 ``bounce_impulse``\ 。踩扁敌人时，我们不必让角色弹得比跳跃一样高。

source: Then, after the **Jumping** codeblock we added above in ``_physics_process()``, add the following loop. With ``move_and_slide()``, Godot makes the body move sometimes multiple times in a row to smooth out the character's motion. So we have to loop over all collisions that may have happened.
es: Luego, después del bloque de código **Jumping** en que agregamos en la parte superior de ``_physics_process()``, agrega el siguiente bucle. Con ``move_and_slide()``, Godot hace que el cuerpo se mueva multiples veces seguidas para suavizar el movimiento del personaje. Por lo tanto, debemos recorrer todas las colisiones que hayan podido ocurrir.
pt_br: Em seguida, após o bloco de código **Jumping** que adicionamos acima em ``_physics_process()``, adicione o seguinte loop. Com ``move_and_slide()``, o Godot faz o corpo se mover às vezes várias vezes seguidas para suavizar o movimento do personagem. Então, temos que fazer uma repetição sobre todas as colisões que possam ter acontecido.
zh_cn: 然后，在 ``_physics_process()`` 中添加的 **Jumping** 代码块之后，添加以下循环。使用 ``move_and_slide()`` 时，Godot 有时会连续多次移动角色身体来平滑运动。因此，我们必须循环遍历所有可能发生的碰撞。

source: In every iteration of the loop, we check if we landed on a mob. If so, we kill it and bounce.
de: In jeder Iteration der Schleife prüfen wir, ob wir auf einem Mob gelandet sind. Wenn ja, töten wir ihn und hüpfen weiter.
es: En cada iteración del bucle, comprobamos si hemos aterrizado sobre un enemigo. Si es así, lo eliminamos y rebotamos.
fr: À chaque itération de la boucle, nous vérifions que nous avons atterri sur un mob. Si c'est le cas, nous le tuons et rebondissons.
pt_br: Em cada iteração da repetição, verificamos se caímos em um inimigo. Se assim for, nós o matamos e saltamos.
ru: В каждой итерации цикла мы проверяем, приземлились ли мы на моба. Если да, то мы убиваем его и отскакиваем.
uk: У кожній ітерації петлі ми перевіряємо, чи приземлилися ми на монстра. Якщо так, то ми вбиваємо його і відскакуємо.
zh_cn: 在循环的每次迭代中，我们会检查是否落在了小怪身上。如果是的话，我们就消灭它并进行弹跳。

source: With this code, if no collisions occurred on a given frame, the loop won't run.
de: Mit diesem Code wird die Schleife nicht durchlaufen, wenn in einem bestimmten Frame keine Kollisionen aufgetreten sind.
es: Con este código, si no ocurren colisiones en un fotograma determinado, el bucle no se ejecutará.
fr: Avec ce code, si aucune collision ne s'est produite sur une image donnée, la boucle ne s'exécutera pas.
pt_br: Com este código, se nenhuma colisão ocorrer em um determinado quadro, a repetição não será executada.
ru: При таком коде, если на данном кадре не произошло ни одного столкновения, цикл не будет выполняться.
uk: За допомогою цього коду, якщо на даному кадрі не сталося зіткнень, цикл не буде запущений.
zh_cn: 如果某一帧没有发生碰撞，那么这段代码中的循环就不会执行。

source: That's a lot of new functions. Here's some more information about them.
de: Das sind eine Menge neuer Funktionen. Hier finden Sie weitere Informationen über sie.
es: Eso es un montón de nuevas funciones. Aquí tienes más información sobre ellas.
fr: Cela fait beaucoup de nouvelles fonctions. Voici quelques informations supplémentaires à leur sujet.
pt_br: São muitas funções novas. Aqui estão mais algumas informações sobre eles.
ru: Это большое количество новых функций. Вот дополнительная информация о них.
uk: Тут багато нових функцій. Ось ще трохи інформації про них.
zh_cn: 新函数很多。下面我们来进一步介绍一下。

source: The functions ``get_slide_collision_count()`` and ``get_slide_collision()`` both come from the :ref:`CharacterBody3D <class_CharacterBody3D>` class and are related to ``move_and_slide()``.
es: Las funciones ``get_slide_collision_count()`` y ``get_slide_collision()`` provienen de la clase :ref:`CharacterBody3D <class_CharacterBody3D>` y están relacionadas con ``move_and_slide()``.
pt_br: As funções ``get_slide_count()`` e ``get_slide_collision()`` ambas vêm da classe :ref:`CharacterBody3D <class_CharacterBody3D>` e estão relacionadas com ``move_and_slide()``.
zh_cn: 函数 ``get_slide_collision_count()`` 和 ``get_slide_collision()`` 都来自于 :ref:`CharacterBody3D <class_CharacterBody3D>` 类，他们与 ``move_and_slide()`` 有关。

source: ``get_slide_collision()`` returns a :ref:`KinematicCollision3D<class_KinematicCollision3D>` object that holds information about where and how the collision occurred. For example, we use its ``get_collider`` property to check if we collided with a "mob" by calling ``is_in_group()`` on it: ``collision.get_collider().is_in_group("mob")``.
es: ``get_slide_collision()`` devuelve un objeto :ref:`KinematicCollision3D<class_KinematicCollision3D>` que contiene información sobre dónde y cómo ocurrió la colisión. Por ejemplo, utilizamos su función ``get_collider()`` para verificar si hemos colisionado con un "mob" llamando a ``is_in_group()`` en él: ``collision.get_collider().is_in_group("mob")``.
pt_br: ``get_slide_collision()`` retorna um objeto :ref:`KinematicCollision3D<class_KinematicCollision3D>` que contém informações sobre onde e como ocorreu a colisão. Por exemplo, utilizamos sua propriedade ``collider`` para verificar se colidimos com um "inimigo", chamando ``is_in_group()`` no: ``collision.get_collider().is_in_group("mob")``.
zh_cn: ``get_slide_collision()`` 返回的是 :ref:`KinematicCollision3D<class_KinematicCollision3D>` 对象，包含碰撞在哪里发生、如何发生等信息。例如，我们对它的 ``get_collider`` 属性调用 ``is_in_group()`` 来检查我们是否是和“mob”发生了碰撞：\ ``collision.collider.is_in_group("mob")``\ 。

source: The method ``is_in_group()`` is available on every :ref:`Node<class_Node>`.
de: Die Methode ``is_in_group()`` ist auf jedem :ref:`Node<class_Node>` verfügbar.
es: El método ``is_in_group()`` está disponible en cada :ref:`Node<class_Node>`.
fr: La méthode ``is_in_group()`` est disponible sur chaque :ref:`Node<class_Node>`.
pt_br: O método ``is_in_group()`` está disponível em cada :ref:`Node<class_Node>`.
ru: Метод ``is_in_group()`` доступен для каждого :ref:`Node<class_Node>`.
uk: Метод ``is_in_group()`` доступний на кожному :ref:`вузлі<class_Node>`.
zh_cn: 每一个 :ref:`Node<class_Node>` 都可以使用 ``is_in_group()`` 方法。

source: To check that we are landing on the monster, we use the vector dot product: ``Vector3.UP.dot(collision.get_normal()) > 0.1``. The collision normal is a 3D vector that is perpendicular to the plane where the collision occurred. The dot product allows us to compare it to the up direction.
es: Para verificar que estamos aterrizando sobre el monstruo, usamos el producto punto de vectores: ``Vector3.UP.dot(collision.get_normal()) > 0.1``. La normal de colisión es un vector 3D que es perpendicular al plano donde ocurrió la colisión. El producto escalar nos permite compararlo con la dirección hacia arriba.
pt_br: Para verificar se estamos pousando no monstro, utilizamos o produto vetorial pontual: ``Vector3.UP.dot(collision.normal()) > 0.1``. A colisão normal é um vetor 3D que é perpendicular ao plano onde ocorreu a colisão. O produto pontal nos permite compará-lo com a direção ascendente.
zh_cn: 我们使用向量点积 ``Vector3.UP.dot(collision.get_normal()) > 0.1`` 来检查我们是不是降落在怪物身上。碰撞法线（normal）是垂直于碰撞平面的 3D 向量。可以通过点积与上方向进行比较。

source: With dot products, when the result is greater than ``0``, the two vectors are at an angle of fewer than 90 degrees. A value higher than ``0.1`` tells us that we are roughly above the monster.
de: Wenn das Ergebnis des Punktprodukts größer ist als ``0``, befinden sich die beiden Vektoren in einem Winkel von weniger als 90 Grad. Ein Wert, der größer als ``0.1`` ist, bedeutet, dass wir uns ungefähr über dem Monster befinden.
es: Con los productos escalares, cuando el resultado es mayor que ``0``, los dos vectores están en un ángulo menor a 90 grados. Un valor mayor a ``0.1`` nos indica que estamos aproximadamente encima del monstruo.
fr: Avec les produits scalaires, quand le résultat est supérieur à ``0``, les deux vecteurs forment un angle inférieur à 90 degrés. Une valeur plus grande que ``0.1`` nous indique que nous sommes à peu près au-dessus du monstre.
pt_br: Com os produtos pontuais, quando o resultado é maior que ``0``, os dois vetores estão a um ângulo inferior a 90 graus. Um valor maior que ``0.1`` nos diz que estamos aproximadamente acima do monstro.
ru: При использовании скалярных произведений, когда результат больше, чем ``0``, два вектора находятся под углом менее 90 градусов. Значение больше, чем ``0.1`` говорит нам о том, что мы находимся примерно над монстром.
uk: З точковими добутками, коли результат більший ``0``, два вектори знаходяться під кутом менше 90 градусів. Вище ``0.1`` говорить нам, що ми приблизно вище монстра.
zh_cn: 点积结果大于 ``0`` 时，两个向量的夹角小于 90 度。大于 ``0.1`` 表示我们大概位于怪物上方。

source: After handling the squash and bounce logic, we terminate the loop early via the ``break`` statement to prevent further duplicate calls to ``mob.squash()``, which may otherwise result in unintended bugs such as counting the score multiple times for one kill.
es: Después de completar la lógica de aplastado y rebote, terminaremos el bucle de manera temprana con la sentencia ``break`` para prevenir llamadas duplicadas a ``mob.squash()``, que de otro modo puede resultar en bugs inintencionales como contar el puntaje muchas veces por cada muerte.
zh_cn: 处理完踩扁和反弹逻辑后，我们通过 ``break`` 语句提前终止循环，以防止进一步重复调用 ``mob.squash()`` ，否则这可能会导致意外的错误，例如将一次击杀获得的分数算成好几倍。

source: We are calling one undefined function, ``mob.squash()``, so we have to add it to the Mob class.
es: Estamos llamando a una función indefinida, ``mob.squash()``. Tenemos que agregarla a la clase Mob.
zh_cn: 我们调用了一个尚未定义的函数 ``mob.squash()``\ 。所以我们需要把它加入到 Mob 类中。

source: Open the script ``Mob.gd`` by double-clicking on it in the *FileSystem* dock. At the top of the script, we want to define a new signal named ``squashed``. And at the bottom, you can add the squash function, where we emit the signal and destroy the mob.
de: Öffnen Sie das Skript ``Mob.gd`` durch Doppelklick im Dock *FileSystem*. Am Anfang des Skripts wollen wir ein neues Signal namens ``squashed`` definieren. Unten können Sie die Squash-Funktion hinzufügen, mit der wir das Signal ausgeben und den Mob zerstören.
es: Abre el script ``Mob.gd`` haciendo doble clic en él en el panel *Sistema de Archivos*. En la parte superior del script, queremos definir una nueva señal llamada ``squashed``. Y en la parte inferior, puedes agregar la función squash, donde emitimos la señal y destruimos el enemigo.
fr: Ouvrez le script ``Mob.gd`` en double-cliquant dessus dans le dock *Système de fichiers*. En haut du script, nous voulons définir un nouveau signal nommé ``squashed`` (écrasé). Et en bas, vous pouvez ajouter la fonction squash, d'où nous émettrons le signal et détruirons le mob.
pt_br: Abra o script ``Mob.gd`` clicando duas vezes sobre ele no painel *Sistema de Arquivos*. Na parte superior do script, queremos definir um novo sinal chamado ``squashed``. E na parte inferior, você pode adicionar a função squash, onde emitimos o sinal e destruímos o inimigo.
ru: Откройте скрипт ``Mob.gd``, дважды щёлкнув на нём в панели *FileSystem*. В верхней части скрипта мы хотим определить новый сигнал с именем ``squashed``. А внизу можно добавить функцию давки, в которой мы испускаем сигнал и уничтожаем моба.
uk: Відкрийте скрипт ``Mob.gd``, двічі клацнувши по ньому на панелі *Файлова система*. У верхній частині скрипту ми хочемо визначити новий сигнал з назвою ``squashed``. А внизу можна додати функцію розчавлення, де ми випромінюємо сигнал і руйнуємо монстра.
zh_cn: 在\ *文件系统*\ 面板中双击打开 ``Mob.gd`` 脚本。在脚本顶部，我们要定义一个新的信号叫作 ``squashed``\ （被踩扁）。你可以在底部添加 squash 函数，在里面发出这个信号并销毁这个小怪。

source: When using C#, Godot will create the appropriate events automatically for all Signals ending with `EventHandler`, see :ref:`C# Signals <doc_c_sharp_signals>`.
es: Cuando se utiliza C#, Godot deberá crear eventos apropiados autimáticamente para todas las Signals terminadas con `EventHandler`, ver :ref:`C# Signals <doc_c_sharp_signals>`.
zh_cn: 使用 C# 时，Godot 将为所有以 `EventHandler` 结尾的信号自动创建适当的事件，请参阅 :ref:`C# 信号 <doc_c_sharp_signals>`。

source: We will use the signal to add points to the score in the next lesson.
de: In der nächsten Lektion werden wir das Signal verwenden, um die Punkte zu addieren.
es: Utilizaremos la señal para agregar puntos a la puntuación en la siguiente lección.
fr: Nous utiliserons le signal pour ajouter des points au score dans la prochaine leçon.
pt_br: Usaremos o sinal para adicionar pontos à pontuação na próxima lição.
ru: Мы будем использовать сигнал для добавления очков к счёту в следующем уроке.
uk: Ми будемо використовувати сигнал, щоб додати бали до рахунку на наступному уроці.
zh_cn: 下一节课中，我们会使用这个信号来加分数。

source: With that, you should be able to kill monsters by jumping on them. You can press :kbd:`F5` to try the game and set ``main.tscn`` as your project's main scene.
es: Con eso, deberías poder eliminar monstruos saltando sobre ellos. Puedes presionar :kbd:`F5` para probar el juego y establecer ``main.tscn`` como la escena principal de tu proyecto.
pt_br: Com isso, você deve ser capaz de matar monstros pulando sobre eles. Você pode pressionar :kbd:`F5` para experimentar o jogo e definir ``main.tscn`` como cena principal do seu projeto.
zh_cn: 好了，你应该可以跳在怪物身上把它们消灭了。你可以按 :kbd:`F5` 试玩游戏，并把 ``main.tscn`` 设成项目的主场景。

source: However, the player won't die yet. We'll work on that in the next part.
de: Allerdings wird der Spieler noch nicht sterben. Daran werden wir im nächsten Teil arbeiten.
es: Sin embargo, el jugador aún no morirá. Trabajaremos en eso en la próxima parte.
fr: Cependant, le joueur ne mourra pas encore. Nous y travaillerons dans la partie suivante.
pt_br: No entanto, o jogador ainda não morre. Vamos trabalhar nisso na próxima parte.
ru: Однако игрок еще не умрёт. Мы поработаем над этим в следующей части.
uk: Однак гравець безсмертний. Ми поправимо це у наступній частині.
zh_cn: 不过玩家现在还不会死。我们会在下一部分实现。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
pt_br: Progresso da Tradução
ru: Translation status (статус перевода)
uk: Стан перекладу
zh_cn: 翻译状态

source: In this part, we'll add the ability to jump, to squash the monsters. In the next lesson, we'll make the player die when a monster hits them on the ground.
de: In diesem Teil werden wir die Fähigkeit zu Springen und Monster zu zerdrücken hinzufügen. In der nächsten Lektion werden wir den Spieler sterben lassen, wenn ihn ein Monster berührt.
fr: Dans cette partie, nous allons ajouter la possibilité de sauter, pour écraser les monstres. Dans la prochaine leçon, nous ferons en sorte que le joueur meure quand un monstre le touche au sol.
ru: В этой части мы добавим возможность прыгать, чтобы раздавить монстров. В следующем уроке мы сделаем так, чтобы игрок умирал, когда монстр ударяет его о землю.
uk: У цій частині ми додамо можливість стрибати і розчавлювати монстрів. А в наступній змусимо гравця померти, коли монстр вдарить їх на землі.
