Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/first_3d_game/07.killing_player.po
Languages: de, es, pt_br, zh_cn

source: Killing the player
de: Den Spieler töten
es: Eliminando al jugador
pt_br: Matando o Jogador
zh_cn: 杀死玩家

source: We can kill enemies by jumping on them, but the player still can't die. Let's fix this.
de: Wir können Feinde töten, indem wir auf sie springen, aber der Spieler kann trotzdem nicht sterben. Lass uns das beheben.
es: Podemos eliminar a los enemigos saltando sobre ellos, pero el jugador aún no puede morir. Arreglemos esto.
pt_br: Podemos matar inimigos pulando sobre eles, mas o jogador ainda não pode morrer. Vamos corrigir isso.
zh_cn: 我们可以通过跳到敌人身上来杀死他们，但玩家仍然不能死亡。让我们来解决这个问题。

source: We want to detect being hit by an enemy differently from squashing them. We want the player to die when they're moving on the floor, but not if they're in the air. We could use vector math to distinguish the two kinds of collisions. Instead, though, we will use an :ref:`Area3D <class_Area3D>` node, which works well for hitboxes.
pt_br: Queremos detectar ao sermos atingidos por um inimigo de uma forma diferente de esmagá-los. Queremos que o jogador morra quando estiver se movendo no chão, mas não se ele estiver no ar. Poderíamos usar matemática vetorial para distinguir os dois tipos de colisões. Ao invés disso, usaremos um nó :ref:`Area3D <class_Area3D>`, que funciona bem para as caixas de impacto (hitboxes).
zh_cn: 我们希望检测到被敌人击中与压扁敌人时的不同。我们希望玩家在地板上移动时死亡，但如果他们在空中，则不会死亡。我们可以使用向量数学来区分这两种碰撞。但是，我们将使用 :ref:`Area3D <class_Area3D>` 节点，该节点适用于命中框。

source: Hitbox with the Area node
de: Hitbox mit dem Area-Node
es: Colisión con el nodo Área
pt_br: Caixa de colisão com o nó Área
zh_cn: 使用 Area 节点制作攻击框

source: Head back to the ``player.tscn`` scene and add a new child node :ref:`Area3D <class_Area3D>`. Name it ``MobDetector`` Add a :ref:`CollisionShape3D <class_CollisionShape3D>` node as a child of it.
pt_br: Volte para a cena ``player.tscn`` e adicione um novo nó filho :ref:`Area3D <class_Area3D>`. Nomeie-o ``MobDetector``. Adicione um nó :ref:`CollisionShape3D <class_CollisionShape3D>` como filho dele.
zh_cn: 回到 ``player.tscn`` 场景，添加一个新的 :ref:`Area3D <class_Area3D>` 子节点。把它命名为 ``MobDetector``\ （小怪检测器）。添加一个 :ref:`CollisionShape3D <class_CollisionShape3D>` 节点作为它的一个子节点。

source: image0
pt_br: imagem0

source: In the *Inspector*, assign a cylinder shape to it.
es: En el *Inspector*, asígnale una forma de cilindro.
pt_br: No *Inspetor*, atribua uma forma de cilindro a ele.
zh_cn: 在\ *检查器*\ 中，给它指定一个圆柱体形状。

source: image1
pt_br: imagem1

source: Here is a trick you can use to make the collisions only happen when the player is on the ground or close to it. You can reduce the cylinder's height and move it up to the top of the character. This way, when the player jumps, the shape will be too high up for the enemies to collide with it.
es: Aquí tienes un truco que puedes usar para hacer que las colisiones solo ocurran cuando el jugador está en el suelo o cerca de él. Puedes reducir la altura del cilindro y moverlo hacia arriba hasta la parte superior del personaje. De esta manera, cuando el jugador salte, la forma estará demasiado alta para que los enemigos colisionen con ella.
pt_br: Aqui está uma dica que você pode usar para fazer as colisões só acontecerem quando o jogador estiver no chão ou perto dele. Você pode reduzir a altura do cilindro e movê-lo até o topo do personagem. Desta forma, quando o jogador pula, a forma será muito alta para os inimigos colidirem com ela.
zh_cn: 这里有一个技巧，你可以用它来使碰撞只发生在玩家在地面上或靠近地面时。你可以降低圆柱体的高度并将其向上移动到角色的顶部。这样，当玩家跳跃时，形状会太高，敌人无法与之碰撞。

source: image2
pt_br: imagem2

source: You also want the cylinder to be wider than the sphere. This way, the player gets hit before colliding and being pushed on top of the monster's collision box.
de: Außerdem soll der Zylinder breiter sein als die Kugel. Auf diese Weise wird der Spieler getroffen, bevor er kollidiert und auf das Kollisionsfeld des Monsters geschoben wird.
es: También quieres que el cilindro sea más ancho que la esfera. De esta manera, el jugador recibirá el golpe antes de colisionar y ser empujado encima de la caja de colisión del monstruo.
pt_br: Você também quer que o cilindro seja mais largo do que a esfera. Desta forma, o jogador é atingido antes de colidir e ser empurrado para cima da caixa de colisão do monstro.
zh_cn: 你还希望圆柱体比球体更宽。这样一来，玩家在碰撞之前就会被击中，并被推到怪物的碰撞盒之上。

source: The wider the cylinder, the more easily the player will get killed.
de: Je breiter der Zylinder, desto eher wird der Spieler getötet.
es: Cuanto más ancho sea el cilindro, más fácilmente el jugador será eliminado.
pt_br: Quanto mais largo o cilindro, mais facilmente o jogador será morto.
zh_cn: 圆柱体越宽，玩家就越容易被杀死。

source: Next, select the ``MobDetector`` node again, and in the *Inspector*, turn **off** its *Monitorable* property. This makes it so other physics nodes cannot detect the area. The complementary *Monitoring* property allows it to detect collisions. Then, remove the *Collision -> Layer* and set the mask to the "enemies" layer.
pt_br: Em seguida, selecione novamente o nó ``MobDetector``, e no *Inspetor*, desligue sua propriedade *Monitorável*. Isto faz com que outros nós de física não possam detectar a área. A propriedade complementar *Monitoramento* lhe permite detectar colisões. Em seguida, remover a *Colisão -> Camada* e colocar a máscara na camada "inimigos".
zh_cn: 接下来，再次选择 ``MobDetector`` 节点，并在\ *检查器*\ 中， **关闭** 其 *Monitorable* 属性。这使得其他物理节点无法检测到这个区域。补充的 *Monitoring* 属性允许它检测碰撞。然后，清除 *Collision -> Layer*\ ，并将掩码设置为“enemies”层。

source: image3
pt_br: imagem3

source: When areas detect a collision, they emit signals. We're going to connect one to the ``Player`` node. Select ``MobDetector`` and go to *Inspector*'s *Node* tab, double-click the ``body_entered`` signal and connect it to the ``Player``
pt_br: Quando as áreas detectam uma colisão, elas emitem sinais. Vamos conectar um ao nó ``Player``.Selecione ``MobDetector`` e vá para aba Nó do *Inspetor*, clique duas vezes no sinal ``body_entered`` e conecte-o ao ``Player``
zh_cn: 当区域检测到碰撞时，它们会发出信号。我们要将一个信号连接到 *Player* 节点。在\ *节点*\ 选项卡中，双击 ``body_entered`` 信号并将其连接到 *Player*\

source: image4
pt_br: imagem4

source: The *MobDetector* will emit ``body_entered`` when a :ref:`CharacterBody3D <class_CharacterBody3D>` or a :ref:`RigidBody3D <class_RigidBody3D>` node enters it. As it only masks the "enemies" physics layers, it will only detect the ``Mob`` nodes.
pt_br: O *MobDetector* irá emitir ``body_entered`` quando um :ref:`CharacterBody3D <class_CharacterBody3D>` ou um :ref:`RigidBody3D <class_RigidBody3D>` entrar nele. Como ele apenas observa as camadas físicas "inimigas", ele só detectará os nós *Inimigo*.
zh_cn: 当一个 :ref:`CharacterBody3D <class_CharacterBody3D>` 或 :ref:`RigidBody3D <class_RigidBody3D>` 节点进入它时，\ *MobDetector* 将发出 ``body_entered`` 信号。由于它只遮罩了“enemies”物理层，它将只检测 *Mob* 节点。

source: Code-wise, we're going to do two things: emit a signal we'll later use to end the game and destroy the player. We can wrap these operations in a ``die()`` function that helps us put a descriptive label on the code.
de: Code-mäßig werden wir zwei Dinge tun: Ein Signal senden welches wir später verwenden werden um das Spiel zu beenden und den Spieler zu zerstören. Wir können diese Vorgänge in eine ``die()`` Funktion verpacken um dem Code eine aussagekräftige Beschriftung zu geben.
es: En cuanto al código, vamos a hacer dos cosas: emitir una señal que luego utilizaremos para finalizar el juego y destruir al jugador. Podemos envolver estas operaciones en una función llamada ``die()`` que nos ayuda a poner una etiqueta descriptiva en el código.
pt_br: Em termos de código, faremos duas coisas: emitir um sinal que usaremos posteriormente para encerrar o jogo e destruir o jogador. Podemos agrupar essas operações em uma função ``die()`` que nos ajuda a colocar um rótulo descritivo no código.
zh_cn: 从代码上看，我们要做两件事：发出一个信号，我们以后会用来结束游戏，并销毁玩家。我们可以用 ``die()`` 函数来包装这些操作，帮助我们给代码贴上描述性标签。

source: Try the game again by pressing :kbd:`F5`. If everything is set up correctly, the character should die when an enemy runs into the collider. Note that without a ``Player``, the following line
pt_br: Teste o jogo novamente pressionando :kbd:`F5`. Se tudo estiver configurado corretamente, o personagem deve morrer quando um inimigo entrar no colisor. Note que sem um ``Player````, a seguinte linha
zh_cn: 按 :kbd:`F5` 再试一下游戏。如果一切设置正确，角色在被敌人碰到时应该会死亡

source: gives error because there is no $Player!
pt_br: dá erro porque não há $Player!
zh_cn: 由于此处没有 $Player 导致的报错！

source: Also note that the enemy colliding with the player and dying depends on the size and position of the ``Player`` and the ``Mob``\ 's collision shapes. You may need to move them and resize them to achieve a tight game feel.
pt_br: Observe também que o inimigo colidindo com o jogador e morrendo depende do tamanho e da posição das formas de colisão do ``Player`` e ``Mob``. Talvez seja necessário movê-las e redimensioná-las para conseguir uma jogabilidade mais desafiante.
zh_cn: 另外请注意，敌人与玩家碰撞并死亡取决于 ``Player`` 和 ``Mob`` 的碰撞形状的大小和位置。你可能需要移动它们，调整它们的大小，以达到紧凑的游戏感觉。

source: Ending the game
de: Das Spiel beenden
es: Finalizando el juego
pt_br: Terminando o jogo
zh_cn: 结束游戏

source: We can use the ``Player``\ 's ``hit`` signal to end the game. All we need to do is connect it to the ``Main`` node and stop the ``MobTimer`` in reaction.
pt_br: Podemos utilizar o sinal ``hit`` do ``Player`` para terminar o jogo. Tudo o que precisamos fazer é conectá-lo ao nó ``Main`` e parar a reação do ``Main``.
zh_cn: 我们可以利用 ``Player`` 的 ``hit`` 信号来结束游戏。我们所要做的就是将它连接到 ``Main`` 节点上，在处理时停止 ``MobTimer``\ 。

source: Open ``main.tscn``, select the ``Player`` node, and in the *Node* dock, connect its ``hit`` signal to the ``Main`` node.
pt_br: Abra ``main.tscn``, selecione o nó ``Player``, e no painel *Nó*, conecte seu sinal ``hit`` ao nó ``Main``.
zh_cn: 打开 ``main.tscn`` 场景，选中 ``Player`` 节点，然后在\ *节点*\ 面板中把 ``hit`` 信号连接到 ``Main`` 节点。

source: image5
pt_br: imagem5

source: Get the timer, and stop it, in the ``_on_player_hit()`` function.
pt_br: Obtenha o temporizador, e pare-o, na função ``_on_player_hit()``.
zh_cn: 在 ``_on_player_hit()`` 函数中获取并停止计时器。

source: If you try the game now, the monsters will stop spawning when you die, and the remaining ones will leave the screen.
de: Wenn Sie das Spiel jetzt testen, hören die Monster auf zu spawnen sobald Sie sterben und die verbleibenden Monster werden den Bildschirmbereich verlassen.
es: Si pruebas el juego ahora, los monstruos dejarán de aparecer cuando mueras y los que queden desaparecerán de la pantalla.
pt_br: Se você testar o jogo agora, os monstros deixarão de surgir quando você morrer, e os outros deixarão a tela.
zh_cn: 如果你现在试玩游戏，你死亡后就会停止刷怪，现有的怪物会离开屏幕。

source: You can pat yourself in the back: you prototyped a complete 3D game, even if it's still a bit rough.
de: Sie können sich selbst auf die Schulter klopfen: Sie haben einen Vollständigen Prototypen für ein 3D Spiel erstellt, auch wenn er noch etwas unfertig ist.
es: Puedes darte palmaditas en la espalda: has creado un prototipo de un juego completo en 3D, aunque todavía esté un poco áspero.
pt_br: Você pode bater palmas para você mesmo: você prototipou um jogo 3D completo, mesmo que ainda seja um pouco bruto.
zh_cn: 你可以鼓励鼓励自己了：你做出了完整 3D 游戏的原型，虽说还有点粗糙。

source: From there, we'll add a score, the option to retry the game, and you'll see how you can make the game feel much more alive with minimalistic animations.
de: Als nächstest fügen wir einen Punkestand, die Option das Spiel zu wiederholen und Sie werden sehen wie Sie mit ein paar minimalen Animationen das Spiel lebendiger gestalten können.
es: A partir de ahí, agregaremos un puntaje, la opción de volver a intentar el juego y verás cómo puedes hacer que el juego se sienta mucho más vivo con animaciones minimalistas.
pt_br: A partir daí, acrescentaremos uma pontuação, a opção de tentar novamente o jogo, e você verá como pode fazer o jogo se parecer muito mais vivo com animações minimalistas.
zh_cn: 在此基础上，我们将会添加计分、重启游戏的选项，你还会看到如何使用简单的动画让游戏变得更加活灵活现。

source: Code checkpoint
es: Codificar el checkpoint
pt_br: Programar o Ponto de controle(checkpoint)
zh_cn: 代码检查点

source: Here are the complete scripts for the ``Main``, ``Mob``, and ``Player`` nodes, for reference. You can use them to compare and check your code.
pt_br: Aqui estão os scripts completos para os nós ``Main``, ``Mob`` e ``Player``, para referência. Você pode usá-los para comparar e verificar seu código.
zh_cn: 这些是 ``Main``\ 、\ ``Mob``\ 、\ ``Player`` 节点的完整脚本，仅供参考。你可以把它们和你的代码进行对比检查。

source: Starting with ``main.gd``.
pt_br: Começando com ``main.gd``.
zh_cn: 首先是 ``main.gd``\ 。

source: Next is ``Mob.gd``.
de: Als nächstes ``Mob.gd``.
es: A continuación ``Mob.gd``.
pt_br: O próximo é ``Mob.gd``.
zh_cn: 然后是 ``Mob.gd``\ 。

source: Finally, the longest script, ``Player.gd``:
pt_br: Finalmente, o script mais longo, ``Player.gd``.
zh_cn: 最后是最长的脚本 ``Player.gd``\ ：

source: See you in the next lesson to add the score and the retry option.
de: Wir sehen uns in der nächsten Lektion, um den Punktestand und die Option das Spiel zu wiederholen hinzuzufügen.
es: Nos vemos en la próxima lección para agregar la puntuación y la opción de volver a intentarlo.
pt_br: Nos vemos na próxima lição para adicionar a pontuação e a opção de nova tentativa.
zh_cn: 在下一节课中我们会添加计分和重试选项，再见。

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
pt_br: Progresso da Tradução
zh_cn: 翻译状态

source: We want to detect being hit by an enemy differently from squashing them. We want the player to die when they're moving on the floor, but not if they're in the air. We could use vector math to distinguish the two kinds of collisions. Instead, though, we will use an *Area* node, which works well for hitboxes.
de: Wir wollen, dass ein Treffer von einem Gegner anders erkannt wird, als wenn er zerquetscht wird. Wir wollen, dass der Spieler stirbt, wenn er sich auf dem Boden bewegt, aber nicht, wenn er in der Luft ist. Wir könnten Vektormathematik verwenden, um die beiden Arten von Kollisionen zu unterscheiden. Stattdessen werden wir jedoch einen *Area* Node verwenden. Dieser funktioniert gut für Hitboxen .
es: Queremos detectar cuando somos golpeados por un enemigo de manera diferente a cuando los aplastamos. Queremos que el jugador muera cuando se mueve sobre el suelo, pero no si está en el aire. Podríamos usar matemáticas de vectores para distinguir los dos tipos de colisiones. Sin embargo, en su lugar, utilizaremos un nodo *Area*, que funciona bien para las cajas de colisión.

source: Head back to the *Player* scene and add a new *Area* node. Name it *MobDetector*. Add a *CollisionShape* node as a child of it.
de: Gehen Sie zurück zur Szene *Player* und fügen Sie einen neuen Knoten *Area* hinzu. Nennen Sie ihn *MobDetector*. Fügen Sie einen *CollisionShape* Node als untergeordnetes Element hinzu.
es: Regresa a la escena del *Player* y agrega un nuevo nodo *Área*. Nómbralo *MobDetector*. Agrega un nodo *CollisionShape* como hijo de este.

source: Next, select the *MobDetector* node again, and in the *Inspector*, turn off its *Monitorable* property. This makes it so other physics nodes cannot detect the area. The complementary *Monitoring* property allows it to detect collisions. Then, remove the *Collision -> Layer* and set the mask to the "enemies" layer.
de: Wählen Sie als Nächstes den Node *MobDetector* erneut aus, und deaktivieren Sie im *Inspector* die Eigenschaft *Monitorable*. Dadurch können andere Physiknodes den Bereich nicht erkennen. Die ergänzende Eigenschaft *Monitoring* ermöglicht es ihm, Kollisionen zu erkennen. Entfernen Sie dann die *Collision -> Layer* und setzen Sie die Maske auf die Ebene "Feinde".
es: A continuación, selecciona nuevamente el nodo *MobDetector* y en el *Inspector*, desactiva su propiedad *Monitorable*. Esto hace que otros nodos de física no puedan detectar el área. La propiedad complementaria *Monitoring* le permite detectar colisiones. Luego, elimina la conexión *Collision -> Layer* y establece la máscara en la capa "enemies".

source: When areas detect a collision, they emit signals. We're going to connect one to the *Player* node. In the *Node* tab, double-click the ``body_entered`` signal and connect it to the *Player*.
de: Wenn Bereiche eine Kollision erkennen, senden sie Signale aus. Wir werden eines der Signale mit dem *Player* Knoten verbinden. Doppelklicken Sie auf der Registerkarte *Node* auf das Signal ``body_entered`` und verbinden Sie es mit dem *Player*.
es: Cuando las áreas detectan una colisión, emiten señales. Vamos a conectar una al nodo *Player*. En la pestaña *Node*, haz doble clic en la señal ``body_entered`` y conéctala al *Player*.

source: The *MobDetector* will emit ``body_entered`` when a *KinematicBody* or a *RigidBody* node enters it. As it only masks the "enemies" physics layers, it will only detect the *Mob* nodes.
de: Der *MobDetector* gibt ``body_entered`` aus, wenn ein *KinematicBody* oder ein *RigidBody* Knoten ihn berührt. Da er nur die "Enemy"-Physikebenen maskiert, wird er nur die *Mob* Nodes erkennen.
es: El *MobDetector* emitirá ``body_entered`` cuando un nodo *KinematicBody* o *RigidBody* entre en él. Como solo tiene enmascaradas las capas de física "enemies", solo detectará los nodos *Mob*.

source: Try the game again by pressing :kbd:`F5`. If everything is set up correctly, the character should die when an enemy runs into it.
de: Testen sie das Spiel erneut indem sie :kbd:`F5` Drücken. Wenn alles richtig eingereichtet ist, sollte der Charakter sterben sobald ein Gegner gegen ihn läuft.
es: Intenta jugar de nuevo presionando :kbd:`F5`. Si todo está configurado correctamente, el personaje debería morir cuando un enemigo colisione con él.

source: However, note that this depends entirely on the size and position of the *Player* and the *Mob*\ 's collision shapes. You may need to move them and resize them to achieve a tight game feel.
de: Beachten Sie jedoch, dass dies vollständig von der Größe und Position der Kollisionsformen des *Player*\s und des *Mob*\s abhängt. Möglicherweise müssen Sie sie etwas verschieben oder ihre größe verändern, um ein gutes Spielgefühl zu erreichen.
es: Sin embargo, ten en cuenta que esto depende completamente del tamaño y la posición de las formas de colisión del *Player* y del *Mob*. Es posible que necesites moverlos y redimensionarlos para lograr una sensación de juego ajustada.

source: We can use the *Player*\ 's ``hit`` signal to end the game. All we need to do is connect it to the *Main* node and stop the *MobTimer* in reaction.
de: Wir können das Signal ``hit`` des *Player*\s verwenden um das Spiel zu beenden. Alles was wir dazu tun müssen, ist das Signal mit der *Main* Node zu verbinden und als Reaktion den *MobTimer* auszuschalten.
es: Podemos utilizar la señal ``hit`` del *Player* para finalizar el juego. Todo lo que necesitamos hacer es conectarla al nodo *Main* y detener el *MobTimer* en reacción.

source: Open ``Main.tscn``, select the *Player* node, and in the *Node* dock, connect its ``hit`` signal to the *Main* node.
de: Öffnen Sie ``Main.tscn``, wählen sie das *Player* Node und verbinden Sie in dem *Node* Panel das ``hit`` Signal mit der *Main* Node.
es: Abre ``Main.tscn``, selecciona el nodo *Player* y en el panel *Node*, conecta su señal ``hit`` al nodo *Main*.

source: Get and stop the timer in the ``_on_Player_hit()`` function.
de: Rufen Sie den Timer in der ``_on_Player_hit()`` Funktion ab und Stoppen Sie ihn.
es: Obtén y detén el temporizador en la función ``_on_Player_hit()``.

source: Here are the complete scripts for the *Main*, *Mob*, and *Player* nodes, for reference. You can use them to compare and check your code.
de: Hier sind die vollständigen Skripte der *Main*, *Mob* und *Spieler* Nodes als Referenz. Sie können sie verwenden um Ihren Code zu vergleichen und zu überprüfen.
es: Aquí están los scripts completos para los nodos *Main*, *Mob* y *Player*, como referencia. Puedes usarlos para comparar y verificar tu código.

source: Starting with ``Main.gd``.
de: Beginnend mit ``Main.gd``.
es: Empezando con ``Main.gd``.

source: Finally, the longest script, ``Player.gd``.
de: Schließlich das längste Skript, ``Player.gd``.
es: Por último, el script más largo, ``Player.gd``.
