Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/node_alternatives.po
Languages: de, es, fr, ja, ko, pt_br, uk, zh_cn, zh_tw

source: When and how to avoid using nodes for everything
de: Wann und wie vermeidet man die Verwendung von Nodes für alles
es: Cuándo y cómo evitar el uso de nodos para todo
fr: Quand et comment éviter d'utiliser des nœuds pour tout
ja: ノードの使用をさけるべき場合といろいろな方法
ko: 노드를 모든 용도로 사용하는 것을 피하는 시기와 방법
pt_br: Quando e como evitar o uso de nós para tudo
uk: Коли і як уникати використання вузлів для всього
zh_cn: 何时以及如何避免为任何事情使用节点
zh_tw: 何時以及如何避免為任何事情使用節點

source: Nodes are cheap to produce, but even they have their limits. A project may have tens of thousands of nodes all doing things. The more complex their behavior though, the larger the strain each one adds to a project's performance.
de: Nodes sind einfach zu erstellen, aber selbst sie haben ihre Grenzen. Ein Projekt kann zehntausende von Nodes haben, die alle irgendetwas tun. Je komplexer ihr Verhalten ist, desto größer ist die Belastung, da jeder einzelne zur Leistung eines Projekts beiträgt.
es: Los nodos son económicos de producir, pero incluso estos tienen sus límites. Un proyecto puede tener decenas de miles de nodos haciendo cosas. Sin embargo, cuanto más complejo es su comportamiento, mayor es la tensión que cada uno añade al rendimiento de un proyecto.
fr: Les nœuds sont bon marché à produire, mais ils ont aussi leurs limites. Un projet peut avoir des dizaines de milliers de nœuds qui font tous quelque chose. Cependant, plus leur comportement est complexe, plus la pression qu'ils exercent sur la performance d'un projet est grande.
ja: ノードは安価に作成できますが、制限があります。プロジェクトには、すべてで処理を行う数万のノードが含まれている場合があります。ただし、動作が複雑になるほど、それぞれの負荷がプロジェクトのパフォーマンスに大きく影響します。
ko: 노드는 생산하기 저렴하지만 한계가 있습니다. 한 프로젝트는 모든 작업을 하는 수 만 개의 노드로 이루어질 수 있습니다. 행동이 더 복잡할 수록, 프로젝트 성능에 추가하는 각 변형은 더 커집니다.
pt_br: Nós são baratos de produzir, mas até eles têm os seus limites. Um projeto pode ter dezenas de milhares de nós fazendo coisas. Quanto mais complexo for o seu comportamento, maior será a tensão que cada um adiciona ao desempenho de um projeto.
uk: Вузли дешеві у виробництві, але навіть вони мають свої межі. Проєкт може мати десятки тисяч вузлів, які все роблять. Чим складнішою є їх поведінка, тим більше напруження кожен з них додає до проєкту.
zh_cn: 虽然节点的创建成本很低，但是它们也有一定的局限性。一个项目可能有成千上万个节点，都各自在做事情。每个节点的行为越复杂，对项目性能增加的压力就越大。
zh_tw: 建立節點成本低，但建立節點有其限制。一個專案中可能有數以千計的節點，各司其職。當這些節點的行為越複雜，每個節點對專案效能造成的壓力就越大。

source: Godot provides more lightweight objects for creating APIs which nodes use. Be sure to keep these in mind as options when designing how you wish to build your project's features.
de: Godot bietet leichtere Objekte zum Erstellen von APIs, die von Nodes verwendet werden. Behalten Sie dies als Möglichkeit im Hinterkopf, wenn Sie festlegen wie Sie die Funktionen Ihres Projekts erstellen möchten.
es: Godot proporciona objetos más ligeros para crear APIs que los nodos utilizan. Recuerda tenerlos en cuenta como opciones a la hora de diseñar cómo deseas construir las características de tu proyecto.
fr: Godot fournit des objets plus légers pour créer des APIs qui utilisent des nœuds. N'oubliez pas qu'il s'agit d'options lorsque vous concevez la façon dont vous souhaitez construire les fonctionnalités de votre projet.
ja: Godot には、ノードが使用するAPIを作成するための、より軽量なオブジェクトが用意されています。プロジェクトの機能を構築する方法を設計する際には、これらのオプションを念頭に置いてください。
ko: Godot는 노드가 사용하는 API를 만들기 위한 더 가벼운 오브젝트를 제공합니다. 어떻게 프로젝트의 기능을 만들고 싶은 지를 설계할 때 옵션으로 다음을 명심하세요.
pt_br: O Godot fornece objetos mais leves para a criação de APIs que os nós usam. Lembre-se de ter isso em mente como opções ao projetar como deseja construir os recursos do seu projeto.
uk: Godot забезпечує більш легкі об'єкти для створення API, які використовують вузли. Обов’язково пам’ятайте про них, як про варіанти, під час розробки функцій свого проєкту.
zh_cn: Godot 为创建节点使用的 API 提供了更轻量级的对象。在设计如何构建项目的特性时，请务必将这些作为选项牢记在心。
zh_tw: Godot 有一些更輕量的物件，這些物件可以用來建立 API，並讓節點使用。在設計如何製作專案功能時，請務必記得有這個選項。

source: :ref:`Object <class_Object>`: The ultimate lightweight object, the original Object must use manual memory management. With that said, it isn't too difficult to create one's own custom data structures, even node structures, that are also lighter than the :ref:`Node <class_Node>` class.
de: :ref:`Objekt <class_Object>`: Das ultimative Lightweight-Objekt, das ursprüngliche Objekt, muss manuell verwaltet werden. Trotzdem ist es nicht allzu schwierig, eigene benutzerdefinierte Datenstrukturen zu erstellen, selbst Nodestrukturen, die auch leichter sind als die :ref:`Node <class_Node>` Klasse.
es: :ref:`Object <class_Object>`: El objeto más liviano existente, Object debe administrar la memoria manualmente. Dicho esto, no es difícil crear una estructura de datos propia, o estructura tipo nodos, que también serán más livianas que la clase :ref:`Node <class_Node>`.
fr: :ref:`Object <class_Object>` : L'objet léger ultime, l'Object original doit utiliser la gestion manuelle de la mémoire. Cela dit, il n'est pas trop difficile de créer ses propres structures de données personnalisées, même des structures de nœuds, qui sont aussi plus légères que la classe :ref:`Node <class_Node>`.
ja: :ref:`Object <class_Object>`: 究極の軽量オブジェクトであり、オリジナルのオブジェクトは手動メモリ管理を使用する必要があります。そうは言っても、\ :ref:`Node <class_Node>` クラスよりも軽い独自のカスタムデータ構造、さらにはノード構造を作成することはそれほど難しくありません。
ko: :ref:`오브젝트 <class_Object>`: 궁극의 경량 오브젝트로, 오리지널 오브젝트는 수동으로 메모리 관리를 하는데 사용해야 합니다. 말인 즉슨, 자체 맞춤 데이터 구조를 만드는 것이 그리 어렵지 않습니다, 심지어 맞춤 노드 구조도 만들 수 있는데 :ref:`노드 <class_Node>`\ 클래스보다 가볍죠.
pt_br: :ref:`Object <class_Object>`: O supremo objeto leve, o Objeto original deve usar gerenciamento manual de memória. Dito isso, não é muito difícil criar suas próprias estruturas de dados personalizadas, mesmo estruturas de nós, que também são mais leves que a classe :ref:`Node <class_Node>`.
uk: :ref:`Об'єкт <class_Object>`: Самий легкий об'єкт, оригінальний Об'єкт повинен використовувати ручне управління пам'яттю. З огляду на це, не надто складно створити свої власні структури даних, навіть структури вузлів, які також легші за клас :ref:`Вузла <class_Node>`.
zh_cn: :ref:`Object <class_Object>`\ ：终极轻量级对象，原始的 Object 必须使用手动内存管理。尽管如此，创建自己的自定义数据结构——甚至是节点结构——也并不难，并且比 :ref:`Node <class_Node>` 类更轻量。
zh_tw: :ref:`Object <class_Object>` ：終極輕量物件，原始的 Object。必須要使用手動記憶體管理。也就是說，要建立自己的自定資料結構甚至節點結構並不困難，而且也比 :ref:`Node <class_Node>` 還要輕量。

source: **Example:** See the :ref:`Tree <class_Tree>` node. It supports a high level of customization for a table of content with an arbitrary number of rows and columns. The data that it uses to generate its visualization though is actually a tree of :ref:`TreeItem <class_TreeItem>` Objects.
de: **Beispiel:** Siehe das Node :ref:`Tree <class_Tree>`. Es unterstützt ein hohes Maß an Anpassung für ein Inhaltsverzeichnis mit einer beliebigen Anzahl von Zeilen und Spalten. Die Daten, die zum Generieren der Visualisierung verwendet werden, sind tatsächlich ein Baum von :ref:`TreeItem <class_TreeItem>` Objekten.
es: **Example:** Ver el nodo :ref:`Tree <class_Tree>`. Este soporta un gran nivel de personalización para una tabla de contenidos con un número arbitrario de filas y columnas. Los datos que este usa para generar la visualización es un árbol de objetos :ref:`TreeItem <class_TreeItem>`.
fr: **Exemple :** Voir le nœud :ref:`Tree <class_Tree>`. Il supporte un haut niveau de personnalisation pour une table des matières avec un nombre arbitraire de lignes et de colonnes. Les données qu'il utilise pour générer sa visualisation sont en fait un arbre d'Objects :ref:`TreeItem <class_TreeItem>`.
ja: **例:** :ref:`Tree <class_Tree>` ノードを参照してください。任意の数の行と列を持つコンテンツテーブルの高度なカスタマイズをサポートします。ただし、視覚化の生成に使用するデータは、実際には :ref:`TreeItem <class_TreeItem>` オブジェクトのツリーです。
ko: **예시:** :ref:`트리 <class_Tree>` 노드를 참고하세요. 이 노드는 임의의 수의 행과 열이 있는 콘텐츠 테이블의 하이 레벨 맞춤 설정을 제공합니다. 시각화에 사용하는 데이터는 사실 :ref:`TreeItem <class_TreeItem>` 오브젝트들의 트리입니다.
pt_br: **Exemplo:** Veja o nó :ref:`Tree <árvore_classe>`. Ele suporta um alto nível de personalização para uma tabela de conteúdo com um número arbitrário de linhas e colunas. Os dados que ele utiliza para gerar sua visualização são na verdade uma árvore de Objetos :ref:`TreeItem <class_TreeItem>`.
uk: **Зразок**: Дивіться вузол :ref:`Дерево<class_Tree>`. Він підтримує високий рівень налаштування змісту із довільною кількістю рядків і стовпців. Дані, які він використовує для створення своєї візуалізації, насправді є деревом об'єктів :ref:`TreeItem <class_TreeItem>`.
zh_cn: **示例：**\ 参见 :ref:`Tree <class_Tree>` 节点。它支持对具有任意行数和列数的内容表，进行高级定制。用来生成可视化的数据实际上是 :ref:`TreeItem <class_TreeItem>` 对象的树。
zh_tw: **範例：** 請參考 :ref:`Tree<class_Tree>` 節點。該節點可為有任意行列的目錄進行高度客製化。用來產生視覺化的資料實際上是通過一個樹狀 :ref:`TreeItem <class_TreeItem>` 物件。

source: **Advantages:** Simplifying one's API to smaller scoped objects helps improve its accessibility and improve iteration time. Rather than working with the entire Node library, one creates an abbreviated set of Objects from which a node can generate and manage the appropriate sub-nodes.
de: **Vorteile:** Durch die Vereinfachung der API auf Objekte mit kleinerem Gültigkeitsbereich wird die Zugänglichkeit und die Iterationszeit verbessert. Anstatt mit der gesamten Node-Bibliothek zu arbeiten, wird eine abgekürzte Gruppe von Objekten erstellt, aus denen ein Node die entsprechenden Unter-Notes generieren und verwalten kann.
es: **Ventajas:** Simplificando la API propia para objetos de poco alcance, ayuda a mejorar la accesibilidad y el tiempo de iteración. En lugar de trabajar con la librería de Node completa, se crea un conjunto reducido de Objects desde donde un nodo puede generar y administrar los sub-nodos apropiados.
fr: **Avantages :** La simplification de l'API en objets de plus petite portée permet d'améliorer son accessibilité et de réduire le temps d'itération. Plutôt que de travailler avec l'ensemble de la bibliothèque Node, on crée un ensemble abrégé d'objets à partir duquel un nœud peut générer et gérer les sous-nœuds appropriés.
pt_br: **Vantagens:** A simplificação da API para objetos com escopo menor ajuda a melhorar sua acessibilidade e melhorar o tempo de iteração. Ao invés de trabalhar com toda a biblioteca de Nós, cria-se um conjunto abreviado de Objetos a partir dos quais um nó pode gerar e gerenciar os sub-nós apropriados.
uk: **Переваги:** Спрощення власного API для об’єктів меншого масштабу допомагає покращити його доступність і покращити час ітерації. Замість того, щоб працювати з усією бібліотекою Вузлів, ви створюєте скорочений набір Об’єктів, з яких вузол може генерувати та управляти відповідними під-вузлами.
zh_cn: **优势：** 将 API 简化为较小范围的对象，有助于提高其可访问性、改善迭代时间。与其使用整个 Node 库，不如创建一组简略的 Object，节点可以从这些 Object 中生成和管理相应的子节点。
zh_tw: **優點：** 簡化 API 至更小作用域的物件有助於提升存取性，並改進迭代時間。比起使用整個 Node 函式庫，不如用一組簡短的 Object 來建立子節點，讓節點可產生與管理適當的子節點。

source: One should be careful when handling them. One can store an Object into a variable, but these references can become invalid without warning. For example, if the object's creator decides to delete it out of nowhere, this would trigger an error state when one next accesses it.
de: Man sollte vorsichtig damit umgehen. Man kann ein Objekt in einer Variablen speichern, aber diese Referenzen können ohne Warnung ungültig werden. Wenn der Ersteller des Objekts beispielsweise beschließt, es aus dem Nichts zu löschen, wird beim nächsten Zugriff ein Fehlerstatus ausgelöst.
es: Hay que tener cuidado al manipularlos. Se puede almacenar un objeto en una variable, pero estas referencias pueden perder su valor sin previo aviso. Por ejemplo, si el creador del objeto decide eliminarlo de improviso, esto provocaría un estado de error al acceder a él.
fr: Il faut être prudent quand on les manipule. On peut stocker un Object dans une variable, mais ces références peuvent devenir invalides sans avertissement. Par exemple, si le créateur de l'Object décide de le supprimer, cela déclencherait un état d’erreur lorsqu’on y accède ensuite.
ja: それらを扱うときは注意が必要です。オブジェクトを変数に保存できますが、これらの参照は警告なしに無効になる可能性があります。たとえば、オブジェクトの作成者がどこからでもオブジェクトを削除することを決定した場合、その次にオブジェクトにアクセスしたときにエラー状態が発生します。
ko: 오브젝트들을 다룰 때는 조심해야 합니다. 오브젝트를 변수 안에 저장할 수 있지만, 오브젝트의 참조는 경고 없이 올바르지 않게 될 수 있습니다. 예를 들어 오브젝트의 생성자가 오브젝트를 아무 곳에도 삭제하지 않기로 결정하면, 다음에 오브젝트에 접근하려 하면 오류 상태가 발동합니다.
pt_br: Deve-se ter cuidado ao manuseá-los. É possível armazenar um Objeto em uma variável, mas essas referências podem se tornar inválidas sem aviso prévio. Por exemplo, se o criador do objeto decidir excluí-lo do nada, isso acionaria um estado de erro no próximo acesso.
uk: Потрібно бути обережним при поводженні з ними. Можна зберегти об’єкт у змінній, але ці посилання без попередження можуть стати недійсними. Наприклад, якщо творець об’єкта вирішить видалити його з нізвідки, це спричинить стан помилки, при наступній спробі отримати доступ до нього.
zh_cn: 处理它们时要小心. 可以将 ``Object`` 存储到变量中, 但是这些引用可能在没有警告的情况下失效. 例如, 如果对象的创建者决定删除它, 这将在下一次访问时, 触发错误状态.
zh_tw: 在處理這些節點時要注意。我們可以將 Object 存到變數中，但這個參照可能會在沒有警告的情況下失效。舉例來說，若物件的建立者刪除了物件，則下次存取物件的時候便會觸發警告。

source: :ref:`Reference <class_Reference>`: Only a little more complex than Object. They track references to themselves, only deleting loaded memory when no further references to themselves exist. These are useful in the majority of cases where one needs data in a custom class.
de: :ref:`Referenz <class_Reference>`: Nur etwas komplexer als ein Objekt. Sie verfolgen Verweise auf sich selbst und löschen den geladenen Speicher nur, wenn keine weiteren Verweise auf sich selbst vorhanden sind. Diese sind in den meisten Fällen nützlich, in denen Daten in einer benutzerdefinierten Klasse benötigt werden.
ja: :ref:`Reference <class_Reference>`: オブジェクトよりも少しだけ複雑です。自身への参照を追跡し、それ自体への参照がそれ以上存在しない場合にのみ、ロードされたメモリを削除します。これらは、カスタムクラスのデータが必要になるほとんどの場合に役立ちます。
ko: :ref:`참조 <class_Reference>`: 오브젝트보다 오직 조금 더 복잡함. 참조는 자신을 참조하는 지를 추적해서 더 이상 참조하지 않으면 불러온 메모리를 삭제합니다. 이는 데이터가 필요한 맞춤 클래스에 있어 대부분의 경우에 유용합니다.
uk: :ref:`Reference (Посилання) <class_Reference>`: Тільки трохи складніше за Object. Вони відстежують посилання на себе, лише видаляючи завантажену пам'ять, коли подальших посилань на них не існує. Вони корисні в більшості випадків, коли потрібні дані у власному класі.

source: **Example:** See the :ref:`File <class_File>` object. It functions just like a regular Object except that one need not delete it themselves.
de: **Beispiel:** Siehe das :ref:`File <class_File>` Objekt. Es funktioniert genau wie ein normales Objekt, nur dass man es nicht selbst löschen muss.
ja: **例:** :ref:`File <class_File>` オブジェクトを参照してください。それ自体を削除する必要がないことを除いて、通常のオブジェクトと同じように機能します。
ko: **예시:** :ref:`파일 <class_File>` 오브젝트를 참고하세요. 이것은 자기 자신을 삭제할 필요가 없다는 것 빼면 보통 오브젝트처럼 작동합니다.
uk: **Зразок:** Дивіться об'єкт :ref:`Файл <class_File>`. Функціонують так само, як звичайний Об'єкт, за винятком того, що їх не потрібно видаляти самостійно.

source: **Advantages:** same as the Object.
de: **Vorteile:** die Gleichen wie das Objekt.
es: **Ventajas:** las mismas que Object.
fr: **Avantages :** les mêmes que l'objet.
ja: **利点:** オブジェクトと同じです。
ko: **이점:** 오브젝트와 같음.
pt_br: **Vantagens:** o mesmo que o Objeto.
uk: ** Переваги: ** ті самі, що і в Об'єкта.
zh_cn: **优势:** 与 ``Object`` 相同.
zh_tw: **優點：** 與 Object 一樣。

source: :ref:`Resource <class_Resource>`: Only slightly more complex than Reference. They have the innate ability to serialize/deserialize (i.e. save and load) their object properties to/from Godot resource files.
de: :ref:`Ressource <class_Resource>`: Nur geringfügig komplexer als Referenz. Sie haben die grundlegende Fähigkeit, ihre Objekteigenschaften in / aus Godot-Ressourcendateien zu serialisieren / deserialisieren (d. H. Zu speichern und zu laden).
ja: :ref:`Resource <class_Resource>`: Referenceよりも少しだけ複雑です。それらは、Godotリソースファイルとの間でオブジェクトプロパティをシリアル化/逆シリアル化(セーブおよびロード)する固有の機能を備えています。
ko: :ref:`리소스 <class_Resource>`: 참조보다 오직 조금 더 복잡함. 리소스는 그들의 오브젝트 속성을 Godot 리소스 파일로 직렬화, 혹은 그 반대로 비직렬화하는데 타고났습니다 (예를 들어, 저장 및 불러오기).
uk: :ref:`Ресурс <class_Resource>`: Тільки трохи складніший, за Посилання. Ресурс мають вроджену здатність серіалізувати/десеріалізувати (тобто зберігати та завантажувати) властивості об’єкта до/з файлів ресурсів Godot.

source: **Example:** Scripts, PackedScene (for scene files), and other types like each of the :ref:`AudioEffect <class_AudioEffect>` classes. Each of these can be save and loaded, therefore they extend from Resource.
de: **Beispiel:** Skripte, PackedScene (für Szenendateien) und andere Typen wie die folgenden :ref:`AudioEffect <class_AudioEffect>` Klassen. Jedes dieser Elemente kann gespeichert und geladen werden, daher erweitern sie sich von Ressource.
es: **Ejemplo:** Scripts, PackedScene (para archivos de escena) y otros tipos como las clases :ref:`AudioEffect <class_AudioEffect>`. Cada uno de esos puede ser guardado y cargado, por eso extienden de Resource.
fr: **Exemple :** Scripts, PackedScene (pour les fichiers de scène), et d'autres types comme chacune des classes :ref:`AudioEffect <class_AudioEffect>`. Chacune d'entre elles peut être sauvegardée et chargée, donc elles s'étendent à partir de Resource.
ja: **例:** スクリプト、PackedScene(シーンファイル用)、および各 :ref:`AudioEffect <class_AudioEffect>` クラスのような他のタイプ。これらはそれぞれセーブおよびロードができるため、Resourceから拡張されます。
ko: **예시:** 스크립트, PackedScene (씬 파일 용), 그리고 각 :ref:`AudioEffect <class_AudioEffect>` 클래스와 같은 다른 타입들. 각각은 저장되고 불러와 질 수 있습니다. 따라서 이들은 리소스에서 분화된 것들입니다.
pt_br: **Exemplo:** Scripts, PackedScene (para arquivos de cena), e outros tipos como cada uma das classes :ref:`AudioEffect <class_AudioEffect>`. Cada uma delas pode ser salva e carregada, portanto elas se estendem de Resource.
uk: **Зразок:** Скрипти, PackedScene (для файлів сцен) та інші типи, як кожен із класів :ref:`AudioEffect <class_AudioEffect>`. Все це можна зберегти та завантажити, тому воно поширюється як ресурс.
zh_cn: **示例** : 脚本, ``PackedScene`` (用于场景文件), 以及其他类型, 比如 :ref:`AudioEffect <class_AudioEffect>` 类. 每一个都可以保存和加载, 因此它们从 ``Resource`` 扩展.
zh_tw: **範例：** Script, PackedScene (用於場景檔案) 與其他如各個 :ref:`AudioEffec <class_AudioEffect>` 類別之類的型別。這些類別都可以載入與保存，因此都是從 Resource 繼承來的。

source: **Advantages:** Much has :ref:`already been said <doc_resources>` on :ref:`Resource <class_Resource>`'s advantages over traditional data storage methods. In the context of using Resources over Nodes though, their main advantage is in Inspector-compatibility. While nearly as lightweight as Object/Reference, they can still display and export properties in the Inspector. This allows them to fulfill a purpose much like sub-Nodes on the usability front, but also improve performance if one plans to have many such Resources/Nodes in their scenes.
de: **Vorteile:** Es wurde :ref:`bereits viel <doc_resources>` über die Vorteile von :ref:`Ressource <class_Resource>` gegenüber herkömmlichen Datenspeichermethoden gesagt. Im Zusammenhang mit der Verwendung von Ressourcen gegenüber Nodes liegt ihr Hauptvorteil jedoch in der Inspektorkompatibilität. Sie sind zwar fast so leicht wie Objekte / Referenzen, können jedoch Eigenschaften im Inspektor anzeigen und exportieren. Dies ermöglicht es ihnen, einen Zweck ähnlich wie Unter-Nodes in Bezug auf die Benutzerfreundlichkeit zu erfüllen, aber auch die Leistung zu verbessern, wenn man plant, viele solcher Ressourcen / Nodes in ihren Szenen zu haben.
ja: **利点:** :ref:`Resource <class_Resource>` の従来のデータ保存方法に対する利点については、\ :ref:`既に語られています<doc_resources>`\ 。ただし、ノードよりもリソースを使用する場合の主な利点は、インスペクタの互換性です。Object/Referenceとほぼ同じくらい軽量ですが、インスペクタでプロパティを表示およびエクスポートできます。これにより、ユーザビリティの面でサブノードによく似た目的を果たすことができますが、シーンにそのようなリソース/ノードが多数ある場合はパフォーマンスも向上します。
ko: **이점:** 기본의 데이터 저장 방법보다 :ref:`리소스 <class_Resource>`\ 가 갖는 이점 대부분은 :ref:`이미 말했습니다 <doc_resources>`\ . 노드를 통한 리소스 사용의 관점에서, 주요 이점은 인스펙터(Inspecter) 호환성에 있습니다. 오브젝트/참조처럼 가벼우면서도, 리소스는 인스펙터(Inspecter)에서 볼 수 있고, 속성을 내보낼 수 있습니다. 이를 통해 사용성 측면에서 하위 노드와 같은 목적을 달성할 수 있으면서도, 씬에 그러한 리소스/노드를 갖게 한다면 성능을 향상시킬 수 있습니다.
uk: **Переваги:** Багато :ref:`вже було сказано<doc_resources>` про переваги :ref:`Ресурсів <class_Resource>` в порівнянні з більш традиційними методами зберігання даних. Однак, у контексті використання Ресурсів чи Вузлів, їх головна перевага полягає у сумісності з Інспектором. Хоча вони майже такі ж легкі, як Об'єкти/Посилання, вони все одно можуть відображати та експортувати властивості в Інспектор. Це дозволяє їм виконувати цілі, подібні до підвузлів зі сторони користувачів, а також покращувати продуктивність, якщо хтось планує мати багато таких ресурсів/вузлів у своїх сценах.

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
ko: 번역 상태
pt_br: Progresso da Tradução
uk: Стан перекладу
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: :ref:`RefCounted <class_RefCounted>`: Only a little more complex than Object. They track references to themselves, only deleting loaded memory when no further references to themselves exist. These are useful in the majority of cases where one needs data in a custom class.
es: :ref:`RefCounted <class_RefCounted>`: Sólo un poco más complicado que Object. Registran las referencias a sí mismos, borrándose de la memoria cuando no existen más referencias. Son útiles para la mayoría de los casos en que se necesitan datos en una clase personalizada.
zh_cn: :ref:`RefCounted <class_RefCounted>`\ ：只比 Object 稍微复杂一点。它们会记录对自己的引用，只有当对自己没有另外的引用存在时，才会删除加载的内存。在大多数需要在自定义类中存取数据的情况下，很有用。
zh_tw: :ref:`Reference <class_Reference>` ：只稍微比 Object 複雜一點。Reference 會追蹤自己的參照，然後只在沒有任何參照到自己時才刪除載入的記憶體。這種類別適用於大多數自定類別中需要資料的情況。

source: **Example:** See the :ref:`FileAccess <class_FileAccess>` object. It functions just like a regular Object except that one need not delete it themselves.
es: **Ejemplo:** Ver el objeto :ref:`FileAccess <class_FileAccess>`. Este funciona como un Object regular, excepto que uno no necesita borrarlo.
zh_cn: **示例：**\ 见 :ref:`FileAccess <class_FileAccess>` 对象。它的功能就像普通 Object 一样，只是不需要人为删除。
zh_tw: **範例：** 請參考 :ref:`File <class_File>` 物件。該物件的功能除了不需要手動刪除以外，就像一般的 Object 一樣。

source: :ref:`Resource <class_Resource>`: Only slightly more complex than RefCounted. They have the innate ability to serialize/deserialize (i.e. save and load) their object properties to/from Godot resource files.
es: :ref:`Resource <class_Resource>`: Algo más complejo que RefCounted. Tiene la habilidad innata de serializar/deserializar (grabar y cargar) sus propiedades desde/hacia un archivo de recursos de Godot.
zh_cn: :ref:`Resource <class_Resource>` ：只比 RefCounted 稍微复杂一点。它们天然具有将其对象属性序列化（即保存）到 Godot 资源文件，或从 Godot 资源文件中反序列化（即加载）的能力。
zh_tw: :ref:`Resource <class_Resource>` ：只比 Reference 複雜一點。Resource 自帶將自身物件屬性序列化到 Godot 資源檔案中，以及反過來從資源檔案中反序列化的能力 (即保存與載入功能)。
