Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/node_alternatives.po
Languages: de, es, fr, ja, ko, pt_br, uk, zh_cn, zh_tw

source: **Advantages:** Much has :ref:`already been said <doc_resources>` on :ref:`Resource <class_Resource>`'s advantages over traditional data storage methods. In the context of using Resources over Nodes though, their main advantage is in Inspector-compatibility. While nearly as lightweight as Object/RefCounted, they can still display and export properties in the Inspector. This allows them to fulfill a purpose much like sub-Nodes on the usability front, but also improve performance if one plans to have many such Resources/Nodes in their scenes.
es: **VEntajas:** Mucho ya :ref:`se ha mencionado anteriormente <doc_resources>` sobre las ventajas de :ref:`Resource <class_Resource>` sobre métodos tradicionales de almacenamiento de datos. En el contexto del uso de Resources sobre Nodes, mantienen la ventaja de su compatibilidad con el Inspector. Mientras son casi tan livianos como Object/RefCounted, pueden mostrar y exportar propiedades en el Inspector. Esto les permite cumplir el propósito de usabilidad de sub-nodos así como mejorar el desempeño si se planea tener muchos Resource/Node en las escenas.
zh_cn: **优势**\ ：关于 :ref:`Resource <class_Resource>` 与传统数据存储方法相比的优势\ :ref:`已经说了 <doc_resources>` 很多。然而，在使用 Resource 替代 Node 的情境下，Resource 的主要优点是与检查器的兼容性。虽然几乎和 Object/Reference 一样轻量，它们仍然可以在检查器中显示并导出属性。这使它们在易用性上，可以媲美使用子节点的方式，而且如果有人计划在其场景中包含许多这类 Resource/Node，它们还可以提高性能。
zh_tw: **優點：** 關於 :ref:`Resource <class_Resource>` 比傳統資料儲存方法相比， :ref:`已經討論過 <doc_resources>` 很多了。在使用 Resource 而不是 Node 的脈路下，主要的優點就是與屬性面板的相容性。雖然輕量程度相當於 Object 與 Reference，但 Resource 還可以在屬性面板中顯示與匯出屬性。這樣便可讓 Resource 在可用性方面來說填補子節點，也可於沒有在計劃場景中使用太多 Resource 與 Node 時提升效能。
