Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/project_organization.po
Languages: cs, de, es, fr, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Project organization
cs: Organizace projektu
de: Projekt Organisation
es: Organización del proyecto
fr: Organisation du projet
ko: 프로젝트 조직
pt_br: Organização do projeto
ru: Организация проекта
uk: Організація проєкта
zh_cn: 项目组织
zh_tw: 組織專案

source: Introduction
cs: Úvod
de: Einführung
es: Introducción
ko: 소개
pt_br: Introdução
ru: Введение
uk: Вступ
zh_cn: 前言
zh_tw: 前言

source: Since Godot has no restrictions on project structure or filesystem usage, organizing files when learning the engine can seem challenging. This tutorial suggests a workflow which should be a good starting point. We will also cover using version control with Godot.
cs: Vzhledem k tomu, že Godot nemá žádná omezení týkající se struktury projektu nebo použití souborového systému, může se uspořádání souborů při učení se enginu zdát náročné. Tento návod navrhuje pracovní postup, který by měl být dobrým výchozím bodem. Budeme se také zabývat používáním správy verzí v systému Godot.
de: Da Godot keine Einschränkungen hinsichtlich der Projektstruktur oder der Verwendung des Dateisystems hat, kann das Organisieren von Dateien beim Erlernen der Engine eine Herausforderung darstellen. Diese Anleitung schlägt einen Arbeitsablauf vor, der ein guter Ausgangspunkt sein sollte. Wir werden auch die Versionskontrolle mit Godot behandeln.
es: Como Godot no tiene restricciones en la estructura del proyecto o el uso del sistema de archivos, organizar los archivos mientras se aprende a usar el motor puede ser exigente. Este tutorial sugiere un modo de trabajo que será bueno como punto de partida. También se cubre el caso de control de versiones con Godot.
fr: Comme Godot n'a aucune restriction sur la structure du projet ou l'utilisation du système de fichiers, l'organisation des fichiers lors de l'apprentissage du moteur peut sembler difficile. Ce tutoriel propose un workflow qui devrait être un bon point de départ. Nous couvrirons également l'utilisation du contrôle de version avec Godot.
ko: Godot는 프로젝트 구조나 파일 시스템 사용에 있어 제한을 두지 않기 때문에 엔진을 배울 때, 파일을 조직하는 것은 도전적인 것처럼 보일 수 있습니다. 이 튜토리얼에서는 좋은 출발점이 될만한 워크플로를 제안합니다. 그리고 Godot로 버전 제어를 사용하는 것도 다룰 것입니다.
pt_br: Uma vez que Godot não tem nenhuma restrição na estrutura do projeto ou uso do sistema de arquivos, organizar arquivos enquanto aprendendo a engine pode parecer desafiador. Este tutorial sugere um fluxo de trabalho que deve ser um bom ponto de início. Também cobriremos o uso de controle de versão com Godot.
ru: Поскольку Godot не имеет ограничений по структуре проекта или использованию файловой системы, организация файлов при изучении движка может показаться сложной задачей. Этот учебник предлагает рабочий процесс, который должен быть хорошей отправной точкой. Мы также рассмотрим использование контроля версий с Godot.
uk: Оскільки у Godot немає обмежень щодо структури проєкту, або використання файлової системи, організація файлів під час вивчення движка може здатися складною. Цей посібник пропонує робочий процес, який повинен стати гарним стартом. Ми також розглянемо використання контролю над версіями з Godot.
zh_cn: 由于Godot对项目结构或文件系统的使用没有限制, 因此学习引擎时组织文件似乎很有挑战性. 本教程提出了一个工作流程, 应该是一个很好的起点. 我们还将介绍在Godot中使用版本控制.
zh_tw: 由於 Godot 並沒有限制專案架構與如何使用檔案系統，在學習使用 Godot 時，如何組織檔案便很有挑戰性。本教學建議的工作流程是一個不錯的開始。我們也會介紹如何配合 Godot 使用版本控制。

source: Organization
cs: Organizace
de: Organisation
es: Organización
fr: Organisation
ko: 구성
pt_br: Organização
ru: Организация
uk: Організація
zh_cn: 组织
zh_tw: 組織

source: Godot is scene-based in nature, and uses the filesystem as-is, without metadata or an asset database.
cs: Godot je primárně založen na scénách a používá souborový systém tak jak je, tj. bez metadat nebo databáze zdrojů.
de: Godot ist szenenbasiert und verwendet das Dateisystem unverändert ohne Metadaten oder eine Asset-Datenbank.
es: Godot es basado en escenas por naturaleza, y usa el sistema de archivos como tal, sin metadatos o una base de datos de recursos.
fr: Godot dans sa nature est un système de scène et utilise le système de fichiers tel quel, sans métadonnées ni base de données d'asset.
ko: Godot는 본질적으로 씬 기반이고, 파일 시스템을 메타데이터나 애셋 데이터베이스가 아닌, 있는 그대로 사용합니다.
pt_br: Godot é baseado em cenas por natureza, e usa o sistema de arquivos como ele é, sem metadados ou um banco de dados de assets.
ru: Godot по своей природе основан на сценах и использует файловую систему как есть, без метаданных или базы данных ресурсов.
uk: Godot є сценічним за своєю природою і використовує файлову систему такою, якою є, без метаданих, або бази даних ресурсів.
zh_cn: Godot本质上是基于场景的, 并按原样使用文件系统, 而没有元数据或资产数据库.
zh_tw: Godot 本質基於場景，並按照檔案系統原本的樣子來使用，不使用後設資料或素材資料庫。

source: Unlike other engines, many resources are contained within the scene itself, so the amount of files in the filesystem is considerably lower.
cs: Na rozdíl od jiných enginů je mnoho zdrojů obsaženo uvnitř scény samotné , takže množství souborů v souborovém systému je podstatně nižší.
de: Im Gegensatz zu anderen Engines sind viele Ressourcen in der Szene selbst enthalten, sodass die Anzahl der Dateien im Dateisystem erheblich geringer ist.
es: A diferencia de otros motores, muchos recursos son contenidos en la escena misma, así que la cantidad de archivos es considerablemente menor.
fr: Contrairement à d'autres moteurs, beaucoup de ressources sont contenues dans la scène même, pour que la quantité de fichiers dans le système de fichier soit considérablement réduite.
ko: 다른 엔진과 달리, 많은 리소스가 씬 자체에 내장되어 있기에, 파일 시스템에 있는 파일의 양은 상당히 적습니다.
pt_br: Ao contrário de outras engines, muitos recursos são contidos dentro da própria cena, então a quantidade de arquivos no sistema de arquivos é consideravelmente mais baixa.
ru: В отличие от других движков, многие ресурсы содержатся внутри самой сцены, поэтому количество файлов в файловой системе значительно ниже.
uk: На відміну від інших движків, багато ресурсів містяться в межах самої сцени, тому кількість файлів у файловій системі значно нижча.
zh_cn: 与其他引擎不同, 场景本身包含许多资源, 因此文件系统中的文件数量要少得多.
zh_tw: 與其他遊戲引擎不同，許多資源都包含在場景內，因此在檔案系統中的檔案數量也就比較少。

source: Considering that, the most common approach is to group assets as close to scenes as possible; when a project grows, it makes it more maintainable.
cs: Vzhledem k tomu je zvykem seskupovat prostředky co nejblíže scénám; když se projekt rozrůstá, je pak lépe udržovatelný.
de: In Anbetracht dessen besteht der gängigste Ansatz darin, Assets so nah wie möglich an Szenen zu gruppieren. Wenn ein Projekt wächst, wird es einfacher zu warten sein.
es: Considerando eso, el enfoque más común es agrupar los recursos cerca de las escenas así, cuando el proyecto crece, se hace más manejable.
fr: Compte tenu de cela, l'approche la plus courante consiste à regrouper les assets à proximité des scènes, car lorsqu'un projet se développe, cette approche le rend plus facile à gérer.
ko: 그것을 고려해보면, 가장 일반적인 접근법은 애셋들을 씬과 가능한 밀접하게 묶어내는 것입니다; 프로젝트가 커지다 보면, 프로젝트를 더 유지할 수 있게 만듭니다.
pt_br: Considerando isso, o modo mais comum de lidar com isso é agrupar recursos com as cenas, assim, quando um projeto cresce, ele fica mais gerenciável.
ru: Учитывая это, наиболее распространённым подходом является группирование ресурсов как можно ближе к сценам; когда проект начнёт расти, это упростит его обслуживание.
uk: Враховуючи це, найпоширенішим підходом є групування ресурсів якомога ближче до сцен; коли проєкт росте, це робить його акуратнішим.
zh_cn: 考虑到这一点, 最常见的方法是将资产编组得尽可能接近场景；当项目变大时, 它使其更易于维护.
zh_tw: 因此，常見的做法是儘量將素材放得靠近場景。隨著專案成長，這樣也比較容易管理。

source: As an example, one can usually place into a single folder their basic assets, such as sprite images, 3D model meshes, materials, and music, etc. They can then use a separate folder to store built levels that use them.
cs: Například do jedné složky lze obvykle umístit základní zdroje, jako jsou obrázky spritů, sítě 3D modelů, materiály, hudba atd. Samostatnou složku pak lze využít pro ukládání sestavených úrovní, které základní zdroje používají.
de: Beispielsweise kann man normalerweise seine grundlegenden Elemente wie Sprite-Bilder, 3D-Model-Meshes, Materialien und Musik usw. in einem einzelnen Ordner ablegen. Anschließend können sie in einem separaten Ordner erstellte Levels speichern, in denen sie verwendet werden.
es: Como ejemplo, normalmente puedes ubicar en una sola carpeta los recursos básicos, como imágenes, mallas de modelos 3D, materiales, música, etc. y utilizar una carpeta separada para almacenar los niveles construidos que los usan.
fr: A titre d'exemple, vous pouvez généralement placer dans un seul dossier vos assets de base, telles que les images de sprite, les maillages de modèles 3D, les matériaux, la musique, etc. Ils peuvent ensuite utiliser un dossier séparé pour stocker les niveaux construits qui les utilisent.
ko: 예를 들어, 보통은 하나의 폴더에 기본 애셋을 넣습니다, 스프라이트 이미지나, 3D 모델 메시, 머티리얼, 그리고 음악 등이죠. 그런 다음 별도의 폴더를 만들어 그것들을 사용하는 레벨을 저장할 수 있습니다.
pt_br: Como exemplo, normalmente é possível colocar em uma única pasta seus ativos básicos, como imagens de sprite, malhas de modelos 3D, materiais e música, etc. Eles podem então usar uma pasta separada para armazenar níveis construídos que os utilizam.
ru: Например, можно поместить в одну папку основные ресурсы, такие как изображения спрайтов, сетки 3D-моделей, материалы, музыку и т.д. Затем можно использовать отдельную папку для хранения созданных уровней, которые их используют.
uk: Як приклад, зазвичай можна розмістити в одній теці свої основні ресурси, такі як спрайтові зображення, 3D моделі, матеріали та музику тощо. Потім можна використовувати окрему теку для зберігання побудованих рівнів, які використовують їх.
zh_cn: 例如, 通常可以将其基本资产(例如, 精灵图像, 3D模型网格, 材质, 和音乐等)放置在一个文件夹中. 然后, 它们可以使用一个单独的文件夹来存储使用它们的构建关卡.
zh_tw: 例如，我們通常會將基本素材如 Sprite 圖片、3D 模型網格、材質與音樂…等放在單一資料夾內。接著可以使用各個不同的資料夾來儲存各個做好的關卡會使用到的素材。

source: Style guide
cs: Průvodce stylem
de: Stil-Richtlinien
es: Guía de estilo
fr: Guide de style
ko: 스타일 가이드
pt_br: Guia de Estilo
ru: Руководство по стилю
uk: Настанови по стилю
zh_cn: 风格指南
zh_tw: 風格指南

source: For consistency across projects, we recommend following these guidelines:
cs: Pro zajištění konzistence mezi projekty doporučujeme dodržovat tyto pokyny:
de: Aus Gründen der Projektkonsistenz empfehlen wir, die folgenden Richtlinien zu befolgen:
es: Para que haya coherencia entre los proyectos, recomendamos seguir estas directrices:
fr: Par souci de cohérence entre les projets, nous recommandons de suivre ces lignes directrices :
ko: 프로젝트 간의 일관성을 위해 아래의 가이드라인을 지켜주십시오:
pt_br: Para manter a consistência entre os projetos, nós recomendamos estas seguintes diretrizes:
ru: Для единообразия проектов мы рекомендуем следовать следующим советам:
uk: Для узгодженості проєктів рекомендуємо дотримуватися наступних вказівок:
zh_cn: 为了项目之间的一致性，我们建议遵循以下规范：
zh_tw: 為了在各專案間保持一貫性，我們建議依照下列方針：

source: Use **snake_case** for folder and file names (with the exception of C# scripts). This sidesteps case sensitivity issues that can crop up after exporting a project on Windows. C# scripts are an exception to this rule, as the convention is to name them after the class name which should be in PascalCase.
cs: Pro názvy složek a souborů (s výjimkou skriptů v jazyce C#) používejte **snake_case**. Tím se vyhnete problémům s citlivostí velkých a malých písmen, které se mohou objevit po exportu projektu v systému Windows. Skripty C# jsou výjimkou z tohoto pravidla, protože konvence je pojmenovat soubor podle názvu třídy, který by měl být v PascalCase.
de: Verwenden Sie **snake_case** für Ordner- und Dateinamen (mit Ausnahme von C# Skripten). Dadurch werden Probleme mit der Groß- und Kleinschreibung umgangen, die nach dem Exportieren eines Projekts unter Windows auftreten können. C# Skripte sind eine Ausnahme von dieser Regel, da die Konvention darin besteht, sie nach dem Klassennamen zu benennen, der in PascalCase geschrieben sein sollte.
es: Usa **snake_case** para los nombres de carpetas y archivos (con la excepción de los scripts C#). Esto evita los problemas de sensibilidad a las mayúsculas y minúsculas que pueden surgir después de exportar un proyecto a Windows. Los scripts de C# son una excepción a esta regla, ya que la convención es nombrarlos después del nombre de la clase que debe estar en PascalCase.
fr: Utilisez **snake_case** pour les noms de dossiers et de fichiers (à l'exception des scripts C#). Cela permet d'éviter les problèmes de sensibilité à la casse qui peuvent survenir après l'exportation d'un projet sous Windows. Les scripts C# sont une exception à cette règle, car la convention est de les nommer d'après le nom de la classe qui doit être en PascalCase.
ko: 프로젝트를 Windows에서 내보낼 때 이름이 잘리는 문제를 피하기 위해 C# 스크립트를 제외한 폴더와 파일 이름에는 **snake_case** 를 사용해주십시오. 예외적으로 C# 스크립트는 PascalCase로 작성된 클래스와 동일한 파일 이름을 가져야 하므로 PascalCase로 작성되어야 합니다.
pt_br: Use **snake_case** para nomes de pastas e arquivos (com exceção de scripts C#). Isto evita os problemas de distinção entre maiúsculas e minúsculas que podem surgir após a exportação de um projeto no Windows. Os scripts C# são uma exceção a essa regra, pois a convenção é nomeá-los após o nome da classe que deve estar em PascalCase.
ru: Используйте стиль **snake_case** для имён папок и файлов (за исключением скриптов на C#). Это позволяет обойти проблемы со стилем, которые могут появиться после экспорта проекта в Windows. Скрипты на C# являются исключением, так как по правилам этого языка должны называться по имени класса, которое должно быть в стиле PascalCase.
uk: Використовуйте **snake_case** для назв папок та файлів (за винятком скриптів C#). Це обходить проблеми з чутливістю до регістру, які можуть з’явитися після експорту проєкту в Windows. Скрипти C# є винятком із цього правила, оскільки домовленість полягає у присвоєнні їм назви класу, яка має бути в PascalCase.
zh_cn: 使用 **snake_case** 风格为文件夹和文件命名(除了c#脚本). 这避免了在 Windows 上导出项目时可能出现的大小写敏感问题.C# 脚本是这个规则的一个例外, 因为按照惯例是用类名来对它们命名, 而类名应该是 PascalCase 风格.
zh_tw: 資料夾與檔案名稱使用 **snake_case** (除了 C# 腳本例外)。這樣一來也同時解決了從 Windows 上匯出專案後可能會出現的區分大小寫功能。C# 腳本為本規則的例外，因為 C# 腳本的準則為以類別名稱命名檔名，而類別名稱應該為 PascalCase。

source: Use **PascalCase** for node names, as this matches built-in node casing.
cs: Pro názvy uzlů použijte **PascalCase**, protože to odpovídá vestavěnému zápisu uzlů.
de: Verwenden Sie **PascalCase** für Node-Namen, da dies mit der Groß-/Kleinschreibung der integrierten Nodes übereinstimmt.
es: Usa **PascalCase** para los nombres de los nodos, ya que esto coincide con la carcasa del nodo incorporado.
fr: Utilisez **PascalCase** pour les noms de nœud, car cela correspond à la casse des nœuds intégrés.
pt_br: Use **PascalCase** para nomes de nós, pois isso combina com a caixa embutida do nó.
ru: Используйте **PascalCase** для имён узлов , так как это соответствует внутреннему стилю именования узлов.
uk: Використовуйте **PascalCase** для назв вузлів, оскільки це відповідає вбудованому стилю.
zh_cn: 使用 **PascalCase** 风格对节点进行命名, 这与内置的节点大小写风格一致.
zh_tw: 節點名稱應為 **PascalCase** ，該命名方式與內建節點一樣。

source: In general, keep third-party resources in a top-level ``addons/`` folder, even if they aren't editor plugins. This makes it easier to track which files are third-party. There are some exceptions to this rule; for instance, if you use third-party game assets for a character, it makes more sense to include them within the same folder as the character scenes and scripts.
cs: Obecně platí, že prostředky třetích stran je lépe uchovávat ve vrcholové složce ``addons/``, i když se nejedná o zásuvné moduly editoru. Snadněji pak lze sledovat, které soubory patří třetí straně. Z tohoto pravidla existují výjimky; například pokud pro postavu používáte herní prostředky třetích stran, je rozumnější je zařadit do stejné složky jako scény a skripty postavy.
de: Bewahren Sie Ressourcen von Drittanbietern im Allgemeinen in einem Ordner ``addons /`` der obersten Ebene auf, auch wenn es sich nicht um Editor-Plugins handelt. Dies erleichtert das Verfolgen der Dateien von Drittanbietern. Es gibt einige Ausnahmen von dieser Regel; Wenn Sie beispielsweise Spiel-Assets von Drittanbietern für einen Charakter verwenden, ist es sinnvoller, diese in denselben Ordner wie die Charakterszenen und -skripte aufzunehmen.
es: En general, mantenga los recursos de terceros en una carpeta ``addons/`` de nivel superior, aunque no sean plugins de edición. Esto facilita el seguimiento de los archivos de terceros. Hay algunas excepciones a esta regla; por ejemplo, si utilizas recursos de juego de terceros para un personaje, tiene más sentido incluirlos dentro de la misma carpeta que las escenas y los scripts del personaje.
fr: En général, gardez les ressources tierces dans un dossier de haut niveau ``addons/``, même s'il ne s'agit pas de plugins d'éditeur. Cela facilite le suivi des fichiers tiers. Il y a quelques exceptions à cette règle ; par exemple, si vous utilisez des ressources de jeu tierces pour un personnage, il est plus logique de les inclure dans le même dossier que les scènes et les scripts du personnage.
ko: 일반적인 경우, 서드파티 리소스는 에디터 플러그인이 아니더라도 최상위의 ``addons/`` 폴더에 저장하십시오. 이렇게 하면 서드파티 파일을 찾아내는 것이 쉬워집니다. 몇 가지 예외로 서드파티 캐릭터 애셋 같은 경우가 있는데, 이 경우는 캐릭터 씬과 스크립트가 위치한 폴더에 저장하는 것이 더 직관적입니다.
pt_br: Em geral, mantenha os recursos de terceiros em uma pasta ``addons/`` de nível superior, mesmo se eles não forem plugins do editor. Isto torna mais fácil rastrear quais arquivos são de terceiros. Existem algumas exceções a esta regra; por exemplo, se você usar recursos de jogo de terceiros para um personagem, faz mais sentido incluí-los na mesma pasta que as cenas e scripts dos personagens.
ru: В общем случае храните сторонние ресурсы в папке верхнего уровня ``addons/``, даже если они не являются плагинами редактора. Это упрощает отслеживание того, какие файлы являются сторонними. Есть несколько исключений из этого правила - например, если вы используете ресурсы для персонажа из сторонней игры, есть смысл включить их в ту же папку, где находятся сцены и скрипты персонажа.
uk: Загалом, зберігайте сторонні ресурси в папці верхнього рівня ``addons/``, навіть якщо це не плагіни редактора. Це полегшує відстеження файлів сторонніх виробників. З цього правила є деякі винятки; наприклад, якщо ви використовуєте сторонні ігрові ресурси для персонажа, то має сенс включити їх до тієї самої папки, що і сцени персонажів та скрипти.
zh_cn: 通常, 将第三方资源放在顶级的 ``addons/`` 文件夹中, 即使它们不是编辑器插件. 这样更加容易跟踪哪些文件是第三方文件. 当然这个规则也有一些例外: 如果你要使用第三方游戏资源创建角色, 将这些资源和角色场景及脚本放在同一文件夹下会更好.
zh_tw: 一般來說，就算不是編輯器外掛，也儘量將第三方資源放在最上層的 ``addons/`` 資料夾中。這樣可以更容易追蹤哪些檔案是第三方。但本規則也有一些例外，如，若在角色上使用第三方遊戲素材，則放到跟角色場景與腳本相同的資料夾內比較合理。

source: Importing
cs: Import
de: Importieren
es: Importando
fr: Importation
ko: 가져오기
pt_br: Importando
ru: Импорт
uk: Імпортування
zh_cn: 导入
zh_tw: 匯入

source: Godot versions prior to 3.0 did the import process from files outside the project. While this can be useful in large projects, it resulted in an organization hassle for most developers.
cs: Verze Godot před verzí 3.0 prováděly import ze souborů mimo projekt. To sice může být užitečné u velkých projektů, ale pro většinu vývojářů to znamenalo organizační potíže.
de: Godot-Versionen vor 3.0 haben den Importvorgang aus Dateien außerhalb des Projekts durchgeführt. Während dies in großen Projekten nützlich sein kann, führte dies für die meisten Entwickler zu Organisationsproblemen.
es: La versión de Godot anterior a la 3.0 hacía el proceso de importación de archivos fuera del proyecto. Aunque esto puede ser útil en proyectos de gran tamaño, ha resultado ser una molestia en la organización del proyecto para la mayoría de los desarrolladores.
fr: Godot, dans les versions antérieures à la 3.0, réalisait le processus d'importation depuis des fichiers extérieurs au projet. Bien que cela puisse être utile pour des gros projets, cela a entraîné des problèmes d'organisation pour la plupart des développeurs.
ko: 3.0 버전 이전의 Godot에서는 프로젝트 밖에서 파일을 접근하는 것으로 가져오기를 실행했습니다. 이것이 큰 규모의 프로젝트에는 유용하지만, 대부분의 개발자들에게는 조직의 번거로움을 초래했습니다.
pt_br: Versões do Godot anteriores à 3.0 faziam o processo de importação dos arquivos fora do projeto. Embora isto possa ser útil em grandes projetos, isso resultou em problemas de organização para a maioria dos desenvolvedores.
ru: До версии 3.0 Godot импортировал ресурсы из файлов, находящихся вне проекта. Хоть это и могло быть полезно в больших проектах, но доставляло лишние хлопоты в организации проекта большинству разработчиков.
uk: Версії Godot до 3.0 виконували процес імпорту з файлів поза проєктом. Хоча це може бути корисно у великих проєктах, це створило організаційні клопоти для більшості розробників.
zh_cn: 3.0版之前的 Godot 版本从项目外的文件执行导入过程. 尽管这在大型项目中很有用, 但它给大多数开发人员带来了组织麻烦.
zh_tw: Godot 3.0 版以前，匯入流程會從專案外部讀取檔案。雖然對於大型專案來說很好用，但對許多開發者來說卻難以組織。

source: Because of this, assets are now transparently imported from within the project folder.
cs: Z tohoto důvodu jsou nyní prostředky transparentně importovány ze složky projektu.
de: Aus diesem Grund werden Assets jetzt aus dem Projektordner importiert.
es: A razón de esto, los recursos ahora son importados desde dentro de la carpeta del proyecto, transparentemente.
fr: Pour cette raison, les assets sont maintenant importées de manière transparente à partir du dossier du projet.
ko: 이 때문에, 애셋은 이제 프로젝트 폴더 내에서 투명하게 가져옵니다.
pt_br: Por causa disso, os assets agora são importados de dentro da pasta do projeto de forma transparente.
ru: Поэтому теперь ресурсы прозрачно импортируются из папки проекта.
uk: Через це ресурси тепер прозоро імпортуються з папки проєкту.
zh_cn: 因此，现在可以从项目文件夹中透明地导入资产。
zh_tw: 因此，素材現在可以在專案資料夾內透明地匯入。

source: Ignoring specific folders
cs: Ignorování určitých složek
de: Bestimmte Ordner ignorieren
es: Ignorando carpetas específicas
fr: Ignorer des dossiers spécifiques
ko: 특정 폴더를 무시하기
pt_br: Ignorando pastas específicas
ru: Игнорирование определённых папок
uk: Ігнорування конкретних папок
zh_cn: 忽略具体文件夹
zh_tw: 忽略特定資料夾
