Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/best_practices/project_organization.po
Languages: cs, de, es, fr, ko, pt_br, ru, uk, zh_cn, zh_tw

source: To prevent Godot from importing files contained in a specific folder, create an empty file called ``.gdignore`` in the folder (the leading ``.`` is required). This can be useful to speed up the initial project importing.
cs: Chcete-li Godotu zabránit v importu souborů obsažených v určité složce, vytvořte v této složce prázdný soubor s názvem ``.gdignore`` (počáteční znak ``.`` je nutný). To může být užitečné pro urychlení počátečního importu projektu.
de: Um zu verhindern, dass Godot Dateien importiert die in einem bestimmten Ordner enthalten sind, erstellen Sie eine leere Datei mit dem Namen ``.gdignore`` im Ordner (der anführende Punkt ``.`` ist erforderlich). Dies kann nützlich sein um den ersten Projektimport zu beschleunigen.
es: Para evitar que Godot importe archivos contenidos en una carpeta específica, cree un archivo vacío llamado ``.gdignore`` en la carpeta (se requiere el `` .`` inicial). Esto puede ser útil para acelerar la importación inicial del proyecto.
fr: Pour empêcher Godot d'importer des fichiers contenus dans un dossier spécifique, créez un fichier vide appelé ``.gdignore`` dans le dossier (le premier ``.`` est requis). Ceci peut être utile pour accélérer l'importation initiale du projet.
ko: Godot이 특정 폴더의 파일을 가져오는 것을 막으려면 ``.gdignore`` 라는 이름의 빈 파일을 폴더에 생성하면 됩니다(위와 같이 이름 앞에 ``.`` 이 들어가야 합니다). 이렇게 하면 프로젝트를 빠르게 가져올 수 있습니다.
pt_br: Para evitar que Godot importe arquivos contidos em uma pasta específica, crie um arquivo vazio chamado ``.gdignore`` na pasta (o início ``.`` é necessário). Isso pode ser útil para acelerar a importação inicial do projeto.
ru: Чтобы запретить Godot импортировать файлы, содержащиеся в определённой папке, создайте в этой папке пустой файл с именем ``.gdignore`` (именно с точкой в начале). Это может оказаться полезным для ускорения первоначального импорта проекта.
uk: Щоб Godot не імпортував файли, що містяться в певній теці, створіть в ній порожній файл, який називається ``.gdignore``(крапка ``.`` обов'язкова). Це може бути корисно для пришвидшення імпорту початкового проєкту.
zh_cn: 为防止 Godot 导入特定文件夹中的文件, 请在文件夹中创建一个名为 ``.gdignore`` 的空文件(以 ``.`` 号开头). 这对于加快初始项目导入非常有用.
zh_tw: 若要防止 Godot 從特定資料夾內匯入檔案，可於該資料夾內建立一個空白檔案 ``.gdignore`` (必須以 ``.`` 開頭)。對於初始專案來說能有效提高速度。

source: To create a file whose name starts with a dot on Windows, place a dot at both the beginning and end of the filename (".gdignore."). Windows will automatically remove the trailing dot when you confirm the name.
es: Para crear un archivo que inicia con punto en Windows, coloca un punto al inicio y al final del archivo (".gdignore."). Windows removerá automaticamente el punto al final cuando confirmes el nombre.
zh_cn: 要在 Windows 上创建文件名以点开头的文件，请在文件名的前后都写一个点（“.gdignore.”）。确认之后 Windows 会自动移除末尾的点。

source: Alternatively, you can use a text editor such as Notepad++ or use the following command in a command prompt: ``type nul > .gdignore``
es: Para crear un archivo cuyo nombre empiece con un punto en Windows, puedes usar un editor de texto como Notepad++ o usar el siguiente comando en el símbolo del sistema: ``type nul > .gdignore``
zh_cn: 你也可以使用文本编辑器来创建它，例如记事本。或在命令提示符中输入以下命令：``type nul > .gdignore``

source: Once the folder is ignored, resources in that folder can't be loaded anymore using the ``load()`` and ``preload()`` methods. Ignoring a folder will also automatically hide it from the FileSystem dock, which can be useful to reduce clutter.
cs: Jakmile je složka ignorována, prostředky v této složce již nelze načíst pomocí metod ``load()`` a ``preload()``. Ignorování složky ji také automaticky skryje z doku FileSystem, což může být užitečné pro snížení nepořádku.
de: Sobald der Ordner ignoriert wird, können die Ressourcen in diesem Ordner nicht mehr mit den Methoden ``load()`` und ``preload()`` geladen werden. Außerdem wird der Ordner im Dateisystem-Panel verborgen, wodurch Unordnung vermieden werden kann.
es: Una vez que se ignora una carpeta, los recursos en esa carpeta ya no se pueden cargar utilizando los métodos ``load()`` y ``preload()``. Ignorar una carpeta también la ocultará automáticamente en el panel del Sistema de Archivos (FileSystem dock), lo cual puede ser útil para reducir el desorden.
fr: Une fois que le dossier est ignoré, les ressources de ce dossier ne peuvent plus être chargées en utilisant les méthodes ``load()`` et ``preload()``. Ignorer un dossier le masquera aussi automatiquement dans le dock FileSystem, ce qui peut être utile pour réduire l'encombrement.
ko: 폴더가 무시된 상태라면 ``load()`` 혹은 ``preload()`` 메서드를 사용해서 리소스를 로딩하는 것이 불가능하며, 파일시스템 독에서 표시되지 않습니다. 불필요한 데이터를 줄이는데 유용합니다.
pt_br: Uma vez ignorada a pasta, os recursos dessa pasta não podem mais ser carregados utilizando os métodos ``load()`` e ``preload()``. Ignorar uma pasta também irá escondê-la automaticamente no painel Sistema de Arquivos, o que pode ser útil para reduzir a desordem.
uk: Після того, як тека буде проігнорована, ресурси в ній вже не можна завантажувати за допомогою методів ``load()`` і ``preload()``. Ігнорування теки також автоматично приховає її з панелі Файлової системи, що може бути корисно для зменшення безладу.
zh_cn: 一旦文件夹被忽略，其中资源就不能再使用 ``load()`` 和 ``preload()`` 方法加载。被忽略文件夹会从文件系统栏目中隐藏，从而减少混乱。
zh_tw: 忽略資料夾後，於該資料夾內的資源將不再可用 ``load()`` 與 ``preload()`` 方法載入。

source: Note that the ``.gdignore`` file's contents are ignored, which is why the file should be empty. It does not support patterns like ``.gitignore`` files do.
de: Beachten Sie, dass der Inhalt der Datei ``.gdignore`` ignoriert wird, weshalb die Datei leer sein sollte. Sie unterstützt keine Muster wie die ``.gitignore``-Dateien.
es: Cabe destacar que el contenido del archivo ``.gdignore`` es ignorado, por lo que este archivo debe estar vacío. No admite patrones como lo hacen los archivos ``.gitignore``.
fr: Notez que le contenu du fichier ``.gdignore``est ignoré, cela explique pourquoi il devrait être vide. Il ne supporte pas les modèles comme le font les fichiers ``.gitignore``.
ko: ``.gdignore`` 파일은 ``.gitignore`` 처럼 패턴을 지원하지 않고 그냥 내용이 무시되므로 파일의 내용은 비워두는게 좋습니다.
pt_br: Observe que o conteúdo do arquivo ``.gdignore`` é ignorado, razão pela qual o arquivo deve estar vazio. Ele não suporta padrões como os arquivos ``.gitignore``.
uk: Зауважте, що вміст файлу ``.gdignore`` ігнорується, тому файл має бути порожнім. Він не підтримує шаблони, як файли ``.gitignore``.
zh_cn: 请注意 ``.gdignore`` 文件的内容会被忽略，因此该文件应当为空。它不像 ``.gitignore`` 文件一样支持模式匹配。
zh_tw: 請注意 ``.gdignore`` 檔的內容會被忽略，因此該檔應當為空。它不像 ``.gitignore`` 檔一樣支援模式配對。

source: Case sensitivity
cs: Citlivost na velikost písmen
de: Groß- und Kleinschreibung beachten
es: Sensibilidad a mayúsculas
fr: Sensibilité à la casse
ko: 대소문자 구분
pt_br: Sensibilidade de caixa
ru: Чувствительность к регистру
uk: Чутливість до регістру
zh_cn: 大小写敏感
zh_tw: 區分大小寫

source: Windows and recent macOS versions use case-insensitive filesystems by default, whereas Linux distributions use a case-sensitive filesystem by default. This can cause issues after exporting a project, since Godot's PCK virtual filesystem is case-sensitive. To avoid this, it's recommended to stick to ``snake_case`` naming for all files in the project (and lowercase characters in general).
cs: Systém Windows a nejnovější verze systému macOS používají ve výchozím nastavení souborový systém NErozlišující malá a velká písmena, zatímco linuxové distribuce ve výchozím nastavení souborového systému velká a malá písmena rozlišují. To může způsobit problémy při exportu projektu, protože virtuální souborový systém PCK systému Godot malá a velká písmena rozlišuje . Abyste se tomu vyhnuli, doporučujeme pojmenování dle ``snake_case`` pro všechny soubory v projektu (a malá písmena obecně ).
de: Windows und neuere MacOS-Versionen verwenden standardmäßig Dateisysteme, bei denen die Groß- und Kleinschreibung nicht berücksichtigt wird, während Linux-Distributionen standardmäßig ein Dateisystem verwenden, bei dem die Groß- und Kleinschreibung berücksichtigt wird. Dies kann nach dem Exportieren eines Projekts zu Problemen führen, da das virtuelle PCK-Dateisystem von Godot zwischen Groß- und Kleinschreibung unterscheidet. Um dies zu vermeiden wird empfohlen, bei allen Dateien im Projekt (und bei Kleinbuchstaben im Allgemeinen) die Bezeichnung "snake_case" beizubehalten.
es: Windows y recientes versiones de macOS usan sistemas de archivos no sensibles a mayúsculas por defecto, mientras que las distribuciones Linux usan un sistema de archivos sensible a mayúsculas por defecto. Esto puede causar problemas al exporta run proyecto ya que el sistema de archivos virtual de Godot, PCK, es sensible a mayúscylas. Para prevenir esto, es recomendado apegarse a un ``snake_case`` al nombrar todos los archivos del proyecto (y en minúsculas en general).
fr: Les versions Windows et MacOS récentes utilisent par défaut des systèmes de fichiers insensibles à la casse, tandis que les distributions Linux utilisent par défaut un système de fichiers sensible à la casse. Cela peut causer des problèmes après l'exportation d'un projet, puisque le système de fichiers virtuel PCK de Godot est sensible à la casse. Pour éviter cela, il est recommandé de s'en tenir au nommage ``snake_case`` pour tous les fichiers du projet (et les caractères minuscules en général).
ko: Windows와 최근 macOS 버전들은 Linux 배포판들과 반대로 대소문자 구분이 없는 파일시스템을 기본적으로 사용합니다. Godot의 PCK 파일시스템은 대소문자를 구분하므로 프로젝트를 내보낸 후 문제가 발생할 수 있는데, 프로젝트의 모든 파일 ``snake_case`` (와 소문자들)를 사용해 이런 문제를 예방하는 것을 권장합니다.
pt_br: Windows e versões recentes do macOS usam sistemas de arquivos sem sensibilidade de caixa por padrão, enquanto distribuições Linux usam um sistema de arquivo com sensibilidade de caixa por padrão. Isto pode causar problemas após exportar um projeto, já que o sistema de arquivos virtual do PCK do Godot tem sensibilidade de caixa, para evitar isto, é recomendado manter a nomeação ``snake_case`` para todos os arquivos no projeto (e caracteres minúsculos em geral).
ru: Windows и современные версии macOS используют по умолчанию файловые системы, нечувствительные к регистру; в отличие от них дистрибутивы Linux используют по умолчанию файловые системы, чувствительные к регистру. Это может вызвать проблемы после экспорта проекта, так как PCK - виртуальная файловая система Godot - чувствительна к регистру. Чтобы избежать этого, рекомендуется использовать стиль ``snake_case`` (и строчные буквы в целом) для именования всех файлов проекта.
uk: У Windows та останніх версіях macOS за замовчуванням використовуються нечутливі до регістру файлові системи, тоді як у дистрибутивах Linux за замовчуванням використовується чутлива до регістру файлова система. Це може спричинити проблеми після експорту проєкту, оскільки віртуальна файлова система PCK Godot чутлива до регістру. Щоб цього уникнути, рекомендується дотримуватися стилю snake_case для іменування усіх файлів у проєкті (та малих символів загалом).
zh_cn: Windows 和最近版本的 macOS 默认使用不区分大小写的文件系统，而 Linux 发行版默认使用区分大小写的文件系统。由于 Godot 的 PCK 虚拟文件系统区分大小写，因此在导出项目后可能会导致问题。为了避免这种情况，建议对项目中的所有文件都使用 ``snake_case`` 蛇形命名法（一般使用小写）。
zh_tw: Windows 與近期的 macOS 版本預設使用不區分大小寫的檔案系統，而 Linux 發行版則預設使用有區分大小寫的檔案系統。由於 Godot 的 PCK 虛擬檔案系統是區分大小寫的，對於匯出專案來說會導致問題。要避免大小寫問題，建議保持專案內所有檔案都使用 ``snake_case`` (並主要使用小寫文字)。

source: You can break this rule when style guides say otherwise (such as the C# style guide). Still, be consistent to avoid mistakes.
cs: Toto pravidlo můžete porušit, pokud příručky stylů říkají něco jiného (například příručka stylů jazyka C#). Přesto buďte důslední, abyste se vyhnuli chybám.
de: Sie können diese Regel brechen, wenn Stil-Richtlinien etwas anderes sagen (z.B. C# Stil-Richtlinien). Seien Sie dennoch konsequent, um Fehler zu vermeiden.
es: Puedes romper esta regla cuando la guia de estilos diga lo contrario (como la guía de estilos de C#). Aún así, mantente consistente para evitar errores.
fr: Vous pouvez enfreindre cette règle lorsque les guides de style disent le contraire (comme le guide de style C#). Néanmoins, soyez cohérent pour éviter les erreurs.
ko: C# 스타일 가이드라인처럼 스타일 가이드라인에 예외가 있다면 이 규칙을 깨도 됩니다. 하지만 실수하지 않도록 일관성을 유지하십시오.
pt_br: Você pode quebrar esta regra quando os guias de estilo dizem o contrário (como o guia de estilo C#). Ainda assim, seja consistente para evitar erros.
ru: Вы можете нарушать это правило, когда руководства по стилю говорят иное (например, руководство по стилю C#). И всё же будьте последовательны, чтобы избежать ошибок.
uk: Ви можете порушити це правило, коли в керівництві по стилю рекомендує інше (наприклад, в посібник зі стилю C#). Однак будьте послідовними, щоб уникнути помилок.
zh_cn: 当风格指南中另有说明时, 可以不遵守此规则(如C#样式指南). 不过, 记得保持一致性, 避免出错.
zh_tw: 當風格指南另有規定時，便可不遵守此規則 (如 C# 風格指南)。但，應維持一致性以避免犯錯。

source: On Windows 10, to further avoid mistakes related to case sensitivity, you can also make the project folder case-sensitive. After enabling the Windows Subsystem for Linux feature, run the following command in a PowerShell window::
cs: Chcete-li se v systému Windows 10 dále vyhnout chybám souvisejícím s rozlišováním velkých a malých písmen, můžete také nastavit, aby se ve složce projektu velká a malá písmena rozlišovala . Po povolení funkce Subsystém Windows pro Linux spusťte v okně prostředí PowerShell následující příkaz::
de: Unter Windows 10 können Sie den Projektordner auch zwischen Groß- und Kleinschreibung unterscheiden lassen, um Fehler im Zusammenhang mit der Groß- und Kleinschreibung zu vermeiden. Führen Sie nach dem Aktivieren der Windows-Subsystem für Linux-Funktion den folgenden Befehl in einem PowerShell-Fenster aus:
es: En Windows 10, para evitar errores relacionado a la sensibilidad a mayúsculas, puedes convertir la carpeta en sensible a mayúsculas. Después de habilitar el Windows Subsystem for Linux, ejecuta el siguiente comando en una ventana PowerShell::
fr: Sous Windows 10, pour éviter les erreurs liées à la sensibilité à la casse, vous pouvez également rendre le dossier du projet sensible à la casse. Après avoir activé la fonction Sous-système Windows pour Linux, exécutez la commande suivante dans une fenêtre PowerShell :
ko: Windows 10의 경우, 대소문자 구분과 관련된 실수를 방지하기 위해 프로젝트 폴더가 대소문자를 구분하도록 만들 수도 있습니다. Linux용 Windows 하위 시스템 기능을 활성화 한 후, PowerShell 창에 다음 명령을 입력하십시오::
pt_br: No Windows 10, para evitar ainda mais erros relacionados à sensibilidade de caixa, você também pode fazer a pasta do projeto suportar sensibilidade. Após ativar o recurso Subsistema Windows para Linux, execute o seguinte comando em uma janela do PowerShell::
ru: В Windows 10, чтобы в дальнейшем избежать ошибок, связанных с чувствительностью к регистру, вы также можете сделать папку проекта чувствительной к регистру. После включения функции Windows Subsystem for Linux выполните следующую команду в окне PowerShell::
uk: У Windows 10, щоб уникнути помилок, пов’язаних з чутливістю до регістру, ви також можете зробити папку проєкту чутливою до регістру. Увімкнувши функцію Windows Subsystem для Linux, запустіть таку команду у вікні PowerShell:
zh_cn: 在 Windows 10 上，为了进一步避免与大小写敏感性相关的错误，你还可以让项目文件夹区分大小写。启用 Windows 的 Linux 子系统特性后，在 PowerShell 窗口中运行以下命令： ::
zh_tw: 為了 Windows 10 中避免區分大小寫的錯誤，也可以將專案資料夾中設定成有區分大小寫。開啟用於 Linux 的 Windows 子系統 (WSL) 後，請於 PowerShell 中執行下列指令：

source: If you haven't enabled the Windows Subsystem for Linux, you can enter the following line in a PowerShell window *running as Administrator* then reboot when asked::
cs: Pokud jste nepovolili podsystém Windows pro Linux, můžete do okna prostředí PowerShell *spuštěného jako správce* zadat následující řádek a po výzvě restartovat počítač::
de: Wenn Sie das Windows-Subsystem für Linux nicht aktiviert haben, können Sie die folgende Zeile in ein PowerShell-Fenster eingeben, das *als Administrator ausgeführt* wird und dann neu starten, wenn Sie dazu aufgefordert werden:
es: Si no tienes habilitado el Windows Subsystem for Linux, puedes poner la siguiente línea en una ventana PowerShell *ejecutándose como Administrador*, después reinicia cuando el sistema pregunte::
fr: Si vous n'avez pas activé le sous-système Windows pour Linux, vous pouvez entrer la ligne suivante dans une fenêtre PowerShell *en tant qu'administrateur* puis redémarrer lorsque l'on vous le demande :
ko: Linux용 Windows 하위 시스템을 활성화하지 않았다면, Powershell에서 아래의 명령을 *관리자 권한으로 실행* 한 후 재부팅 알림이 나올 때 재부팅하는 방법도 있습니다::
pt_br: Se você não habilitou o Subsistema Windows para Linux, você pode inserir a seguinte linha em uma janela do PowerShell *executando como Administrador* e reinicializar quando solicitado::
ru: Если у вас не включён компонент Windows Subsystem for Linux, вы можете ввести в PowerShell, *запущенный от имени администратора*, следующее (для вступления изменений в силу потребуется перезагрузка)::
uk: Якщо ви не ввімкнули Windows Subsystem для Linux, ви можете ввести наступний рядок у вікні PowerShell, що *працює від імені адміністратора*, а потім перезавантажити на запит:
zh_cn: 如果你还没有启用 Windows 的 Linux 子系统，可以在 PowerShell 窗口中输入以下代码\ *以管理员权限运行*\ 然后重启： ::
zh_tw: 若尚未啟用用於 Linux 的 Windows 子系統，請 **以系統管理員身份執行** PowerShell 並輸入下列指令，接著將會詢問是否重開機：

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ko: 번역 상태
pt_br: Progresso da Tradução
ru: Статус перевода
uk: Стан перекладу
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: To create a file whose name starts with a dot on Windows, you can use a text editor such as Notepad++ or use the following command in a command prompt: ``type nul > .gdignore``
de: Um eine Datei zu erstellen, deren Name unter Windows mit einem Punkt beginnt, können Sie einen Texteditor wie Notepad++ verwenden oder den folgenden Befehl in einer Eingabeaufforderung verwenden: ``type nul> .gdignore``
