Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/vertex_animation/controlling_thousands_of_fish.po
Languages: es, ja

source: Controlling thousands of fish with Particles
es: Controlando miles de peces con Partículas
ja: パーティクルで数千の魚を制御する

source: The problem with :ref:`MeshInstances <class_MeshInstance>` is that it is expensive to update their transform array. It is great for placing many static objects around the scene. But it is still difficult to move the objects around the scene.
es: El problema con :ref:`MeshInstances <class_MeshInstance>` es que resulta complicado actualizar su array de transformación. Es genial para colocar muchos objetos estáticos alrededor de la escena. Pero sigue siendo difícil mover los objetos alrededor de la escena.
ja: :ref:`MeshInstances <class_MeshInstance>` の問題は、transform配列を更新するのにコストがかかることです。シーンの周囲に多くの静的オブジェクトを配置するのには最適です。ただし、オブジェクトをシーン内で移動することは依然として困難です。

source: To make each instance move in an interesting way, we will use a :ref:`Particles <class_Particles>` node. Particles take advantage of GPU acceleration by computing and setting the per-instance information in a :ref:`Shader <class_Shader>`.
es: Para hacer que cada instancia se mueva de forma interesante, usaremos un nodo :ref:`Particles <class_Particles>`. Las partículas aprovechan la aceleración de la GPU calculando y configurando la información por instancia en un :ref:`Shader <class_Shader>`.

source: Particles are not available in GLES2, instead use :ref:`CPUParticles <class_CPUParticles>`, which do the same thing as Particles, but do not benefit from GPU acceleration.
es: Las partículas no están disponibles en GLES2, en su lugar usa :ref:`CPUParticles <class_CPUParticles>`, que hacen lo mismo que las partículas, pero no se benefician de la aceleración de la GPU.
ja: ParticlesはGLES2では使用できません。代わりに :ref:`CPUParticles <class_CPUParticles>` を使用します。これはParticlesと同じことを行いますが、GPUアクセラレーションの恩恵は受けません。

source: First create a Particles node. Then, under "Draw Passes" set the Particle's "Draw Pass 1" to your :ref:`Mesh <class_Mesh>`. Then under "Process Material" create a new :ref:`ShaderMaterial <class_ShaderMaterial>`.
es: Primero crea un nodo de Partículas. Luego, bajo "Draw Passes" establece el "Draw Pass 1" de la Partícula a tu :ref:`Mesh <class_Mesh>`. Luego en "Process Material" crea un nuevo :ref:`ShaderMaterial <class_ShaderMaterial>`.
ja: 最初にParticlesノードを作成します。次に、\ ``Draw Passes`` の下で、パーティクルの ``Draw Pass 1`` を :ref:`Mesh <class_Mesh>` に設定します。次に、[Process Material]の下に新しい :ref:`ShaderMaterial <class_ShaderMaterial>` を作成します。

source: Set the ``shader_type`` to ``particles``.
es: Ponga el ``shader_type`` a ``particles``.
ja: ``shader_type`` を ``particles`` に設定します。

source: Then add the following two functions:
es: A continuación, añade dos funciones:
ja: 続いて、次の2つの関数を追加します:

source: These functions come from the default :ref:`ParticlesMaterial <class_ParticlesMaterial>`. They are used to generate a random number from each particle's ``RANDOM_SEED``.
es: Estas funciones vienen por defecto :ref:`ParticlesMaterial <class_ParticlesMaterial>`. Se usan para generar un número aleatorio para ``RANDOM_SEED`` de partícula.

source: A unique thing about particle shaders is that some built-in variables are saved across frames. ``TRANSFORM``, ``COLOR``, and ``CUSTOM`` can all be accessed in the Spatial shader of the mesh, and also in the particle shader the next time it is run.
es: Una cosa única de los shaders de partículas es que algunas variables incorporadas se guardan a través de los fotogramas. ``TRANSFORM``, ``COLOR``, y ``CUSTOM`` pueden ser accedidas en al Spatial shader de la malla, y también en el shader de partículas la próxima vez que se ejecuta.

source: Next, setup your ``vertex`` function. Particles shaders only contain a vertex function and no others.
es: A continuación, configura tu función ``vertex``. Los shaders de partículas sólo contienen una función de vértice y ninguna otra.
ja: 次に、\ ``vertex`` 関数をセットアップします。パーティクルシェーダーには頂点関数のみが含まれ、その他は含まれません。

source: First we will distinguish between code that needs to be run only when the particle system starts and code that should always run. We want to give each fish a random position and a random animation offset when the system is first run. To do so, we wrap that code in an ``if`` statement that checks the built-in variable ``RESTART`` which becomes ``true`` for one frame when the particle system is restarted.
es: Primero distinguiremos entre el código que necesita ser ejecutado sólo cuando el sistema de partículas se inicia y el código que siempre debe ejecutarse. Queremos darle a cada pez una posición aleatoria y un desplazamiento de animación aleatorio cuando el sistema se ejecuta por primera vez. Para ello, envolvemos ese código en una declaración ``if`` que comprueba la variable incorporada ``RESTART`` que se convierte en ``true`` para un fotograma cuando el sistema de partículas es reiniciado.

source: From a high level, this looks like:
es: Desde un alto nivel, esto parece:
ja: 大まかに言えば、次のようになります:

source: Next, we need to generate 4 random numbers: 3 to create a random position and one for the random offset of the swim cycle.
es: A continuación, necesitamos generar 4 números al azar: 3 para crear una posición aleatoria y uno para el desplazamiento aleatorio del ciclo de natación.
ja: 次に、4つの乱数を生成する必要があります。3つはランダムな位置を作成し、1つは遊泳サイクルのランダムなオフセットを作成します。

source: First, generate 4 seeds inside the ``RESTART`` block using the ``hash`` function provided above:
es: Primero, genera 4 semillas dentro del bloque ``RESTART`` usando la función ``hash`` proporcionada arriba:
ja: まず、上記の ``hash`` 関数を使用して ``RESTART`` ブロック内に4つのシードを生成します:

source: Then, use those seeds to generate random numbers using ``rand_from_seed``:
es: Luego, usa esas semillas para generar números aleatorios usando ``rand_from_seed``:
ja: 次に、これらのシードを使用して、\ ``rand_from_seed`` を使用して乱数を生成します:

source: Finally, assign ``position`` to ``TRANSFORM[3].xyz``, which is the part of the transform that holds the position information.
es: Finalmente, asigna la ``position`` a `TRANSFORM[3].xyz``, que es la parte de la transformación que contiene la información de la posición.
ja: 最後に、位置情報を保持するtansformの一部である ``TRANSFORM[3].xyz`` に ``position`` を割り当てます。

source: Remember, all this code so far goes inside the ``RESTART`` block.
es: Recuerda, todo este código hasta ahora va dentro del bloque ``RESTART``.
ja: これまでのこのコードはすべて、\ ``RESTART`` ブロックの内部にあることに注意してください。

source: The vertex shader for your mesh can stay the exact same as it was in the previous tutorial.
es: El shader de vértices para su malla puede permanecer exactamente igual que en el tutorial anterior.
ja: メッシュの頂点シェーダーは、前のチュートリアルとまったく同じままにすることができます。

source: Now you can move each fish individually each frame, either by adding to the ``TRANSFORM`` directly or by writing to ``VELOCITY``.
es: Ahora puedes mover cada pez individualmente en cada fotograma, ya sea agregando a la ``TRANSFORM`` directamente o escribiendo ``VELOCITY``.
ja: これで、\ ``TRANSFORM`` に直接追加するか、\ ``VELOCITY`` に書き込むことで、各魚をフレームごとに個別に移動できます。

source: Let's transform the fish by setting their ``VELOCITY``.
es: Transformemos a los peces estableciendo su ``VELOCITY``.
ja: 魚の ``VELOCITY`` を設定して魚を変身させましょう。

source: This is the most basic way to set ``VELOCITY`` every particle (or fish) will have the same velocity.
es: Esta es la forma más básica de establecer la ``VELOCITY``, cada partícula (o pez) tendrá la misma velocidad.
ja: これは、すべてのパーティクル(または魚)が同じ速度を持つように ``VELOCITY`` を設定する最も基本的な方法です。

source: Just by setting ``VELOCITY`` you can make the fish swim however you want. For example, try the code below.
es: Con sólo con poner ``VELOCITY`` puedes hacer que los peces naden como tú quieras. Por ejemplo, intenta el código inferior.
ja: ``VELOCITY`` を設定するだけで、好きなように魚を泳がせることができます。たとえば、次のコードを試してください。

source: This will give each fish a unique speed between ``2`` and ``10``.
es: Esto le dará a cada pez una velocidad única entre ``2`` y ``10``.
ja: これにより、各魚に ``2`` と ``10`` の間のユニークな速度が与えられます。

source: If you used ``CUSTOM.y`` in the last tutorial, you can also set the speed of the swim animation based on the ``VELOCITY``. Just use ``CUSTOM.y``.
es: Si usaste ``CUSTOM.y`` en el último tutorial, también puedes ajustar la velocidad de la animación de natación basada en la ``VELOCITY``. Sólo usa ``CUSTOM.y``.
ja: 前回のチュートリアルで ``CUSTOM.y`` を使用した場合、\ ``VELOCITY`` に基づいて遊泳アニメーションの速度を設定することもできます。\ ``CUSTOM.y`` を使用してください。

source: This code gives you the following behavior:
es: Este código proporciona el siguiente comportamiento:
ja: このコードは、次の動作を提供します:

source: Using a ParticlesMaterial you can make the fish behavior as simple or complex as you like. In this tutorial we only set Velocity, but in your own Shaders you can also set ``COLOR``, rotation, scale (through ``TRANSFORM``). Please refer to the :ref:`Particles Shader Reference <doc_particle_shader>` for more information on particle shaders.
es: Usando un ParticlesMaterial puedes hacer que el comportamiento de los peces sea tan simple o complejo como quieras. En este tutorial sólo establecemos la Velocidad, pero en tus propios shaders también puedes establecer el ``COLOR``, la rotación, la escala (a través de ``TRANSFORM``). Por favor, consulta la :ref:`Particles Shader Reference <doc_particle_shader>` para más información sobre los shaders de partículas.
ja: ParticlesMaterialを使用すると、魚の動作を好きなだけ単純または複雑にすることができます。このチュートリアルでは、Velocityのみを設定しますが、独自のシェーダーでは、\ ``COLOR``\ 、回転、スケール(``TRANSFORM`` を使用)も設定できます。パーティクルシェーダーの詳細については、\ :ref:`パーティクルシェーダーリファレンス <doc_particle_shader>` を参照してください。
