Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/portals/rooms_and_portals_example.po
Languages: es, fr, ru, uk, zh_cn

source: Create different types of geometry. CSG nodes, Particle systems, and Multimeshes are all supported by the portal system.
es: Crea diferentes tipos de geometría. Los nodos CSG, los sistemas de partículas y las mallas múltiples son compatibles con el sistema de portales.
fr: Créez différents types de géométrie. Les nœuds CSG, les systèmes de particules, et les Multimeshes sont pris en charge par le système de portail.
ru: Создавайте различные типы геометрии. Узлы CSG, системы частиц и мультимеши - все они поддерживаются портальной системой.
uk: Створення різних типів геометрії. Вузли CSG, системи частинок і Мультимеші підтримуються системою порталів.
zh_cn: 创建不同类型的几何体。入口系统支持 CSG 节点、粒子系统和多重网格。

source: Try creating a Camera and adding it to the scene. If you run the scene you will notice that the portal culling is not active. This is because the ``room graph`` must be created each time you load a level, by converting the rooms. Instead of using a button in the editor, in real games you call a function in the RoomManager to convert the level, called ``rooms_convert()``. Try this out with a script, perhaps running within a ``_ready()`` function.
es: Intenta crear una cámara y añadirla a la escena. Si ejecutas la escena, notarás que el descarte de los portales no está activo. Esto se debe a que el ``gráfico de salas`` debe crearse cada vez que cargas un nivel, convirtiendo las salas. En lugar de utilizar un botón en el editor, en los juegos reales se llama a una función en el RoomManager para convertir el nivel, llamada ``rooms_convert()``. Prueba esto con un script, tal vez ejecutándolo dentro de una función ``_ready()``.
fr: Essayez de créer une Caméra et de l'ajouter à la scène. Si vous lancez la scène, vous remarquerez que le culling du portail n'est pas actif. C'est parce que le ``graphe de salles`` doit être créé à chaque fois que vous chargez un niveau, en convertissant les salles. Plutôt que d'utiliser un bouton dans l'éditeur, dans les vrais jeux, vous appelez une fonction dans le RoomManager pour convertir le niveau, appelée ``rooms_convert()``. Essayez-la avec un script, peut-être en l'exécutant à l'intérieur d'une fonction ``_ready()``.
ru: Попробуйте создать камеру и добавить ее в сцену. Если вы запустите сцену, вы заметите, что выборка порталов не активна. Это происходит потому, что портал ``room graph`` должен создаваться каждый раз при загрузке уровня путем преобразования комнат. Вместо того чтобы использовать кнопку в редакторе, в реальных играх вы вызываете функцию в RoomManager для преобразования уровня, называемую ``rooms_convert()``. Попробуйте сделать это с помощью скрипта, возможно, запущенного внутри функции ``_ready()``.
uk: Спробуйте створити камеру і додати її на сцену. Якщо ви запустите сцену, ви помітите, що вибракування порталу не є активним. Це тому, що необхідно створювати ``room graph`` кожен раз, коли ви завантажуєте рівень, перетворюючи кімнати. Замість того, щоб використовувати кнопку в редакторі, в реальній грі ви викликаєте функцію в RoomManager для перетворення рівня, яка називається ``rooms_convert()``. Спробуйте це за допомогою скрипта, запустивши її в рамках функції ``_ready()``.
zh_cn: 尝试创建相机并将其添加到场景中。如果运行场景，您会注意到入口剔除未处于活动状态。这是因为每次加载关卡时都必须通过转换房间来创建房间数据 ``room graph``\ 。在实际游戏中，您无需在编辑器中使用按钮，而是通过 RoomManager 调用函数来转换关卡， ``rooms_convert()``\ 。使用脚本试用此内容，也许是在 ``_ready()`` 函数中运行。

source: The geometry you created so far is all ``STATIC`` (non-moving). If you look in the inspector for geometry nodes, you will see they derive from ``CullInstance``. Here you can set the **Portal Mode** for objects in the portal system. This determines how the node is processed.
es: La geometría que has creado hasta ahora es toda ``STATIC`` (no se mueve). Si miras en el inspector de los nodos de geometría, verás que derivan de ``CullInstance``. Aquí puedes establecer el **Modo de Portal** para los objetos en el sistema de portales. Esto determina cómo se procesa el nodo.
fr: La géométrie que vous avez créé jusqu'à présent est toujours ``STATIC`` (non mobile). Si vous regardez dans l'inspecteur des nœuds de géométrie, vous verrez qu'ils dérivent de ``CullInstance``. Ici vous pouvez définir le **Portal Mode** pour les objets du système de portail. Cela détermine la façon dont le nœud est traité.
ru: Геометрия, которую вы создали до сих пор, состоит из ``STATIC`` (не движущаяся). Если вы посмотрите в инспекторе на узлы геометрии, вы увидите, что они происходят от ``CullInstance``. Здесь вы можете установить **Portal Mode** для объектов в портальной системе. Это определяет, как будет обрабатываться узел.
uk: Геометрія, яку ви створили має режим ``STATIC`` (не рухається). Якщо ви подивитеся в інспектор для геометрії вузлів, ви побачите, що ці режими в ``CullInstance``. Тут ви можете встановити режим порталу **Portal Mode** для об'єктів в системі порталів. Вони визначають спосіб обробки вузла.
zh_cn: 到目前为止，你创建的几何体都是 ``STATIC``\ （非移动的）。如果在检查器中查看几何体节点，你会看到它们源自 ``CullInstance``\ 。你可以为入口系统中的对象设置\ **入口模式**\ ，其决定了节点的处理方式。

source: If you now write a script to move one of your objects within a room and view it through a Camera as the scene runs, you may notice that the object gets culled incorrectly. This is because ``STATIC`` objects are assumed not to move in the system. If you instead change the object to ``DYNAMIC``, it should now update the culling correctly.
es: Si ahora escribes un script para mover uno de tus objetos dentro de una sala y lo ves a través de una cámara mientras se ejecuta la escena, es posible que notes que el objeto se descarta incorrectamente. Esto se debe a que se asume que los objetos ``STATIC`` no se mueven en el sistema. Si en cambio cambias el objeto a ``DYNAMIC``, ahora debería actualizarse el descarte correctamente.
fr: Si vous écrivez maintenant un script pour déplacer un de vos objets dans une salle et que vous le visualisez à travers une Caméra pendant que la scène s'exécute, vous pouvez remarquer que l'objet est affecté par le culling de manière incorrecte. C'est parce que les objets ``STATIC`` ne sont pas supposés bouger dans le système. Si vous changez plutôt l'objet en ``DYNAMIC``, le culling devrait maintenant se mettre à jour correctement.
ru: Если вы сейчас напишете сценарий для перемещения одного из ваших объектов в пределах комнаты и просмотрите его через камеру во время выполнения сцены, вы можете заметить, что объект выбраковывается неправильно. Это происходит потому, что предполагается, что объекты ``STATIC`` не перемещаются в системе. Если вместо этого вы измените объект на ``DYNAMIC``, то теперь он будет обновлять выборку правильно.
uk: Якщо ви зараз пишете скрипт для переміщення одного з ваших об'єктів у кімнаті та перегляду його через камеру, під час запуску сцени, ви можете помітити, що об'єкт неправильно вибраковується. Це пов'язано з тим, що передбачається, що об'єкти ``STATIC`` не рухаються в системі. Зміна на ``DYNAMIC`` дасть правильне вибракування.
zh_cn: 如果你现在写一个脚本，在房间里移动一个对象，并在场景运行时，通过相机查看，你可能会注意到这个对象被错误地剔除了。这是因为 ``STATIC`` 对象被认为不会在系统中移动。如果你把这个对象改为 ``DYNAMIC`` 后，应该能正确地更新剔除。

source: There are several ``portal_modes``, these are described in the main documentation.
es: Existen varios``portal_modes`` que están descritos en la documentación principal.
fr: Il existe plusieurs ``portal_modes``, ils sont décrits dans la documentation principale.
ru: Есть несколько ``portal_modes``, которые описаны в документации.
uk: Режимів порталів кілька , вони описані в основній документації.
zh_cn: 有几种 ``portal_modes`` ，在主文档中有描述。

source: Try turning the portal on and off at runtime from your script. You can call ``set_portal_active()`` to open and close the portal.
es: Intenta activar y desactivar el portal durante la ejecución desde tu script. Puedes llamar a ``set_portal_active()`` para abrir y cerrar el portal.
fr: Essayez d'activer et de désactiver le portail au moment de l'exécution à partir d'un script. Vous pouvez appeler ``set_portal_active()`` pour ouvrir et fermer le portail.
ru: Попробуйте включать и выключать портал во время выполнения из вашего сценария. Вы можете вызвать ``set_portal_active()`` для открытия и закрытия портала.
uk: Спробуйте ввімкнути та вимкнути портал під час виконання скрипта. Ви можете викликати ``set_portal_active()``, щоб відкрити і закрити портал.
zh_cn: 试着在运行时，从脚本中调用 ``set_portal_active()`` 来打开和关闭入口。

source: If you select the portal, you should see 4 handles appear. Try dragging the portal points with the mouse, and see how it affects the objects that are culled.
es: Si seleccionas el portal, deberías ver que aparecen 4 manipuladores. Intenta arrastrar los puntos del portal con el ratón y observa cómo afecta a los objetos que se descartan.
fr: Si vous sélectionnez le portail, vous devriez voir 4 poignées apparaître. Essayez de déplacer les points du portail avec la souris, et de voir comment ça affecte les objets qui sont affectés par le culling.
ru: При выделении портала должны появиться 4 ручки. Попробуйте перетащить точки портала с помощью мыши и посмотрите, как это повлияет на объекты, которые будут выбраковываться.
uk: Якщо вибрати портал, з'явиться 4 дескриптори. Спробуйте перетягнути точки порталу за допомогою мишки, і подивитися, як це впливає на об'єкти, які вибраковуються.
zh_cn: 如果你选择了入口，应该可能看到出现4个手柄。试着用鼠标拖动入口的点，看看它对被剔除的对象有什么影响。

source: If you select a room and click the **Generate Points** button in the toolbar, it will store the points of the room hull in the room inspector. You can now edit these with the gizmo handles.
es: Si seleccionas una sala y haces clic en el botón **Generate Points** en la barra de herramientas, se guardarán los puntos del casco de la habitación en el inspector de la sala. Ahora puedes editar estos puntos con los manipuladores del gizmo.
fr: Si vous sélectionnez une salle et que vous cliquez sur le bouton **Générer des points** dans la barre d'outils, il stockera les points de l'enveloppe de la salle dans l'inspecteur de la salle. Vous pouvez maintenant les modifier avec les poignées du gadget.
ru: Если выделить помещение и нажать кнопку **Generate Points** на панели инструментов, то точки корпуса помещения будут сохранены в инспекторе помещений. Теперь их можно редактировать с помощью ручек.
uk: Якщо ви виберете кімнату та натиснете кнопку **Згенерувати точки** на панелі інструментів, вона зберігатиме точки корпусу кімнати в інспекторі кімнати. Тепер ви можете редагувати їх за допомогою дескрипторів gizmo.
zh_cn: 如果你选择一个房间并点击工具栏上的\ **Generate Points**\ 按钮，它将把房间外体的点储存在房间的检查器中。你现在可以用辅助工具手柄来编辑这些点。

source: Translation status
es: Estado de traducción
fr: État de la traduction
ru: Translation status (статус перевода)
uk: Стан перекладу
