Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/3d/portals/rooms_and_portals_example.po
Languages: es, fr, ru, uk, zh_cn

source: Rooms and Portals example
es: Ejemplo de Portales y Salas
fr: Exemple de Salles et de Portails
ru: Пример комнат и порталов
uk: Зразок Кімнат і Порталів
zh_cn: 房间和入口示例

source: Download this tutorial project: `Simple Portals Example <https://github.com/lawnjelly/godot-demo-projects/tree/portals_simple_demo/3d/portals/room_and_portals_simple_example>`_ .
es: Descarga este proyecto de tutorial: `Ejemplo de Portales Simple <https://github.com/lawnjelly/godot-demo-projects/tree/portals_simple_demo/3d/portals/room_and_portals_simple_example>`_.
fr: Téléchargez ce projet tutoriel : `Exemple Simple de Portails <https://github.com/lawnjelly/godot-demo-projects/tree/portals_simple_demo/3d/portals/room_and_portals_simple_example>`_ .
ru: Загрузите этот учебный проект: `Пример простых порталов <https://github.com/lawnjelly/godot-demo-projects/tree/portals_simple_demo/3d/portals/room_and_portals_simple_example>`_.
uk: Завантажте цей навчальний проект: `Простий Зразок Порталів <https://github.com/lawnjelly/godot-demo-projects/tree/portals_simple_demo/3d/portals/room_and_portals_simple_example>`_ .
zh_cn: 下载此简单入口实例教程项目: `Simple Portals Example <https://github.com/lawnjelly/godot-demo-projects/tree/portals_simple_demo/3d/portals/room_and_portals_simple_example>`_ 。

source: Introduction
es: Introducción
ru: Введение
uk: Вступ
zh_cn: 前言

source: This tutorial will introduce you to building a "Hello World" room system with two rooms, and a portal in between.
es: Este tutorial te guiará en la construcción de un sistema de salas "Hola Mundo" con dos salas y un portal en medio.
fr: Ce tutoriel vous initiera à la construction d'un système de salle "Hello World" avec deux salles, et un portail entre les deux.
ru: Этот туториал ознакомит Вас с созданием системы комнат "Hello World" с двумя комнатами и порталом между ними.
uk: Цей урок познайомить вас зі створенням системи кімнат "Hello World" з двома кімнатами та порталом між ними.
zh_cn: 本教程将向你介绍如何建立有两个房间的 "Hello World" 房间系统，以及中间的入口。

source: Step 1
es: Paso 1
fr: Étape 1
ru: Шаг 1
uk: Крок 1
zh_cn: 第一步

source: Create a new project.
es: Creando un nuevo proyecto.
fr: Créer un nouveau projet.
ru: Создайте новый проект.
uk: Створіть новий проект.
zh_cn: 创建新项目。

source: Add a :ref:`Spatial<class_Spatial>` as the scene root (on the screenshot, it's called "Root").
es: Agrega un :ref:`Spatial<class_Spatial>` como raíz de la escena (en la captura de pantalla, se llama "Root").
fr: Ajoutez un :ref:`Spatial<class_Spatial>` comme racine de la scène (sur la capture d'écran, il est nommé "Root").
ru: Добавьте :ref:`Spatial<class_Spatial>` в качестве корня сцены (на скриншоте он называется "Root").
uk: Додайте вузол :ref:`Spatial<class_Spatial>` *(Просторовий)*, як корінь сцени (на скріншоті він називається "Root" *(Корінь)*).
zh_cn: 添加一个 :ref:`Spatial<class_Spatial>` 作为场景根节点（截图里称作“Root”）。

source: Next add a :ref:`RoomManager<class_RoomManager>` node. We will need this later to process the room system.
es: A continuación, agrega un nodo :ref:`RoomManager<class_RoomManager>`. Lo necesitaremos más adelante para procesar el sistema de salas.
fr: Ajoutez ensuite un nœud :ref:`RoomManager<class_RoomManager>`. Nous en aurons besoin plus tard pour gérer le système de salles.
ru: Затем добавьте узел :ref:`RoomManager<class_RoomManager>`. Он понадобится нам позже для обработки системы комнат.
uk: Далі додайте вузол :ref:`RoomManager<class_RoomManager>` *(Керівник кімнат)*. Нам знадобиться він пізніше, щоб обробити систему приміщень.
zh_cn: 然后添加一个 :ref:`RoomManager<class_RoomManager>` 节点。我们后面处理房间系统时会用到。

source: Next we need to start defining our rooms. We create all our rooms under another Spatial we have called 'RoomList'.
es: A continuación, necesitamos empezar a definir nuestras salas. Creamos todas nuestras salas debajo de otro nodo Spatial que hemos llamado 'RoomList'.
fr: Ensuite, nous devons commencer à définir nos salles. Nous créons toutes nos salles sous un autre Spatial que nous avons appelé 'RoomList'.
ru: Далее нам нужно начать определять наши комнаты. Мы создадим все наши комнаты в другом пространстве, которое мы назвали 'RoomList'.
uk: Далі ми повинні почати визначати наші кімнати. Ми створюємо всі наші кімнати під іншим просторовим вузлом, який назвемо "RoomList" *(Список кімнат)*.
zh_cn: 然后我们就要开始定义我们的房间了。我们在另一个叫做“RoomList”（房间列表）的 Spatial 节点下创建房间。

source: Add a new :ref:`Room<class_Room>` node as a child of the roomlist.
es: Agrega un nuevo nodo :ref:`Room<class_Room>` como hijo de "RoomList".
fr: Ajoutez un nouveau nœud :ref:`Room<class_Room>` comme enfant de la RoomList.
ru: Добавьте новый узел :ref:`Room<class_Room>` в качестве дочернего элемента roomlist.
uk: Додайте в список кімнат вузол :ref:`Room<class_Room>` *(Кімната)*.
zh_cn: 新建一个 :ref:`Room<class_Room>` 节点作为房间列表的子节点。

source: We have named the room ``Kitchen``.
es: Hemos llamado a la habitación ``Cocina``.
fr: Nous avons nommé la salle ``Kitchen`` (Cuisine).
ru: Назовём комнату ``Kitchen``.
uk: Ми назвали кімнату ``Kitchen`` *(Кухня)*.
zh_cn: 我们把这个房间命名为 ``Kitchen``\ （厨房）。

source: We will now create the geometry of our room. The names you give to the geometry is up to you.
es: Ahora crearemos la geometría de nuestra sala. Los nombres que le des a la geometría dependen de ti.
fr: Nous allons maintenant créer la géométrie de notre salle. Vous pouvez donner les noms que vous souhaitez à la géométrie.
ru: Теперь мы создадим геометрию нашей комнаты. Названия, которые вы дадите геометрии, зависят от вас.
uk: Тепер ми створимо геометрію нашої кімнати. Імена, які ви даєте геометрії, залежить від вас.
zh_cn: 我们现在来创建这个房间的几何体。几何体的名字你可以随便起。

source: Create a :ref:`MeshInstance<class_MeshInstance>` for the floor. Create a box by adding a CubeMesh resource to the MeshInstance. Scale and position it to form a floor.
es: Crea un :ref:`MeshInstance<class_MeshInstance>` para el suelo. Agrega un recurso de CubeMesh al MeshInstance para crear una caja. Escala y posiciona la caja para formar un suelo.
fr: Créez un :ref:`MeshInstance<class_MeshInstance>` pour le sol. Créez une boîte en ajoutant une ressource CubeMesh au MeshInstance. Changez sa taille et sa position pour former un sol.
ru: Создайте :ref:`MeshInstance<class_MeshInstance>` для пола. Создайте коробку, добавив ресурс CubeMesh к MeshInstance. Масштабируйте и позиционируйте его, чтобы сформировать пол.
uk: Створіть :ref:`MeshInstance<class_MeshInstance>` *(Екземпляр Меша)* для підлоги. Створіть коробку, додавши ресурс CubeMesh в MeshInstance. Масштабуйте і розташуйте його так, щоб утворилася підлога.
zh_cn: 创建一个 :ref:`MeshInstance<class_MeshInstance>` 作为地板。先给 MeshInstance 添加一个 CubeMesh 资源形成盒子，然后缩放平移成地板的样子。

source: Create MeshInstances for the walls. Create more box meshes for this, then scale and position them. Be sure to leave an opening on one side. You will need to create two wall segments to do this on that side.
es: Crea instancias de malla (:ref:`MeshInstance<class_MeshInstance>`) para las paredes. Crea más cajas para esto, luego escala y posiciona cada una de ellas. Asegúrate de dejar una apertura en un lado. Para lograrlo, deberás crear dos segmentos de pared en ese lado.
fr: Créez des MeshInstances pour les murs. Créez plus d'autres CubeMesh pour ça, puis changer leur taille et leur position. Assurez-vous de laisser une ouverture sur un côté. Vous devrez créer deux segments de mur pour le faire sur ce côté.
ru: Создайте MeshInstance для стен. Создайте несколько сеток в форме прямоугольных параллелепипедов (box meshes), затем измените их масштаб и позицию. Убедитесь, что на одной стороне остаётся открытый проход. Для этого вам потребуется создать два сегмента стены.
uk: Створіть екземпляри мешів для стін. Створіть для цього більше коробчастих мешів, а потім масштабуйте та розташуйте їх. Обов'язково залиште отвір з одного боку. Для цього потрібно буде створити два сегменти стіни.
zh_cn: 为墙壁添加几个 MeshInstance。创建的应该也是盒子网格，然后缩放平移即可。记得留一个开口，开口那一面墙需要分两段。

source: Step 2
es: Paso 2
fr: Étape 2
ru: Шаг 2
uk: Крок 2
zh_cn: 第二步

source: Now we need to create the other room.
es: Ahora tenemos que crear la otra habitación.
fr: Maintenant, nous devons créer l'autre pièce.
ru: Теперь нужно создать другую комнату.
uk: Тепер нам потрібно створити іншу кімнату.
zh_cn: 现在我们需要创建另一个房间。

source: You can do this simply by duplicating the first room (select the ``Kitchen`` node, right click and choose **Duplicate**).
es: Puedes hacer esto simplemente duplicando la primera sala. Selecciona el nodo ``Cocina``, haz clic derecho y elige **Duplicar**.
fr: Vous pouvez le faire simplement en dupliquant la première salle (sélectionnez le nœud ``Kitchen``, faîtes un clic droit et choisissez **Dupliquer**).
ru: Это можно сделать, просто продублировав первую комнату (выберите узел ``Kitchen``, щелкните правой кнопкой мыши и выберите **Duplicate**).
uk: Зробити це можна просто, дублюючи першу кімнату (виберіть вузол ``Kitchen``, клацніть правою кнопкою мишки і виберіть **Дублювати**).
zh_cn: 可以直接复制第一个房间（选择 ``Kitchen`` 节点，右键，然后选择\ **制作副本**\ ）。

source: Rotate and position the second room so that the openings line up.
es: Rota y posiciona la segunda sala de manera que las aperturas se alineen.
fr: Faîtes pivoter et positionnez la deuxième salle pour que les ouvertures soient alignées.
ru: Поверните и расположите вторую комнату так, чтобы открытые проходы совпадали.
uk: Поверніть і розташуйте другу кімнату так, щоб отвори співпали.
zh_cn: 通过旋转平移第二个房间，把两个房间的开口对齐。

source: Rename the second room to ``Lounge``.
es: Renombra la segunda sala como "Sala de estar".
fr: Renommez la deuxième salle en ``Lounge`` (Salon).
ru: Переименуйте вторую комнату в ``Lounge``.
uk: Перейменуйте другу кімнату на ``Lounge``.
zh_cn: 把第二个房间重命名为 ``Lounge``\ （起居室）。

source: Step 3
es: Paso 3
fr: Étape 3
uk: Крок 3
zh_cn: 第三步

source: Next, we will add a portal between the two rooms.
es: A continuación, agregaremos un portal entre las dos salas.
fr: Ensuite, nous ajouterons un portail entre les deux salles.
ru: Далее мы добавим портал между двумя комнатами.
uk: Далі ми додамо портал між двома кімнатами.
zh_cn: 接下来，我们要在两个房间之间添加一个入口。

source: Create a new :ref:`Portal<class_Portal>` in the kitchen.
es: Crea un nuevo nodo :ref:`Portal<class_Portal>` en la cocina.
fr: Créez un nouveau :ref:`Portal<class_Portal>` dans la cuisine.
uk: Створити новий :ref:`Portal<class_Portal>` *(Портал)* на кухні.
zh_cn: 在厨房中新建一个 :ref:`Portal<class_Portal>`\ 。

source: Scale and position the portal using the node ``Transform`` in the inspector, so it fits within the opening between the two rooms.
es: Escala y posiciona el portal utilizando el nodo ``Transform`` en el inspector para que se ajuste dentro de la abertura entre las dos salas.
fr: Changer la taille et la position du portail en utilisant le nœud ``Transform`` dans l'inspecteur, pour qu'il s'insère correctement dans l'ouverture entre les deux salles.
ru: Масштабируйте и позиционируйте портал с помощью узла ``Transform`` в инспекторе, чтобы он поместился в проеме между двумя комнатами.
uk: Масштабуйте і розташуйте портал за допомогою вузла ``Transform`` в інспекторі, так щоб він поміщався в отвір між двома кімнатами.
zh_cn: 使用检查器中的节点的 ``Transform`` 来调整入口的缩放和坐标，使其适合两个房间之间的开口。

source: The portal plane should face *outward* from the source room, i.e. towards the lounge. This direction is indicated by the arrow in the editor gizmo, and portal gizmo's color.
es: El plano del portal debe estar orientado hacia *afuera* desde la sala de origen, es decir, hacia la sala de estar. Esta dirección se indica mediante la flecha en el gizmo del editor y el color del gizmo del portal.
fr: Le plan du portail doit être orienté *vers l'extérieur* de la salle source, c'est-à-dire vers le salon. Cette direction est indiquée par la flèche dans le gadget de l'éditeur, et avec la couleur du gadget du portail.
ru: Плоскость портала должна быть обращена *наружу* от исходной комнаты, т.е. в сторону гостиной. На это направление указывает стрелка гизмо в редакторе и цвет портала гизмо.
uk: Площина порталу повинна дивитися *назовні* від вихідної кімнати, тобто до ``lounge``. На цей напрямок вказує стрілка в редакторі gizmo, а також колір порталу gizmo.
zh_cn: 入口的平面应该朝向源房间的 *外侧* ，也就是朝向休息室。这个方向由编辑器中的箭头和入口的颜色表示。

source: Step 4
es: Paso 4
fr: Étape 4
uk: Крок 4
zh_cn: 第四步

source: To make things more exciting, we want to add a few more boxes to the rooms.
es: Para hacer las cosas más emocionantes, queremos agregar algunas cajas más a las salas.
fr: Pour rendre les choses plus excitantes, nous voulons ajouter quelques boîtes supplémentaires aux salles.
ru: Чтобы сделать все более интересным, мы хотим добавить в комнаты еще несколько ящиков.
uk: Щоб зробити речі більш захопливими, ми хочемо додати ще кілька коробок в кімнати.
zh_cn: 为了更有趣，我们在房间里多加几个盒子。

source: Placing these boxes as children or grandchildren of the room nodes explicitly tells the system which room the objects should be in. However, we can also create these objects *outside* the rooms. Provided they are in the RoomList branch, the system will attempt to automatically place them in the correct room at runtime.
es: Colocar estas cajas como hijos o nietos de los nodos de las salas indica explícitamente al sistema en qué sala deben estar los objetos. Sin embargo, también podemos crear estos objetos *fuera* de las salas. Siempre y cuando estén en la rama de "RoomList", el sistema intentará colocarlos automáticamente en la sala correcta durante la ejecución.
fr: Le fait de placer ces boîtes comme enfants ou petits-enfants des nœuds de salles indique explicitement au système dans quelle salle les objets doivent se trouver. Cependant, nous pouvons également créer ces objets *en dehors* des salles. Tant qu'ils sont dans une branche RoomList, le système essaiera automatiquement de les placer dans la bonne salle au moment de l'exécution.
ru: Размещение этих ящиков в качестве дочерних или внучатых узлов комнат явно указывает системе, в какой комнате должны находиться объекты. Однако мы также можем создать эти объекты *вне* комнаты. При условии, что они находятся в ветке RoomList, система попытается автоматически поместить их в нужную комнату во время выполнения.
uk: Розмістіть ці коробки в якості нащадків вузлів кімнат прямо вказуючи системі, в якій кімнаті повинні знаходитися об'єкти. Однак ми також можемо створювати ці об'єкти *за межами* кімнат. За умови, що вони знаходяться у відділенні ``RoomList``, система намагатиметься автоматично розмістити їх у правильному приміщенні під час виконання гри.
zh_cn: 将这些盒子作为房间节点的子节点或孙节点，明确告知系统这些对象应该在哪个房间。然而，我们也可以在房间之外创建这些对象。只要它们在房间列表分支当中，系统就会尝试在运行时自动将它们放在正确的房间中。

source: On the screenshot, the boxes were places as children of a Spatial I have called ``Freeform`` to keep things tidy.
es: En la captura de pantalla, las cajas se colocaron como hijos de un nodo Spatial que has llamado ``Freeform`` para mantener las cosas ordenadas.
fr: Sur la capture d'écran, les boîtes ont été placées comme enfants d'un Spatial que j'ai appelé ``Freeform`` pour garder les choses bien rangées.
ru: На скриншоте ящики были размещены как дочерние элементы Spatial, который я назвал ``Freeform`` для поддержания порядка.
uk: На скріншоті коробки є нащадками просторового вузла ``Freeform``, який утримує їх в порядку.
zh_cn: 在截图中，这些盒子是作为名为 ``Freeform`` 空间的子项，以保持整洁。

source: Boxes also have a green SpatialMaterial assigned to them to make them stand out more from the rest of the room.
es: Las cajas también tienen asignado un material espacial verde para que se destaquen más del resto de la sala.
fr: Les boîtes ont également un SpatialMaterial vert qui leur est attribué pour qu'elles se distinguent davantage du reste de la salle.
ru: Коробкам также присвоен зеленый пространственный материал, чтобы они сильнее выделялись на фоне остальной комнаты.
uk: Коробки також мають зелений просторовий матеріал, призначений їм, щоб вони більше виділялися з іншої частини кімнати.
zh_cn: 给盒子分配绿色的 SpatialMaterial，以使其在房间中突显。

source: Let's also create an :ref:`OmniLight<class_OmniLight>` so it will be autoplaced in one of the rooms.
es: También crearemos una :ref:`OmniLight<class_OmniLight>` para que se coloque automáticamente en una de las salas.
fr: Créons égalemant une :ref:`OmniLight<class_OmniLight>` pour qu'elle soit placée automatiquement dans l'une des pièces.
ru: Давайте также создадим :ref:`OmniLight<class_OmniLight>`, чтобы он был автоматически размещен в одной из комнат.
uk: Давайте також створимо :ref:`OmniLight<class_OmniLight>` *(Світло Навсібіч)*, щоб воно було автоматично розміщене в одній з кімнат.
zh_cn: 我们再创建一个 :ref:`OmniLight<class_OmniLight>`，它将被自动放置在其中一个房间中。

source: Step 5
es: Paso 5
fr: Étape 5
ru: Шаг 5
uk: Крок 5
zh_cn: 第五步

source: Next comes a crucial stage. We must let the RoomManager know where the rooms are!
es: A continuación, llega una etapa crucial. ¡Debemos informar al RoomManager dónde están las salas!
fr: Vient ensuite une étape cruciale. Nous devons dire au RoomManager où sont les salles !
ru: Далее наступает решающий этап. Мы должны сообщить RoomManager, где находятся комнаты!
uk: Далі настає вирішальний етап. Ми повинні дати пояснити Керівнику кімнат, де знаходяться кімнати!
zh_cn: 接下来是关键阶段。我们必须让RoomManager房间管理器知道房间在哪里!

source: Select the RoomManager and look in the Inspector window in the **Paths** section.
es: Selecciona el RoomManager y busca en la ventana del Inspector en la sección **Paths**.
fr: Sélectionnez le RoomManager et regardez la section **Paths** dans la fenêtre de l'inspecteur.
ru: Выберите RoomManager и посмотрите в окне инспектора в разделе **Paths**.
uk: Виберіть Керівник Кімнат і подивіться у вікні інспектора в розділі **Paths** *(Контури)*.
zh_cn: 选择RoomManager，查看检查器窗口的\ **Paths**\ 部分。

source: You need to assign the **Room List** to point to the RoomList node we created earlier (which is the parent of all the rooms).
es: Debes asignar la **Room List** para que apunte al nodo RoomList que creamos anteriormente (que es el padre de todas las salas).
fr: Vous devez assigner la propriété **Room List** pour qu'elle pointe vers le nœud RoomList que nous avons créé précédemment (qui est le parent de toutes les salles).
ru: Вам нужно назначить **Room List** для указания на узел RoomList, который мы создали ранее (который является родителем всех комнат).
uk: Вам потрібно призначити **Room List** *(Список Кімнат)*, щоб вказати на вузол ``RoomList``, який ми створили раніше (і який є батьком усіх кімнат).
zh_cn: 你需要将\ **Room List**\ 指向我们之前创建的RoomList节点，RoomList是所有房间的父节点。

source: Step 6
es: Paso 6
fr: Étape 6
uk: Крок 6
zh_cn: 第六步

source: Make sure you have saved your project before this next step. It is always a good idea to save and make a backup before converting.
es: Asegúrate de haber guardado tu proyecto antes de dar el siguiente paso. Siempre es una buena idea guardar y hacer una copia de seguridad antes de realizar la conversión.
fr: Assurez-vous d'avoir sauvegardé votre projet avant de passer à l'étape suivante. C'est toujours une bonne idée d'enregistrer et de faire une backup avant de convertir.
ru: Убедитесь, что вы сохранили свой проект перед следующим шагом. Всегда полезно сохранять и создавать резервные копии перед конвертированием.
uk: Переконайтеся, що ви зберегли свій проект, перш ніж робити цей наступний крок. Це завжди гарна ідея, зберегти і зробити резервну копію перед перетворенням.
zh_cn: 确保在进行下一步之前，你已经保存了项目。在转换之前，最好总是保存并做备份。

source: Select the RoomManager, and you will see a button in the toolbar at the top of the 3d editor viewport called **Convert Rooms**. Press this button.
es: Selecciona el RoomManager y verás un botón en la barra de herramientas en la parte superior de la vista del editor 3D llamado **Convert Rooms**. Haz clic en este botón.
fr: Sélectionnez le RoomManager, et vous verrez un bouton appelé **Convertir les salles** dans la barre d'outils en haut de la fenêtre de l'éditeur 3D. Appuyez sur ce bouton.
ru: Выберите RoomManager, и на панели инструментов в верхней части видового окна 3d-редактора появится кнопка **Convert Rooms**. Нажмите эту кнопку.
uk: Виберіть Керівник Кімнат, і ви побачите кнопку на панелі інструментів у верхній частині перегляду 3d-редактора під назвою **Перетворити кімнати**. Натисніть цю кнопку.
zh_cn: 选择RoomManager，你会在3D编辑器视窗顶部的工具栏中看到一个按钮，叫做\ **Convert Rooms**\ ，按下这个按钮。

source: If all goes well, the RoomManager will have created the runtime data (the *room graph*) to perform occlusion culling at runtime.
es: Si todo va bien, el RoomManager habrá creado los datos en tiempo de ejecución (el *gráfico de salas*) para realizar el descarte de ocultación durante la ejecución.
fr: Si tout se passe bien le RoomManager aura créé les données pour l'exécution (le *graphe de salles*) pour effectuer l'occlusion culling pendant l'exécution.
ru: Если все прошло успешно, RoomManager создаст данные для выполнения (*граф помещения* ), чтобы выполнить окклюзию во время выполнения.
uk: Якщо все піде добре, Керівник Кімнат створить дані про виконання (*графік кімнат*) для вибракування оклюзії під час виконання.
zh_cn: 如果一切顺利，RoomManager将创建运行时数据（ \ *房间图*\ ），以便在运行时进行遮挡剔除。

source: You can see a log of the conversion process in the output window. This is helpful for finding problems.
es: Puedes ver un registro del proceso de conversión en la ventana de salida. Esto es útil para encontrar problemas.
fr: Vous pouvez voir un log du processus de conversion dans la fenêtre de sortie. C'est utile pour trouver les problèmes.
ru: В окне вывода можно увидеть журнал процесса преобразования. Это полезно для поиска проблем.
uk: Ви можете побачити лоґ процесу перетворення у вікні виводу. Це корисно для пошуку проблем.
zh_cn: 您可以在输出窗口中看到转换过程的日志。这有助于发现问题。

source: If you now move the editor camera inside the rooms, you should see the meshes in the opposite room being culled depending on what you can see through the portal.
es: Si ahora mueves la cámara del editor dentro de las salas, deberías ver cómo las mallas de la sala opuesta se descartan dependiendo de lo que puedas ver a través del portal.
fr: Si vous déplacez maintenant la caméra de l'éditeur à l'intérieur des salles, vous devriez voir les modèles de la salle opposée être affectés par le culling en fonction de ce que vous pouvez voir à travers le portail.
ru: Если вы теперь переместите камеру редактора внутрь комнат, вы должны увидеть, как сетки в противоположной комнате будут выбраковываться в зависимости от того, что вы можете видеть через портал.
uk: Якщо тепер ви переміщуєте камеру редактора всередині кімнат, ви повинні побачити, як меші в протилежній кімнаті вибраковуються в залежності від того, що ви можете побачити через портал.
zh_cn: 如果你现在在房间内移动编辑器相机，应该可以看到对面房间的网格被剔除，是取决于你通过入口所能看到的东西。

source: Conclusion
es: Conclusión
ru: Вывод
uk: Висновки
zh_cn: 总结

source: This concludes this simple tutorial. Don't be afraid to experiment with the new room system you have created.
es: Esto concluye este tutorial simple. No temas experimentar con el nuevo sistema de salas que has creado.
fr: Ceci conclut ce simple tutoriel. N'ayez pas peur d'expérimenter avec le nouveau système de salles que vous avez créé.
ru: На этом мы завершаем этот простой учебник. Не бойтесь экспериментировать с созданной вами новой системой комнат.
uk: На цьому завершується цей простий урок. Не бійтеся експериментувати з системою кімнат, яку ви створили.
zh_cn: 这个简单的教程到此结束。你可以尝试创建的新房间系统。

source: Some things to try
es: Algunas cosas para probar
fr: Quelques trucs à essayer
ru: Некоторые вещи, которые следует попробовать
uk: Спробуйте такі речі
zh_cn: 试一试
