Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/documentation/contributing_to_the_documentation.po
Languages: es, fr, zh_cn

source: Contributing to the documentation
es: Contribuyendo a la documentación
fr: Contribuer à la documentation
zh_cn: 贡献文档

source: This guide explains how to contribute to Godot's documentation, be it by writing or reviewing pages.
es: Esta guía explica cómo contribuir a la documentación de Godot, ya sea escribiendo o revisando páginas.
fr: Ce guide explique comment contribuer à la documentation de Godot, que ce soit en écrivant ou en révisant des pages.
zh_cn: 本指南介绍的是如何向 Godot 的文档做出贡献，无论是编写页面还是审核页面。

source: If you want to translate pages or the class reference from English to other languages, read :ref:`doc_editor_and_docs_localization`.
es: Si deseas traducir páginas o la referencia de clases de inglés a otros idiomas, lee :ref:`doc_editor_and_docs_localization`.
fr: Si vous souhaitez traduire des pages ou la référence de la classe de l'anglais vers d'autres langues, lisez :ref:`doc_editor_and_docs_localization`.
zh_cn: 如果你想要将页面或类参考从英语翻译为其他语言，请阅读 :ref:`doc_editor_and_docs_localization`\ 。

source: Getting started
es: Primeros pasos
fr: Pour commencer
zh_cn: 入门

source: To modify or create pages in the reference manual, you need to edit ``.rst`` files in the `godot-docs GitHub repository <https://github.com/godotengine/godot-docs>`_. Modifying those pages in a pull request triggers a rebuild of the online documentation upon merging.
es: Para modificar o crear páginas en el manual de referencia, debes editar archivos ``.rst`` en el repositorio de GitHub de `godot-docs <https://github.com/godotengine/godot-docs>`_. Al modificar esas páginas en una solicitud de extracción (pull request), se activa una reconstrucción de la documentación en línea al fusionarse.
fr: Pour modifier ou créer des pages dans le manuel de référence, vous devez modifier les fichiers ``.rst`` dans le dépôt GitHub `godot-docs <https://github.com/godotengine/godot-docs>`_. La modification de ces pages dans une pull request déclenche une reconstruction de la documentation en ligne lors de la fusion.
zh_cn: 要修改或创建参考手册中的页面，你需要编辑 `godot-docs GitHub 仓库 <https://github.com/godotengine/godot-docs>`_\ 中的 ``.rst`` 文件。如果在拉取请求中修改了这些文件，合并时就会触发在线文档的重新构建。

source: For details on Git usage and the pull request workflow, please refer to the :ref:`doc_pr_workflow` page. Most of what it describes regarding the main godotengine/godot repository is also valid for the docs repository.
es: Para obtener detalles sobre el uso de Git y el flujo de trabajo de solicitudes de extracción (pull requests), consulta la página :ref:`doc_pr_workflow`. La mayoría de lo que describe sobre el repositorio principal godotengine/godot también es válido para el repositorio de documentación.
fr: Pour plus de détails sur l'utilisation de Git et sur le flux de travail des Pull Requests, veuillez vous référer à la page :ref:`doc_pr_workflow`. La plupart de ce qu'elle décrit concernant le dépôt principal godotengine/godot est également valable pour le dépôt docs.
zh_cn: 有关Git用法和拉取请求工作流程的详细信息, 请参阅 :ref:`doc_pr_workflow` 页面. 它描述的关于主godotengine/godot仓库的大部分内容, 这对文档仓库也是有效的.

source: The class reference's source files are in the `Godot engine repository <https://github.com/godotengine/godot>`_. We generate the :ref:`Class Reference <doc_class_reference>` section of this documentation from them. If you want to update the description of a class, its methods, or properties, read :ref:`doc_updating_the_class_reference`.
zh_cn: 类参考的源文件位于 `Godot 引擎仓库 <https://github.com/godotengine/godot>`_\ 中。我们会用它来生成本文档的 :ref:`类参考 <doc_class_reference>` 章节。如果你想要更新类、方法、属性等的描述信息，请参阅 :ref:`doc_updating_the_class_reference`\ 。

source: What is the Godot documentation
es: Qué es la documentación de Godot
fr: Qu'est-ce la documentation de Godot
zh_cn: Godot 文档是什么

source: The Godot documentation is intended as a comprehensive reference manual for the Godot game engine. It is not meant to contain step-by-step tutorials, except for two game creation tutorials in the Getting Started section.
es: La documentación de Godot tiene como objetivo ser un manual de referencia completo para el motor de juegos Godot. No está destinada a contener tutoriales paso a paso, excepto por dos tutoriales de creación de juegos en la sección de Introducción.
fr: La documentation Godot est conçue comme un manuel de référence complet pour le moteur de jeu Godot. Elle n'est pas censée contenir des didacticiels pas à pas, à l'exception de deux didacticiels de création de jeux dans la section Démarrage.
zh_cn: Godot 文档旨在作为 Godot 游戏引擎的完备参考手册。除了“入门”章节的两个游戏制作教程之外，不包含渐进式教程。

source: We strive to write factual content in an accessible and well-written language. To contribute, you should also read:
es: Nos esforzamos por escribir contenido factual en un lenguaje accesible y bien escrito. Para contribuir, también debes leer:
fr: Nous nous efforçons de rédiger des contenus factuels dans un langage accessible et bien écrit. Pour contribuer, vous devriez également lire :
zh_cn: 我们致力于使用简单通顺的语言编写实事求是的内容。投稿前请阅读：

source: :ref:`doc_content_guidelines`. They explain the principles we follow to write the documentation and the kind of content we accept.
zh_cn: :ref:`doc_content_guidelines`。对我们在编写文档时所遵循的原则进行了解释，也解释了我们接受哪些形式的内容。

source: Contributing changes
es: Contribuyendo con los cambios
fr: Contribuer aux changements
zh_cn: 将修改投稿

source: **Pull Requests should use the** ``master`` **branch by default.** Only make Pull Requests against other branches (e.g. ``2.1`` or ``3.0``) if your changes only apply to that specific version of Godot.
es: Las solicitudes de extracción (Pull Requests) deben usar la rama ``master`` de forma predeterminada. Solo crea solicitudes de extracción en otras ramas (por ejemplo, ``2.1`` o ``3.0``) si tus cambios solo se aplican a esa versión específica de Godot.
fr: **Les Pull Requests doivent utiliser la branche** ``master`` **par défaut.** Ne faites des demandes de Pull que sur d'autres branches (par exemple ``2.1`` ou ``3.0``) si vos modifications ne s'appliquent qu'à cette version spécifique de Godot.
zh_cn: **拉取请求应该默认使用** ``master`` **分支。**\ 请在修改只对特定版本的 Godot 有意义时，才针对其他分支（比如 ``2.1`` 或 ``3.0``\ ）提交拉取请求。

source: Though less convenient to edit than a wiki, this Git repository is where we write the documentation. Having direct access to the source files in a revision control system is a plus to ensure our documentation quality.
es: Aunque sea menos conveniente de editar que una wiki, este repositorio Git es donde escribimos la documentación. Tener acceso directo a los archivos fuente en un sistema de control de versiones es una ventaja para asegurar la calidad de nuestra documentación.
fr: Bien que moins pratique à modifier qu'un wiki, ce dépôt Git est l'endroit où nous écrivons la documentation. Avoir un accès direct aux fichiers sources dans un système de contrôle de révision est un plus pour assurer la qualité de notre documentation.
zh_cn: 虽然编辑器来不如百科方便，但是我们就是在这个 Git 仓库中编写文档的。可以在版本控制系统中直接访问源文件，对于保证我们文档的质量是有利的。

source: Editing existing pages
es: Editando páginas existentes
fr: Modifier des pages existantes
zh_cn: 编辑现有页面

source: To build the manual and test changes on your computer, see :ref:`doc_building_the_manual`.
es: Para compilar el manual y probar los cambios en tu computadora, consulta :ref:`doc_building_the_manual`.
fr: Pour compiler le manuel et tester les modifications sur votre ordinateur, consultez :ref:`doc_building_the_manual`.
zh_cn: 要在你的电脑上构建手册并测试修改，请参阅 :ref:`doc_building_the_manual`\ 。

source: Editing pages online
es: Editando páginas online
fr: Modifier des pages en ligne
zh_cn: 在线编辑页面

source: You can edit the documentation online by clicking the **Edit on GitHub** link in the top-right of every page.
es: Puedes editar la documentación en línea haciendo clic en el enlace **Editar en GitHub** que se encuentra en la parte superior derecha de cada página.
fr: Vous pouvez modifier la documentation en ligne en cliquant sur le lien **Editer sur GitHub** en haut à droite de chaque page.
zh_cn: 点击每一页右上角的 **Edit on GitHub** 链接即可在线编辑该文档。

source: Doing so takes you to the GitHub text editor. You need to have a GitHub account and to log in to use it. Once logged in, you can propose change like so:
es: Una vez allí, se abrirá el editor de texto de GitHub. Necesitas tener una cuenta en GitHub y haber iniciado sesión para poder utilizarlo. Una vez iniciada sesión, puedes proponer cambios de la siguiente manera:
fr: Vous accédez ainsi à l'éditeur de texte de GitHub. Vous devez avoir un compte GitHub et vous connecter pour l'utiliser. Une fois connecté, vous pouvez proposer des modifications comme suit :
zh_cn: 这样你就会跳转到 GitHub 文本编辑器，要拥有 GitHub 账户并登录才能够使用。登录后，可以这样提出修改方案：

source: Click the **Edit on GitHub** button.
es: Haz clic en el botón "Editar en GitHub".
fr: Cliquez sur le bouton **Edit on GitHub**.
zh_cn: 点击“Edit on GitHub”按钮。

source: On the GitHub page you're taken to, click the pencil icon in the top-right corner near the **Raw**, **Blame**, and **Delete** buttons. It has the tooltip "Fork this project and edit the file".
es: En la página de GitHub a la que te llevará el enlace, haz clic en el ícono de lápiz que se encuentra en la esquina superior derecha, cerca de los botones **Raw**, **Blame** y **Delete**. El ícono de lápiz tiene una etiqueta emergente que dice "Fork this project and edit the file".
fr: Sur la page GitHub où vous êtes dirigé, cliquez sur l'icône crayon dans le coin supérieur droit près des boutons **Raw**, **Blame** et **Delete**. Il y a l'info-bulle "Fork this project and edit the file".
zh_cn: 在你转到的 GitHub 页面上，点击右上角靠近 **Raw**\ 、\ **Blame**\ 、\ **History** 按钮的铅笔图标。它的工具提示是“Edit the file in a fork of this project”，在这个项目的 Fork 中编辑该文件。

source: Edit the text in the text editor.
es: Edita el texto en el editor de texto.
fr: Modifiez le texte dans l'éditeur de texte.
zh_cn: 在文本编辑器中编辑文本。

source: At the bottom of the web page, summarize the changes you made and click the button **Propose file change**. Make sure to replace the placeholder "Update file.rst" by a short but clear one-line description, as this is the commit title.
es: En la parte inferior de la página web, resume los cambios que realizaste y haz clic en el botón **Propose file change**. Asegúrate de reemplazar el marcador de posición "Update file.rst" con una descripción breve pero clara de una línea, ya que esto será el título del commit.
fr: Au bas de la page Web, résumez les modifications que vous avez apportées et cliquez sur le bouton **Propose file change**. Veillez à remplacer le caractère générique "Update file.rst" par une description courte mais claire d'une ligne, car il s'agit du titre du commit.
zh_cn: 请在网页的底部总结你所作出的修改，然后单击 **Propose file change**\ （提议修改文件）按钮。请确保已经把占位的“Update file.rst”替换成了简短的单行描述，因为这会成为提交的标题。

source: On the following screens, click the **Create pull request** button until you see a message like *Username wants to merge 1 commit into godotengine:master from Username:patch-1*.
es: En las siguientes pantallas, haz clic en el botón **Create pull request** hasta que veas un mensaje como *Username quiere fusionar 1 commit en godotengine:master desde Username:patch-1*.
fr: Sur les écrans suivants, cliquez sur le bouton **Create pull request** jusqu'à ce que vous voyiez un message comme *Username wants to merge 1 commit into godotengine:master from Username:patch-1*.
zh_cn: 在接下来的页面上，点击 **Create pull request**\ （创建拉取请求）按钮，直到看到类似 *Username wants to merge 1 commit into godotengine:master from Username:patch-6* 的信息。

source: Another contributor will review your changes and merge them into the docs if they're good. They may also make changes or ask you to do so before merging.
es: Otro colaborador revisará tus cambios y los fusionará en la documentación si son buenos. También pueden realizar cambios o pedirte que los hagas antes de fusionarlos.
fr: Un autre contributeur examinera vos modifications et les intégrera dans la documentation si elles sont bonnes. Il peut également apporter des modifications ou vous demander de le faire avant la fusion.
zh_cn: 另一个贡献者会适合你的修改，如果修改没有问题的话，就会把它们合并进文档。在合并之前，他们可能还会进行一些修改，或者要求你自己进行修改。

source: Adding new pages
es: Agregando nuevas páginas
fr: Ajouter de nouvelles pages
zh_cn: 添加新页面

source: Before adding a new page, please ensure that it fits in the documentation:
es: Antes de agregar una nueva página, asegúrate de que se ajuste a la documentación existente:
fr: Avant d’ajouter une nouvelle page, assurez-vous qu’elle s’intègre dans la documentation :
zh_cn: 在添加新页面之前，请确保它适合现有文档：

source: Look for `existing issues <https://github.com/godotengine/godot-docs/issues>`_ or open a new one to see if the page is necessary.
es: Busca en los `problemas existentes <https://github.com/godotengine/godot-docs/issues>`_ o abre uno nuevo para ver si la página es necesaria.
fr: Recherchez les ` questions existantes <https://github.com/godotengine/godot-docs/issues>`_ ou ouvrez-en une nouvelle pour voir si la page est nécessaire.
zh_cn: 搜索\ `已有 Issue <https://github.com/godotengine/godot-docs/issues>`\ 或者提交新 Issue，确认该页面是必须的。

source: Ensure there isn't a page that already covers the topic.
es: Asegúrate de que no haya una página que ya cubra el tema.
fr: Assurez-vous qu'il n'y a pas une page qui couvre déjà le sujet.
zh_cn: 确认目前不存在涉及该话题的页面。

source: Read our :ref:`doc_content_guidelines`.
es: Lea nuestro :ref:`doc_content_guidelines`.
fr: Lisez notre :ref:`doc_content_guidelines`.
zh_cn: 阅读我们的 :ref:`doc_content_guidelines`\ 。

source: To add a new page, create a ``.rst`` file with a meaningful name in the section you want to add a file to, e.g. ``tutorials/3d/light_baking.rst``.
es: Para agregar una nueva página, crea un archivo ``.rst`` con un nombre significativo en la sección donde desees agregarlo, por ejemplo, ``tutorials/3d/light_baking.rst``.
fr: Pour ajouter une nouvelle page, créez un fichier ``.rst`` avec un nom significatif dans la section à laquelle vous voulez ajouter un fichier, par exemple ``tutorials/3d/light_baking.rst``.
zh_cn: 要添加一个新页面，请在想要的章节下创建一个 ``.rst`` 文件并起一个有意义的名字，例如 ``tutorials/3d/light_baking.rst``\ 。

source: You should then add your page to the relevant "toctree" (table of contents, e.g. ``tutorials/3d/index.rst``). Add your new filename to the list on a new line, using a relative path and no extension, e.g. here ``light_baking``.
es: Luego, debes agregar tu página al "toctree" relevante (tabla de contenidos), por ejemplo, ``tutorials/3d/index.rst``. Agrega el nombre de tu archivo nuevo en la lista en una nueva línea, usando una ruta relativa y sin extensión, por ejemplo, aquí ``light_baking``.
fr: Vous devez ensuite ajouter votre page au "toctree" (table des matières, par exemple ``tutorials/3d/index.rst``). Ajoutez votre nouveau nom de fichier à la liste sur une nouvelle ligne, en utilisant un chemin relatif et sans extension, par exemple ici ``light_baking``.
zh_cn: 你应该将你的页面加入相关的“toctree”（目录，例如 ``tutorials/3d/index.rst``\ ）。请将你的新文件名加入目录列表中，使用相对路径，不要带扩展名，例如 ``light_baking``\ 。

source: Titles
es: Títulos
fr: Titres
zh_cn: 标题

source: Always begin pages with their title and a Sphinx reference name:
es: Siempre comienza las páginas con su título y un nombre de referencia de Sphinx:
fr: Commencez toujours les pages par leur titre et un nom de référence Sphinx :
zh_cn: 始终以标题和Sphinx引用名称开始页面:

source: The reference ``_doc_insert_your_title_here`` and the title should match.
es: La referencia ``_doc_insert_your_title_here`` y el título deben coincidir.
fr: La référence ``_doc_insert_your_title_here`` et le titre doivent correspondre.
zh_cn: 引用 ``_doc_insert_your_title_here`` 应该和标题相匹配。

source: The reference allows linking to this page using the ``:ref:`` format, e.g. ``:ref:`doc_insert_your_title_here``` would link to the above example page (note the lack of leading underscore in the reference).
es: La referencia permite vincular a esta página utilizando el formato ``:ref:``, por ejemplo, ``:ref:`doc_insert_your_title_here``` enlazaría a la página de ejemplo anterior (nota la falta de guión bajo al principio de la referencia).
fr: La référence permet un lien vers cette page en utilisant le format ``:ref:``, par exemple ``:ref:`doc_insérer_votre_titre_ici``` aurait un lien pour l'exemple ci-dessus page (notez l'absence de préfixe tiret du bas '_' dans la référence).
zh_cn: 引用允许使用 ``:ref:`` 格式链接到这个页面，例如 ``:ref:`doc_insert_your_title_here``` 将链接到上面的例子页面（注意引用中没有前导下划线）。

source: Write your titles like plain sentences, without capitalizing each word:
es: Escribe tus títulos como frases simples, sin capitalizar cada palabra:
fr: Rédigez vos titres comme des phrases simples, sans mettre de majuscules à chaque mot :
zh_cn: 请以普通句子的形式编写标题，不要所有单词都大写：

source: **Good:** Understanding signals in Godot
es: **Bueno:** Entendiendo las señales en Godot
fr: **Bien :** Comprendre les signaux dans Godot
zh_cn: **良好：**\ Understanding signals in Godot

source: **Bad:** Understanding Signals In Godot
es: **Malo:** Entendiendo Señales En Godot
fr: **Bien :** Comprendre Les Signaux Dans Godot
zh_cn: **欠佳：**\ Understanding Signals In Godot

source: Only propers nouns, projects, people, and node class names should have their first letter capitalized.
es: Solo los nombres propios, proyectos, personas y nombres de clases de nodos deben tener su primera letra en mayúscula.
fr: Seuls les noms propres, les projets, les personnes et les noms de classes de nœuds doivent avoir leur première lettre en majuscule.
zh_cn: 专有名词、项目、人物、节点名称等才应该首字母大写。

source: Sphinx and reStructuredText syntax
es: Sintaxis de Sphinx y reStructuredText
fr: Syntaxe Sphinx et reStructuredText
zh_cn: Sphinx 与 reStructuredText 语法

source: Sphinx uses specific reST comments to do specific operations, like defining the table of contents (``.. toctree::``) or cross-referencing pages. Check the `official Sphinx documentation <https://www.sphinx-doc.org/en/stable/index.html>`__ for more details. To learn how to use Sphinx directives like ``.. note::`` or ``.. seealso::``, check out the `Sphinx directives documentation <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__.
es: Sphinx utiliza comentarios específicos de reST para realizar operaciones específicas, como definir la tabla de contenido (``.. toctree::``) o crear referencias cruzadas entre páginas. Para obtener más detalles, consulta la `documentación oficial de Sphinx <https://www.sphinx-doc.org/en/stable/index.html>`__. Si deseas aprender cómo usar directivas de Sphinx como ``.. note::`` o ``.. seealso::``, puedes revisar la `documentación de directivas de Sphinx <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__.
fr: Sphinx utilise des commentaires reST spécifiques pour effectuer des opérations spécifiques, comme la définition de la table des matières (``.. toctree::``) ou les références croisées de pages. Consultez la `documentation officielle de Sphinx <https://www.sphinx-doc.org/en/stable/index.html>`__ pour plus de détails. Pour apprendre à utiliser les directives Sphinx comme ``.. note::`` ou ``.. seealso::``, consultez la `documentation des directives Sphinx <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__.
zh_cn: Sphinx 会利用特定的 reST 注释来执行特定的操作，比如定义目录（\ ``.. toctree::``\ ）或者进行页面之间的交叉引用。详情请查看 `Sphinx 官方文档 <https://www.sphinx-doc.org/en/stable/index.html>`__\ 。要学习如何使用 ``.. note::``\ 、\ ``.. seealso::`` 等 Sphinx 指令，请查看 `Sphinx 指令文档 <https://www.sphinx-doc.org/en/master/usage/restructuredtext/directives.html>`__\ 。

source: Adding images and attachments
es: Añadiendo imágenes y archivos adjuntos
fr: Ajout d'images et de pièces jointes
zh_cn: 添加图片及附件

source: To add images, please put them in an ``img/`` folder next to the ``.rst`` file with a meaningful name and include them in your page with:
es: Para agregar imágenes, colócalas en una carpeta ``img/`` junto al archivo ``.rst`` con un nombre significativo e inclúyelas en tu página con:
fr: Pour ajouter des images, veuillez les placer dans un dossier ``img/`` à côté du fichier ``.rst`` avec un nom significatif et les inclure dans votre page avec :
zh_cn: 要添加图片，请将它们放入 ``.rst`` 旁的 ``img/`` 目录中，起一个有意义的名字，然后在页面中加入：

source: Alternatively, you can use the `figure` directive, which gives the image a contrasting border and allows centering it on the page.
zh_cn: 或者，你可以使用 `figure` 指令，该指令使图像具有对比边框并允许将其集中在页面上。

source: License
es: Licencia
fr: Licence
zh_cn: 许可证

source: By contributing to the documentation on the GitHub repository, you agree that your changes are distributed under this license.
es: Al contribuir a la documentación en el repositorio de GitHub, aceptas que tus cambios se distribuyen bajo esta licencia.
fr: En contribuant à la documentation sur le dépôt GitHub, vous acceptez que vos modifications soient distribuées sous cette licence.
zh_cn: 通过贡献GitHub仓库上的文档, 你同意你的更改是根据此许可证分发的.

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
