Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/first_look_at_the_editor.po
Languages: de, pt_br

source: First look at Godot's editor
de: Erster Blick auf Godot's Editor
pt_br: Primeiras impressões do editor do Godot

source: This page will give you a brief overview of Godot's interface. We're going to look at the different main screens and docks to help you situate yourself.
de: Diese Seite gibt Ihnen einen kurzen Überblick über die Benutzeroberfläche von Godot. Wir werden uns die verschiedenen Hauptbildschirme und Docks ansehen, um Ihnen zu helfen, sich zurechtzufinden.
pt_br: Esta página lhe dará uma breve visão geral da interface do Godot. Vamos ver as diferentes telas principais e painéis para ajudá-lo a se situar.

source: For a comprehensive breakdown of the editor's interface and how to use it, see the :ref:`Editor manual <toc-learn-editor>`.
de: Eine ausführliche Beschreibung der Benutzeroberfläche des Editors und seiner Bedienung finden Sie im :ref:`Editor-Handbuch <toc-learn-editor>`.
pt_br: Para uma descrição mais detalhada da interface do editor e como utilizá-la, veja o :ref:`Manual do editor <toc-learn-editor>`.

source: The Project manager
de: Der Projektmanager

source: When you launch Godot, the first window you see is the Project Manager. In the default tab, "Projects," you can manage existing projects, import or create new ones, and more.
de: Wenn Sie Godot starten, ist das erste Fenster, das Sie sehen, der Projektmanager. Auf dem Standardreiter "Projekte" können Sie vorhandene Projekte verwalten, neue Projekte importieren oder erstellen und vieles mehr.

source: At the top of the window, there is another tab named "Asset Library Projects". In the open-source asset library you can search for demo projects, templates, and completed projects, including many that are developed by the community.
de: Am oberen Rand des Fensters befindet sich eine weitere Registerkarte mit der Bezeichnung "Vorlagen". Sie können in der Open-Source-Asset-Bibliothek, die viele von der Community entwickelte Projekte enthält, nach Demoprojekten suchen.

source: You can also change the editor's language using the drop-down menu to the right of the engine's version in the window's top-right corner. By default, it is in English (EN).
de: Sie können auch die Sprache des Editors ändern, indem Sie das Dropdown-Menü rechts neben der Version der Engine in der rechten oberen Ecke des Fensters verwenden. Standardmäßig ist er auf Englisch (EN) eingestellt.
pt_br: Você pode também mudar o idioma do editor utilizando o menu suspenso à direita da versão do motor(engine), no canto superior direito da janela. Por padrão, está em English (EN).

source: When you open a new or an existing project, the editor's interface appears. Let's look at its main areas.
de: Wenn Sie ein neues oder ein bestehendes Projekt öffnen, erscheint die Benutzeroberfläche des Editors. Schauen wir uns die Hauptbereiche an.
pt_br: Quando você abre um projeto novo ou existente, a interface do editor aparece. Vejamos suas principais áreas.

source: By default, it features **menus**, **main screens**, and playtest buttons along the window's top edge.
de: Standardmäßig verfügt es über **Menüs**, **Hauptbildschirme** und Spieltest-Schaltflächen am oberen Rand des Fensters.
pt_br: Por padrão, aparece **menus**, **telas principais**, e os botões de teste no canto superior da janela.

source: In the center is the **viewport** with its **toolbar** at the top, where you'll find tools to move, scale, or lock the scene's nodes.
de: In der Mitte befindet sich das **Ansichtsfenster** mit der **Toolbar** am oberen Rand, in der Sie Werkzeuge zum Verschieben, Skalieren oder Sperren der Nodes der Szene finden.
pt_br: No centro está a **janela de visualização (viewport)** com sua **barra de ferramenta (toolbar)** no topo, onde você encontra as ferramentas para mover, redimensionar ou travar nós da sua cena.

source: On either side of the viewport sit the **docks**. And at the bottom of the window lies the **bottom panel**.
de: Auf beiden Seiten des Ansichtsfensters befinden sich die **Docks**. Und am unteren Rand des Fensters befindet sich das **Untere Bedienfeld**.
pt_br: Em ambos os lados da janela de exibição estão os **painéis**. E na parte inferior da janela encontra-se o **painel inferior**.

source: The toolbar changes based on the context and selected node. Here is the 2D toolbar.
de: Die Toolbar ändert sich je nach Kontext und ausgewähltem Node. Hier ist die 2D-Toolbar.
pt_br: A barra de ferramentas muda baseado no contexto e no nó selecionado. Aqui está a barra de ferramentas 2D.

source: Below is the 3D one.
de: Unten ist die 3D-Version zu sehen.
pt_br: Abaixo sua versão 3D.

source: Let's look at the docks. The **FileSystem** dock lists your project files, be it scripts, images, audio samples, and more.
de: Schauen wir uns die Docks an. Das Dock **Dateisystem** listet Ihre Projektdateien auf, seien es Skripte, Bilder, Audio-Samples und mehr.

source: The **Scene** dock lists the active scene's nodes.
de: Das **Szenen**-Dock listet die aktiven Nodes der Szene auf.
pt_br: O painel **Cena** lista os nós da cena ativa.

source: The **Inspector** allows you to edit the properties of a selected node.
de: Mit dem **Inspektor** können Sie die Eigenschaften eines ausgewählten Nodes bearbeiten.
pt_br: O **Inspetor** te permite editar as propriedades de um nó selecionado.

source: The **bottom panel**, situated below the viewport, is the host for the debug console, the animation editor, the audio mixer, and more. They can take precious space, that's why they're folded by default.
de: Das **untere Panel**, das sich unterhalb des Ansichtsfensters befindet, beherbergt die Debug-Konsole, den Animationseditor, den Audiomixer und vieles mehr. Sie können wertvollen Platz einnehmen, deshalb sind sie standardmäßig eingeklappt.
pt_br: O **Painel Inferior**, abaixo da janela principal(viewport), é onde fica o console de depuração, o editor de animação e o mixer de áudio. Eles são largos e podem ocupar bastante espaço, por isso eles ficam minimizados por padrão.

source: When you click on one, it expands vertically. Below, you can see the animation editor opened.
de: Wenn Sie auf eines klicken, wird es vertikal erweitert. Unten sehen Sie den geöffneten Animationseditor.
pt_br: Quando você clica em um deles, ele expande verticalmente. Abaixo você pode ver o editor de animações aberto.

source: The four main screens
de: Die vier Hauptbildschirme
pt_br: As quatro cenas principais

source: There are four main screen buttons centered at the top of the editor: 2D, 3D, Script, and AssetLib.
de: Im oberen Bereich des Editors befinden sich vier Schaltflächen: 2D, 3D, Skript und AssetLib.
pt_br: Há quatro botões na tela principal, centralizados no topo do editor: 2D, 3D, Script e AssetLib.

source: You'll use the **2D screen** for all types of games. In addition to 2D games, the 2D screen is where you'll build your interfaces.
de: Sie werden den **2D-Bildschirm** für alle Arten von Spielen verwenden. Neben 2D-Spielen ist der 2D-Bildschirm der Ort, an dem Sie Ihre Interfaces erstellen werden.
pt_br: Você usará a **tela 2D** para todos os tipos de jogos. Além dos jogos 2D, a tela 2D é onde você construirá suas interfaces.

source: In the **3D screen**, you can work with meshes, lights, and design levels for 3D games.
de: Im **3D-Bildschirm** können Sie mit Meshes und Lichtern arbeiten und Ebenen für 3D-Spiele entwerfen.
pt_br: Na **tela 3D**, você pode trabalhar com malhas (*meshes*), luzes e a criação de leveis para jogos 3D.

source: Notice the perspective button under the toolbar. Clicking on it opens a list of options related to the 3D view.
de: Beachten Sie die Schaltfläche Perspektive unter der Symbolleiste. Wenn Sie darauf klicken, wird eine Liste mit Optionen für die 3D-Ansicht geöffnet.
pt_br: Observe o botão ``Perspectiva`` sob a barra de ferramentas. Clicar nele abre uma lista de opções relacionadas à visualização 3D.

source: Read :ref:`doc_introduction_to_3d` for more detail about the **3D main screen**.
de: Lese :ref:`doc_introduction_to_3d` für weitere Informationen zum **3D-Arbeitsbereich**.
pt_br: Leia :ref:`doc_introduction_to_3d` para saber mais sobre a **tela principal 3D**.

source: The **Script screen** is a complete code editor with a debugger, rich auto-completion, and built-in code reference.
de: Der **Script-Bearbeiter** ist ein vollständiger Code-Editor mit Debugger, Autovervollständigung und eingebauten Code-Referenzen.
pt_br: A **tela Script** é um editor de código completo com um depurador, preenchimento automático avançado e referência de código integrada.

source: Finally, the **AssetLib** is a library of free and open-source add-ons, scripts, and assets to use in your projects.
de: Abschließend die **AssetLib**: eine Bibliothek mit kostenlosen und OpenSource Add-ons, Skripten und Inhalten, die Sie in Ihren Projekten verwenden können.

source: You can learn more about the asset library in :ref:`doc_what_is_assetlib`.
de: Weitere Informationen zu Visual Shadern finden Sie unter :ref:`doc_visual_shaders`.
pt_br: Você pode aprender mais sobre a biblioteca de assets em :ref:`doc_what_is_assetlib`.

source: Integrated class reference
de: Integrierte Klassenreferenz
pt_br: Documentação integrada

source: Godot comes with a built-in class reference.
de: Godot kommt mit einer eingebauten Klassenreferenz.
pt_br: Godot vem com a documentão de referência de classe integrada.

source: You can search for information about a class, method, property, constant, or signal by any one of the following methods:
de: Sie können nach Informationen über eine Klasse, Methode, Eigenschaft, Konstante oder ein Signal mit einer der folgenden Methoden suchen:
pt_br: Você pode procurar informações sobre uma classe, método, propriedade, ou sinal usando qualquer um dos métodos seguintes:

source: Pressing :kbd:`F1` (or :kbd:`Alt + Space` on macOS) anywhere in the editor.
de: Drücken von :kbd:`F1` (oder :kbd:`Alt + Leertaste` auf macOS) irgendwo im Editor.

source: Clicking the "Search Help" button in the top-right of the Script main screen.
de: Klicken Sie auf die Schaltfläche "Hilfe suchen" oben rechts im Hauptbildschirm des Skripts.
pt_br: Clicando no botão "Pesquisar Ajuda" no canto superior direito da tela principal do Script.

source: Clicking on the Help menu and Search Help.
de: Klicken auf das Menü "Hilfe" und "Hilfe suchen".
pt_br: Clicando no menu de Ajuda e Pequisar Ajuda.

source: Clicking while pressing the :kbd:`Ctrl` key on a class name, function name, or built-in variable in the script editor.
de: Klicken bei gedrückter :kbd:`Strg`-Taste auf einen Klassennamen, Funktionsnamen oder eine eingebaute Variable im Skript-Editor.
pt_br: Clicar enquanto pressiona a tecla :kbd:`Ctrl` em um nome de classe, nome de função ou variável incorporada no editor de script.

source: When you do any of these, a window pops up. Type to search for any item. You can also use it to browse available objects and methods.
de: Wenn Sie eine dieser Aktionen durchführen, öffnet sich ein Fenster. Tippen Sie, um nach einem beliebigen Element zu suchen. Sie können es auch verwenden, um die verfügbaren Objekte und Methoden zu durchsuchen.
pt_br: Quando você faz qualquer um desses, uma janela aparece. Digite para pesquisar qualquer item. Você também pode usá-lo para procurar objetos e métodos disponíveis.

source: Double-click on an item to open the corresponding page in the script main screen.
de: Doppelklicken Sie auf einen Eintrag, um die entsprechende Seite im Hauptfenster des Skripts zu öffnen.
pt_br: Clique duas vezes em um item para abrir a página correspondente na tela principal do script.

source: Translation status
de: Übersetzungsstatus
pt_br: Progresso da Tradução
