Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/godot_design_philosophy.po
Languages: cs, de, fr, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Godot offers a fully open source codebase under the **MIT license**. This means all the technologies that ship with it have to be Free (as in freedom) as well. For the most part, they're developed from the ground up by contributors.
cs: Godot nabízí plně otevřený zdrojový kód pod licencí **MIT**. To znamená, že všechny technologie, které se s ním dodávají, musí být také zdarma (jako ve svobodě). Z velké části jsou vyvíjeny od základu přispěvateli.
de: Godot bietet eine vollständig offenen Quellcode unter der **MIT-Lizenz** an. Das bedeutet, dass alle Technologien, die mit ihm ausgeliefert werden, auch frei sein müssen (wie in Freiheit). Sie werden größtenteils von Mitwirkenden von Grund auf entwickelt.
fr: Godot offre une base de code entièrement open source sous la licence **MIT**. Cela signifie que toutes les technologies qui l'accompagnent doivent également être libres (comme dans la liberté). Pour la plupart, elles sont développées à partir de zéro par des contributeurs.
ko: Godot는 **MIT 라이선스**\ 에 따라 완전한 오픈 소스 코드베이스를 제공합니다. 이는 함께 제공되는 모든 기술도 (권리로서의 의미로) 무료여야 함을 의미합니다. 대부분의 경우 기여자에 의해 처음부터 개발되었습니다.
pt_br: O Godot oferece uma base de código totalmente aberto sob a **licença MIT**. Isso significa que todas as tecnologias que acompanham o produto têm que ser Livres (como em liberdade) também. Na maior parte, elas são codificadas do zero pelos colaboradores.
ru: Godot предлагает полностью открытую кодовую базу под лицензией **MIT**. Это означает, что все технологии, которые поставляются с ней, должны быть бесплатными и свободными. По большей части, они разрабатываются с нуля членами сообщества.
uk: Godot пропонує повністю відкритий вихідний код за **ліцензією MIT**. Це означає, що всі технології, які постачаються разом із ним, також мають бути безкоштовними (як і вільними). Здебільшого вони розробляються з нуля учасниками.
zh_cn: Godot 源代码采用了 **MIT 许可证**\ 。这意味着它附带的所有技术也必须是自由的（自由使用、修改等）。大部分代码都是由贡献者从头开始开发的。
zh_tw: Godot 所有的程式碼皆使用 **MIT 授權** 開放原始碼。這表示 Godot 所包含的所有技術都能自由使用。而且大部分的程式都是由許多貢獻者從頭開始開發的。

source: Anyone can plug in proprietary tools for the needs of their projects — they just won't ship with the engine. This may include Google AdMob, or FMOD. Any of these can come as third-party plugins instead.
cs: Každý může připojit proprietární nástroje pro potřeby svých projektů - prostě je nebude dodávat spolu s enginem. To může zahrnovat Google AdMob, nebo FMOD. Každý z nich může být užíván jako plugin třetích stran.
de: Jeder kann proprietäre Tools für die Bedürfnisse seiner Projekte einsetzen - sie werden aber nicht mit der Engine ausgeliefert. Dies kann NVIDIA PhysX, Google AdMob oder ein FBX-Modell-Importeur sein. Jedes dieser Plugins kann stattdessen als Drittanbieter-Plugin mitgeliefert werden.
fr: N'importe qui peut brancher des outils propriétaires pour les besoins de ses projets - ils ne seront tout simplement pas livrés avec le moteur. Cela peut inclure Google AdMob, ou FMOD. Tous ces outils peuvent être fournis sous forme de plugins tiers.
ko: 누구나 프로젝트의 요구에 맞게 독점 툴을 연결할 수 있습니다. 여기에는 Google 애드모빌 또는 FMOD가 포함될 수 있습니다. 이들 중 어떤 것들은 대신 서드 파티 플러그인으로 연결할 수 있습니다.
pt_br: Qualquer um pode conectar ferramentas proprietárias em seus projetos - elas só não vêm junto com o motor do Godot. Isso pode incluir NViDia PhysX, o Google Admob ou um importador de arquivos FBX. Qualquer um destes pode vir como plugins de terceiros.
ru: Любой может подключить проприетарный инструментарий для нужд своих проектов - он просто не будет поставляться с движком. Это могут быть, например, Google AdMob или FMOD. Что угодно из этого может подойти в качестве стороннего плагина.
uk: Будь-хто може підключити пропрієтарні інструменти для потреб своїх проектів — вони просто не будуть поставлятися разом із рушієм. Наприклад Google AdMob або FMOD. Натомість будь-який з них може бути підключений як зовнішній плагін.
zh_cn: 任何人都可以根据各自需求添加专有软件——当然它们是不会通过引擎一起提供. 包括Google AdMob或FMOD等, 如果需要可以作为第三方插件来提供.
zh_tw: 任何人都可以根據各自的需求來在自己的專案內插入專屬軟體，這些工具只是不會跟著引擎一起提供給你而已。例如 Google AdMob、或 FMOD。這些專屬軟體工具都作為第三方外掛來提供。

source: On the other hand, an open codebase means you can **learn from and extend the engine** to your heart's content. You can also debug games easily, as Godot will print errors with a stack trace, even if they come from the engine itself.
cs: Na druhé straně, otevřená kódová základna znamená, že se můžete **učit od enginu a rozšiřovat jej** co hrdlo ráčí. Můžete také snadno ladit hry, protože Godot bude tisknout chyby s trasováním zásobníku, i když pocházejí z enginu samotného.
de: Auf der anderen Seite bedeutet eine offene Codebasis, dass Sie **von der Engine lernen und sie erweitern** können. Sie können auch Spiele leicht debuggen, da Godot Fehler mit einem Stack Trace ausgibt, auch wenn sie von der Engine selbst stammen.
fr: D'autre part, une base de code ouverte signifie que vous pouvez **apprendre et étendre le moteur** à votre guise. Vous pouvez également déboguer facilement des jeux, car Godot imprimera les erreurs avec une pile de trace, même si elles proviennent du moteur lui-même.
ko: 반면에 오픈 코드베이스는 **엔진에서 배우고 확장**\ 할 수 있다는 것을 의미합니다. 또한 Godot는 오류가 엔진 자체에서 발생하더라도 스택 추적으로 오류를 출력하므로 게임을 쉽게 디버그할 수 있습니다.
pt_br: Por outro lado, uma base de código aberta significa que você pode **aprender e estender a engine** como desejar. Você também consegue depurar jogos facilmente, pois o Godot irá mostrar erros com um rastreamento de pilha, mesmo se eles vierem da própria engine.
ru: С другой стороны, открытая кодовая база означает, что вы можете **изучать и расширять движок** как вам угодно. Вы также можете легко отлаживать игры, поскольку Godot будет печатать ошибки с отслеживанием стека, даже если они исходят из самого движка.
uk: З іншого боку, відкритий вихідний код означає, що ви можете **навчити і розширити редактор** як забажаєте. Ви також можете легко зневаджувати ігри, оскільки Godot друкує помилки із трасуванням стека, навіть якщо вони надходять із самого рушія.
zh_cn: 另一方面，开放源代码意味着你可以\ **学习并扩展引擎**\ 。你也可以很容易地调试游戏，因为 Godot 会使用堆栈跟踪打印所有错误，即使这些错误来自引擎本身。
zh_tw: 另一方面，開放原始碼代表你可以根據你的需求 **一邊擴充引擎一邊學習** 。而你也可以更輕鬆地來除錯遊戲，因為 Godot 在印出錯誤提示時，就算錯誤是來自引擎內部也會包含在堆疊回溯中 。

source: This **does not affect the work you do with Godot** in any way: there's no strings attached to the engine or anything you make with it.
cs: To **nijak neovlivňuje práci, kterou provádíte s Godotem**: k enginu nejsou připojeny žádné další podmínky a omezení a ani nic, co s ním vytvoříte.
de: Dies hat **keinen Einfluss auf die Arbeit, die man mit Godot macht**: Es gibt keine Bedingungen, die an die Engine geknüpft sind, oder etwas, was man damit macht.
fr: Cela **n'affecte en rien le travail que vous faites avec Godot** : il n'y a aucune condition attachée au moteur ou à tout ce que vous faites avec.
ko: 이것은 **여러분이 Godot로 하는 작업에 어떤 식으로든 영향을 미치지 않습니다**: 엔진은 여러분이 엔진으로 만드는 어떤 것과도 연결되어 있지 않습니다.
pt_br: Isso **não afeta o trabalho que você faz com o Godot** de maneira alguma: não há strings anexadas à engine ou qualquer coisa que você faça com ela.
ru: Это **ни коим образом не влияет на работу, которую вы совершаете с Godot**: нет никаких условий для движка или всего, что вы делаете с ним.
uk: Це жодним чином **не впливає на роботу, яку ви виконуєте з Godot**: до рушія чи будь-чого, що ви з ним робите, немає жодних умов.
zh_cn: **开放源码的协议不会以任何方式影响您用Godot所创作的作品** : 不会有附加条件影响Godot引擎与您用Godot制作的东西.
zh_tw: 開放原始碼不管在各種方面都 **不會影響到你使用 Godot 製作的作品** ：Godot 引擎與所有你通過 Godot 製作的東西都不會帶有附加條件。

source: Community-driven
cs: Řízený komunitou
de: Community-gesteuert
fr: Géré par la communauté
ko: 커뮤니티 중심
pt_br: Orientada pela comunidade
ru: Управляемый сообществом
uk: Керований спільнотою
zh_cn: 社区驱动
zh_tw: 社群驅動

source: **Godot is made by its community, for the community, and for all game creators out there.** It's the needs of the users and open discussions that drive the core updates. New features from the core developers often focus on what will benefit the most users first.
cs: **Godot je vytvořen komunitou, pro komunitu a pro všechny tvůrce her tam venku.** Je to potřeba uživatelů a diskuze, co řídí základní aktualizace. Nové funkce od hlavních vývojářů se často zaměřují na to, co přinese užitek co nejvíce uživatelům.
de: **Godot wird von seiner Gemeinschaft entwickelt für die Gemeinschaft, und für alle Spieleentwickler da draußen.** Es sind die Anforderungen der Nutzer und die offene Diskussionskultur, die den Kurs steuern, nach welchem sich die Engine weiterentwickelt. Neu hinzukommende Features der Kernentwickler konzentrieren sich oft auf die Elemente, die am häufigsten benötigt werden.
fr: **Godot est fait par sa communauté, pour la communauté et pour tous les créateurs de jeux.** Ce sont les besoins des utilisateurs et les discussions ouvertes qui déterminent les mises-à-jour pricipales. Les nouvelles fonctionnalités apportées par les développeurs du moteur se focalisent souvent sur ce qui profitera d'abord au plus grand nombre d'utilisateurs.
ko: **Godot는 커뮤니티에 의해, 커뮤니티를 위해, 모든 게임 제작자를 위해 만들어졌습니다.** 핵심 업데이트를 주도하는 것은 사용자의 요구와 공개 토론입니다. 핵심 개발자들에 의해 개발되는 새로운 기능은 대부분의 사용자에게 가장 먼저 혜택을 주는 것에 초점을 맞추는 경우가 많습니다.
pt_br: **O Godot é feito por sua comunidade, para a comunidade e para todos os criadores de jogos.** São as necessidades dos usuários e as discussões abertas que geram as principais atualizações. Novas funcionalidades dos principais desenvolvedores geralmente focam no que beneficiará a maioria dos usuários em primeiro lugar.
ru: **Godot создается его сообществом, для сообщества и для всех создателей игр.** Именно потребности пользователей и открытые дискуссии движут основными обновлениями. Новые функции от основных разработчиков часто фокусируются на том, что в первую очередь принесет пользу большинству пользователей.
uk: **Godot створений його спільнотою, для спільноти та для всіх творців ігор.** Саме основні потреби користувачів та відкриті дискусії визначають основні оновлення. Нові функції основних розробників часто зосереджуються на тому, що в першу чергу принесе користь користувачам.
zh_cn: **Godot开发自社区, 为其社区内外所有游戏开发者创造的.** 由用户需求及公开讨论驱动核心更新. 核心开发人员的新功能通常将重点放在首先让大多数用户受益的方面.
zh_tw: **Godot 是由社群製作，也是為社群以及世界上所有遊戲創作者所製作的。** 重大的更新都是由使用者的需求與開放的討論而來的。核心開發者製作的新功能通常是優先是為了大多數使用者的利益來考慮。

source: That said, although a handful of core developers work on it full-time, the project has over 600 contributors at the time of writing. Benevolent programmers work on features they may need themselves, so you'll see improvements in all corners of the engine at the same time in every major release.
cs: To znamená, že ačkoli zde pracuje několik vývojářů na plný úvazek, má v době psaní tohoto článku Godot více než 600 přispěvatelů. Dobrovolní programátoři pracují především na funkcích, které mohou potřebovat sami, takže ve všech hlavních vydáních uvidíte průběžné zlepšování všech oblastí, které engine pokrývá.
de: Obwohl nur eine handvoll Kernentwickler in Vollzeit an der Engine arbeiten, hat das Projekt zum Zeitpunkt des Schreibens dieses Textes über 600 Mitwirkende. Programmierer arbeiten an Funktionen, die sie möglicherweise selbst benötigen. Dadurch sieht man Verbesserungen in allen Teilen der Engine in jeder großen Version.
fr: Cela dit, bien qu'une poignée de développeurs y travaillent à plein temps, le projet compte plus de 600 contributeurs au moment de la rédaction. Des programmeurs bénévoles travaillent sur des fonctions dont ils peuvent avoir besoin eux-mêmes, de sorte que vous verrez des améliorations partout dans le moteur à chaque version majeure.
ko: 비록 소수의 핵심 개발자가 하루종일 작업하지만 지금 글을 적고 있는 시점에서 이 프로젝트에는 600명 이상의 기여자가 있습니다. 자비로운 프로그래머는 자신에게 필요할 수 있는 기능에 대해 작업하므로 모든 메이저 릴리스에서 동시에 엔진의 모든 부분에서 개선된 사항을 볼 수 있습니다.
pt_br: Dito isso, embora um punhado de desenvolvedores principais trabalhe em tempo integral, o projeto tem mais de 600 colaboradores no momento dessa redação. Programadores benevolentes trabalham em recursos que necessitam, por isso você verá melhorias em todos os cantos da engine ao mesmo tempo em todas as principais versões.
ru: Тем не менее не смотря на то, что небольшая группа основных разработчиков работает полный рабочий день, в проекте более 600 участников на момент написания. Доброжелательные программисты работают над функциями, которые им самим могут понадобиться, поэтому в каждом крупном выпуске вы увидите улучшения во всех аспектах движка.
uk: Хоча повний робочий день над ним працюють лише декілька основних розробників, проєкт нараховує понад 600 учасників. Доброзичливі програмісти працюють над можливостями, які можуть знадобитися їм самим, тому ви побачите покращення в усіх аспектах рушія в кожному великому випуску.
zh_cn: 就是说, 尽管只有少数全职的核心开发者, 但在撰写本文时, 该项目已有超过600位贡献者. 仁慈的程序员致力于完善他们可能需要的功能, 因此在每个主要版本中都能看到引擎各个方面的改进.
zh_tw: 話雖如此，雖然 Godot 只有少數全職的核心開發者，但本文撰寫時本專案有超過 600 位貢獻者。這些佛心的工程師都是在處理各自的需求，所以 Godot 每次主要更新都包含了各方面的改進。

source: The Godot editor is a Godot game
cs: Editor Godot je Godot hra
de: Der Godot Editor ist ein Godot Spiel
fr: L'éditeur Godot est un jeu Godot
ko: Godot 에디터는 Godot 게임입니다
pt_br: O editor do Godot é um jogo do Godot
ru: Редактор Godot - это игра Godot
uk: Редактор Godot - це гра Godot
zh_cn: Godot 编辑器是 Godot 游戏
zh_tw: Godot 編輯器就是一個 Godot 遊戲

source: The Godot editor runs on the game engine. It uses the engine's own UI system, it can hot-reload code and scenes when you test your projects, or run game code in the editor. This means you can **use the same code** and scenes for your games, or **build plugins and extend the editor.**
cs: Editor Godot běží na herním enginu. Využívá vlastní systém uživatelského rozhraní enginu, může při testování projektů znovu načíst kód a scény, nebo spustit kód hry v editoru. To znamená, že můžete **použít stejný kód** a scény pro své hry, nebo **vytvořit doplňky a rozšířit editor.**
de: Der Godot-Editor läuft auf der Spielengine. Er verwendet das eigene UI-System der Engine und kann beim Testen von Projekten Code und Szenen per Hot-Reload laden oder Spielcode im Editor ausführen. Das bedeutet, dass Sie **denselben Code** und dieselben Szenen für Ihre Spiele verwenden oder **Plugins erstellen und den Editor erweitern können.**
fr: L'éditeur Godot fonctionne sur le moteur de jeu. Il utilise le propre système d'interface utilisateur du moteur, il peut recharger à chaud du code et des scènes lorsque vous testez vos projets, ou exécuter du code de jeu dans l'éditeur. Cela signifie que vous pouvez **utiliser le même code** et les mêmes scènes pour vos jeux, ou **construire des plugins et étendre l'éditeur.**
ko: Godot 에디터는 게임 엔진에서 실행됩니다. 엔진의 자체 UI 시스템을 사용하므로 프로젝트를 테스트하거나 에디터에서 게임 코드를 실행할 때 코드와 씬을 핫 리로드할 수 있습니다. 즉, 게임에 **동일한 코드와 씬을 사용**\ 하거나 **플러그인을 빌드하고 에디터를 확장**\ 할 수 있습니다.
pt_br: O editor do Godot é executado na engine de jogo. Ele usa o próprio sistema de interface do usuário da engine, pode recarregar códigos e cenas ao testar seus projetos ou executar códigos de jogos no editor. Isso significa que você pode **usar o mesmo código** e cenas para seus jogos ou **construir plug-ins e estender o editor.**
ru: Редактор Godot работает на игровом движке. Он использует собственную систему пользовательского интерфейса движка, он может быстро перезагружать код и сцены при тестировании ваших проектов или запускать игровой код в редакторе. Это означает, что вы можете **использовать один и тот же код** и сцены для своих игр или **создавать плагины и расширять редактор.**
uk: Редактор Godot працює на ігровому рушії. Він використовує власну систему інтерфейсу рушія, може перезавантажувати код і сцени під час тестування проєктів, або запускати ігровий код у редакторі. Це означає, що ви можете використовувати **той самий код** і сцени для своїх ігор, або **створювати плагіни та розширювати редактор.**
zh_cn: Godot 编辑器是使用游戏引擎运行的，使用的是引擎自己的 UI 系统，可以在测试项目时热重载代码和场景，也可以在编辑器中运行游戏代码。这意味着\ **相同的代码**\ 既可以用来构建游戏中的场景，又可以用来\ **构建插件对编辑器进行扩展。**
zh_tw: Godot 編輯器是在遊戲引擎上執行的。編輯器使用了 Godot 引擎自己的 UI 系統，能夠在測試專案時熱重載程式碼與場景，或是在編輯器中執行遊戲程式碼。這表示 **同一個程式碼** 可以用在場景，也可以 **製作成外掛並擴充編輯器功能** 。

source: This leads to a reliable and flexible UI system, as it powers the editor itself. With the ``tool`` keyword, you can run any game code in the editor.
cs: To vede k spolehlivému a flexibilnímu systému uživatelského rozhraní, protože to pohání editor samotný. Pomocí klíčového slova ``tool`` můžete v editoru spustit libovolný herní kód.
de: Dies führt zu einem zuverlässigen und flexiblen UI-System, da es den Editor selbst steuert. Mit dem Schlüsselwort ``tool`` können Sie beliebigen Spielcode im Editor ausführen.
fr: Cela conduit à un système d'interface utilisateur fiable et flexible car l'éditeur lui-même est construit avec. Avec le mot-clé ``tool``, vous pouvez exécuter n'importe quel code de jeu dans l'éditeur.
ko: 이는 에디터 자체에 전원을 공급하기 때문에 안정적이고 유연한 UI 시스템으로 이어집니다. ``tool`` 키워드를 사용하면 에디터에서 모든 게임 코드를 실행할 수 있습니다.
pt_br: Isso leva a um sistema de interface de usuário (UI) confiável e flexível, pois aciona o próprio editor. Com a palavra-chave ``tool``, você pode executar qualquer código de jogo no editor.
ru: Это приводит к созданию надежной и гибкой системы пользовательского интерфейса, поскольку она сама настраивает редактор. С ключевым словом ``tool`` вы можете запускать любой игровой код в редакторе.
uk: Це призводить до надійної та гнучкої системи користувацького інтерфейсу, оскільки вона приводить в дію сам редактор. За допомогою ключового слова ``tool`` ви можете запустити будь-який ігровий код у редакторі.
zh_cn: 因此，UI 系统非常稳定、灵活，因为编辑器本身就是由它驱动的。使用 ``tool`` 关键字，你就可以在编辑器中运行任何游戏代码。
zh_tw: 誠如編輯器也仰賴於統一套系統，也讓我們有了可靠與靈活的 UI 系統。使用 ``tool`` 關鍵字，就能在編輯器中執行任何遊戲程式碼。

source: image5
pt_br: imagem5

source: *RPG in a Box is a voxel RPG editor made with Godot 2. It uses Godot's UI tools for its node-based programming system and for the rest of the interface.*
cs: *RPG in a Box je voxel RPG editor vytvořený programem Godot 2. Používá nástroje UI Godota pro svůj programovací systém založený na uzlech a pro zbytek rozhraní.*
de: *RPG in a Box ist ein Voxel-RPG-Editor, der mit Godot 2 erstellt wurde. Er verwendet Godots UI-Tools für sein Node-basiertes Programmiersystem und für den Rest der Benutzeroberfläche.*
fr: *RPG in a Box est un éditeur RPG (Jeux de rôle) en style voxel réalisé avec Godot 2. Il utilise les outils d'interface utilisateur de Godot pour son système de programmation par nœuds et pour le reste de l'interface.*
ko: *RPG in a Box는 Godot 2로 만든 복셀 RPG 편집기입니다. 노드 기반 프로그래밍 시스템과 나머지 인터페이스에 Godot의 UI 툴을 사용합니다.*
pt_br: *RPG in a Box é um editor de RPG voxel feito no Godot 2. Ele usa as ferramentas de Interface com Usuário do Godot para seu sistema de programação baseada em nós e para o resto da interface.*
ru: *RPG in a Box - это воксельный редактор RPG, сделанный с помощью Godot 2. Он использует инструменты пользовательского интерфейса Godot для своей системы программирования на основе узлов и для остальной части интерфейса.*
uk: *RPG in Box - це редактор вокселів RPG , створений з Godot 2. Він використовує інструменти інтерфейсу Godot для своєї програми програмування на основі вузлів та для решти інтерфейсу.*
zh_cn: *RPG in a Box 是一个用 Godot 2 制作的 RPG 体素编辑器。它使用 Godot 的 UI 工具制作了其基于节点的编程系统和界面的其余部分。*
zh_tw: > *RPG in a Box* 是一個使用 Godot 2 開發的 Voxel RPG 編輯器。他使用 Godot 的 UI 工具來製作他的基於節點的程式語言系統以及其他界面。

source: Put the ``tool`` keyword at the top of any GDScript file and it will run in the editor. This lets you import and export plugins, create plugins like custom level editors, or create scripts with the same nodes and API you use in your projects.
cs: Umístěte klíčové slovo ``tool`` na začátek jakéhokoli souboru GDScript a bude spuštěn v editoru. To vám umožní importovat a exportovat pluginy, vytvářet pluginy jako editory na vlastních úrovni nebo vytvářet skripty se stejnými uzly a API, jaké používáte ve svých projektech.
de: Platzieren Sie das Schlüsselwort ``tool`` oben in einer GDScript-Datei und es wird im Editor ausgeführt. Auf diese Weise können Sie Plugins importieren und exportieren, Plugins wie benutzerdefinierte Level-Editoren erstellen oder Skripts mit denselben Nodes und APIs erstellen, die Sie in Ihren Projekten verwenden.
fr: Mettez le mot-clé ``tool`` au début de n'importe quel fichier GDScript et il s'exécutera dans l'éditeur. Cela vous permet d'importer, d'exporter, de créer des plugins comme des éditeurs de niveau personnalisé ou bien de créer des scripts avec les mêmes nœuds et API que vous utilisez dans vos projets.
ko: GDScript 파일의 맨 위에 ``tool`` 키워드를 넣으면 에디터에서 실행됩니다. 이를 통해 플러그인을 가져오거나 내보내고, 커스텀 에디터같은 플러그인을 생성하거나, 프로젝트에서 사용하는 것과 동일한 노드 및 API로 스크립트를 생성할 수 있습니다.
pt_br: Coloque a palavra-chave ``tool`` na parte superior de qualquer arquivo GDscript e ela será executada no editor. Isso permite importar e exportar plug-ins, criar plug-ins como editores de nível personalizados ou criar scripts com os mesmos nós e API que você usa em seus projetos.
ru: Поместите ключевое слово ``tool`` в начало любого файла GDscript, и он будет запущен в редакторе. Это позволяет вам импортировать и экспортировать плагины, создавать такие плагины, как пользовательские редакторы уровней, или создавать скрипты с теми же узлами и API, которые вы используете в своих проектах.
uk: Помістіть ключове слово ``tool`` на початку будь-якого файлу GDScript, і він запуститься в редакторі. Це дозволяє імпортувати та експортувати плагіни, створювати плагіни, такі як-от редактори користувацького рівня, або створювати скрипти з тими ж вузлами та API, які ви використовуєте у своїх проєктах.
zh_cn: 将 ``tool`` 关键字放在任何GDScript文件的顶部, 它将在编辑器中运行. 这使您可以导入和导出插件, 创建自定义级别编辑器之类的插件, 或使用与项目中使用的相同的节点和API来创建脚本.
zh_tw: 將 ``tool`` 關鍵字放在任何 GDScript 檔案的最上方就可以在編輯器中使用。這就讓你可以匯入與匯出外掛、可以建立如自定關卡的編輯器、或是可以使用與專案相同的節點與 API 來建立腳本。

source: The editor is fully written in C++ and is statically compiled into the binary. This means you can't import it as a typical project that would have a ``project.godot`` file.
de: Der Editor ist vollständig in C++ geschrieben und wird statisch in die Binärdatei kompiliert. Das bedeutet, dass Sie ihn nicht wie ein typisches Projekt importieren können, das eine ``project.godot`` Datei hat.
fr: L'éditeur est entièrement écrit en C++ et est compilé de manière statique dans le binaire. Cela signifie que vous ne pouvez pas l'importer comme un projet typique qui aurait un fichier ``project.godot``.
ko: Godot 편집기는 완전히 C++로 작성되었으며 바이너리 실행 파일에 정적(statically)으로 컴파일됩니다. 이는 일반적인 ``project.godot`` 파일이 있는 프로젝트처럼 가져올 수 없음을 의미합니다.
pt_br: O editor é inteiramente escrito em C++ e é compilado estaticamente num binário. Isso significa que você não consegue importa-lo como um objeto qualquer que teria um arquivo ``project.godot``.
ru: Редактор полностью написан на C++ и статически скомпилирован в бинарный файл. Это означает, что вы не можете импортировать его как обычный проект с файлом ``project.godot``.
uk: Редактор повністю написаний на C++ і статично скомпільований у двійковий файл. Це означає, що ви не можете імпортувати його як типовий проект, який має файл ``project.godot``.
zh_cn: 编辑器完全使用 C++ 编写并且静态地编译为二进制文件。这意味着你不能像导入一个拥有 ``project.godot`` 文件的普通项目一样导入它。

source: Separate 2D and 3D engines
cs: Oddělené 2D a 3D enginy
de: Separate 2D- und 3D-Engines
fr: Moteurs 2D et 3D séparés
ko: 2D 와 3D 엔진을 분리
pt_br: Engine 2D e 3D separados
ru: Отдельные 2D и 3D движки
uk: Окремі 2D та 3D рушії
zh_cn: 独立的 2D 和 3D 引擎
zh_tw: 互相獨立的 2D 與 3D 引擎
