Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/godot_design_philosophy.po
Languages: cs, de, fr, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Godot's design philosophy
cs: Filozofie návrhu Godota
de: Godots Design-Philosophie
fr: La philosophie de design de Godot
ko: Godot의 디자인 철학
pt_br: Filosofia de Design do Godot
ru: Философия дизайна Godot
uk: Філософія архітектури Godot
zh_cn: Godot 的设计理念
zh_tw: Godot 的設計理念

source: Now that you've gotten your feet wet, let's talk about Godot's design.
cs: Teď, když jste si ušpinili ruce, pojďme si promluvit o tom, jak byl Godot navržen.
de: Nun, da Sie sich einen Überblick verschafft haben, lassen Sie uns über Godot's Design sprechen.
fr: Maintenant que vous avez pris vos marques, parlons de la conception de Godot.
ko: 슬슬 Godot에 익숙해졌으니 Godot이 어떻게 디자인 되었는지 얘기해봅시다.
pt_br: Agora que você já deu uma mergulhada no assunto, vamos falar no design do Godot.
ru: Теперь, когда вы "набили свою руку", давайте поговорим о дизайне Godot.
uk: Тепер, коли ви "набили руку", давайте поговоримо про архітектуру Godot.
zh_cn: 既然你已经小试身手，让我们谈谈 Godot 的设计。

source: **Every game engine is different and fits different needs.** Not only do they offer a range of features, but the design of each engine is unique. This leads to different workflows and different ways to form your games' structures. This all stems from their respective design philosophies.
cs: **Každý herní engine je jiný a vyhovuje různým potřebám.** Nejenže nabízejí celou řadu funkcí, ale i design každého enginu je unikátní. To vede k různým pracovním postupům a různým způsobům tvorby struktury vašich her. Vše tedy vychází z příslušné filozofie návrhu enginu.
de: **Jede Spiel-Engine ist anders und erfüllt unterschiedliche Bedürfnisse.** Sie bieten nicht nur eine Reihe von Funktionen, sondern auch das Design jeder Engine ist einzigartig. Dies führt zu unterschiedlichen Arbeitsabläufen und unterschiedlichen Möglichkeiten, um die Strukturen Ihrer Spiele zu gestalten. Dies alles ergibt sich aus ihren jeweiligen Designphilosophien.
fr: **Chaque moteur de jeu est différent et répond à des besoins différents.** Non seulement ils offrent une série de fonctionnalités, mais la conception de chaque moteur est unique. Cela conduit à des flux de travail différents et à des façons différentes de former les structures de vos jeux. Tout cela découle de leurs philosophies de design respectives.
ko: **모든 게임 엔진은 다르며 서로 다른 요구사항에 알맞습니다.** 다양한 기능을 제공할뿐만 아니라 각 엔진은 디자인도 독특합니다. 이는 게임의 구조를 형성하는 다양한 방법과 다양한 워크플로로 이어집니다. 게임 엔진의 디자인은 모두 각자의 디자인 철학에서 비롯되었습니다.
pt_br: **Cada motor de jogo é diferente e atende a necessidades diferentes.** Não apenas oferecem uma gama de recursos, mas o design de cada motor de jogo é único. Isso leva a diferentes fluxos de trabalho e diferentes maneiras de formar as estruturas dos seus jogos. Tudo isso vem de suas respectivas filosofias de design.
ru: **Каждый игровой движок отличается и соответствует разным потребностям.** Они не только предлагают широкий спектр функций, но и дизайн каждого движка уникален. Это приводит к разным рабочим процессам и различным способам формирования структур ваших игр. Все это вытекает из их соответствующих концепций дизайна.
uk: **Кожен ігровий рушій різний і відповідає різним потребам.** Вони не тільки пропонують цілий ряд функцій, але й архітектура кожного рушія унікальна. Це призводить до різних робочих процесів та різних способів формування структур ваших ігор. Все це випливає з їхніх конкретних особливостей.
zh_cn: **游戏引擎各不相同，以满足不同的需求。**\ 它们不仅提供一系列功能，而且每个引擎的设计都是独一无二的。这将导致不同工作流程和项目组织结构。这一切都源于它们各自的设计理念。
zh_tw: **所有的遊戲引擎都是不同的，而且適用於不同的需求。** 不同遊戲引擎不僅提供了不同的功能，他們各自的設計也有所不同。這就造成了工作流程的不同與不同的遊戲架構組織方式。而這都要歸咎於他們各自的設計理念。

source: This page is here to help you understand how Godot works, starting with some of its core pillars. It is not a list of available features, nor is it an engine comparison. To know if any engine can be a good fit for your project, you need to try it out for yourself and understand its design and limitations.
cs: Tato stránka vám pomůže pochopit, jak Godot a některé jeho základní pilíře fungují. Nejedná se tedy o seznam dostupných funkcí, ani o porovnání enginů. Chcete-li vědět, zda je nějaký engine pro váš projekt vhodný, musíte si jej vyzkoušet a pochopit jeho konstrukci a omezení.
de: Diese Seite soll Ihnen helfen, die Funktionsweise von Godot zu verstehen, angefangen bei einigen Grundpfeilern. Es ist keine Liste verfügbarer Funktionen und auch kein Engine-Vergleich. Um herauszufinden, ob eine Engine für Ihr Projekt gut geeignet ist, müssen Sie sie selbst ausprobieren und deren Design und Einschränkungen verstehen.
fr: Cette page est là pour vous aider à comprendre le fonctionnement de Godot, en commençant par certains de ses piliers fondamentaux. Il ne s'agit pas d'une liste des fonctionnalités disponibles, ni d'une comparaison de moteurs. Pour savoir si un moteur peut convenir à votre projet, vous devez l'essayer vous-même et comprendre sa conception et ses limites.
ko: 이 페이지는 Godot의 작동방식을 이해하도록 돕기 위해, 여러 핵심 기둥으로부터 시작합니다. 이 페이지는 사용가능한 기능의 목록이 아닐 뿐더러, 엔진을 비교하는 문서도 아닙니다. 프로젝트에 적합한 엔진이 있는지 확인하려면 여러분 스스로 시도하고 엔진의 디자인과 한계를 이해해야 합니다.
pt_br: Esta página está aqui para ajudá-lo a entender como funciona o Godot, começando com alguns de seus fundamentos. Não é uma lista de funcionalidades disponíveis, nem uma comparação de motores de jogos. Para saber se algum motor de jogo é uma boa escolha para seu projeto, você mesmo precisa testá-los e entender seu design e limitações.
ru: Эта страница здесь для того, чтобы помочь вам понять, как Godot работает, начиная с самых основ. Это не список доступных возможностей, также это не сравнение различных движков. Чтобы понять, хорошо ли подходит какой-либо движок для вашего проекта, его необходимо попробовать самостоятельно и понять его архитектуру и ограничения.
uk: Ця сторінка тут для того, щоб допомогти вам зрозуміти як Godot працює, починаючи з самих основ. Це не список доступних можливостей, також це не порівняння різних рушіїв. Щоб зрозуміти, чи добре підходить якийсь рушій для проєкту, його необхідно спробувати і зрозуміти його архітектуру і обмеження.
zh_cn: 这个页面是为了帮助你通过godot的一些核心功能来理解它的工作原理. 这个页面既不是godot特性的介绍列表, 也不会对各个引擎做比较. 要知道哪一种引擎更适合你的项目, 你需要自己尝试一下并了解各个引擎对设计和局限性.
zh_tw: 這個頁面會幫助你瞭解 Godot 的運作原理，會先一些核心概念開始。這裡不是要介紹 Godot 包含的功能，也不是要比較各個引擎。如果要知道哪一種引擎適合你的專案，需要自己嘗試並瞭解各個引擎的設計與其限制。

source: Please watch `Godot explained in 5 minutes <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ if you're looking for an overview of the engine's features.
cs: Pokud hledáte přehled funkcí enginu, podívejte se prosím na `Godot vysvětlený v 5 minutách <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_.
de: Bitte schauen Sie sich `Godot explained in 5 minutes <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ an, wenn Sie einen Überblick über die Funktionen der Engine suchen.
fr: Veuillez regarder `Godot explained in 5 minutes <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ (vidéo en Anglais) pour un aperçu des fonctionnalités du moteur.
ko: 이 엔진의 전체 특징을 보고싶다면 `Godot explained in 5 minutes <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ 이 영상을 시청해주세요.
pt_br: Por favor assista `Godot explicado em 5 minutos <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ se você estiver procurando por uma visão geral das funcionalidades do motor de jogos.
ru: Пожалуйста, посмотрите `Обзор Godot 3, свободного игрового движка <https://youtu.be/4v3qge-3CqQ>`_, если вы ищете обзор возможностей движка.
uk: Будь ласка, подивіться `Що таке Godot. Пояснення за 5 хвилин <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_, якщо ви шукаєте огляд функцій рушія.
zh_cn: 如果你在寻找引擎特性的概览，请观看 `Godot explained in 5 minutes <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_\ 。
zh_tw: 如果你想瞭解的是引擎功能的概覽，請觀看 `Godot explained in 5 minutes <https://www.youtube.com/watch?v=KjX5llYZ5eQ>`_ （英語）。

source: Object-oriented design and composition
cs: Objektově orientovaný návrh a kompozice
de: Objektorientiertes Design und Komposition
fr: Design et composition orientées objet
ko: 객체 지향 디자인과 구성
pt_br: Design orientado a objetos e composição
ru: Объектно-ориентированный дизайн и композиция
uk: Об'єктно-орієнтоване проєктування і композиція
zh_cn: 面向对象的设计与组合
zh_tw: 物件導向的設計與組合

source: Godot embraces object-oriented design at its core with its flexible scene system and Node hierarchy. It tries to stay away from strict programming patterns to offer an intuitive way to structure your game.
cs: Godot zahrnuje objektově orientovaný design ve svém jádru díky flexibilnímu systému scén a hierarchii uzlů. Snaží se držet dál od přísných programovacích vzorů a nabízí intuitivní způsob, jak strukturovat vaši hru.
de: Godot setzt auf objektorientiertes Design mit seinem flexiblen Szenensystem und der Node-Hierarchie. Die Engine versucht sich von strengen Programmiermustern fernzuhalten, um das Spiel intuitiv zu strukturieren.
fr: Godot embrasse le design orienté objet à sa racine avec son système de scènes flexible et sa hiérarchie de nœuds. Il essaie de rester éloigné des modèles de programmation stricts pour offrir un moyen intuitif de structurer votre jeu.
ko: Godot는 유연한 씬 시스템과 노드 계층 구조로 이루어진 객체 지향 디자인을 핵심으로 받아들입니다. 이로인해 엄격한 프로그래밍 패턴을 피하고 직관적인 방법으로 게임을 구성하도록 했습니다.
pt_br: Godot adota o design orientado a objetos em seu núcleo, com seu sistema de cena flexível e hierarquia de Nós. Ele tenta ficar longe de padrões estritos de programação para oferecer uma maneira intuitiva de estruturar seu jogo.
ru: В основе Godot лежит объектно-ориентированный дизайн с его гибкой системой сцен и иерархией узлов. Он старается держаться подальше от строгих шаблонов программированияв в угоду интуитивному способу структурирования вашей игры.
uk: Godot включає в себе об'єктно-орієнтоване проєктування з його гнучкою системою сцен та ієрархією вузлів. Він намагається триматися подалі від суворих шаблонів програмування, щоб запропонувати інтуїтивний спосіб структурування вашої гри.
zh_cn: Godot凭借其灵活的场景系统和节点层次结构, 将面向对象设计作为其核心. 它试图远离严格的编程模式, 以提供直观的方式来构建游戏.
zh_tw: Godot 通過靈活的場景系統與節點結構，在核心設計上就貫徹了物件導向設計。Godot 避免強制規定程式設計模式來讓你用更直觀的方式組織遊戲。

source: For one, Godot lets you **compose or aggregate** scenes. It's like nested prefabs: you can create a BlinkingLight scene and a BrokenLantern scene that uses the BlinkingLight. Then, create a city filled with BrokenLanterns. Change the BlinkingLight's color, save, and all the BrokenLanterns in the city will update instantly.
cs: Pro jednu, Godot vám umožňuje **komponovat nebo agregovat** scény. Je to jako vnořené montované panely: můžete vytvořit scénu BlinkingLight a scénu BrokenLantern, která používá BlinkingLight. Poté vytvořte město plné BrokenLanterns. Změňte barvu, uložte BlinkingLight a všechny BrokenLanterns ve městě se okamžitě aktualizují.
de: Sie können zum Beispiel mit Godot Szenen **zusammenstellen oder zusammenfassen**. Es ist wie verschachtelte Fertigteile: Sie können eine BlinkendesLicht-Szene und einer KaputteLaterne-Szene erstellen, die BlinkendesLicht verwendet. Dann erstellen Sie eine Stadt mit KaputteLaterne. Ändern Sie die Farbe des BlinkendesLicht, speichern es und alle KaputteLaterne Objekte in der Stadt werden sofort aktualisiert.
fr: D'une part, Godot vous permet de **composer ou d'agréger** des scènes. C'est comme des préfabriqués imbriqués : vous pouvez créer une scène BlinkingLight et une scène BrokenLantern qui utilise le BlinkingLight. Ensuite, créez une ville remplie de BrokenLanterns. Changez la couleur du BlinkingLight, sauvegardez, et toutes les BrokenLanterns dans la ville se mettront à jour instantanément.
ko: 예를 들어 Godot를 사용하면 씬을 **구성하거나 집합**할 수 있습니다. 중첩된 조립식 건물과 같습니다. BrinkingLight 씬과 BrinkingLight를 사용하는 BrokenLantern 씬을 만들 수 있습니다. 그런 다음 BrokenLanterns로 가득 찬 도시를 만드세요. BrinkingLight의 색상을 변경하고 저장하면 도시의 모든 BrokenLanterns가 즉시 업데이트됩니다.
pt_br: Por um lado, Godot permite **compor ou agregar** cenas. É como prefabs aninhados: você pode criar uma cena BlinkingLight e uma cena BrokenLantern que usa o BlinkingLight. Em seguida, crie uma cidade repleta de BrokenLanterns. Mude a cor do BlinkingLight, salve e todos os BrokenLanterns na cidade serão atualizados instantaneamente.
ru: Например, Godot позволяет вам **составлять или собирать** сцены. Это как вложенные префабы: вы можете создать сцену с мерцающим светом и сцену со сломанным фонарём, который использует мерцающий свет. Затем создать город, наполненный сломанными фонарями. Поменяйте цвет мерцающего света, сохраните, и все сломанные фонари в городе тут же обновятся.
uk: По-перше, Godot дозволяє вам **складати або збирати** сцени. Це як вкладені префаби: ви можете створити мерехтливе світло і сцену зі зламаним ліхтарем, який використовує мерехтливе світло. Потім створити місто наповнений такими ліхтарями. Потім поміняти колір мерехтіння, зберегти об'єкт, і всі ліхтарі тут же оновляться.
zh_cn: 首先，Godot 可以让你把场景\ **组合或聚合**\ 起来。这和嵌套的预制件是类似的：你可以创建 BlinkingLight 场景，并创建使用 BlinkingLight 的 BrokenLantern 场景。然后，创建一个充满 BrokenLantern 的城市。更改 BlinkingLight 的颜色、保存，城市中的所有 BrokenLantern 都会立即更新。
zh_tw: 首先，Godot 讓你可以 **組合或聚合** 場景。這樣的做法就像巢狀架構的 Prefab 一樣：可以建立一個「BlinkingLight」（閃燈）場景與一個使用 BlingkingLight 的「BrokenLantern」（壞掉的路燈）場景。接著，製作一個使用 BrokenLantern 填滿的城市。一旦修改了 BlinkingLight 的色彩，城市裡所有的 BrokenLantern 都會馬上跟著一起變。

source: On top of that, you can **inherit** from any scene.
cs: Navíc můžete **dědit** z jakékoliv scény.
de: Darüber hinaus können Sie von jeder Szene **erben**.
fr: En plus de cela, vous pouvez **hériter** de n'importe quelle scène.
ko: 게다가 어떤 씬에서든지 **상속**\ 할 수 있습니다.
pt_br: Além disso, você pode **herdar** de qualquer cena.
ru: Более того, вы можете **наследовать** от любой сцены.
uk: Більш того, ви можете **успадковувати** від будь якої сцени.
zh_cn: 更重要的是，你可以从任何场景\ **继承**\ 。
zh_tw: 重點是，場景可以 **繼承** 。

source: A Godot scene could be a Weapon, a Character, an Item, a Door, a Level, part of a level… anything you'd like. It works like a class in pure code, except you're free to design it by using the editor, using only the code, or mixing and matching the two.
cs: Godotová scéna může být zbraň, postava, položka, dveře, úroveň, část úrovně ... cokoli, co budete chtít. Funguje to jako třída v čistém kódu, kromě toho, že si ji můžete navrhnout pomocí editoru nebo pouze kódem anebo smícháním a porovnáním obou.
de: Eine Godot-Szene kann eine Waffe, ein Charakter, ein Gegenstand, eine Tür, ein Level, ein Teil eines Levels sein ... alles, was Sie möchten. Es funktioniert wie eine Klasse in reinem Code, außer dass Sie es frei gestalten können, indem Sie den Editor oder nur den Code verwenden oder beides kombinieren.
fr: Une scène Godot peut être une arme, un personnage, un objet, une porte, un niveau, une partie d'un niveau… tout ce que vous voulez. Elle fonctionne comme une classe en pur code classique sauf que vous êtes libre de la concevoir en utilisant l'éditeur, en utilisant seulement le code, ou en mélangeant et en faisant correspondre les deux.
ko: Godot 씬은 무기, 캐릭터, 아이템, 문, 레벨, 레벨의 일부… 원하는 모든 것이 될 수 있습니다. 에디터를 사용하거나, 코드만 사용하거나, 둘을 혼합하여 일치시켜 자유롭게 디자인할 수 있다는 점을 제외하고는 순수 코드의 클래스처럼 작동합니다.
pt_br: Uma cena do Godot poderia ser uma Arma, um Personagem, um Item, uma Porta, uma Fase, parte de uma fase... qualquer coisa que você quiser. Funciona como uma classe em código puro, com a exceção de que você é livre para projetá-la usando o editor, usando apenas o código ou misturando e combinando os dois.
ru: Сценой в Godot может являться оружие, персонаж, предмет, дверь, уровень, часть уровня... всё, что пожелаете. Это работает как классы в коде, за исключением лишь того, что вы создаёте всё сами, используя редактор, либо только код, либо и то и другое одновременно.
uk: Сцена Godot може бути зброєю, персонажем, предметом, дверима, рівнем, частиною рівня... всім, чим завгодно. Вона працює як клас у чистому коді, за винятком того, що ви вільні спроєктувати її лише за допомогою редактора, лише використовуючи код, або змішуючи та поєднуючи обидва способи.
zh_cn: Godot 场景可以是武器、角色、物品、门、关卡、关卡的一部分……任何你能想象的东西。它就像类一样，但也可以使用编辑器，纯代码或同时使用两者来编辑场景。
zh_tw: Godot 的場景可以是一個武器、或是一個角色、是一件物品、一扇門、一道關卡、或是一道關卡的一部分……等任何你能想像的東西。在程式碼中場景就以物件的形式存在，但你也可以使用編輯器來設計場景，也可以只用程式碼來設計出場景，或是同時用編輯器與程式碼來設計場景。

source: It's different from prefabs you find in several 3D engines, as you can then inherit from and extend those scenes. You may create a Magician that extends your Character. Modify the Character in the editor and the Magician will update as well. It helps you build your projects so that their structure matches the game's design.
cs: Je to odlišné od prefabrikátů, které najdete v některých 3D enginech, protože tyto scény pak můžete zdědit a rozšířit. Můžete si vytvořit Kouzelníka, který rozšíří vaši Postavu. Upravte Postavu v editoru a Kouzelník se také aktualizuje. Godot vám pomáhá vytvářet vaše projekty tak, aby jejich struktura odpovídala designu hry.
de: Es unterscheidet sich von prefabs in anderen 3D-Engines, da man von diesen Szenen erben und sie erweitern kann. Sie können einen Magier erstellen, der Ihren Charakter erweitert. Ändere den Charakter im Editor und der Magier wird ebenfalls aktualisiert. Es hilft Ihnen Ihre Projekte so zu erstellen, dass deren Struktur dem Design des Spiels entspricht.
fr: C'est différent des prefabs que l'on trouve dans plusieurs moteurs 3D car on peut ensuite en hériter et étendre ces scènes. Vous pouvez créer un Magician qui étend votre Character. Modifiez le Character dans l'éditeur et le Magician se mettra également à jour. Cela vous aide à construire vos projets afin que leur structure corresponde au design du jeu.
ko: 씬은 상속하고 확장할 수 있기 때문에 여러 3D 엔진에서 찾을 수 있는 프리팹(prefab)과는 다릅니다. 여러분은 여러분의 캐릭터를 확장해서 마술사(Magician)로 만들 수 있습니다. 에디터에서 캐릭터를 수정하면 Magician도 업데이트됩니다. 이는 구조가 게임 디자인과 일치하도록 프로젝트를 빌드하는 데 도움이 됩니다.
pt_br: É diferente das prefabs que você encontra em vários motores 3D, pois você pode herdar e estender essas cenas. Você pode criar um Mago que estenda seu Personagem. Modifique o Personagem no editor e o Mago também atualizará. Isso te ajuda a criar seus projetos de modo que sua estrutura corresponda ao design do jogo.
ru: Это отличается от префабов, которые можно найти в некоторых 3D движках, так как вы можете наследовать и расширять любую сцену. К примеру, вы можете создать сцену "Маг", которая будет потомком вашей сцены "Персонаж". Измените сцену "Персонаж" в редакторе, и сцена "Маг" также будет обновлена. Это позволит вам построить свои проекты таким образом, чтобы их структура соответствовала дизайну игры.
uk: Це відрізняється від збірних даних (префабів), які ви знайдете в деяких тривимірних редакторах, тому що ви можете успадкувати та розширити ці сцени. Ви можете створити сцену Чаклун, яка буде успадкована та розширена з вашої сцени Персонаж. Змініть Персонаж у редакторі, і Чаклун також оновиться. Це допомагає вам будувати свої проєкти так, щоб їх структура відповідала архітектурі гри.
zh_cn: 和其他几个 3D 引擎的 Prefab（预制体）不同，场景可以通过继承来扩展。你可以创建一个 Magician（魔术师）来扩展您的 Character（角色）。在编辑器中修改 Character 后 Magician 也会更新。这样的设计可以帮你保持项目结构与设计的一致性。
zh_tw: 但 Godot 的場景與其他各種 3D 引擎的 Prefab 不同，因為在 Godot 中，可以對場景繼承來進行擴充。你可以建立一個繼承自 Character （角色）場景的 Magician（魔術師）場景，並在編輯器中修改 Character，接著 Magician 便會隨之更新。這樣的設計可以幫助你在建立專案時，這些架構都能符合遊戲的設計。

source: image0
pt_br: imagem0

source: Also note that Godot offers many different types of objects called nodes, each with a specific purpose. Nodes are part of a tree and always inherit from their parents up to the Node class. Although the engine does feature some nodes like collision shapes that a parent physics body will use, most nodes work independently from one another.
cs: Také si všimněte, že Godot nabízí mnoho různých typů objektů zvaných uzly, každý se specifickým účelem. Uzly jsou součástí stromu a vždy dědí od svých rodičů až po základní třídu Node. Ačkoli engine obsahuje některé uzly, jako jsou kolizní tvary, které jsou využívány rodičovským uzlem, zde fyzikálním tělesem (physic body), většina uzlů pracuje nezávisle na sobě.
de: Beachten Sie auch, dass Godot viele verschiedene Arten von Objekten bereitstellt, die als Nodes bezeichnet werden und jeweils einen bestimmten Zweck haben. Nodes sind Teil eines Baumes und erben immer von ihren Eltern bis zur Node-Klasse. Obwohl die Engine auch über Komponenten wie Kollisionsformen verfügt, handelt es sich hierbei um die Ausnahme und nicht um die Regel.
fr: Notez également que Godot offre de nombreux types différents d'objets appelés nœuds, chacun avec un but spécifique. Les nœuds font partie d'un arbre et héritent toujours de leurs parents jusqu'à la classe Node. Bien que le moteur comporte certains nœuds comme les formes de collision qu'un corps physique parent utilisera, la plupart des nœuds fonctionnent indépendamment les uns des autres.
ko: 또한 Godot은 노드라고 불리는 다양한 형태의 오브젝트를 제공한다는 것을 기억하세요. 각각 특정한 목적으로 쓰이는 노드는 트리의 파트이며, 언제나 노드 클래스라고 하는 부모에게 상속되어 있습니다. 그러므로 충돌을 구현할 때 쓰이는 콜리전과 같은 특정 노드라도 다른 노드들과는 분리되어 작동합니다.
pt_br: Observe também que Godot oferece muitos tipos diferentes de objetos chamados nós, cada um com uma finalidade específica. Os nós fazem parte de uma árvore e sempre herdam de seus pais até a classe Node. Embora o mecanismo apresente alguns nós como formas de colisão que um corpo físico pai usará, a maioria dos nós funciona independentemente um do outro.
ru: Также обратите внимание, что Godot предлагает множество различных типов объектов, называемых узлами, каждый из которых имеет определенную цель. Узлы являются частью дерева и всегда наследуют от своих родителей вплоть до класса **Node** (**Узел**). Хоть в движке и есть некоторые узлы, такие как формы столкновения, которые будут использоваться родительским физическим телом, большинство узлов работают независимо друг от друга.
uk: Також зауважте, що Godot пропонує безліч різних типів об'єктів, які називаються вузлами, кожен з певним призначенням. Вузли є частиною дерева і завжди успадковуються від батьків аж до класу Node (Вузол). Хоча редактор має такі компоненти, як форми зіткнення, які використовують батьківське фізичне тіло, більшість вузлів працюють незалежно один від одного.
zh_cn: Godot 还提供了不同类型的对象，称作节点，每种节点都有特定的用途。节点是场景树的一部分，最终继承自 Node 类。尽管引擎提供的碰撞形状等节点确实会被父节点物理实体所使用，但大多数节点都可以独立使用。

source: In other words, Godot's nodes do not work like components in some other game engines.
de: Mit anderen Worten, Godot's Nodes funktionieren nicht wie Komponenten in einigen anderen Spiel-Engines.
fr: En d'autres termes, les nœuds de Godot ne fonctionnent pas comme les composants de certains autres moteurs de jeu.
ko: 다시말해, Godot에서의 노드는 다른 일부 게임 엔진에서의 요소와는 조금 다르게 작동합니다.
pt_br: Em outras palavras, os nós do Godot não funcionam como componentes em outros motores de jogos.
ru: Другими словами, узлы Godot работают не так, как компоненты в некоторых других игровых движках.
uk: Іншими словами, вузли Godot не працюють як компоненти в деяких інших ігрових рушіях.
zh_cn: 换句话说，Godot的节点并不像其他一些游戏引擎中的组件那样工作。

source: image1
pt_br: imagem1
