Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/godot_design_philosophy.po
Languages: cs, de, fr, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Godot offers dedicated 2D and 3D rendering engines. As a result, **the base unit for 2D scenes is pixels.** Even though the engines are separate, you can render 2D in 3D, 3D in 2D, and overlay 2D sprites and interfaces over your 3D world.
cs: Godot nabízí jednoúčelové 2D a 3D vykreslovací enginy. Výsledkem je, že **základní jednotkou pro 2D scény jsou pixely.** Přestože jsou enginy oddělené, můžete vykreslit 2D ve 3D, 3D ve 2D a překrýt 2D sprity a rozhraní přes svůj 3D svět.
de: Godot bietet dedizierte 2D- und 3D-Rendering-Engines an. Daher ist **die Basiseinheit für 2D-Szenen Pixel.** Obwohl die Engines getrennt sind, können Sie 2D in 3D und 3D in 2D rendern sowie 2D-Sprites und -Benutzeroberflächen über Ihre 3D-Welt platzieren.
fr: Godot propose des moteurs de rendu 2D et 3D dédiés. Ainsi, **l'unité de base pour les scènes 2D est le pixel**. Même si les moteurs sont distincts, vous pouvez faire un rendu 2D en 3D, 3D en 2D, et superposer des sprites et des interfaces 2D avec votre monde 3D.
ko: Godot는 전용 2D 및 3D 렌더링 엔진을 제공합니다. 결과적으로 **2D 씬의 기본 단위는 픽셀입니다.** 엔진이 분리되어 있어도 2D를 3D로, 3D를 2D로 렌더링하고 2D 스프라이트와 인터페이스를 3D 세계에 오버레이할 수 있습니다.
pt_br: O Godot oferece mecanismos dedicados de renderização 2D e 3D. Como resultado, **a unidade base para cenas 2D é pixels.** Mesmo que os mecanismos sejam separados, você pode renderizar 2D em 3D, 3D em 2D e sobrepor sprites 2D e fazer a interface em seu mundo 3D.
ru: Godot предлагает специализированные движки 2D- и 3D-рендеринга. В итоге **базовая единица для 2D-сцен - это пиксели.** Несмотря на то, что движки являются отдельными, вы можете отрендерить 2D в 3D, 3D в 2D и накладывать 2D-спрайты и интерфейсы поверх вашего 3D-мира.
uk: Godot пропонує спеціалізовані рушії 2D та 3D візуалізації. В результаті **базовою одиницею для 2D сцен є пікселі**. Незважаючи на те, що рушії є окремими, ви можете візуалізувати 2D в 3D, 3D в 2D і накладати 2D спрайти та інтерфейси поверх вашого 3D-світу.
zh_cn: Godot分别提供了独立的2D和3D渲染引擎. **2D场景的基本单位使用的是像素.** 即使引擎是分开的, 您依然可以在3D中渲染2D, 在2D中渲染3D, 也能在您的3D世界上叠加2D图片与界面.
zh_tw: Godot 提供了互相獨立的 2D 與 3D 算繪引擎。所以 **2D 場景的基本單位是像素** 。雖然引擎是分開的，但你可以在 3D 中使用 2D、在 2D 中使用 3D 、或是在 3D 世界中使用 2D Sprite 或界面。

source: Translation status
cs: Stav překladu
de: Übersetzungsstatus
fr: État de la traduction
ko: 번역 상태
pt_br: Estado da Tradução
ru: Translation status (статус перевода)
uk: Стан перекладу
zh_cn: 翻译状态
zh_tw: 翻譯狀態
