Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/godot_design_philosophy.po
Languages: cs, de, fr, ko, pt_br, ru, uk, zh_cn, zh_tw

source: Sprite is a Node2D, a CanvasItem and a Node. It has all the properties and features of its three parent classes, like transforms or the ability to draw custom shapes and render with a custom shader.
cs: Sprite je potomek Node2D, CanvasItem a Node. Má všechny vlastnosti a rysy svých tří nadřazených (rodičovských) tříd, jako jsou transformace nebo schopnost kreslit vlastní tvary a vykreslovat se pomocí vlastního shaderu.
de: Sprite ist ein Node2D, ein CanvasItem und ein Node. Es verfügt über alle Eigenschaften und Funktionen der drei übergeordneten Klassen, z.B. Transformationen oder die Möglichkeit, benutzerdefinierte Formen zu zeichnen und mit einem benutzerdefinierten Shader zu rendern.
fr: Sprite est un Node2D, un CanvasItem et un Node. Il a toutes les propriétés et les caractéristiques de ses trois classes parents, comme les transformations ou la possibilité de dessiner des formes personnalisées et de faire un rendu avec un shader personnalisé.
ko: 스프라이트는 Node2D, CanvasItem, 그리고 노드로 이루어집니다. 이러한 노드는 세 부모 클래스가 가지는 변환, 모형 생성, 커스텀 셰이더의 렌더와 같은 속성과 특징을 그대로 가집니다.
pt_br: Sprite é um Node2D, um CanvasItem e um Node. Ele tem todas as propriedades e recursos de suas três classes principais, como transformações ou a capacidade de desenhar formas personalizadas e renderizar com um sombreador personalizado.
ru: Sprite наследуется от классов Node2D, CanvasItem и Node. Благодаря этому он обладает их свойствами и особенностями, что позволяет ему, к примеру, выполнять преобразования или же отрисовывать произвольные фигуры и визуализировать их при помощи сторонних шейдеров.
uk: Sprite — це Node2D, CanvasItem і Node. Він володіє всіма властивостями та функціями трьох батьківських класів, як-от перетворення або можливість малювати користувацькі фігури та відображати за допомогою спеціального шейдера.
zh_cn: Sprite 属于 Node2D、CanvasItem、Node 类型。它具有三个父类的所有属性和功能，比如变换或者绘制自定义形状和使用自定义着色器渲染的能力。

source: All-inclusive package
cs: All-inclusive balíček
de: Rundum-sorglos-Paket
fr: Forfait tout compris
ko: 올인원 패키지
pt_br: Pacote com tudo incluído
ru: Полный пакет
uk: Повний пакет
zh_cn: 完善的工具集
zh_tw: 一條龍服務的套裝軟體

source: Godot tries to provide its own tools to answer most common needs. It has a dedicated scripting workspace, an animation editor, a tilemap editor, a shader editor, a debugger, a profiler, the ability to hot-reload locally and on remote devices, etc.
cs: Godot se snaží poskytnout své vlastní nástroje k řešení nejběžnějších potřeb. Má vyhrazený skriptovací pracovní prostor, animační editor, tilemap editor, shader editor, debugger, profiler, schopnost znovu se načíst lokálně a na vzdálených zařízeních atd.
de: Godot versucht, seine eigenen Werkzeuge zur Verfügung zu stellen, um die häufigsten Bedürfnisse zu erfüllen. Es verfügt über einen dedizierten Scripting-Arbeitsbereich, einen Animationseditor, einen TileMap-Editor, einen Shader-Editor, einen Debugger, einen Profiler, die Fähigkeit, Hot-Reloads lokal und auf Remote-Geräten usw. durchzuführen.
fr: Godot essaie de fournir ses propres outils pour répondre aux besoins les plus courants. Il dispose d'un espace de travail dédié aux scripts, d'un éditeur d'animation, d'un éditeur de tilemap, d'un éditeur de shader, d'un débogueur, d'un profileur, de la possibilité de rechargement à chaud local et sur des périphériques distants, etc.
ko: Godot는 가장 일반적인 요구 사항을 위해 자체 툴을 제공하려고 합니다. 전용 스크립팅 작업 공간, 애니메이션 편집기, 타일맵 편집기, 셰이더 편집기, 디버거, 프로파일러, 로컬 및 원격 장치에서 핫 리로드 등의 기능이 있습니다.
pt_br: O Godot tenta fornecer suas próprias ferramentas para responder às necessidades mais comuns. Tem um editor de script dedicado, um editor de animação, um editor de tilemaps, um editor de shaders, um depurador, um profiler, a capacidade de hot-reload local e em dispositivos remotos, etc.
ru: Godot предоставляет свои собственные инструменты для удовлетворения наиболее распространенных потребностей. Он имеет встроенный редактор кода, редактор анимации, редактор tilemap, редактор шейдеров, отладчик, профилировщик, возможность перезагрузки на ходу локально и на удаленных устройствах и многое другое.
uk: Godot надає свої власні інструменти для задоволення найбільш поширених потреб. Він має вбудований редактор коду, редактор анімації, редактор tilemap, редактор шейдерів, зневаджувач, профілювальник, можливість перезавантаження на ходу локально і на віддалених пристроях і багато іншого.
zh_cn: Godot尝试提供自己的工具来满足最常见的需求. 它具有专用的脚本工作区, 动画编辑器, tilemap编辑器, 着色器编辑器, 调试器, 分析器, 能够在本地和远程等设备上热重载的功能.
zh_tw: Godot 竭力自主提供一般情況下會用到的工具。我們有專用的腳本工作區、有動畫編輯器、有圖塊編輯器、有著色器編輯器、有除錯工具、有分析工具、還有可以在本機與遠端裝置上熱重載 (Hot-Reload) 的功能…等。

source: image2
pt_br: imagem2

source: The goal is to offer a full package to create games and a continuous user experience. You can still work with external programs as long as there is an import plugin for it. Or you can create one, like the `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
cs: Cílem je nabídnout kompletní balíček pro vytváření her a plynulou uživatelskou zkušenost. Stále můžete pracovat s externími programy, pokud pro ně existuje plugin pro import. Nebo si můžete jeden vytvořit, například `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
de: Ziel ist es, ein komplettes Paket für die Erstellung von Spielen und eine kontinuierliche Benutzererfahrung anzubieten. Sie können weiterhin mit externen Programmen arbeiten, sofern dafür ein Import-Plugin vorhanden ist. Sie können auch ein eigenes erstellen, wie z.B. den `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
fr: L'objectif est d'offrir un package complet pour créer des jeux et une expérience utilisateur continue. Vous pouvez toujours travailler avec des programmes externes tant qu'il existe un plugin d'importation. Ou vous pouvez en créer un, comme le `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
ko: 저희의 목표는 게임과 지속적인 사용자 경험을 만들기 위한 전체 패키지를 제공하는 것입니다. 가져오기 플러그인이 있는 한 외부 프로그램으로 계속 작업할 수 있습니다. 또는 `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__\ 처럼 여러분이 하나를 만들 수도 있습니다.
pt_br: O objetivo é oferecer um pacote completo para criar jogos e uma experiência de usuário contínua. Você ainda pode trabalhar com programas externos desde que exista um plugin de importação para ele. Ou você pode criar um, como o `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
ru: Цель состоит в том, чтобы предложить полный пакет для создания игр и непрерывного обучения. Вы по-прежнему можете работать с внешними программами, если для них есть плагин импорта. Или вы можете создать его, например, `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
uk: Мета полягає в тому, щоб запропонувати повний пакет для створення ігор і безперервного навчання. Ви можете працювати з зовнішніми програмами, якщо для них є плагін імпорту. Або ви можете створити його, наприклад, `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__.
zh_cn: 我们的目标是提供一个完整的软件包来创建游戏以及持续的用户体验。只要有对应的导入插件，你就仍然可以使用外部程序。或者你可以自己创建一个，比如 `Tiled Map 导入器 <https://github.com/vnen/godot-tiled-importer>`__\ 。
zh_tw: 我們的目標就是要提供一個製作遊戲的完整套裝軟體，同時還擁有一致的使用者經驗（User Experience，或譯作使用者體驗）。你也可以同時使用外部程式來配合，只要這個外部程式有匯入工具可以將成品匯入至 Godot。如果沒有的話你甚至也可以自己做一個，如 `Tiled Map Importer <https://github.com/vnen/godot-tiled-importer>`__ 就是個例子。

source: That is also partly why Godot offers its own programming languages GDScript and VisualScript, along with C#. They're designed for the needs of game developers and game designers, and they're tightly integrated in the engine and the editor.
cs: To je také částečně důvod, proč Godot nabízí své vlastní programovací jazyky GDscript a VisualScript, spolu s C#. Jsou navrženy pro potřeby vývojářů her a návrhářů her a jsou pevně integrovány do enginu a editoru.
de: Aus diesem Grund bietet Godot neben C# auch seine eigenen Programmiersprachen GDscript und VisualScript an. Sie sind für die Bedürfnisse von Spieleentwicklern und -designern konzipiert und tief in die Engine und den Editor integriert.
fr: C'est aussi en partie pour cela que Godot propose ses propres langages de programmation GDscript et VisualScript, parallèlement à C#. Ils ont été conçus pour les besoins des développeurs et des designers de jeu, et sont étroitement intégrés au moteur et à l'éditeur.
ko: 이것이 Godot이 C#과 함께 자체 프로그래밍 언어인 GDscript 및 VisualScript를 제공하는 이유이기도 합니다. 게임 개발자와 게임 디자이너의 요구에 맞게 설계되었으며, 게임 엔진과 에디터가 하나인 것 처럼 실행됩니다.
pt_br: Isso também é, em parte, o porque o Godot oferecer suas próprias linguagens de programação GDscript e VisualScript, junto com C#. Elas são projetadas para as necessidades de desenvolvedores de jogos e designers de jogos, e são totalmente integradas ao motor e ao editor.
ru: Отчасти поэтому Godot предлагает свои собственные языки программирования GDScript и VisualScript вместе с C#. Они разработаны для нужд разработчиков и геймдизайнеров, а также тесно интегрированы в движок и редактор.
uk: Частково тому Godot пропонує власні мови програмування GDscript та VisualScript разом із C#. Вони розроблені для потреб розробників ігор та дизайнерів ігор, і вони тісно інтегровані в рушій та редактор.
zh_cn: 这也是为什么 Godot 会提供自己的编程语言 GDScript 和 VisualScript 以及 C# 的部分原因。它们是为满足游戏开发人员和游戏设计师的需求而设计的，并且被紧密集成在引擎和编辑器中。

source: GDScript lets you write code using an indentation-based syntax, yet it detects types and offers a static language's quality of auto-completion. It is also optimized for gameplay code with built-in types like Vectors and Colors.
cs: GDscript vám umožňuje psát jednoduchý kód pomocí syntaxe podobné Pythonu, přesto detekuje typy a nabízí automatické doplňování v kvalitě statického jazyka. Je také optimalizován pro herní kód s vestavěnými typy, jako jsou vektory a barvy.
de: Mit GDscript können Sie einfachen Code mit Python-ähnlicher Syntax schreiben, jedoch erkennt es Typen und bietet die Vorzüge der Autovervollständigung einer statischen Sprache. Es ist auch für Gameplay-Code mit integrierten Typen wie Vektoren und Farben optimiert.
fr: GDScript vous permet d'écrire du code en utilisant une syntaxe basée sur l'indentation, tout en détectant les types et en offrant la qualité d'autocomplétion d'un langage statique. Il est également optimisé pour le code de jeu avec des types intégrés comme les Vectors et les Colors.
ko: GDScript는 들여쓰기 기반의 문장과 자동 완성, 데이터 타입 감지도 제공합니다. 이는 벡터나 색과 같은 빌트인 타입의 코드에도 최적화되어있습니다.
pt_br: O GDScript permite que você escreva código usando uma sintaxe baseada em recuo, mas detecta tipos e oferece a qualidade de preenchimento automático de uma linguagem estática. Também é otimizado para código de jogo com tipos integrados como Vetores e Cores.
ru: GDScript позволяет вам писать код с использованием синтаксиса на основе отступов, но при этом он определяет типы и предлагает качественное автозаполнение для статического языка. К тому же, он оптимизирован для игрового кода с уже встроенными типами, такими как векторы и цвета.
uk: GDScript дозволяє писати код із використанням синтаксису, заснованого на відступах, але він виявляє типи та пропонує якість автоматичного завершення статичної мови. Він також оптимізований для ігрового коду з вбудованими типами, такими як вектори та кольори.
zh_cn: GDScript 使您可以使用基于缩进的语法编写代码，但是它可以检测类型，提供质量接近静态语言的自动补全。它还针对使用 Vector、Color 等内置类型的游戏代码进行了优化。

source: Note that with GDNative, you can write high-performance code using compiled languages like C, C++, Rust, or Python (using the Cython compiler) without recompiling the engine.
cs: Všimněte si také, že v GDNative můžete psát vysoce výkonný kód pomocí kompilovaných jazyků jako C, C ++, Rust nebo Python (pomocí kompilátoru Cython) bez překompilování enginu.
de: Beachten Sie auch, dass Sie mit GDNative Hochleistungscode mit kompilierten Sprachen wie C, C++, Rust oder Python (mit dem Cython-Compiler) schreiben können, ohne die Engine neu kompilieren zu müssen.
fr: Il est à noter qu'avec GDNative, vous pouvez écrire du code haute performance en utilisant des langages compilés tels que C, C++, Rust ou Python (en utilisant le compilateur Cython) sans avoir à recompiler le moteur.
ko: GDNative를 사용하면 엔진을 다시 컴파일하지 않고도 C, C++, Rust 또는 Python(Cython 컴파일러 사용)과 같은 컴파일된 언어를 사용해 고성능 코드를 작성할 수 있습니다.
pt_br: Observe que com o GDNative, você pode escrever código de alto desempenho usando linguagens compiladas como C, C++, Rust ou Python (usando o compilador Cython) sem recompilar a engine.
ru: Обратите внимание, что с помощью GDNative вы можете написать высокопроизводительный код, используя скомпилированные языки, такие как C, C++, Rust или Python (используя компилятор Cython) без перекомпиляции движка.
uk: Зауважте, що за допомогою GDNative ви можете писати високоефективний код, використовуючи компільовані мови, такі як C, C++, Rust, або Python (використовуючи компілятор Cython), без перекомпіляції рушія.
zh_cn: 请注意，使用GDNative，你可以编写出使用类似 C、C++、Rust、Python（使用 Cython 编译器）这类的编译语言编写的高性能代码，无需重新编译引擎。
zh_tw: 值得注意的是，使用 GDNative 的話，你也可以使用如 C、C++、Rust、與（使用 Cython 編譯器的）Python 這類的編譯語言而毋須重新編譯整個引擎。

source: *VisualScript is a node-based programming language that integrates well in the editor. You can drag and drop nodes or resources into the graph to create new code blocks.*
cs: * VisualScript je programovací jazyk založený na uzlech, který se dobře integruje do editoru. Můžete přetáhnout uzly nebo zdroje do grafu a vytvořit nové bloky kódu. *
de: *VisualScript ist eine Node-basierte Programmiersprache, die sich gut in den Editor integrieren lässt. Sie können Nodes oder Ressourcen per Drag & Drop in das Diagramm ziehen, um neue Codeblöcke zu erstellen.*
fr: *VisualScript est un langage de programmation basé sur des nœuds s'intégrant très bien avec l'éditeur. Vous pouvez glisser-déposer des nœuds ou des ressources dans le graphe pour créer de nouveaux blocs de code.*
ko: *VisualScript는 편집기에 잘 통합된 노드 기반 프로그래밍 언어입니다. 노드나 리소스를 그래프에 끌어다 놓아서 새 코드 블록을 만들 수 있습니다.*
pt_br: *VisualScript é uma linguagem de programação baseada em nós que se integra bem ao editor. Você pode arrastar e soltar nós ou recursos no gráfico para criar novos blocos de código.*
ru: *VisualScript - это язык программирования на основе узлов, который хорошо интегрируется в редактор. Вы можете перетаскивать узлы или ресурсы в граф для создания новых блоков кода.*
uk: *VisualScript - мова програмування на основі вузлів, яка добре інтегрується в редактор. Ви можете перетягувати вузли, або ресурси, в граф для створення нових блоків коду.*
zh_cn: *VisualScript 是一种基于节点的编程语言，可以很好地集成到编辑器中。你可以将节点或资源拖放到图中以创建新的代码块。*
zh_tw: > VisualScript 是基於節點的程式語言，且與 Godot 編輯器整合地很好。你可以將節點或資源拖曳到圖形上來建立新的程式碼區塊。

source: Note that the 3D workspace doesn't feature as many tools as the 2D workspace. You'll need external programs or add-ons to edit terrains, animate complex characters, and so on. Godot provides a complete API to extend the editor's functionality using game code. See `The Godot editor is a Godot game`_ below.
cs: Všimněte si, že 3D pracovní prostor nemá tolik nástrojů jako 2D pracovní prostor. K úpravám terénů, animaci složitých postav atd. budete potřebovat externí programy nebo doplňky. Godot poskytuje kompletní API pro rozšíření funkčnosti editoru pomocí herního kódu. Viz `Editor Godot je hra Godot`_ níže.
de: Beachten Sie, dass der 3D-Arbeitsbereich nicht so viele Werkzeuge enthält wie der 2D-Arbeitsbereich. Sie benötigen externe Programme oder Add-ons um Gelände zu bearbeiten, komplexe Charaktere zu animieren und so weiter. Godot bietet eine komplette API, um die Funktionalität des Editors mit Hilfe von Spiel-Code zu erweitern. Siehe `Der Godot Editor ist ein Godot Spiel`_ unten.
fr: Il est à noter que l'espace de travail pour la 3D ne comporte pas autant d'outils que celui pour la 2D. Vous aurez besoin de programmes externes ou d'extensions pour éditer des terrains, animer des personnages complexes, etc. Godot fourni une API complète pour étendre les fonctionnalités de l'éditeur via du code de jeu. Cf. `L'éditeur Godot est un jeu Godot`_ ci-dessous.
ko: 3D 작업 공간에는 2D 작업 공간만큼 많은 툴이 없습니다. 지형을 편집하고 복잡한 캐릭터에 애니메이션을 적용하는 등의 작업을 수행하려면 외부 프로그램이나 추가 기능이 필요합니다. Godot는 게임 코드를 사용해 에디터의 기능을 확장하는 완전한 API를 제공합니다. 아래의 `Godot 에디터는 Godot 게임입니다`_\ 를 참조하세요.
pt_br: Observe que o espaço de trabalho 3D não possui tantas ferramentas quanto o espaço de trabalho 2D. Você precisará de programas externos ou complementos para editar terrenos, animar caracteres complexos e assim por diante. O Godot fornece uma API completa para estender a funcionalidade do editor usando o código do jogo. Veja `O editor do Godot é um jogo do Godot`_ abaixo.
ru: Обратите внимание, что в рабочем пространстве 3D нет того же количества инструментов, как в рабочем пространстве 2D. Вам понадобятся внешние программы или аддоны для редактирования ландшафтов (terrain-ов), анимации сложных персонажей и т.д. Godot предоставляет полный API для расширения функциональности редактора с помощью кода игры. См. `Редактор Godot - это игра Godot`_ ниже.
uk: Зауважте, що в робочій області 3D немає такої кількості інструментів, як у робочій області 2D. Вам знадобляться зовнішні програми, або додатки, для редагування місцевості, анімації складних персонажів тощо. Godot пропонує повний API для розширення функціональності редактора за допомогою ігрового коду. Дивіться `Редактор Godot — це гра Godot`_ нижче.
zh_cn: 请注意，3D 工作区不像 2D 工作区那样有那么多工具。你将需要使用外部的程序或插件来编辑地形，给复杂的角色模型制作动画等。Godot 提供了完整的 API，可以直接使用编写游戏的代码来扩展编辑器的功能。参见下面的 `Godot 编辑器是一个 Godot 游戏`_\ 。
zh_tw: 請注意，3D 工作區沒有提供如 2D 工作區這麼多的工具。你會需要使用外部程式或擴充套件來編輯地形、複雜的動態角色等。Godot 提供了能用遊戲程式碼來擴充編輯器功能的完整 API。詳細請參考下方的 `Godot 編輯器就是一個 Godot 遊戲`_ 。

source: *A State Machine editor plugin in Godot 2 by kubecz3k. It lets you manage states and transitions visually.*
cs: *Doplněk editoru State Machine v Godot 2 od kubecz3k. Umožňuje vizuální správu stavů a přechodů.*
de: *Ein State Machine Editor Plugin in Godot 2 von kubecz3k. Mit ihm können Sie Zustände und Übergänge visuell verwalten.*
fr: *Un plugin d'éditeur de machine à états dans Godot 2 par kubecz3k. Il vous permet de gérer les états et les transitions visuellement*
ko: *Godot 엔진 2에서 kubecz3k님이 제작해주신 State Machine editor 플러그인입니다. 이것으로 여러분은 시각적으로 상태와 변화를 다룰 수 있습니다.*
pt_br: *Um plugin de editor de Máquina de Estados em Godot 2 por kubecz3k. Ele permite gerenciar estados e transições visualmente*
ru: *Плагин State Machine (Машина Состояний) в Godot 2 от kubecz3k. Он позволяет визуально управлять состояниями и переходами.*
uk: *Плагін редактора State Machine (Машина станів) у Godot 2 від kubecz3k. Він дозволяє візуально керувати станами та переходами.*
zh_cn: *Godot 2 的状态机编辑器插件，由 kubecz3k 开发。它使您可以直观地管理状态和转换。*
zh_tw: > Godot 2 中的狀態機 (State Machine) 編輯器外掛，作者為 kubecz3k。這個外掛提供視覺化的狀態管理與轉換界面。

source: `Godot 4.0 will remove VisualScript from core entirely. <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__ As a result, creating new projects using visual scripting in Godot is not recommended. Future Godot 4.x releases may have VisualScript reimplemented as an extension.
de: `Godot 4.0 wird kein VisualScript mehr haben. <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__ Deswegen empfehlen wir, keine neuen Projekte mit visuellem scripting in Godot zu beginnen. Für spätere Godot 4.x Versionen könnte VisualScript als eine Erweiterung implementiert werden.
fr: `Godot 4.0 supprimera entièrement le VisualScript du noyau. <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__ Par conséquent, la création de nouveaux projets utilisant VisualScript dans Godot n'est pas recommandée. Les futures versions de Godot 4.x peuvent avoir le VisualScript réimplémenté comme une extension.
ko: `Godot 4.0은 비주얼스크립트를 완전히 제거할 것입니다. <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__ 결과적으로, Godot에서 비주얼 스크립팅을 사용하는 새로운 프로젝트를 만드는 것은 권장되지 않습니다. 추후의 Godot 4.x 릴리즈는 비주얼스크립트를 재구현하는 확장을 포함할 수도 있습니다.
pt_br: `Godot 4.0 vai remover o VisualScript de toda sua base. <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__Como resultado, criar novos projetos utilizando visual script no Godot não é recomendado. Futuras versões do Godot 4.x podem ter o VisualScript reimplementado como uma extensão.
ru: `В Godot 4.0 из ядра будет убрана поддержка VisualScript.<https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__Так, создание новых проектов с использованием визуального программирования не рекомендуется. В будущем VisualScript может быть интегрирован в Godot 4.x только как расширение.
uk: «З Godot 4.0 буде повністю видалене ядро VisualScript. <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__ Тому не рекомендується створювати нові проекти за допомогою візуальних скриптів у Godot. У майбутніх випусках Godot 4.x VisualScript може бути повторно реалізований як розширення.
zh_cn: `Godot 4.0 将会把 VisualScript 从核心中完全移除。 <https://godotengine.org/article/godot-4-will-discontinue-visual-scripting>`__\ 因此，不推荐在新的 Godot 项目中使用可视化脚本。后续的 Godot 4.x 版本可能会将 VisualScript 重新实现为扩展。

source: While Godot 3.x will keep VisualScript supported, we recommend :ref:`trying out GDScript <toc-learn-scripting-gdscript>` instead, especially if you intend to migrate your project to Godot 4.
de: Während Godot 3.x VisualScript weiterhin offiziell unterstützt, empfehlen wir stattdessen :ref:`GDScript auszutesten <toc-learn-scripting-gdscript>`, vor allem dann, wenn du vor hast dein Projekt zu Godot 4 zu migrieren.
fr: Alors que Godot 3.x conservera le support de VisualScript, nous recommandons :ref:`d'essayer GDScript <toc-learn-scripting-gdscript>` à la place, surtout si vous avez l'intention de migrer votre projet vers Godot 4.
ko: Godot 3.x 는 비주얼스크립트를 계속 지원하지만, 저희는 그 대안으로 :ref:`GDScript를 시도해보는 것을 <toc-learn-scripting-gdscript>` (특히 여러분이 자신의 프로젝트를 Godot 4로 마이그레이션할 생각이 있으시다면) 권장합니다.
pt_br: Apesar do Godot 3.x manter o suporte ao VisualScript, é recomentado ao :ref:`experimentar GDScript <toc-learn-scripting-gdscript>` especialmente se você pretende migrar seu projeto para o Godot 4.
ru: Пока что Godot 3.x поддерживает VisualScript, но рекомендуется :ref:`использовать GDScript <toc-learn-scripting-gdscript>`, особенно если планируется дальнейший переход проекта на Godot 4.
uk: Хоча Godot 3.x підтримуватиме VisualScript, ми рекомендуємо :ref:`спробувати GDScript <toc-learn-scripting-gdscript>`, особливо якщо ви маєте намір перенести свій проект на Godot 4.
zh_cn: Godot 3.x 仍会支持 VisualScript，我们建议你先\ :ref:`试一试 GDScript <toc-learn-scripting-gdscript>`\ ，尤其是你想要把项目移植到 Godot 4 的话。

source: Open source
fr: Libre
ko: 오픈 소스
pt_br: Código aberto
ru: Открытый исходный код
uk: Відкритий код
zh_cn: 开源
zh_tw: 開放原始碼
