Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/learning_new_features.po
Languages: de, es, fr, ja, ko, pt_br

source: If there is an error involved, **share the exact error message**. You can copy the exact error message in the editor's Debugger bottom panel by clicking the Copy Error icon. Knowing what it says can help community members better identify how you triggered the error.
de: Wenn ein Fehler auftritt, **geben Sie die genaue Fehlermeldung an**. Sie können die genaue Fehlermeldung im Debugger des Unteren Bedienfelds im Editor kopieren, indem Sie auf das Icon „Fehler kopieren“ klicken. Wenn Sie die genaue Fehlermeldung kennen, können die Community-Mitglieder besser erkennen, was den Fehler ausgelöst hat.
es: Si hay un error involucrado, **comparta el mensaje de error exacto**. Puede copiar el mensaje de error exacto en el panel inferior del Depurador del editor haciendo clic en el icono Copiar error. Saber lo que dice puede ayudar a los miembros de la comunidad a identificar mejor cómo provocó el error.
fr: S'il y a une erreur, **partagez le message d'erreur exact**. Vous pouvez copier le message d'erreur exact dans le panneau inférieur du débogueur de l'éditeur en cliquant sur l'icône Copier l'erreur. Savoir ce que cela dit peut aider les membres de la communauté à mieux identifier comment vous avez déclenché l'erreur.
ja: エラーが発生した場合は、 **正確なエラーメッセージを共有** してください。エディタのデバッガの下部パネルにある「エラーをコピー」アイコンをクリックすると、正確なエラーメッセージをコピーすることができます。その内容を知ることで、どのようなエラーが発生したのかをコミュニティメンバーがより正確に把握することができます。
ko: **정확한 오류 메시지를 공유**하세요. 디버거 하단 패널의 오류 메시지를 복사하기 위해 "오류 복사" 아이콘을 클릭하여 정확한 오류 메시지를 복사할 수 있습니다. 어떤 오류가 발생했는지 알면 커뮤니티 회원들이 해당 오류가 어떻게 발생했는지 더 잘 파악할 수 있습니다.
pt_br: Se tem um erro envolvido, **compartilhe a exata mensagem de erro**. Você pode copiar a exata mensagem de erro no painel inferior do Debugger do editor clicando ícone de Copiar Erro. Sabendo do erro ajuda os membros da comunidade a melhor identificar como você causou esse erro.

source: If there is code involved, **share a code sample**. Other users won't be able to help you fix a problem without seeing your code. Share the code as text directly. To do so, you can copy and paste a short code snippet in a chat box, or use a website like `Pastebin <https://pastebin.com/>`_ to share long files.
de: Wenn es um Code geht, **teilen Sie ein Codebeispiel**. Andere Benutzer können Ihnen nicht helfen, ein Problem zu lösen, ohne Ihren Code zu sehen. Geben Sie den Code direkt als Text weiter. Dazu können Sie einen kurzen Codeschnipsel kopieren und in ein Chatfeld einfügen oder eine Website wie `Pastebin <https://pastebin.com/>`_ verwenden, um lange Dateien zu teilen.
es: Si hay código involucrado, **comparta una muestra de código**. Otros usuarios no podrán ayudarlo a solucionar un problema sin ver su código. Comparta el código como texto directamente. Para hacerlo, puede copiar y pegar un fragmento de código corto en un cuadro de chat, o usar un sitio web como `Pastebin <https://pastebin.com/>`_ para compartir archivos largos.
fr: S'il s'agit de code, **partagez un échantillon de code**. Les autres utilisateurs ne seront pas en mesure de vous aider à résoudre un problème sans voir votre code. Partagez directement le code sous forme de texte. Pour ce faire, vous pouvez copier et coller un court extrait de code dans une boîte de discussion, ou utiliser un site Web comme `Pastebin <https://pastebin.com/>`_ pour partager des fichiers longs.
ja: コードが含まれている場合は、 **コードサンプル** を共有してください。あなたのコードを見ずに他のユーザーが問題解決の手助けをすることは不可能です。コードを直接、テキストとして共有してください。そのためには、短いコードスニペットをコピーしてチャットボックスに貼り付けたり、 `Pastebin <https://pastebin.com/>`_ のようなサイトを使って長いファイルを共有したりします。
ko: **코드 샘플을 공유**하세요. 코드를 보지 않고는 다른 사용자가 문제를 해결하는 데 도움을 줄 수 없습니다. 코드를 텍스트로 직접 공유하세요. 이를 위해 코드 스니펫을 채팅 박스(chat box)에 복사하여 붙여넣거나, `Pastebin <https://pastebin.com/>`_과 같은 웹사이트를 사용하여 긴 코드를 공유할 수 있습니다.
pt_br: Se tem código envolvido, **compartilhe um trecho do código**. Outros usuários não vão conseguir te ajudar sem olhar o seu código. Compartilhe o código como texto diretamente. Você pode copiar e colar um trecho do código no chat, ou usando um site como `Pastebin <https://pastebin.com/>`_ para compartilhar arquivos grandes.

source: **Share a screenshot** of your *Scene* dock along with your written code. Most of the code you write affects nodes in your scenes. As a result, you should think of those scenes as part of your source code.
de: **Teilen Sie einen Screenshot** Ihres *Szene*-Docks zusammen mit Ihrem geschriebenen Code. Der meiste Code, den Sie schreiben, wirkt sich auf Nodes in Ihren Szenen aus. Daher sollten Sie diese Szenen als Teil Ihres Quellcodes betrachten.
es: **Comparta una captura de pantalla** de su panel *Escena* junto con su código escrito. La mayor parte del código que escribe afecta a los nodos de sus escenas. Como resultado, debe pensar en esas escenas como parte de su código fuente.
fr: **Partagez une capture d'écran** de votre dock *Scène* ainsi que votre code écrit. La plupart du code que vous écrivez affecte les nœuds de vos scènes. Par conséquent, vous devez considérer ces scènes comme faisant partie de votre code source.
ja: **書き込んだコードと一緒に、 *Scene* ドックのスクリーンショット** を共有してください。あなたが書いたコードのほとんどは、シーンのノードに影響を与えます。そのため、シーンはソースコードの一部と考えるべきです。
ko: 당신이 쓴 코드와 함께 *Scene* 독의 **스크린샷을 공유**하세요. 작성한 대부분의 코드는 씬 내의 노드에 영향을 미칩니다. 결과적으로, 해당 씬을 소스 코드의 일부로 생각해야 합니다.
pt_br: **Compartilhe uma captura de tela** do seu painel *Cena* junto com seu código escrito. A maior parte do código que você escreve afeta os nós em suas cenas. Como resultado, você deve pensar nessas cenas como parte de seu código-fonte.

source: Also, please don't take a picture with your phone, the low quality and screen reflections can make it hard to understand the image. Your operating system should have a built-in tool to take screenshots with the :kbd:`PrtSc` (Print Screen) key.
de: Bitte machen Sie keine Fotos mit Ihrem Handy, denn die schlechte Qualität und die Spiegelungen auf dem Bildschirm können das Verständnis des Bildes erschweren. Ihr Betriebssystem sollte über ein Tool verfügen, mit dem Sie mit der Taste :kbd:`Druck` Bildschirmfotos machen können.
es: Además, no tome una foto con su teléfono, la baja calidad y los reflejos de la pantalla pueden dificultar la comprensión de la imagen. Su sistema operativo debe tener una herramienta integrada para tomar capturas de pantalla con la tecla :kbd:`PrtSc` (Imprimir pantalla).
fr: De même, ne prenez pas de photo avec votre téléphone, la mauvaise qualité et les reflets de l'écran peuvent rendre l'image difficile à comprendre. Votre système d'exploitation devrait avoir un outil intégré pour faire des captures d'écran avec la touche :kbd:`PrtSc` (Print Screen).
ja: 携帯電話で撮影した写真は使用しないでください、画質の問題と画面の反射のため、内容を理解するのが難しくなります。お使いのOSには、 :kbd:`PrtSc` (Print Screen)キーを使ってスクリーンショットを撮るツールが組み込まれているはずです。
ko: 또한, 휴대폰으로 사진을 찍지 마세요. 낮은 품질과 화면 반사로 인해 이미지를 이해하기 어려울 수 있습니다. 운영 체제에는 :kbd:`PrtSc` (Print Screen) 키로 스크린샷을 찍어야 합니다.
pt_br: Além disso, não tire uma foto com o telefone, a baixa qualidade e os reflexos da tela podem dificultar a compreensão da imagem. Seu sistema operacional deve ter uma ferramenta embutida para tirar fotos da tela com a tecla :kbd:`PrtSc` (Print Screen).

source: Alternatively, you can use a program like `ShareX <https://getsharex.com/>`_ on Windows or `FlameShot <https://flameshot.org/>`_ on Linux.
de: Alternativ können Sie ein Programm wie `ShareX <https://getsharex.com/>`_ unter Windows oder `FlameShot <https://flameshot.org/>`_ unter Linux verwenden.
es: Alternativamente, puede usar un programa como `ShareX <https://getsharex.com/>`_ en Windows o `FlameShot <https://flameshot.org/>`_ en Linux.
fr: Vous pouvez également utiliser un programme comme `ShareX <https://getsharex.com/>`_ sous Windows ou `FlameShot <https://flameshot.org/>`_ sous Linux.
ja: あるいは、Windowsでは `ShareX <https://getsharex.com/>`_ 、Linuxでは `FlameShot <https://flameshot.org/>`_ のようなプログラムを使うこともできます。
ko: 또는 Windows의 경우 `ShareX <https://getsharex.com/>`_ 또는 Linux의 경우 `FlameShot <https://flameshot.org/>`_와 같은 프로그램을 사용할 수도 있습니다.
pt_br: Alternativamente, você pode usar um programa como `ShareX <https://getsharex.com/>`_ no Windows ou `FlameShot <https://flameshot.org/>`_ no Linux.

source: Sharing a video of your running game can also be really **useful to troubleshoot your game**. You can use programs like `OBS Studio <https://obsproject.com/>`_ and `Screen to GIF <https://www.screentogif.com/>`_ to capture your screen.
de: Ein Video von Ihrem laufenden Spiel kann auch sehr **nützlich sein, um Fehler in Ihren Spiel** zu beheben. Sie können Programme wie `OBS Studio <https://obsproject.com/>`_ und `Screen to GIF <https://www.screentogif.com/>`_ verwenden, um Ihren Bildschirm aufzunehmen.
es: Compartir un video de su juego en ejecución también puede ser realmente **útil para solucionar problemas de su juego**. Puede usar programas como `OBS Studio <https://obsproject.com/>`_ y `Screen to GIF <https://www.screentogif.com/>`_ para capturar su pantalla.
fr: Partager une vidéo de votre jeu en cours d'exécution peut aussi être vraiment **utile pour dépanner votre jeu**. Vous pouvez utiliser des programmes comme `OBS Studio <https://obsproject.com/>`_ et `Screen to GIF <https://www.screentogif.com/>`_ pour capturer votre écran.
ja: 実行中のゲームのビデオを共有することは、 **ゲームのトラブルシューティングにとても役立つことがあります**。 `OBS Studio <https://obsproject.com/>`_ や `Screen to GIF <https://www.screentogif.com/>`_ のようなプログラムを使用して、画面をキャプチャすることができます。
ko: 게임 실행 중인 비디오를 공유하는 것은 문제 해결에 매우 유용할 수 있습니다. `OBS Studio <https://obsproject.com/>`_ 및 `Screen to GIF <https://www.screentogif.com/>`_와 같은 프로그램을 사용하여 화면을 녹화할 수 있습니다.
pt_br: Compartilhar um vídeo do seu jogo rodando também pode ser bem **útil para solucionar problemas do seu jogo**. Você pode usar programas como `OBS Studio <https://obsproject.com/>`_ e `Screen to GIF <https://www.screentogif.com/>`_ para capturar sua tela.

source: You can then use a service like `streamable <https://streamable.com/>`_ or a cloud provider to upload and share your videos for free.
de: Sie können dann einen Dienst wie `streamable <https://streamable.com/>`_ oder einen Cloud-Anbieter nutzen, um Ihre Videos kostenlos hochzuladen und zu teilen.
es: Luego puede usar un servicio como `streamable <https://streamable.com/>`_ o un proveedor de la nube para cargar y compartir sus videos de forma gratuita.
fr: Vous pouvez ensuite utiliser un service comme `streamable <https://streamable.com/>`_ ou un fournisseur de cloud pour télécharger et partager vos vidéos gratuitement.
ja: `streamable <https://streamable.com/>`_ やクラウドプロバイダーなどのサービスを利用して、無料で動画をアップロードして共有することができます。
ko: 그런 다음 `streamable <https://streamable.com/>`_과 같은 서비스나 클라우드를 사용하여 비디오를 업로드하고 무료로 공유할 수 있습니다.
pt_br: Você pode então usar serviços como `streamable <https://streamable.com/>`_ ou algum armazenamento em nuvem para enviar e compartilhar seus vídeos de graça.

source: If you're not using the stable version of Godot, please mention the version you're using. The answer can be different as available features and the interface evolve rapidly.
de: Wenn Sie keine stabile Version von Godot verwenden, geben Sie bitte die Version an, die Sie verwenden. Die Antwort kann unterschiedlich ausfallen, da sich die verfügbaren Features und die Schnittstelle schnell weiterentwickeln.
es: Si no está utilizando la versión estable de Godot, mencione la versión que está utilizando. La respuesta puede ser diferente ya que las funciones disponibles y la interfaz evolucionan rápidamente.
fr: Si vous n’utilisez pas la version stable de Godot, veuillez mentionner la version que vous utilisez. La réponse peut être différente car les fonctionnalités disponibles et l'interface évoluent rapidement.
ja: もし、Godotの安定版を使っていない場合は、使っているバージョンを教えてください。利用可能な機能やインターフェイスが急速に進化しているため、回答が異なることがあります。
ko: 만약 Godot의 stable 버전이 아닌 다른 버전을 사용 중이라면, 사용 중인 버전을 명시해 주세요. 사용 가능한 기능과 인터페이스가 빠르게 변화하기 때문에 답변이 달라질 수 있습니다.
pt_br: Se você não está usando a versão estável do Godot, por favor diga a versão que você está usando. A resposta pode variar já que funcionalidades e a interface mudam rapidamente.

source: Following these guidelines will maximize your chances of getting the answer you're looking for. They will save time both for you and the persons helping you.
de: Wenn Sie sich an diese Leitlinien halten, haben Sie die besten Chancen, die gewünschte Antwort zu erhalten. Sie sparen Zeit, sowohl für Sie als auch für die Personen, die Ihnen helfen.
es: Seguir estas pautas maximizará tus posibilidades de obtener la respuesta que estás buscando. Te ahorrarán tiempo tanto a tí como a las personas que te ayuden.
ja: これらのガイドラインに従うことで、あなたが探している答えを得る可能性を最大限に高めることができます。また、あなたとあなたをサポートする人の両方にとって、時間の節約にもなります。

source: Community tutorials
es: Tutoriales de la comunidad
fr: Tutoriels de la communauté
ja: コミュニティのチュートリアル
ko: 커뮤니티 튜토리얼
pt_br: Tutoriais da Comunidade

source: This manual aims to provide a comprehensive reference of Godot's features. Aside from the 2D and 3D getting started series, it does not contain tutorials to implement specific game genres. If you're looking for a tutorial about creating a role-playing game, a platformer, or other, please see :ref:`doc_community_tutorials`, which lists content made by the Godot community.
de: Dieses Handbuch soll ein umfassendes Nachschlagewerk für Godots Features sein. Abgesehen von den 2D- und 3D-Einstiegs-Artikelreihen enthält es keine Tutorials zur Umsetzung bestimmter Spielgenres. Wenn Sie auf der Suche nach einer Anleitung für ein Rollenspiel, einen Plattformer oder ein anderes Spiel sind, schauen Sie bitte unter :ref:`doc_community_tutorials` nach, in dem Inhalte der Godot-Community aufgeführt sind.
es: Este manual tiene como objetivo proporcionar una referencia completa de las características de Godot. Aparte de la serie de introducción en 2D y 3D, no contiene tutoriales para implementar géneros de juegos específicos. Si estás buscando un tutorial sobre cómo crear un juego de rol, un juego de plataformas u otro, consulta :ref:`doc_community_tutorials`, que enumera el contenido creado por la comunidad de Godot.
fr: Ce manuel vise à fournir une référence complète des fonctionnalités de Godot. Hormis les séries de démarrage en 2D et 3D, il ne contient pas de tutoriels pour mettre en œuvre des genres de jeux spécifiques. Si vous recherchez un tutoriel sur la création d'un jeu de rôle, d'un jeu de plateforme ou autre, veuillez consulter :ref:`doc_community_tutorials`, qui répertorie le contenu créé par la communauté Godot.
ja: このマニュアルは、Godot'の機能を包括的に参照することを目的としています。2Dと3Dの入門シリーズを除いて、特定のゲームジャンルを実装するためのチュートリアルは含まれていません。ロールプレイングゲームやプラットフォーマーなどを作るためのチュートリアルを探している場合は、Godotコミュニティが作成したコンテンツをリストアップした :ref:`doc_community_tutorials` をご覧ください。
ko: 이 매뉴얼은 Godot의 기능에 대한 포괄적인 참조를 제공하는 것을 목표로 합니다. 2D 및 3D 시리즈 이외에도 특정 게임 장르를 구현하는 튜토리얼은 포함되어 있지 않습니다. 만약 롤플레잉 게임, 플랫포머 또는 기타 게임을 만드는 방법에 대한 튜토리얼을 찾고 있다면, :ref:`doc_community_tutorials`를 참조하세요. 해당 페이지에는 Godot 커뮤니티가 작성한 내용이 나열되어 있습니다.
pt_br: Esse manual foca em trazer uma referência compreensível paras as funcionalidades do Godot. Além das séries de primeiros passos em 2D e 3D, ele não contém tutoriais de como implementar gêneros específicos de jogos. Se você está procurando um tutorial sobre a criação de um jogo RPG, ou plataforma, ou qualquer outro, por favor veja :ref:`doc_community_tutorials`, que listam conteúdo feita pela comunidade do Godot.

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
ko: 번역 상태
pt_br: Estado da Tradução

source: The manual has a companion class reference that explains each Godot class's available functions and properties when programming. While the manual covers general features, concepts, and how to use the editor, the reference is all about using Godot's scripting API (Application Programming Interface). You can access it both online and offline. We recommend browsing the reference offline, from within the Godot editor. To do so, go to Help -> Search or press :kbd:`F1`.
pt_br: O manual tem uma referência de classe complementar que explica as funções e propriedades disponíveis de cada classe Godot durante a programação. Enquanto o manual cobre recursos gerais, conceitos e como usar o editor, a referência é sobre como usar a API do Godot (Application Programming Interface). Você pode acessá-lo online e offline. Recomendamos navegar na referência offline, a partir do editor Godot. Para fazer isso, vá para Ajuda -> Ajuda ou pressione :kbd:`F1`.

source: To browse it online, head to the manual's :ref:`Class Reference <toc-class-ref>` section.
pt_br: Para navegar online, vá para a seção :ref:`Referência de Classe <toc-class-ref>` do manual.

source: The best place to ask for questions and find already answered ones is the official `Questions & Answers <https://godotengine.org/qa/>`_ site. These responses show up in search engine results and get saved, allowing other users to benefit from discussions on the platform. Once you asked a question there, you can share its link on other social platforms. Before asking a question, be sure to look for existing answers that might solve your problem on this website or using your preferred search engine.
pt_br: O melhor lugar para tirar dúvidas e achar perguntas já respondidas é o site oficial de `Perguntas & Respostas <https://godotengine.org/qa/>`. Essas respostas aparecem nos resultados de motores de busca (google, duckduckgo, bing, etc...) e ficam salvados, permitindo que outros usuários se beneficiem de discussões na plataforma. Uma vez que você perguntou alguma coisa lá, você pode compartilhar o link em outras redes sociais. Antes de tirar uma dúvida, procure por respostas existente que talvez resolvam seu problema nesse site ou usando seu motor de busca favorito.

source: Following these guidelines will maximize your chances of getting the answer you're looking for. They will save time both to you and the persons helping you.
pt_br: Seguir os guias vai maximizar suas chances de conseguir uma resposta que te agrade. Eles ajudam tanto você quanto as pessoas te ajudando.
