Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/introduction/learning_new_features.po
Languages: de, es, fr, ja, ko, pt_br

source: Learning new features
de: Neue Features kennenlernen
es: Aprendiendo nuevas características
fr: Apprendre de nouvelles fonctionnalités
ja: 新しい機能を学ぶには
ko: 새로운 기능 학습
pt_br: Aprendendo novas funcionalidades

source: Godot is a feature-rich game engine. There is a lot to learn about it. This page explains how you can use the online manual, built-in code reference, and join online communities to learn new features and techniques.
de: Godot ist eine Spiele-Engine mit vielen Features. Es gibt eine Menge darüber zu lernen. Auf dieser Seite wird erklärt, wie Sie das Online-Handbuch und die integrierte Code-Referenz nutzen und Online-Communities beitreten können, um neue Features und Techniken zu erlernen.
es: Godot es un motor de videojuegos rico en características. Hay mucho para aprender. Esta página explica cómo usar el manual online, la referencia integrada y cómo unirse a comunidades para aprender nuevas funcionalidades y técnicas.
fr: Godot est un moteur de jeu riche en fonctionnalités. Il y a beaucoup à apprendre à son sujet. Cette page explique comment vous pouvez utiliser le manuel en ligne, la référence de code intégrée et rejoindre les communautés en ligne pour apprendre de nouvelles fonctionnalités et techniques.
ja: Godotは、機能豊富なゲームエンジンです。そのため、学ぶべきことがたくさんあります。このページでは、新しい機能やテクニックを学ぶために、オンライン・マニュアルや内蔵のコード・リファレンスを利用したり、オンライン・コミュニティに参加する方法を説明します。
ko: Godot는 기능이 풍부한 게임 엔진이기 때문에, 배울 것이 많습니다. 이 페이지에서는 온라인 매뉴얼, 내장된 코드 참조 및 온라인 커뮤니티에 참여하여 새로운 기능과 기술을 배우는 방법에 대해 설명합니다.
pt_br: Godot é um motor de jogos rico em funcionalidades. Há muito a aprender sobre ela. Esta página explica como você pode usar o manual online, com código de referência embutido. Junte-se as comunidades online para aprender novas funcionalidades e técnicas.

source: Making the most of this manual
de: Dieses Handbuch optimal nutzen
es: Aprovechando al máximo este manual
fr: Tirer le meilleur parti de ce manuel
ja: このマニュアルを活用する
ko: 이 매뉴얼을 최대한 활용하는 방법에 대해 알아보겠습니다.
pt_br: Fazendo a maior parte deste manual

source: What you are reading now is the user manual. It documents each of the engine's concepts and available features. When learning a new topic, you can start by browsing the corresponding section of this website. The left menu allows you to explore broad topics while the search bar will help you find more specific pages. If a page exists for a given theme, it will often link to more related content.
de: Was Sie gerade lesen, ist das Benutzerhandbuch. Es dokumentiert alle Konzepte und verfügbaren Features der Engine. Wenn Sie sich in ein neues Thema einarbeiten möchten, können Sie zunächst den entsprechenden Abschnitt dieser Website durchsuchen. Das linke Menü ermöglicht es Ihnen, allgemeine Themen zu erkunden, während die Suchleiste Ihnen hilft, spezifischere Seiten zu finden. Wenn eine Seite zu einem bestimmten Thema existiert, verweist sie oft auf weitere verwandte Inhalte.
es: Lo que estás leyendo ahora es el manual de usuario. Documenta cada uno de los conceptos del motor y las características disponibles. Al aprender un tema nuevo, puede comenzar navegando en la sección correspondiente de este sitio web. El menú de la izquierda te permite explorar temas amplios, mientras que la barra de búsqueda te ayudará a encontrar páginas más específicas. Si existe una página para un tema determinado, a menudo se vinculará a más contenido relacionado.
fr: Ce que vous lisez actuellement est le manuel utilisateur. Il documente chacun des concepts et des fonctions disponibles du moteur. Lorsque vous apprenez un nouveau sujet, vous pouvez commencer par parcourir la section correspondante de ce site Web. Le menu de gauche vous permet d'explorer des thèmes généraux tandis que la barre de recherche vous aidera à trouver des pages plus spécifiques. Si une page existe pour un thème donné, elle renvoie souvent à plus de contenu.
ja: あなたが今読んでいる、ユーザーマニュアルです。このマニュアルには、エンジンの概念や使用可能な機能が記載されています。新しいトピックを学ぶ際には、まずこのウェブサイトの対応するセクションを閲覧することから初めてみてください。左側のメニューでは大まかなテーマを、検索バーではより具体的なページを探すことができます。そのテーマのページがあれば、より関連性の高いコンテンツにリンクしています。
ko: 지금 읽고 계신 것은 사용자 매뉴얼입니다. 이 매뉴얼은 엔진의 각 개념과 사용 가능한 기능을 문서화합니다. 새로운 주제를 학습할 때는 해당 웹사이트의 해당 섹션을 찾아보는 것으로 시작할 수 있습니다. 왼쪽 메뉴를 사용하여 일반적인 주제를 탐색하고, 검색 창을 사용하여 더 구체적인 페이지를 찾을 수 있습니다. 특정 주제에 대한 페이지가 있는 경우, 관련된 내용으로 연결됩니다.
pt_br: O que você está lendo agora é o manual do usuário. Ele documenta cada um dos conceitos do mecanismo e recursos disponíveis. Ao aprender um novo tópico, você pode começar navegando na seção correspondente deste site. O menu à esquerda permite explorar tópicos amplos, enquanto a barra de pesquisa o ajudará a encontrar páginas mais específicas. Se existir uma página para um determinado tema, ela geralmente será vinculada a um conteúdo mais relacionado.

source: The manual has a companion class reference that explains each Godot class's available functions and properties when programming. While the manual covers general features, concepts, and how to use the editor, the reference is all about using Godot's scripting API (Application Programming Interface). You can access it both online and offline. We recommend browsing the reference offline, from within the Godot editor. To do so, go to Help -> Search Help or press :kbd:`F1`.
de: Das Handbuch enthält eine begleitende Klassenreferenz, in der die verfügbaren Funktionen und Eigenschaften der einzelnen Godot-Klassen zum Programmieren erläutert werden. Während das Handbuch allgemeine Features, Konzepte und die Verwendung des Editors behandelt, dreht sich in der Referenz alles um die Verwendung der Godot-Skripting-API (Application Programming Interface, deutsch: „Schnittstelle zur Anwendungsprogrammierung“). Sie können sowohl online als auch offline darauf zugreifen. Wir empfehlen, die Referenz offline im Godot-Editor zu lesen. Gehen Sie dazu zu Hilfe -> Hilfe durchsuchen oder drücken Sie :kbd:`F1`.
es: El manual tiene una referencia de clase complementaria que explica las funciones y propiedades disponibles de cada clase de Godot durante la programación. Si bien el manual cubre características generales, conceptos y cómo usar el editor, la referencia trata sobre el uso de la API de secuencias de comandos de Godot (interfaz de programación de aplicaciones). Puedes acceder a él tanto en línea como fuera de línea. Recomendamos buscar la referencia sin conexión, desde el editor de Godot. Para hacerlo, ve a Ayuda -> Buscar o presiona :kbd:`F1`.
ja: このマニュアルには、プログラミング時に各 Godot クラスで使用できる関数とプロパティを説明するコンパニオンクラスリファレンスが含まれています。 マニュアルはエディタの一般的な機能、概念、使用方法について説明していますが、リファレンスではGodotのスクリプティングAPI (アプリケーション プログラミング インターフェイス) の使い方の全てを説明しています。 オンラインでもオフラインでもアクセスできます。 Godot エディタ内からオフラインでリファレンスを参照することをお勧めします。 これを行うには、[ヘルプ] -> [ヘルプを検索] に移動するか、 :kbd:`F1` を押してください。

source: To browse it online, head to the manual's :ref:`Class Reference <doc_class_reference>` section.
de: Um sie online zu durchsuchen, gehen Sie zum Abschnitt :ref:`Klassenreferenz <doc_class_reference>` des Handbuchs.
es: Para buscar en línea, ve a la sección :ref:`Class Reference <doc_class_reference>` del manual.
ja: オンラインで見る場合は、マニュアルの :ref:`クラスリファレンス <doc_class_reference>` のセクションをご覧ください。

source: A class reference's page tells you:
de: Auf der Seite einer Klassenreferenz erfahren Sie:
es: Una página de referencia de clase te dice:
fr: Une page de référence de classe vous indique :
ja: クラスリファレンスのページには、次のことが記載されています。
ko: 클래스 참조 페이지는 제공합니다:
pt_br: A página de referência de classe informa:

source: Where the class exists in the inheritance hierarchy. You can click the top links to jump to parent classes and see the properties and methods a type inherits.
de: Wo sich die Klasse in der Vererbungshierarchie befindet. Sie können auf die oberen Links klicken, um zu Parent-Klassen zu springen und die Eigenschaften und Methoden zu sehen, die ein Typ erbt.
es: Donde existe la clase en la jerarquía de herencia. Puede hacer clic en los enlaces superiores para saltar a las clases principales y ver las propiedades y los métodos que hereda un tipo.
fr: Où se trouve la classe dans la hiérarchie de l'héritage. Vous pouvez cliquer sur les liens supérieurs pour passer aux classes parentes et voir les propriétés et méthodes dont un type hérite.
ja: 継承階層内のクラスの場所。上位のリンクをクリックすると、親クラスにジャンプし、型が継承するプロパティとメソッドを確認できます。
ko: 클래스가 상속 계층 구조에서 어디에 위치하는지에 대한 정보를 제공합니다. 맨 위의 링크를 클릭하여 상위 클래스로 이동하면 해당 타입이 상속한 속성과 방법을 볼 수 있습니다.
pt_br: Onde a classe existe na hierarquia de herança. Você pode clicar nos links superiores para ir para as classes pai e ver as propriedades e métodos que um tipo herda.

source: A summary of the class's role and use cases.
de: Eine Zusammenfassung der Rolle und der Anwendungsfälle der Klasse.
es: Un resumen de la función de la clase y los casos de uso.
fr: Un résumé du rôle et des cas d'utilisation de la classe.
ja: クラスの役割や使用例をまとめたもの。
ko: 클래스의 역할과 사용 사례에 대한 요약을 제공합니다.
pt_br: Um resumo da função e dos casos de uso da classe.

source: An explanation of the class's properties, methods, signals, enums, and constants.
de: Eine Erklärung der Eigenschaften, Methoden, Signale, Enums und Konstanten der Klasse.
es: Una explicación de las propiedades, métodos, señales, enumeraciones y constantes de la clase.
fr: Une explication des propriétés, méthodes, signaux, enums et constantes de la classe.
ja: クラスのプロパティ、メソッド、シグナル、列挙、定数についての説明。
ko: 클래스의 속성, 방법, 신호, 열거형 및 상수에 대한 설명을 제공합니다.
pt_br: Uma explicação das propriedades, métodos, sinais, enumerações e constantes da classe.

source: Links to manual pages further detailing the class.
de: Links zu Handbuchseiten, die diese Klasse näher beschreiben.
es: Enlaces a páginas del manual que detallan aun más la clase.
fr: Liens vers des pages du manuel détaillant davantage la classe.
ja: クラスの詳細を説明するマニュアルページへのリンク
ko: 해당 클래스를 자세히 설명하는 매뉴얼 페이지로의 링크를 제공합니다.
pt_br: Links para páginas de manual detalhando ainda mais a classe.

source: If the manual or class reference is missing or has insufficient information, please open an Issue in the official `godot-docs <https://github.com/godotengine/godot-docs/issues>`_ GitHub repository to report it.
de: Wenn das Handbuch oder die Klassenreferenz fehlt oder unzureichende Informationen enthält, öffnen Sie bitte eine Issue im offiziellen `godot-docs <https://github.com/godotengine/godot-docs/issues>`_ GitHub Repository, um dies zu melden.
es: Si falta el manual o la referencia de clase o no tiene información suficiente, abra un Issue en el repositorio oficial GitHub `godot-docs <https://github.com/godotengine/godot-docs/issues>`_ para informarlo.
fr: Si le manuel ou la référence de classe est manquant ou présente des informations insuffisantes, veuillez ouvrir une Issue dans le dépôt officiel `godot-docs <https://github.com/godotengine/godot-docs/issues>`_ GitHub pour le signaler.
ja: マニュアルやクラスリファレンスに欠落や不適当な内容がある場合は、公式の`godot-docs <https://github.com/godotengine/godot-docs/issues>`_ GitHubリポジトリにIssueを開いて報告してください。
ko: 만약 매뉴얼이나 클래스 참조에 부족한 정보가 있거나 누락된 경우, 공식 `godot-docs <https://github.com/godotengine/godot-docs/issues>`_ GitHub 저장소에 이를 보고하기 위해 이슈(Issue)를 열어주시기 바랍니다.
pt_br: Se o manual ou referência de classe estiver ausente ou tiver informações insuficientes, abra um problema no repositório oficial `godot-docs <https://github.com/godotengine/godot-docs/issues>`_ do GitHub para reportá-lo.

source: You can Ctrl-click any underlined text like the name of a class, property, method, signal, or constant to jump to it.
de: Sie können auf jeden unterstrichenen Text wie den Namen einer Klasse, Eigenschaft, Methode, eines Signals oder einer Konstante mit der Strg-Taste klicken, um zu dieser Referenz zu springen.
es: Puede pulsar Ctrl y hacer clic en cualquier texto subrayado, como el nombre de una clase, propiedad, método, señal o constante, para acceder a él.
fr: Vous pouvez Ctrl+cliquer sur tout texte souligné, comme le nom d'une classe, d'une propriété, d'une méthode, d'un signal ou d'une constante, pour y accéder.
ja: クラス名、プロパティ名、メソッド名、シグナル名、定数名など、下線が引かれたテキストをCtrlキーを押しながらクリックすると、その項目にジャンプします。
ko: 클래스, 속성, 방법, 시그널, 상수와 같은 항목의 이름과 같이 밑줄이 그어진 텍스트를 Ctrl+클릭 하여 해당 항목으로 이동할 수 있습니다.
pt_br: Você pode clicar com a tecla Ctrl pressionada em qualquer texto sublinhado, como o nome de uma classe, propriedade, método, sinal ou constante, para ir até ele.

source: Learning to think like a programmer
de: Lernen, wie ein Programmierer zu denken
es: Aprender a pensar como un programador
ja: プログラマーの考え方を学ぶ
pt_br: Aprendendo a pensar como um programador

source: Teaching programming foundations and how to think like a game developer is beyond the scope of Godot's documentation. If you're new to programming, we recommend two excellent free resources to get you started:
de: Die Vermittlung von Programmiergrundlagen und der Denkweise eines Spieleentwicklers würde den Rahmen der Godot-Dokumentation sprengen. Wenn Sie Programmier-Anfänger sind, empfehlen wir Ihnen zwei ausgezeichnete kostenlose Ressourcen für den Einstieg:
es: Enseñar los fundamentos de la programación y a como pensar como un desarrollador no es el objetivo de la documentación de Godot. Pero si eres novato en la programación, aquí tienes 2 recursos fantásticos que te sugerimos para comenzar:
ja: プログラミングの基礎とゲーム開発者の考え方を教えることは、Godot のドキュメントの範囲を超えています。 プログラミングが初めての場合は、開始するために 2 つの優れた無料リソースをお勧めします。
pt_br: Ensinar fundamentos de programação e como pensar como um desenvolvedor de jogos está além do escopo da documentação do Godot. Se você é novo na programação, recomendamos dois excelentes recursos gratuitos para você começar:

source: Harvard university offers a free courseware to learn to program, `CS50 <https://cs50.harvard.edu/x/>`_. It will teach you programming fundamentals, how code works, and how to think like a programmer. These skills are essential to become a game developer and learn any game engine efficiently. You can see this course as an investment that will save you time and trouble when you learn to create games.
de: Die Harvard-Universität bietet einen kostenlosen Kurs zum Erlernen von Programmierfähigkeiten an, `CS50 <https://cs50.harvard.edu/x/>`_. Hier lernen Sie die Grundlagen des Programmierens, wie Code funktioniert und wie man wie ein Programmierer denkt. Diese Fähigkeiten sind unerlässlich, um Spieleentwickler zu werden und jede beliebige Spiele-Engine effizient zu erlernen. Sie können diesen Kurs als eine Investition sehen, die Ihnen Zeit und Ärger erspart, wenn Sie lernen, Spiele zu entwickeln.
es: La Universidad de Harvard ofrece un curso gratuito para aprender a programar, `CS50 <https://cs50.harvard.edu/x/>`_. Enseña fundamentos de programación, como funciona el código y como pensar como un programador. Estas habilidades son esenciales para convertirte en desarrollador de videojuegos y aprender a usar eficientemente cualquier motor de videojuegos. Considera este curso como una inversión que te ahorrará mucho tiempo y problemas a la hora de aprender a hacer juegos.
ja: ハーバード大学は、プログラミングを学ぶための無料のコースウェア `CS50 <https://cs50.harvard.edu/x/>`_ を提供しています。 プログラミングの基礎、コードがどのように機能するか、プログラマーがどのように考えるかを教えてくれます。 これらのスキルは、ゲーム開発者になったりどんなゲームエンジンでも効率的に学ぶ際には不可欠です。 このコースはあなたにとって、ゲーム作成を学ぶ際の時間と手間を節約する、投資とみなすことができます。
pt_br: A Universidade de Harvard oferece um curso gratuito para aprender a programar, `CS50 <https://cs50.harvard.edu/x/>`_. Ele vai te ensinar fundamentos de programação, como o código funciona e como pensar como um programador. Essas habilidades são essenciais para se tornar um desenvolvedor de jogos e aprender qualquer mecanismo de jogo com eficiência. Você pode ver este curso como um investimento que economizará tempo e problemas ao aprender a criar jogos.

source: If you prefer books, check out the free ebook `Automate The Boring Stuff With Python <https://automatetheboringstuff.com/>`_ by Al Sweigart.
de: Wenn Sie Bücher bevorzugen, schauen Sie sich das kostenlose E-Book `Automate The Boring Stuff With Python <https://automatetheboringstuff.com/>`_ von Al Sweigart an.
es: Si prefieres aprender con libros, te recomendamos el libro digital y gratuito `Automate The Boring Stuff With Python <https://automatetheboringstuff.com/>`_ por Al Sweigart.
ja: 本がお好みの場合は、Al Sweigat 著の無料電子ブック `Automate The Boring Stuff With Python <https://automatetheboringstuff.com/>`_ をチェックしてください。
pt_br: Se você preferir livros, confira o ebook gratuito `Automate The Boring Stuff With Python <https://automatetheboringstuff.com/>`_ por Al Sweigart.

source: Learning with the community
de: Lernen mit der Community
es: Aprendiendo con la comunidad
fr: Apprendre avec la communauté
ja: コミュニティで学ぶ
ko: 커뮤니티와 함께 배우기
pt_br: Aprenda com a comunidade

source: Godot has a growing community of users. If you're stuck on a problem or need help to better understand how to achieve something, you can ask other users for help on one of the many `active communities <https://godotengine.org/community>`_.
de: Godot hat eine wachsende Community von Benutzern. Wenn Sie bei einem Problem nicht weiterkommen oder Hilfe dabei benötigen, etwas besser zu verstehen, können Sie andere Benutzer in einer der vielen `aktiven Communities <https://godotengine.org/community>`_ um Hilfe bitten.
es: Godot tiene una creciente comunidad de usuarios. Si está atascado en un problema o necesita ayuda para comprender mejor cómo lograr algo, puede pedir ayuda a otros usuarios en una de las muchas `comunidades activas <https://godotengine.org/community>`_.
fr: Godot dispose d'une communauté d'utilisateurs en pleine expansion. Si vous êtes bloqué sur un problème ou si vous avez besoin d'aide pour mieux comprendre comment réaliser quelque chose, vous pouvez demander de l'aide aux autres utilisateurs sur l'une des nombreuses ` communautés actives <https://godotengine.org/community>`_.
ja: Godotには拡大を続けるユーザーコミュニティがあります。問題に悩まされてたり、何かを達成する方法を理解するために助けが必要な場合は、 `活動中のコミュニティ<https://godotengine.org/community>`_ の中から、他のユーザーに助けを求めることができます。
ko: Godot는 점점 성장하는 사용자 커뮤니티를 가지고 있습니다. 문제에 막혀있거나 어떤 것을 어떻게 구현할 수 있는지 더 잘 이해하기 위해 도움이 필요하다면 다른 사용자들에게 도움을 요청할 수 있습니다. 많은 활발한 커뮤니티 중 하나에서 도움을 받을 수 있습니다. 이러한 커뮤니티는 다음 링크에서 확인할 수 있습니다. `active communities <https://godotengine.org/community>`_.
pt_br: Godot tem uma comunidade crescente de usuários. Se você está preso em um problema ou precisa de ajuda para entender melhor como conseguir algo, você pode pedir ajuda a outros usuários em uma das muitas `comunidades ativas <https://godotengine.org/community>`_.

source: The best place to ask questions and find already answered ones is the official `Questions & Answers <https://ask.godotengine.org/>`_ site. These responses show up in search engine results and get saved, allowing other users to benefit from discussions on the platform. Once you have asked a question there, you can share its link on other social platforms. Before asking a question, be sure to look for existing answers that might solve your problem on this website or using your preferred search engine.
de: Der beste Ort, um Fragen zu stellen und bereits beantwortete Fragen zu finden, ist die offizielle `Questions & Answers <https://ask.godotengine.org/>`_ Seite. Diese Antworten erscheinen in Suchmaschinenergebnissen und werden gespeichert, so dass andere Nutzer von den Diskussionen auf der Plattform profitieren können. Sobald Sie dort eine Frage gestellt haben, können Sie den Link dazu auf anderen sozialen Plattformen teilen. Bevor Sie eine Frage stellen, sollten Sie auf dieser Website oder über Ihre bevorzugte Suchmaschine nach Antworten suchen, die Ihr Problem lösen könnten.
es: El mejor lugar para hacer preguntas y encontrar las ya respondidas es el sitio oficial `Preguntas y Respuestas <https://ask.godotengine.org/>`_. Estas respuestas aparecen en los resultados del motor de búsqueda y se guardan, lo que permite que otros usuarios se beneficien de las discusiones en la plataforma. Una vez que hayas hecho una pregunta allí, puede compartir su enlace en otras plataformas sociales. Antes de hacer una pregunta, asegúrate de buscar respuestas existentes que puedan resolver tu problema en este sitio web o utilizando tu motor de búsqueda preferido.

source: Asking questions well and providing details will help others answer you faster and better. When asking questions, we recommend including the following information:
de: Indem Sie gut formulierte Fragen stellen und Einzelheiten angeben, können andere Ihnen schneller und besser antworten. Wenn Sie Fragen stellen, empfehlen wir Ihnen, die folgenden Informationen anzugeben:
es: Hacer bien las preguntas y brindar detalles ayudará a que otros te respondan más rápido y mejor. Al hacer preguntas, recomendamos incluir la siguiente información:
fr: En posant bien les questions et en fournissant des détails, vous aiderez les autres à vous répondre plus rapidement et mieux. Lorsque vous posez des questions, nous vous recommandons d'inclure les informations suivantes :
ja: 上手に質問する方法として、詳細な情報を提供することで、他の人がより早く、よりよく答えてくれるようになります。質問をする際には、以下の情報を含めることをお勧めします。
ko: 다른 사람들이 답변을 더 빠르고 더 잘 할 수 있도록 질문을 잘하고 세부 정보를 제공하는 것이 좋습니다. 질문을 할 때, 다음과 같은 정보를 포함하는 것이 좋습니다:
pt_br: Perguntar bem e com detalhes ajuda outros a te responderem mais rápido e melhor. Quando tirar dúvidas, nós recomendamos que inclua as seguintes informações:

source: **Describe your goal**. You want to explain what you are trying to achieve design-wise. If you are having trouble figuring out how to make a solution work, there may be a different, easier solution that accomplishes the same goal.
de: **Beschreiben Sie Ihr Ziel**. Erläutern Sie, welche Idee Sie umsetzen wollen. Wenn Sie Schwierigkeiten haben herauszufinden, wie eine Lösung funktioniert, gibt es vielleicht eine andere, einfachere Lösung, die das gleiche Ziel erreicht.
es: **Describe tu objetivo**. Desea explicar lo que está tratando de lograr en cuanto al diseño. Si tiene problemas para descubrir cómo hacer que una solución funcione, puede haber una solución diferente y más fácil que logre el mismo objetivo.
fr: **Décrivez votre objectif**. Vous devez expliquer ce que vous essayez d'accomplir sur le plan de la conception. Si vous avez du mal à trouver comment faire fonctionner une solution, il existe peut-être une solution différente et plus simple qui permet d'atteindre le même objectif.
ja: **達成したいことを説明してください**。何を目標として達成しようとしているのかを説明する必要があります。1つの解決案がうまくいかない場合、同じ目標を達成するために、もっと簡単な別の解決案があるかもしれません。
ko: **목표를 설명**하세요. 디자인 관점에서 어떤 결과를 달성하려고 하는지 설명하세요. 만약 해결 방법을 구현하는 데 문제가 있다면, 동일한 목표를 달성하는 다른, 더 간단한 해결책이 있을 수 있습니다.
pt_br: **Descreva seu objetivo**. Você quer explicar o'que você está tentando realizar em respeito ao design. Se você está tendo problemas tentando fazer uma solução funcionar, talvez tenha uma solução diferente, mais simples que resolva o mesmo objetivo.
