Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_first_script.po
Languages: de, es, fr, ja, ko, pt_br, uk

source: A Sprite node needs a texture to display. In the Inspector on the right, you can see that the Texture property says "[empty]". To display the Godot icon, click and drag the file ``icon.png`` from the FileSystem dock onto the Texture slot.
de: Ein Sprite-Node braucht eine Textur, um angezeigt zu werden. Im Inspektor auf der rechten Seite sehen Sie, dass die Eigenschaft Textur "[leer]" lautet. Um das Godot-Symbol anzuzeigen, klicken Sie auf die Datei ``icon.png`` und ziehen Sie sie aus dem FileSystem-Dock auf den Textur-Slot.
fr: Un nœud Sprite a besoin d'une texture pour s'afficher. Dans l'inspecteur à droite, vous pouvez voir que la propriété Texture indique "[empty]". Pour afficher l'icône Godot, cliquez et faites glisser le fichier ``icon.png`` du dock FileSystem sur l'emplacement Texture.
ja: スプライトノードを表示するにはテクスチャが必要です。右側のインスペクターで、Textureプロパティが「[空]」と表示されていることがわかります。 Godotアイコンを表示するには、ファイル ``icon.png`` をFileSystemドックからTextureスロットにドラッグアンドドロップします。
ko: Sprite 노드에는 표시할 텍스처가 필요합니다. 오른쪽 Inspector에서 Texture 속성에 "[empty]"라고 표시된 것을 볼 수 있습니다. Godot 아이콘을 표시하려면 FileSystem 독에서 ``icon.png`` 파일을 클릭하여 텍스처 슬롯으로 드래그하세요.
pt_br: Um nó Sprite precisa de uma textura para mostrá-la. No inspetor na direita, você pode ver que a propriedade Textura diz "[vazio]". Para mostrar o ícone do Godot, clique e arraste o arquivo ``icon.png`` do painel de Arquivos para o slot de Textura.
uk: Для відображення вузла Sprite потрібна текстура. У Інспекторі праворуч ви можете побачити, що властивість Texture говорить «[порожньо]». Щоб відобразити піктограму Godot, клацніть і перетягніть файл ``icon.png`` із вкладки Файлова система у слот Texture.

source: You can create Sprite nodes automatically by dragging and dropping images on the viewport.
de: Sie können Sprite-Nodes automatisch durch Ziehen und Ablegen von Bildern auf das Ansichtsfenster erstellen.
fr: Vous pouvez créer des nœuds Sprite automatiquement en faisant glisser et en déposant des images dans la fenêtre d'affichage.
ja: また ビューポートに画像をドラッグアンドドロップすることで、スプライトノードを自動的に作成することもできます。
ko: 뷰포트에 이미지를 드래그 앤 드롭하여 Sprite 노드를 자동으로 생성할 수 있습니다.
pt_br: Você pode criar nós Sprite automaticamente arrastando e soltando imagens no viewport.
uk: Ви можете створювати вузли Sprite автоматично, перетягуючи зображення у вікно перегляду.

source: To create and attach a new script to our node, right-click on Sprite in the scene dock and select "Attach Script".
de: Um ein neues Skript zu erstellen und an unseres Node anzuhängen, klicken Sie mit der rechten Maustaste auf Sprite im Szenendock und wählen Sie „Skript hinzufügen“.
fr: Pour créer et attacher un nouveau script à notre nœud, cliquez avec le bouton droit de la souris sur Sprite dans le dock scène et sélectionnez "Attach Script".
ja: 新しいスクリプトを作成してノードにアタッチするには、シーンドックでスプライトを右クリックし、[スクリプトをアタッチ]を選択します。
ko: 새 스크립트를 생성하고 노드에 연결하려면 씬 독에서 Sprite를 마우스 오른쪽 버튼으로 클릭하고 "스크립트 연결"을 선택하세요.
pt_br: Para criar e anexar um novo script para o nosso nó, clique com o botão direito no Sprite no painel de cena e selecione "Adicionar Script".
uk: Щоб створити та приєднати новий сценарій до нашого вузла, клацніть правою кнопкою миші на Sprite в панелі сцени та виберіть «Долучити скрипт».

source: Change the Template from Default to Empty to start with a clean file. Leave the other options by default and click the Create button to create the script.
de: Ändern Sie die Vorlage von "Standard" in "Leer", um mit einer sauberen Datei zu beginnen. Belassen Sie die anderen Optionen in der Standardeinstellung und klicken Sie auf die Schaltfläche Erstellen, um das Skript zu erstellen.
fr: Modifiez le modèle de Default à Empty pour commencer avec un fichier propre. Laissez les autres options par défaut et cliquez sur le bouton Créer pour créer le script.
ja: テンプレートを デフォルト から Empty に変更して、クリーンなファイルから始めます。デフォルトで他のオプションを変更せず、[作成]ボタンをクリックしてスクリプトを作成します。
ko: 초기 상태의 파일로 시작하려면 템플릿을 '기본값'에서 '비어 있음'으로 변경하세요. 다른 옵션은 기본으로 두고 생성 버튼을 클릭하여 스크립트를 생성합니다.
pt_br: Mude o modelo de Padrão para Vazio para começar com um arquivo vazio. Deixe as outras opções no padrão e clique em Criar para criar o script.
uk: Змініть шаблон із Типовий на Empty, щоб почати з чистого файлу. Залиште інші параметри за замовчуванням і натисніть кнопку Створити, щоб створити сценарій.

source: The Script workspace should appear with your new ``Sprite.gd`` file open and the following line of code:
de: Der Skript-Arbeitsbereich sollte mit der neuen Datei ``Sprite.gd`` und der folgenden Codezeile geöffnet werden:
fr: L'espace de travail Script devrait apparaître avec votre nouveau fichier ``Sprite.gd`` ouvert et avec la ligne de code suivante :
ja: スクリプトワークスペースに新しい\ ``Sprite.gd`` \ ファイルが開いて下記のコードが表示されます。
ko: 스크립트 작업공간은 새 ``Sprite.gd`` 파일이 열려 있고 다음 코드 줄이 나타나야 합니다:
pt_br: O espaço de trabalho do script deve aparecer com o seu novo arquivo ``Sprite.gd`` aberto com a seguinte linha de código:
uk: Робоча область Script має з’явитися з відкритим новим файлом ``Sprite.gd`` і таким рядком коду:

source: Every GDScript file is implicitly a class. The ``extends`` keyword defines the class this script inherits or extends. In this case, it's ``Sprite``, meaning our script will get access to all the properties and functions of the Sprite node, including classes it extends, like ``Node2D``, ``CanvasItem``, and ``Node``.
de: Jede GDScript-Datei ist implizit eine Klasse. Das Schlüsselwort ``extends`` definiert die Klasse, die dieses Skript erbt oder erweitert. In diesem Fall ist es ``Sprite``, was bedeutet, dass unser Skript Zugriff auf alle Eigenschaften und Funktionen des Sprite-Nodes erhält, einschließlich der Klassen, die es erweitert, wie ``Node2D``, ``CanvasItem``, und ``Node``.
fr: Chaque fichier GDScript est implicitement une classe. Le mot clé ``extends`` définit la classe dont ce script hérite ou qu'il étend. Dans ce cas, c'est ``Sprite``, ce qui signifie que notre script aura accès à toutes les propriétés et fonctions du nœud Sprite, y compris les classes qu'il étend, comme ``Node2D``, ``CanvasItem``, et ``Node``.
ja: すべてのGDScriptファイルは暗黙的なクラスです。 ``extends`` キーワードは、このスクリプトが継承または拡張クラスであることを定義します。この場合 スクリプトの ``Sprite`` クラスは、 ``Node2D`` 、 ``CanvasItem`` 、 ``Node`` など、拡張クラスを含む、Spriteノードのすべてのプロパティと関数にアクセスできます。
ko: 모든 GDScript 파일은 암시적으로 클래스입니다. ``extends`` 키워드는 이 스크립트가 상속하거나 확장하는 클래스를 정의합니다. 지금 예시에서는 ``Sprite``입니다. 즉, 스크립트는 ``Node2D``, ``CanvasItem`` 및 ``Node2D``, ``CanvasItem`` 및 ``Node 등의 확장되는 클래스를 포함하여 Sprite 노드의 모든 속성과 기능에 액세스할 수 있습니다. ``.
pt_br: Todo arquivo GDScript é implicitamente uma classe. A palavra-chave ``extends``define qual classe este script herda ou estende. Neste caso, é o ``Sprite``, significa que nosso script terá acesso a todas as propriedades e funções do nó Sprite, incluindo as classes que a estende, como ``Node2D``, ``CanvasItem``, e ``Node``.
uk: Кожен файл GDScript є неявно класом. Ключове слово ``extends`` визначає клас, який успадковує або розширює цей сценарій. У цьому випадку це ``Sprite``, що означає, що наш скрипт отримає доступ до всіх властивостей і функцій вузла Sprite, включаючи класи, які він розширює, наприклад, ``Node2D``, ``CanvasItem`` і ``Node` ``.

source: In GDScript, if you omit the line with the ``extends`` keyword, your class will implicitly extend :ref:`Reference <class_Reference>`, which Godot uses to manage your application's memory.
de: Wenn Sie in GDScript die Zeile mit dem Schlüsselwort ``extends`` weglassen, erweitert Ihre Klasse implizit :ref:`Reference <class_Reference>`, die Godot verwendet, um den Speicher Ihrer Anwendung zu verwalten.
fr: Dans GDScript, si vous omettez la ligne contenant le mot-clé ``extends``, votre classe étendra implicitement :ref:`Reference <class_Reference>`, que Godot utilise pour gérer la mémoire de votre application.
ja: GDScriptでは、 ``extends`` キーワードの行を省略した場合 :ref:`Reference <class_Reference>` 、 Godotがアプリケーションのメモリを管理するために クラスは暗黙的に拡張されます。
ko: GDScript에서 ``extends`` 키워드가 있는 줄을 생략하면 클래스는 Godot가 애플리케이션의 메모리를 관리하는 데 사용하는 :ref:`Reference <class_Reference>`를 암시적으로 확장합니다.
pt_br: No GDScript, se você omitir a linha com a palavra-chave ``extends``, sua classe vai implicitamente estender :ref:`Reference <class_Reference>`, que o Godot usa para gerenciar a memória do seu aplicativo.
uk: У GDScript, якщо ви пропустите рядок із ключовим словом ``extends``, ваш клас неявно розширить клас :ref:`Reference <class_Reference>`, який Godot використовує для керування пам’яттю вашої програми.

source: You can hover any property's name in the Inspector to see a description and its identifier in code.
de: Sie können den Mauszeiger über den Namen einer Eigenschaft im Inspektor bewegen, um eine Beschreibung und den Bezeichner im Code zu sehen.
fr: Vous pouvez survoler le nom d'une propriété dans l'inspecteur pour voir une description et son identifiant dans le code.
ja: インスペクター内で任意のプロパティの名前にカーソルを合わせると、その説明とコード内での識別子が表示されます。
ko: 인스펙터에서 속성 이름에 마우스 커서를 올리면 속성에 대한 설명과, 코드 상에서의 식별자를 볼 수 있습니다.
pt_br: Você pode passar o mouse sobre o nome de qualquer propriedade no Inspetor para ver uma descrição e seu identificador no código.
uk: Ви можете навести курсор на назву будь-якої властивості в Інспекторі, щоб побачити опис та її ідентифікатор у коді.

source: Save the scene if you haven't already, then press :kbd:`F6` (:kbd:`Cmd + R` on macOS) to run it. Look at the **Output** bottom panel that expands. It should display "Hello, world!".
de: Speichern Sie die Szene, falls Sie dies noch nicht getan haben, und drücken Sie dann :kbd:`F6` (:kbd:`Cmd + R` unter macOS), um sie auszuführen. Sehen Sie sich das untere Feld **Ausgabe** an, das erweitert wird. Es sollte "Hello, world!" anzeigen.
fr: Sauvegardez la scène si vous ne l'avez pas encore déjà fait, puis appuyez sur :kbd:`F6` pour l'exécuter. Regardez le panneau inférieur de sortie qui s'étend. Il devrait afficher "Hello, world !".
ja: シーンをまだ保存していない場合は保存し、 :kbd:`F6` を(macOSでは :kbd:`Cmd + R` )押して実行します。展開された下部の ** [Output]** パネルを確認します。 "Hello, world!"と表示されているはずです。
ko: 아직 저장하지 않았다면 씬을 저장한 다음 :kbd:`F6`(macOS에서는:kbd:`Cmd + R`)을 눌러 실행하세요. 하단의 **Output** 패널을 살펴보세요. "Hello, world!"가 표시되어야 합니다.
pt_br: Salve a cena se você não salvou ainda, e então pressione :kbd:`F6` (:kbd:`Cmd + R` no macOS) para rodá-la. Olhe no painel Saída em baixo que pode ser expandido. Deve estar mostrando "Olá, mundo!".
uk: Збережіть сцену, якщо ви ще цього не зробили, та натисніть :kbd:`F6` (:kbd:`Cmd + R` на macOS), щоб запустити її. Погляньте на нижню панель **Вивід**, яка розгорнеться. На ній має відображатися "Привіт, світ!".

source: Delete the ``_init()`` function, so you're only left with the line ``extends Sprite``.
de: Löschen Sie die Funktion ``_init()``, so dass nur die Zeile ``extends Sprite`` übrig bleibt.
fr: Supprimez la fonction ``_init()``, il ne vous reste que la ligne ``extends Sprite``.
ja: 次に ``_init()`` 関数を削除して、 ``extends Sprite`` という行だけを残します。
ko: ``_init()`` 함수를 삭제해 ``extends Sprite`` 줄만 남깁니다.
pt_br: Delete a função ``_init()``, para que você tenha apenas a linha ``extends Sprite``.
uk: Видаліть функцію ``_init()``, щоб у вас залишився лише рядок ``extends Sprite``.

source: It's time to make our node move and rotate. To do so, we're going to add two member variables to our script: the movement speed in pixels per second and the angular speed in radians per second.
de: Es ist an der Zeit, unser Node zu bewegen und zu drehen. Dazu fügen wir zwei Variablen zu unserem Skript hinzu: die Bewegungsgeschwindigkeit in Pixeln pro Sekunde und die Winkelgeschwindigkeit in Bogenmaß pro Sekunde.
fr: Il est temps de faire bouger et pivoter notre nœud. Pour ce faire, nous allons ajouter deux variables membres à notre script : la vitesse de mouvement en pixels par seconde et la vitesse angulaire en radians par seconde.
ja: スプライトノードを移動および回転させるときが来ました。そのために、スクリプトに2つのメンバー変数を追加します。1秒あたりのピクセル数で表した移動速度と1秒あたりのラジアンで表した角速度です。
ko: 이제 노드를 움직이고 회전시킬 차례입니다. 이를 위해 스크립트에 두 개의 멤버 변수, 즉 초당 픽셀 이동 속도와 초당 라디안 각속도를 추가하겠습니다.
pt_br: Está na hora de fazer nosso nó se mover e girar. Para fazer isso, nós iremos adicionar duas variáveis para o nosso script: a velocidade de movimento em pixels por segundo, e a velocidade angular em radianos por segundo.
uk: Настав час змусити наш вузол рухатися і обертатися. Для цього ми збираємося додати до нашого сценарію дві змінні-члени: швидкість руху в пікселях за секунду і кутову швидкість в радіанах за секунду.

source: To move our icon, we need to update its position and rotation every frame in the game loop. We can use the ``_process()`` virtual function of the ``Node`` class. If you define it in any class that extends the Node class, like Sprite, Godot will call the function every frame and pass it an argument named ``delta``, the time elapsed since the last frame.
de: Um unser Symbol zu bewegen, müssen wir seine Position und Drehung in jedem Frame der Spielschleife aktualisieren. Wir können die virtuelle Funktion ``_process()`` der Klasse ``Node`` verwenden. Wenn Sie die Funktion in einer Klasse definieren, welche die Klasse Node erweitert, wie z.B. Sprite, ruft Godot die Funktion bei jedem Frame auf und übergibt ihr ein Argument namens ``delta``, die seit dem letzten Frame verstrichene Zeit.
fr: Pour déplacer notre icône, nous devons mettre à jour sa position et sa rotation à chaque image de la boucle de jeu. Nous pouvons utiliser la fonction virtuelle ``_process()`` de la classe ``Node``. Si vous la définissez dans une classe qui étend la classe Node, comme Sprite, Godot appellera la fonction à chaque frame et lui passera un argument nommé ``delta``, le temps écoulé depuis la dernière frame.
ja: アイコンを移動するには、ゲームループ内のフレームごとにアイコンの位置と回転を更新する必要があります。 ``Node`` クラスの ``_process（）`` 仮想関数を使用できます。 SpriteなどのNodeクラスの拡張クラスで定義すると、Godotはフレームごとに関数を呼び出し、最後のフレームからの経過時間である ``delta`` という名前の引数を渡します。
ko: 아이콘을 이동하기 위해서는, 게임 루프에서 매 프레임마다 아이콘의 위치와 방향을 업데이트해야 합니다. 이를 위해 ``Node`` 클래스의 가상 함수인``_process()`` 함수를 사용할 수 있습니다. Node 클래스를 확장하는 클래스(Sprite 등)에서 정의하면 Godot는 매 프레임마다 함수를 호출하고, 마지막 프레임 이후 경과된 시간인 ``delta``라는 인수를 전달합니다.
pt_br: Para mover nosso ícone, precisamos atualizar sua posição e rotação a cada quadro no loop do jogo. Podemos usar a função virtual ``_process()`` da classe ``Node``. Se você definir em qualquer classe que estenda a classe Node, como Sprite, Godot chamará a função a cada quadro e passará a ela um argumento chamado ``delta``, o tempo decorrido desde o último quadro.
uk: Щоб перемістити нашу іконку, нам потрібно оновити її положення та обертати кожен кадр у ігровому циклі. Ми можемо використовувати віртуальну функцію ``_process()`` класу ``Node``. Якщо ви визначите її в будь-якому класі, який розширює клас Node, як-от Sprite, Godot буде викликати функцію кожен кадр і передасть їй аргумент під назвою ``delta``, тобто час, що минув з моменту останнього кадру.

source: The line inside the function, ``rotation += angular_speed * delta``, increments our sprite's rotation every frame. Here, ``rotation`` is a property inherited from the class ``Node2D``, which ``Sprite`` extends. It controls the rotation of our node and works with radians.
de: Die Zeile innerhalb der Funktion, ``rotation += angular_speed * delta``, erhöht die Rotation unseres Sprites in jedem Frame. Hier ist ``rotation`` eine Eigenschaft, die von der Klasse ``Node2D`` geerbt wurde, die ``Sprite`` erweitert. Sie steuert die Drehung unseres Nodes und arbeitet mit Bogenmaß.
fr: La ligne à l'intérieur de la fonction, ``rotation += angular_speed * delta``, incrémente la rotation de notre sprite à chaque image. Ici, ``rotation`` est une propriété héritée de la classe ``Node2D``, que ``Sprite`` étend. Elle contrôle la rotation de notre noeud et fonctionne avec des radians.
ja: 関数内の行 ``rotation += angular_speed * delta`` は、フレームごとにスプライトの回転角をインクリメントします。ここで、 ``rotation`` は、 ``Sprite`` が拡張する ``Node2D`` クラスから継承されたプロパティです。ノードの回転を制御し、ラジアンで指定します。
ko: 함수 내부의 ``rotation += angular_speed * delta`` 줄은 매 프레임마다 스프라이트의 회전을 증가시킵니다. 여기서 ``rotation``은 ``Sprite``가 상속하는 ``Node2D`` 클래스에서 상속된 프로퍼티입니다. 이 프로퍼티는 노드의 회전을 제어하며 라디안(radians)으로 작동합니다.
pt_br: A linha dentro da função, ``rotation += angular_speed * delta``, incrementa a rotação do nosso sprite a cada frame. Aqui, ``rotation`` é uma propriedade herdada da classe ``Node2D``, onde ``Sprite`` estende. Isso controla a rotação do nosso nó e trabalha com radianos.
uk: Рядок всередині функції, ``rotation += angular_speed * delta``, збільшує обертання нашого спрайта кожен кадр. Тут ``rotation`` є властивістю, успадкованою від класу ``Node2D``, який розширює ``Sprite``. Він контролює обертання нашого вузла і працює з радіанами.

source: Let's now make the node move. Add the following two lines to the ``_process()`` function, ensuring the new lines are indented the same way as the one before them.
de: Lassen Sie uns nun das Node verschieben. Fügen Sie der Funktion ``_process()`` die folgenden beiden Zeilen hinzu und achten Sie darauf, dass die neuen Zeilen genauso eingerückt werden wie die vorherigen.
fr: Faisons maintenant bouger le noeud. Ajoutez les deux lignes suivantes à la fonction ``_process()``, en vous assurant que les nouvelles lignes sont indentées de la même manière que celle qui les précède.
ja: ノードを動かしてみましょう。次の2行を \ ``_process（）``\ 関数に追加し、前の行にそろえインデントします。
ko: 이제 노드를 이동시켜 보겠습니다. 새 줄이 이전 줄과 같은 방식으로 들여쓰기 되도록 유의하며 ``_process()`` 함수에 다음 두 줄을 추가합니다.
pt_br: Agora vamos fazer o nó se deslocar. Adicione estas duas linhas de código na função ``_process()``, garantindo que as novas linhas são espaçadas da mesma forma que as linhas anteriores.
uk: Тепер змусимо вузол рухатися. Додайте наступні два рядки до функції ``_process()``, переконавшись, що нові рядки мають відступ так само, як і попередній.

source: We define a local variable named ``velocity``, a 2D vector representing both a direction and a speed. To make the node move forward, we start from the Vector2 class's constant Vector2.UP, a vector pointing up, and rotate it by calling the ``Vector2.rotated()`` method. This expression, ``Vector2.UP.rotated(rotation)``, is a vector pointing forward relative to our icon. Multiplied by our ``speed`` property, it gives us a velocity we can use to move the node forward.
de: Wir definieren eine lokale Variable namens ``velocity``, einen 2D-Vektor, der sowohl eine Richtung als auch eine Geschwindigkeit darstellt. Um das Node vorwärts zu bewegen, gehen wir von der Konstante Vector2.UP der Klasse Vector2 aus, einem nach oben zeigenden Vektor, und drehen ihn durch Aufruf der Methode ``Vector2.rotated()``. Dieser Ausdruck, ``Vector2.UP.rotated(rotation)``, ist ein Vektor, der relativ zu unserem Symbol nach vorne zeigt. Multipliziert mit unserer Eigenschaft ``speed`` ergibt sich eine Geschwindigkeit, mit der wir das Node vorwärts bewegen können.
fr: Nous définissons une variable locale appelée ``velocity``, un vecteur 2D représentant à la fois une direction et une vitesse. Pour faire avancer le noeud, nous partons de la constante Vector2.UP de la classe Vector2, un vecteur pointant vers le haut, et nous le faisons tourner en appelant la méthode ``Vector2.rotated()``. Cette expression, ``Vector2.UP.rotated(rotation)``, est un vecteur pointant vers l'avant par rapport à notre icône. Multiplié par notre propriété ``speed``, il nous donne une vitesse que nous pouvons utiliser pour faire avancer le noeud.
ja: ``velocity`` という名前のローカル変数を定義します、方向と速度の両方を表す2Dベクトルです。ノードを前進させるには、Vector2クラスの定数 Vector2.UP（上向きのベクトル）を用います、回転は ``Vector2.rotated()`` メソッドを呼び出して実行します。この式 ``Vector2.UP.rotated（rotation）`` は、アイコンに対して前方を指すベクトルです。 ``speed`` プロパティを掛けることで、ノードを前方に移動するための速度が得られます。
ko: 방향과 속도를 모두 나타내는 2D 벡터인 'velocity'라는 지역 변수를 정의합니다. 노드가 앞으로 이동하도록 하려면 위쪽을 가리키는 벡터인 Vector2 클래스의 상수인 Vector2.UP에서 ``Vector2.rotated()`` 메서드를 호출하여 이를 회전시킵니다. ``Vector2.UP.rotated(rotation)``라는 표현은 아이콘을 기준으로 앞으로 향하는 벡터입니다. ``speed`` 속성을 곱하면 노드를 앞으로 이동하기 위한 속도가 적용됩니다.
pt_br: Definimos uma variável local chamada ``velocity``, um vetor 2D representando uma direção e uma velocidade. Para fazer o nó se mover, partimos da constante Vector2.UP da classe Vector2, um vetor apontando para cima, e o giramos chamando o método ``Vector2.rotated()``. Esta expressão, ``Vector2.UP.rotated(rotation)``, é um vetor apontando para frente em relação ao nosso ícone. Multiplicado por nossa propriedade ``velocidade``, nos dá uma velocidade que podemos usar para mover o nó para frente.
uk: Ми визначаємо локальну змінну з назвою ``velocity``, двовимірний вектор, що представляє і напрямок, і швидкість. Щоб змусити вузол рухатися вперед, ми починаємо з константи Vector2.UP класу Vector2, вектора, спрямованого вгору, і повертаємо його, викликаючи метод ``Vector2.rotated()``. Цей вираз, ``Vector2.UP.rotated(rotation)``, є вектором, спрямованим вперед відносно нашої піктограми. Помножений на нашу властивість ``speed``, дає нам швидкість, яку ми можемо використовувати для переміщення вузла вперед.

source: Our node currently moves by itself. In the next part :ref:`doc_scripting_player_input`, we'll use player input to control it.
de: Unser Node bewegt sich derzeit von selbst. Im nächsten Teil :ref:`doc_scripting_player_input` werden wir es mit Spielereingaben steuern.
fr: Notre nœud se déplace actuellement tout seul. Dans la prochaine partie :ref:`doc_scripting_player_input`, nous utiliserons les entrées du joueur pour le contrôler.
ja: このノードは現在、ノード自身で移動します。次のパート :ref:`doc_scripting_player_input` では、プレイヤーの入力を使ってノードをコントロールします。
ko: 우리 노드는 현재 스스로 움직입니다. 다음 파트 :ref:`doc_scripting_player_input`에서는 플레이어 입력을 사용하여 제어합니다.
pt_br: Nosso nó atualmente se move sozinho. Na próxima parte :ref:`doc_scripting_player_input`, usaremos a entrada do jogador para controlá-lo.
uk: Зараз наш вузол рухається сам. У наступній частині :ref:`doc_scripting_player_input`, ми надамо гравцю можливість керувати ним.

source: Here is the complete ``Sprite.gd`` file for reference.
de: Hier ist die vollständige ``Sprite.gd``-Datei als Referenz.
fr: Voici le fichier complet ``Sprite.gd`` pour référence.
ja: 参考までに、\ ``Sprite.gd``\ ファイル全体は次のようになります。
ko: 참조용 전체 ``Sprite.gd`` 파일은 다음과 같습니다.
pt_br: Aqui está o arquivo ``Sprite.gd`` completo, para referência.
uk: Ось повний файл ``Sprite.gd`` для порівняння.
