Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_first_script.po
Languages: de, es, fr, ja, ko, pt_br, uk

source: Creating your first script
de: Ihr erstes Skript erstellen
es: Creando tu primer script
fr: Création de votre premier script
ja: 初めてのスクリプト作成
pt_br: Criando seu primeiro script
uk: Створення першого сценарію

source: In this lesson, you will code your first script to make the Godot icon turn in circles using GDScript. As we mentioned :ref:`in the introduction <toc-learn-introduction>`, we assume you have programming foundations. The equivalent C# code has been included in another tab for convenience.
de: In dieser Lektion programmieren Sie Ihr erstes Skript, um das Godot-Symbol mithilfe von GDScript im Kreis drehen zu lassen. Wie wir :ref:`in der Einführung <toc-learn-introduction>` erwähnt haben, gehen wir davon aus, dass Sie Programmiergrundlagen haben. Der entsprechende C#-Code wurde der Einfachheit halber in eine andere Registerkarte eingefügt.
es: En esta lección, codificarás tu primer script para hacer que el icono de Godot gire en círculos usando GDScript. Como mencionamos :ref:`en la introducción <toc-learn-introduction>`, asumimos que tienes bases de programación. El código equivalente en C# se ha incluido en otra pestaña para mayor comodidad.
fr: Dans cette leçon, vous allez écrire votre premier script pour faire tourner l'icône de Godot en utilisant GDScript. Comme mentionné précédemment :ref:`dans l'introduction <toc-learn-introduction>`, nous supposons que vous avez des bases de programmation. Le code équivalent en C# est inclut dans un autre onglet pour plus de simplicité.
ja: このレッスンでは、GDScript を使ってGodotアイコンを回転させるスクリプトをコーディングします。 :ref:`in the introduction <toc-learn-introduction>` で触れたように、プログラミングの基礎知識があることを前提にしています。同等の C# コードは、便宜上、別のタブに含まれています。
ko: 이번 레슨에서는 GDScript를 사용하여 Godot 아이콘이 원을 그리며 회전하는 첫 번째 스크립트를 코딩해 보겠습니다. 소개 <toc-learn-introduction>`에서 :ref:`를 언급했듯이, 당신이 프로그래밍 기초 지식이 있는 상태라고 가정합니다. 편의를 위해, 동일한 동작을 하는 C# 코드가 다른 탭에 있습니다.
pt_br: Nesta lição, você irá programar seu primeiro script para fazer o ícone do Godot girar em círculos usando GDScript. Como nós mencionamos :ref:`na introdução <toc-learn-introduction>`, assumimos que você tem os fundamentos de programação. O código em C# equivalente será incluído em outra aba para conveniência.
uk: У цьому уроці ви напишете свій перший сценарій на GDScript, що буде обертати піктограму Godot по колу. Як ми вже згадували :ref:`у вступі <toc-learn-introduction>`, ми припускаємо, що ви володієте основами програмування. Для зручності еквівалентний C# код знахолиться в іншій вкладці.

source: To learn more about GDScript, its keywords, and its syntax, head to the :ref:`GDScript reference<doc_gdscript>`.
de: Um mehr über GDScript, seine Schlüsselwörter und seine Syntax zu erfahren, besuchen Sie die :ref:`GDScript-Referenz<doc_gdscript>`.
es: Para obtener más información sobre GDScript, sus palabras clave y su sintaxis, diríjase a :ref:`GDScript reference<doc_gdscript>`.
fr: Pour en savoir plus sur GDScript, ses mots-clés et sa syntaxe, consultez la :ref:`Référence GDScript <doc_gdscript>`.
ja: GDScript、そのキーワード、およびその構文の詳細については、 :ref:`GDScript reference<doc_gdscript>` にアクセスしてください。
ko: GDScript의 키워드와 문법에 대해 좀 더 알아보려면 :ref:`GDScript 참조<doc_gdscript>`를 참조하세요.
pt_br: Para aprender mais sobre GDScript, suas palavras-chave, e sua sintaxe, veja as :ref:`referências GDScript<doc_gdscript>`.
uk: Щоб дізнатися більше про GDScript, його ключові слова та синтаксис, перейдіть до :ref:`Посилання на GDScript<doc_gdscript>`.

source: To learn more about C#, head to the :ref:`C# basics <doc_c_sharp>` page.
de: Weitere Informationen zu C# finden Sie auf der Seite :ref:`C#-Grundlagen <doc_c_sharp>`.
es: Para obtener más información sobre C#, visite la página :ref:`C# básico <doc_c_sharp>`.
fr: Pour en savoir plus sur C#, lire la page :ref:`bases C#<doc_c_sharp>`.
ja: C#の詳細については、\ :ref:`C# basics <doc_c_sharp>` を参照してください。
pt_br: Para aprender mais sobre C#, vá para a página :ref:`Conceitos Básicos de C# <doc_c_sharp>`.
uk: Щоб дізнатися більше про C#, перегляньте :ref:`основи C# <doc_c_sharp>`.

source: Project setup
de: Projektkonfiguration
es: Configuración del proyecto
fr: Configuration du projet
ja: プロジェクトの設定
ko: 프로젝트 설정하기
pt_br: Configuração do projeto
uk: Налаштування проєкту

source: Please :ref:`create a new project <doc_creating_and_importing_projects>` to start with a clean slate. Your project should contain one picture: the Godot icon, which we often use for prototyping in the community.
es: :ref:`Crea un proyecto nuevo <doc_creating_and_importing_projects>` para comenzar en limpio. Tu proyecto tendrá una imagen: el ícono de Godot, que a menudo usamos para crear prototipos en la comunidad.

source: We need to create a Sprite2D node to display it in the game. In the Scene dock, click the Other Node button.
es: Necesitamos crear un nodo Sprite2D para mostrarlo en el juego. En el panel Escena, haz clic en el botón Otro nodo.

source: Type "Sprite2D" in the search bar to filter nodes and double-click on Sprite2D to create the node.
es: Escribe "Sprite2D" en la barra de búsqueda para filtrar nodos y haz doble clic en Sprite2D para crear el nodo.

source: Your Scene tab should now only have a Sprite2D node.
es: Tu pestaña Escena ahora solo debería tener un nodo Sprite2D.

source: A Sprite2D node needs a texture to display. In the Inspector on the right, you can see that the Texture property says "[empty]". To display the Godot icon, click and drag the file ``icon.svg`` from the FileSystem dock onto the Texture slot.
es: Un nodo Sprite necesita una textura para mostrar. En el Inspector de la derecha, puedes ver que la propiedad Texture dice "[vacío]". Para mostrar el icono de Godot, haz clic y arrastra el archivo ``icon.svg`` desde el panel del sistema de archivos hasta la ranura Texture.

source: You can create Sprite2D nodes automatically by dragging and dropping images on the viewport.
es: Puedes crear nodos Sprite2D automáticamente arrastrando y soltando imágenes en el viewport.

source: Then, click and drag the icon in the viewport to center it in the game view.
de: Klicken und ziehen Sie dann das Symbol in das Ansichtsfenster, um es in der Spielansicht zu zentrieren.
es: Luego, haga clic y arrastre el icono en el viewport para centrarlo en la vista del juego.
fr: Ensuite, cliquez et faites glisser l'icône dans la fenêtre d'affichage pour la centrer dans la vue du jeu.
ja: 次に、ビューポートの Godotアイコン をドラッグし、ゲームビューの中央に配置します。
ko: 그런 다음 뷰포트에서 아이콘을 클릭하고 드래그하여 게임 뷰 중앙에 배치합니다.
pt_br: E então, clique e arraste o ícone no viewport para centralizá-lo na visualização do jogo.
uk: Потім клацніть і перетягніть піктограму у вікні перегляду, щоб відцентрувати її в області перегляду гри.

source: Creating a new script
de: Ein neues Skript erstellen
es: Creando un nuevo script
fr: Créer un nouveau script
ja: 新規スクリプトの作成
pt_br: Criando um novo script
uk: Створення нового сценарію

source: To create and attach a new script to our node, right-click on Sprite2D in the scene dock and select "Attach Script".
es: Para crear y adjuntar un nuevo script a nuestro nodo, haz clic derecho sobre el Sprite2D en el panel de escenas y selecciona "Añadir Script".

source: The Attach Node Script window appears. It allows you to select the script's language and file path, among other options.
de: Im Fenster Node-Skript hinzufügen wird angezeigt. Hier können Sie unter anderem die Sprache des Skripts und den Dateipfad auswählen.
es: Aparece la ventana Adjuntar script de nodo. Le permite seleccionar el idioma del script y la ruta del archivo, entre otras opciones.
fr: La fenêtre "Attacher un script au nœud" apparaît. Elle vous permet de sélectionner la langue du script et le chemin du fichier, en plus d'autres options.
ja: 「ノードにスクリプトをアタッチする」("Attach node Script")ウィンドウが表示されます。このウィンドウでは、スクリプトの言語やファイルパスなどのオプションを選択できます。
pt_br: A janela Adicionar Script ao Nó será exibida. Permite selecionar a linguagem do script e o caminho do arquivo, entre outras opções.
uk: З’явиться вікно Долучити скрипт вузла. Воно дозволяє вибрати мову скрипта та шлях до файлу, серед інших параметрів.

source: Change the Template field from "Node: Default" to "Object: Empty" to start with a clean file. Leave the other options set to their default values and click the Create button to create the script.
es: Cambia la Plantilla por defecto de "Node: Default" a "Object: Empty" para comenzar con un archivo limpio. Deja las otras opciones en sus valores por defecto y haz clic en el botón Crear para crear el script.

source: The Script workspace should appear with your new ``sprite_2d.gd`` file open and the following line of code:
es: El espacio de trabajo Script debería aparecer con su nuevo archivo ``sprite_2d.gd`` abierto y la siguiente línea de código:

source: Every GDScript file is implicitly a class. The ``extends`` keyword defines the class this script inherits or extends. In this case, it's ``Sprite2D``, meaning our script will get access to all the properties and functions of the Sprite2D node, including classes it extends, like ``Node2D``, ``CanvasItem``, and ``Node``.
es: Cada archivo GDScript es implícitamente una clase. La palabra clave ``extends`` define la clase que este script hereda o extiende. En este caso, es ``Sprite2D``, lo que significa que nuestro script tendrá acceso a todas las propiedades y funciones del nodo Sprite, incluidas las clases que extiende, como ``Node2D``, ``CanvasItem`` y ``Node ``.

source: In GDScript, if you omit the line with the ``extends`` keyword, your class will implicitly extend :ref:`RefCounted <class_RefCounted>`, which Godot uses to manage your application's memory.
es: En GDScript, si omites la línea con la palabra clave ``extends``, tu clase extenderá implícitamente :ref:`RefCounted <class_RefCounted>`, la que Godot usa para administrar la memoria de tu aplicación.

source: Inherited properties include the ones you can see in the Inspector dock, like our node's ``texture``.
de: Zu den vererbten Eigenschaften gehören die, welche Sie im Inspektor-Dock sehen können, wie z. B. ``texture`` in unserem Node.
es: Las propiedades heredadas incluyen las que puede ver en el panel Inspector, como la ``textura`` de nuestro nodo.
fr: Les propriétés héritées comprennent celles que vous pouvez voir dans le dock inspecteur, comme notre nœuds ``texture``.
ja: 継承されたプロパティには、ノードの ``texture`` のように、インスペクタードックに表示されるプロパティも含まれます。
ko: 상속된 속성에는 노드의 ``텍스처``와 같이 인스펙터 독에서 볼 수 있는 속성이 포함됩니다.
pt_br: Propriedades herdadas inclui as que você pode ver no painel Inspetor, que nem o ``texture`` do nosso nó.
uk: Успадковані властивості включають ті, які ви можете побачити в панелі Інспектор, як-от ``texture`` нашого вузла.

source: By default, the Inspector displays a node's properties in "Title Case", with capitalized words separated by a space. In GDScript code, these properties are in "snake_case", which is lowercase with words separated by an underscore.
de: Standardmäßig zeigt der Inspektor die Eigenschaften eines Nodes in „Titelschreibweise“ an, wobei großgeschriebene Wörter durch ein Leerzeichen getrennt werden. Im GDScript-Code befinden sich diese Eigenschaften in "snake_case", also Kleinbuchstaben mit Wörtern, die durch einen Unterstrich getrennt sind.
es: Por defecto, el Inspector muestra las propiedades de un nodo en "Title Case", con palabras en mayúsculas separadas por un espacio. En código GDScript, estas propiedades están en "snake_case", minúsculas y palabras separadas por un guión bajo.
fr: Par défaut, l'inspecteur affiche les propriétés d'un nœud en "Title Case", avec chaque mots commençant par une majuscule et séparés par un espace. En code GDScript, ces propriétés sont en "snake_case", en minuscules, et les mots séparés par un underscore.
ja: デフォルトでは、インスペクタータブ内ではノードのプロパティを「Title Case」（タイトルケース）で表示し、大文字の単語をスペースで区切ります。 GDScriptコード内では、これらのプロパティは「snake_case」（スネークケース）およびアンダースコアで区切られた小文字で表記します。
ko: 기본적으로 인스펙터는 노드의 속성을 "Title Case"(공백으로 구분되며 대문자로 시작하는 단어 형태)로 표시합니다. GDScript 코드에서 이러한 속성은 "snake_case"(밑줄로 구분되며 소문자로 이루어진 단어 형태)로 표기됩니다.
pt_br: Por padrão, o Inspetor exibe as propriedades de um nó em "Title Case", com palavras em maiúsculas separadas por um espaço. No código GDScript, essas propriedades estão em "snake_case", que é minúscula com palavras separadas por sublinhado.
uk: За замовчуванням Інспектор відображає властивості вузла з великої літери, розділені проміжком ("Title Case"). У коді GDScript ці властивості позначаються у нижньому регістрі та розділені символом підкреслення ("snake_case").

source: You can hover over any property's name in the Inspector to see a description and its identifier in code.
es: Puedes pasar el cursor sobre el nombre de cualquier propiedad en el Inspector para ver una descripción y su identificador en el código.

source: Hello, world!
de: Hallo, Welt!
es: Hola, mundo!
ja: ハロー、ワールド!
pt_br: Olá, mundo!
uk: Привіт, всесвіт!

source: Our script currently doesn't do anything. Let's make it print the text "Hello, world!" to the Output bottom panel to get started.
de: Unser Skript tut derzeit nichts. Lassen wir es den Text "Hallo, Welt!" in das untere Ausgabefeld drucken, um loszulegen.
es: Nuestro script actualmente no hace nada. Hagamos que imprima el texto "¡Hola, mundo!" al panel inferior Salida para comenzar.
fr: Notre script ne fait actuellement rien. Faisons-le imprimer le texte "Hello, world !" dans le panneau inférieur de sortie pour commencer.
ja: 現在、スクリプトは何もしません。 手始めに「Hello、world！」というテキストを下部[出力]パネルに表示させましょう。
ko: 우리 스크립트는 현재 아무것도 하지 않습니다. 시작으로 하단의 Output 패널에 "Hello, world!"라는 텍스트를 출력해 보겠습니다.
pt_br: Nosso script por enquanto não está fazendo nada. Vamos fazê-lo imprimir o texto "Olá, mundo!" no painel de Saída em baixo para começarmos.
uk: Наш скрипт наразі нічого не робить. Давайте змусимо його надрукувати текст "Привіт, світ!" до нижньої панелі виводу, щоб почати.

source: Add the following code to your script:
de: Fügen Sie den folgenden Code in Ihr Skript ein:
es: Añade el siguiente código a tu script:
fr: Ajoutez le code suivant à votre script :
ja: スクリプトに次のコードを追加します。
ko: 다음 코드를 스크립트에 추가하세요:
pt_br: Adicione o seguinte código no seu script:
uk: Додайте наступний код до свого сценарію:

source: Let's break it down. The ``func`` keyword defines a new function named ``_init``. This is a special name for our class's constructor. The engine calls ``_init()`` on every object or node upon creating it in memory, if you define this function.
de: Schauen wir uns das mal an. Das Schlüsselwort ``func`` definiert eine neue Funktion namens ``_init``. Dies ist ein spezieller Name für den Konstruktor unserer Klasse. Die Engine ruft ``_init()`` bei jedem Objekt oder Node auf, wenn es im Speicher erstellt wird, wenn Sie diese Funktion definieren.
es: Vamos a desglosarlo. La palabra clave ``func`` define una nueva función llamada ``_init``. Este es un nombre especial para el constructor de nuestra clase. El motor llama a ``_init()`` en cada objeto o nodo al crearlo en la memoria, si define esta función.
fr: Décomposons-la. Le mot-clé ``func`` définit une nouvelle fonction nommée ``_init``. C'est un nom spécial pour le constructeur de notre classe. Le moteur appelle ``_init()`` sur chaque objet ou noeud lors de sa création en mémoire, si vous définissez cette fonction.
ja: こまかく見てみましょう。 ``func`` キーワードは、 ``_init`` という名前の新しい関数を定義します。これは、クラスのコンストラクターの特別な名前です。この関数を定義すると、エンジンがメモリ内にオブジェクトまたはノードを作成すると ``_init()`` が初期化のため呼ばれます。
ko: 내용을 분석해 봅시다. ``func`` 키워드는 ``_init``이라는 이름의 새로운 함수를 정의합니다. 이는 우리 클래스 생성자에서 사용하는 특별한 이름입니다. 이 함수를 정의하면 엔진은 메모리에 생성된 모든 개체나 노드에 대해 ``_init()``를 호출합니다.
pt_br: Vamos decompô-lo. A palavra-chave ``func`` define uma nova função chamada ``_init``. Este é um nome especial para o construtor da nossa classe. A engine chama o ``_init()`` em cada objeto ou nó ao criá-lo na memória, se você definir esta função.
uk: Давайте розберемо його. Ключове слово ``func`` визначає нову функцію під назвою ``_init``. Це спеціальна назва для конструктора нашого класу. Движок викликає ``_init()`` для кожного об'єкта або вузла після його створення в пам'яті, якщо ви визначаєте цю функцію.

source: GDScript is an indent-based language. The tab at the start of the line that says ``print()`` is necessary for the code to work. If you omit it or don't indent a line correctly, the editor will highlight it in red and display the following error message: "Indented block expected".
de: GDScript ist eine einrückungsbasierte Sprache. Der Tab am Anfang der Zeile mit der Aufschrift ``print()`` ist notwendig, damit der Code funktioniert. Wenn Sie es weglassen oder eine Zeile nicht richtig einrücken, hebt der Editor dies rot hervor und zeigt die folgende Fehlermeldung an: "Eingerückter Block erwartet".
es: GDScript es un lenguaje basado en sangrías. La tabulación al principio de la línea que dice ``print()`` es necesaria para que el código funcione. Si la omites o no indentas correctamente una línea, el editor la resaltará en rojo y mostrará el siguiente mensaje de error: "Se espera un bloque sangrado".
fr: GDScript est un langage basé sur l'indentation. La tabulation au début de la ligne qui dit ``print()`` est nécessaire pour que le code fonctionne. Si vous l'omettez ou si vous n'indentez pas correctement une ligne, l'éditeur la surligne en rouge et affiche le message d'erreur suivant : "Indentation inattendue".
ja: GDScriptはインデントベースの言語です。コードが機能するには、 ``print()`` という行の先頭にあるタブが必要です。これを省略したり、行を正しくインデントしなかったりすると、エディターはそれを赤で強調表示し、"Unexpected indentation(予期しないインデント)" というエラーメッセージを表示します。
ko: GDScript는 들여쓰기 기반의 언어입니다. ``print()``가 작성된 라인의 시작 부분의 탭은 코드가 동작하기 위해 반드시 필요합니다. 이를 생략하거나 줄을 알맞게 들여쓰지 않으면 편집기에서 해당 항목을 빨간색으로 강조 표시하고 다음과 같은 오류 메시지를 표시합니다:"들여쓰기 된 블록이 필요합니다".
pt_br: GDScript é uma linguagem baseada em recuo. A aba no início da linha que diz ``print()`` é necessária para que o código funcione. Se você omitir ou não recuar uma linha corretamente, o editor a destacará em vermelho e exibirá a seguinte mensagem de erro: "Esperado recuo do bloco".
uk: GDScript — мова, базована на відступах. Табуляція на початку рядка ``print()``необхідниа для роботи коду. Якщо ви пропустите її або зробите не правильний відступ, редактор виділить його червоним кольором і відобразить повідомлення про помилку: "Неочікуваний відступ".

source: Save the scene as ``sprite_2d.tscn`` if you haven't already, then press :kbd:`F6` (:kbd:`Cmd + R` on macOS) to run it. Look at the **Output** bottom panel that expands. It should display "Hello, world!".
es: Guarda la escena como ``sprite_2d.tscn`` si aún no lo has hecho y pulsa :kbd:`F6` (:kbd:`Cmd + R` en macOS) para ejecutarla. Fíjate en el panel inferior **Output** que se expande. Debería mostrar "Hello, world!".

source: Delete the ``_init()`` function, so you're only left with the line ``extends Sprite2D``.
es: Elimina la función ``_init()``, de modo que solo le quede la línea ``extends Sprite2D``.

source: Turning around
de: Umdrehen
es: Dar la vuelta
fr: Faire demi-tour
ja: 回転させるには
ko: 되돌아보기
pt_br: Adicionando movimento
uk: Обертання

source: It's time to make our node move and rotate. To do so, we're going to add two member variables to our script: the movement speed in pixels per second and the angular speed in radians per second. Add the following after the ``extends Sprite2D`` line.
es: Es hora de hacer que nuestro nodo se mueva y gire. Para hacerlo, agregaremos dos variables miembro a nuestro script: la velocidad del movimiento en píxeles por segundo y la velocidad angular en radianes por segundo. Agrega la siguiente línea después de ``extends Sprite2D``.

source: Member variables sit near the top of the script, after any "extends" lines, but before functions. Every node instance with this script attached to it will have its own copy of the ``speed`` and ``angular_speed`` properties.
de: Member-Variablen befinden sich am Anfang des Skripts, nach allen "extends"-Zeilen, aber vor Funktionen. Jede Nodeinstanz, an die dieses Skript angehängt ist, hat eine eigene Kopie der Eigenschaften ``speed`` und ``angular_speed``.
es: Las variables miembro se ubican en la parte superior del script, antes de las funciones. Cada instancia de nodo con este script adjunto tendrá su propia copia de las propiedades ``speed`` y ``angular_speed``.
fr: Les variables membres se trouvent en haut du script, après toutes les lignes "extends", mais avant les fonctions. Chaque instance de nœud à laquelle ce script est attaché aura sa propre copie des propriétés ``speed`` et ``angular_speed``.
ja: メンバー変数は、スクリプトの先頭付近、"extends" 行の後、関数の前に置かれます。このスクリプトがアタッチされているすべてのノードインスタンスは、 ``speed`` （速度）プロパティと ``angular_speed`` （角速度）プロパティの独自のコピーを持つことになります。
ko: 멤버 변수는 스크립트 상단 부근의 "extends" 줄 보다는 뒤에, 함수 보다는 앞에 위치합니다. 이 스크립트가 첨부된 모든 노드 인스턴스는 ``speed`` 및 ``angular_speed`` 속성의 복사본을 갖게 됩니다.
pt_br: As variáveis de definição ficam próximas ao topo do script, depois de qualquer linha "extends", mas antes das funções. Cada instância de nó com este script anexado a ela terá sua própria cópia das propriedades ``speed`` e ``angular_speed``.
uk: Змінні-члени розташовані у верхній частині скрипту, після всіх "extends", але перед функціями. Кожен екземпляр вузла з цим скриптом матиме власну копію властивостей ``speed`` та ``angular_speed``.

source: Angles in Godot work in radians by default, but you have built-in functions and properties available if you prefer to calculate angles in degrees instead.
de: Winkel in Godot funktionieren standardmäßig im Bogenmaß, aber Sie haben integrierte Funktionen und Eigenschaften zur Verfügung, wenn Sie es vorziehen, Winkel stattdessen in Grad zu berechnen.
es: Los ángulos en Godot funcionan por defecto en radianes, pero dispone de funciones y propiedades incorporadas si prefiere calcular los ángulos en grados.
fr: Les angles dans Godot sont exprimés en radians par défaut, mais il existe des fonctions intégrées et des propriétés disponibles si vous préférez calculer les angles en degrés à la place.
ja: Godotの角度はデフォルトではラジアン単位で計算されますが、度単位で角度を計算したい場合に使える組み込み関数やプロパティも用意されています。
ko: Godot에서 각도는 기본적으로 라디안으로 동작하지만, 각도를 도 단위로 계산하는 것을 선호하는 경우 사용할 수 있는 내장 함수와 속성도 있습니다.
pt_br: Os ângulos no Godot trabalham com radianos por padrão, mas há funções e propriedades embutidas disponíveis se você preferir calcular ângulos em graus ao invés de radianos.
uk: Кути в Godot за замовчуванням вказуються в радіанах, але ви маєте вбудовані функції та властивості, якщо ви віддаєте перевагу обчислюванню кутів в градусах.

source: To move our icon, we need to update its position and rotation every frame in the game loop. We can use the ``_process()`` virtual function of the ``Node`` class. If you define it in any class that extends the Node class, like Sprite2D, Godot will call the function every frame and pass it an argument named ``delta``, the time elapsed since the last frame.
es: Para mover nuestro ícono, necesitamos actualizar su posición y rotación por cada frame en el bucle del juego. Podemos usar la función virtual ``_process()`` de la clase ``Node``. Si lo defines en cualquier clase que extienda la clase Node, como Sprite2D, Godot llamará a la función en cada cuadro y le pasará un argumento llamado ``delta``, el tiempo transcurrido desde el último frame.
