Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/step_by_step/scripting_first_script.po
Languages: de, es, fr, ja, ko, pt_br, uk

source: Games work by rendering many images per second, each called a frame, and they do so in a loop. We measure the rate at which a game produces images in Frames Per Second (FPS). Most games aim for 60 FPS, although you might find figures like 30 FPS on slower mobile devices or 90 to 240 for virtual reality games.
de: Bei Spielen werden viele Bilder pro Sekunde gerendert, die als Frames bezeichnet werden, und zwar in einer Schleife. Wir messen die Rate, mit der ein Spiel Bilder produziert, in Frames Per Second (FPS). Die meisten Spiele streben 60 FPS an, obwohl man bei langsameren Mobilgeräten auch Werte wie 30 FPS oder bei Virtual-Reality-Spielen 90 bis 240 FPS finden kann.
es: Los juegos funcionan renderizando muchas imágenes por segundo, cada una llamada frame, y lo hacen en un bucle. Medimos la velocidad a la que un juego produce imágenes en fotogramas por segundo (FPS). La mayoría de los juegos apuntan a 60 FPS, aunque es posible que encuentre cifras como 30 FPS en dispositivos móviles más lentos o de 90 a 240 para juegos de realidad virtual.
fr: Les jeux fonctionnent en rendant de nombreuses images par seconde, chacune étant appelée "frame", et ils le font en boucle. On mesure la vitesse à laquelle un jeu produit des images en images par seconde (FPS). La plupart des jeux visent 60 FPS, mais vous pouvez trouver des chiffres comme 30 FPS sur des appareils mobiles plus lents ou 90 à 240 pour les jeux de réalité virtuelle.
ja: ゲームは、1秒あたりに数多くの画像をレンダリングすることで機能します。各画像はフレームと呼ばれ、ループしてレンダリングされます。ゲームが画像を生成する速度をフレーム/秒（FPS）で測定します。ほとんどのゲームは60FPSを目指していますが、低速のモバイルデバイスでは30 FPS、バーチャルリアリティゲームでは90〜240のような数値が見られる場合があります。
ko: 게임은 초당 많은 이미지(각각을 프레임이라 부름)를 렌더링하는 방식으로 작동하며, 반복해서 동작합니다. 우리는 초당 프레임 수(FPS)로 게임이 이미지를 생성하는 속도를 측정합니다. 대부분의 게임은 60FPS를 목표로 하지만 느린 모바일 장치에서는 30FPS, 가상 현실 게임에서는 90~240FPS와 정도의 수치를 볼 수 있습니다.
pt_br: Os jogos funcionam renderizando muitas imagens por segundo, cada uma chamada de quadro, e fazem isso em um loop. Medimos a taxa na qual um jogo produz imagens em quadros por segundo (FPS). A maioria dos jogos aponta para 60 FPS, embora você possa encontrar números como 30 FPS em dispositivos móveis mais lentos ou 90 a 240 para jogos de realidade virtual.
uk: Ігри працюють, відтворюючи багато зображень за секунду, кожне з яких називається кадром, і роблять це циклічно. Ми вимірюємо швидкість, з якою гра створює зображення в кадрах за секунду (FPS). Більшість ігор націлені на 60 FPS, хоча ви можете знайти і 30 FPS на повільних мобільних пристроях або від 90 до 240 для ігор віртуальної реальності.

source: The engine and game developers do their best to update the game world and render images at a constant time interval, but there are always small variations in frame render times. That's why the engine provides us with this delta time value, making our motion independent of our framerate.
de: Die Engine und die Spieleentwickler tun ihr Bestes, um die Spielwelt zu aktualisieren und Bilder in einem konstanten Zeitintervall zu rendern, aber es gibt immer kleine Schwankungen bei den Renderzeiten der Frames. Deshalb liefert uns die Engine diesen Delta-Zeitwert, der unsere Bewegung unabhängig von unserer Framerate macht.
es: El motor de videojuegos y los desarrolladores hacen todo lo posible para actualizar el mundo del juego y renderizar imágenes en un intervalo de tiempo constante, pero siempre hay pequeñas variaciones en los tiempos de renderizado de frames. Es por eso que el motor nos proporciona este valor de tiempo delta, lo que hace que nuestro movimiento sea independiente de nuestra velocidad de fotogramas.
fr: Le moteur et les développeurs du jeu font de leur mieux pour mettre à jour le monde du jeu et rendre les images à un intervalle de temps constant, mais il y a toujours de petites variations dans les temps de rendu des images. C'est pourquoi le moteur nous fournit cette valeur de temps delta, rendant notre mouvement indépendant de notre framerate.
ja: エンジンとゲームの開発者は、一定の時間でゲームの世界を更新しレンダリングするために最善を尽くしますが、フレームのレンダリング時間には常に小さな変動があります。これはエンジンがフレームレートに依存しないモーションを作成するため提供するデルタタイムです。
ko: 엔진과 게임 개발자는 일정한 시간 간격으로 게임 세계를 업데이트하고 이미지를 렌더링하기 위해 최선을 다하지만, 프레임 렌더링 시간에는 항상 작은 차이가 있습니다. 이것이 바로 엔진이 우리에게 델타 시간 값을 제공하여 움직임을 프레임 속도와 독립적으로 만드는 이유입니다.
pt_br: A engine e os desenvolvedores de jogos fazem seu melhor para atualizar o mundo do jogo e renderizar imagens em um intervalo de tempo constante, mas sempre terá pequenas variações no tempo de renderização de frames. É por isso que a engine nos oferece o valor de tempo delta, fazendo com que o movimento ocorra independente da taxa de quadros.
uk: Розробники рушія та ігор роблять усе можливе, щоб оновлювати ігровий світ і відтворювати зображення через постійний проміжок часу, але завжди є невеликі зміни в часі візуалізації кадрів. Ось чому рушій надає нам це значення дельта-часу, завдяки чому наш рух не залежить від частоти кадрів.

source: At the bottom of the script, define the function:
de: Definieren Sie am Ende des Skripts die Funktion:
es: En la parte inferior del script, defina la función:
fr: Au bas du script, définissez la fonction :
ja: スクリプトの最後に、関数を定義します。
ko: 스크립트 하단에, 아래와 같은 함수를 정의합니다:
pt_br: No fim do script, defina a função:
uk: У нижній частині скрипту визначте функцію:

source: The ``func`` keyword defines a new function. After it, we have to write the function's name and arguments it takes in parentheses. A colon ends the definition, and the indented blocks that follow are the function's content or instructions.
de: Das Schlüsselwort ``func`` definiert eine neue Funktion. Danach müssen wir den Namen der Funktion und die Argumente, die sie benötigt, in Klammern setzen. Ein Doppelpunkt beendet die Definition, und die folgenden eingerückten Blöcke sind der Inhalt oder die Anweisungen der Funktion.
es: La palabra clave ``func`` define una nueva función. Después, tenemos que escribir el nombre de la función y los argumentos que toma entre paréntesis. Los dos puntos terminan la definición y los bloques indentados que siguen son el contenido o las instrucciones de la función.
fr: Le mot-clé ``func`` définit une nouvelle fonction. Après lui, nous devons écrire le nom de la fonction et les arguments qu'elle prend entre parenthèses. Un deux-points termine la définition, et les blocs indentés qui suivent sont le contenu ou les instructions de la fonction.
ja: ``func`` キーワードは新しい関数を定義します。その後、関数名と引数を括弧で囲んで記述する必要があります。コロンで定義を終了し、それに続くインデントされたブロックが関数のコンテンツまたは命令になります。
ko: ``func`` 키워드는 새로운 함수를 정의합니다. 이 키워드 뒤에는 함수의 이름과 인수를 괄호 안에 적어야 합니다. 콜론으로 정의를 끝내고, 이후의 들여쓰기 된 블록은 함수의 내용이나 명령입니다.
pt_br: A palavra-chave ``func`` define uma nova função. Depois disso, devemos escrever o nome da função e os argumentos que ela recebe entre parênteses. Dois pontos terminam a definição e os blocos recuados que seguem são o conteúdo ou as instruções da função.
uk: Ключове слово ``func`` визначає нову функцію. Після нього ми повинні написати ім’я функції та аргументи, які вона приймає, у дужках. Двокрапка закінчує визначення, а наступні блоки з відступом є вмістом або інструкціями функції.

source: Notice how ``_process()``, like ``_init()``, starts with a leading underscore. By convention, Godot's virtual functions, that is to say, built-in functions you can override to communicate with the engine, start with an underscore.
de: Beachten Sie, dass ``_process()``, wie ``_init()``, mit einem führenden Unterstrich beginnt. Godot's virtuelle Funktionen, d.h. eingebaute Funktionen, die Sie überschreiben können, um mit der Engine zu kommunizieren, beginnen mit einem Unterstrich.
es: Observe cómo ``_process()``, al igual que ``_init()``, comienzan con un guión bajo al principio. Por convención, las funciones virtuales de Godot, es decir, las funciones integradas que puede anular para comunicarse con el motor, comienzan con un guión bajo.
fr: Remarquez comment ``_process()``, comme ``_init()``, commence par un trait de soulignement. Par convention, les fonctions virtuelles de Godot, c'est-à-dire les fonctions intégrées que vous pouvez surcharger pour communiquer avec le moteur, commencent par un trait de soulignement.
ja: ``_init()`` や ``_process()`` のように関数の先頭がアンダースコアで始まることに注意してください。慣例により、Godotの仮想関数、つまり、エンジンとやりとりするため オーバーライドされる組み込み関数は、アンダースコアから始まります。
ko: ``_init()``과 마찬가지로 ``_process()``가 밑줄로 시작한다는 걸 주목하세요. 관례적으로, Godot의 가상 함수, 즉 엔진과 통신하기 위해 오버라이딩 할 수 있는 내장 함수는 밑줄로 시작합니다.
pt_br: Observe como ``_process()`` e ``_init()``, começam com um sublinhado à esquerda. Por convenção, as funções virtuais do Godot, ou seja, funções integradas que você pode substituir para se comunicar com a engine, começam com um sublinhado.
uk: Зверніть увагу, що як ``_process()``, так і ``_init()``, починається з підкреслення. За домовленістю, віртуальні функції Godot, тобто вбудовані функції, які ви можете замінити для зв’язку з рушієм, починаються з підкреслення.

source: The line inside the function, ``rotation += angular_speed * delta``, increments our sprite's rotation every frame. Here, ``rotation`` is a property inherited from the class ``Node2D``, which ``Sprite2D`` extends. It controls the rotation of our node and works with radians.
es: La línea dentro de la función, ``rotación += angular_speed * delta``, incrementa la rotación de nuestro sprite en cada frame. Aquí, ``rotation`` es una propiedad heredada de la clase ``Node2D``, la que ``Sprite2D`` extiende. Esta controla la rotación de nuestro nodo y funciona con radianes.

source: In the code editor, you can ctrl-click on any built-in property or function like ``position``, ``rotation``, or ``_process`` to open the corresponding documentation in a new tab.
de: Im Code-Editor können Sie bei gedrückter Strg-Taste auf jede eingebaute Eigenschaft oder Funktion klicken, z. B. ``position``, ``rotation``, oder ``_process``, um die entsprechende Dokumentation in einem neuen Tab zu öffnen.
es: En el editor de código, puede presionar ctrl + clic en cualquier función o propiedad incorporada como ``position``, ``rotation`` o ``_process`` para abrir la documentación correspondiente en una nueva pestaña.
fr: Dans l'éditeur de code, vous pouvez faire un ctrl-clic sur n'importe quelle propriété ou fonction intégrée comme "position", "rotation" ou "traitement" pour ouvrir la documentation correspondante dans un nouvel onglet.
ja: コードエディタで、「position」、「rotation」、「_ process」などの組み込みプロパティまたは関数をCtrlキーを押しながらクリックすると対応する説明文が新しいタブで開きます。
ko: 코드 에디터에서, ``position``, ``rotation`` 또는 ``_process``와 같은 내장된 속성 혹은 함수 위에서 Ctrl + 클릭을 하면 관련된 문서가 새로운 탭으로 나타납니다.
pt_br: No editor de código, você pode clicar com botão esquerdo enquanto segura Ctrl em qualquer propriedade ou função embutida, como ``position``, ``rotation``, ou ``_process`` para abrir a correspondente documentação em uma nova aba.
uk: У редакторі коду ви можете клацнути, утримуючи клавішу ctrl, будь-яку вбудовану властивість або функцію, як-от ``position``, ``rotation`` або ``_process``, щоб відкрити відповідну документацію у новій вкладці.

source: Run the scene to see the Godot icon turn in-place.
de: Führen Sie die Szene aus, um zu sehen, wie sich das Godot-Symbol an Ort und Stelle dreht.
es: Ejecute la escena para ver el ícono de Godot girar en su lugar.
fr: Exécutez la scène pour voir l'icône de Godot tourner en place.
ja: シーンを実行して、Godotアイコンが指定した位置で回転することを確認します。
ko: 씬을 실행하여 Godot 아이콘이 제자리에서 돌아가는 것을 확인하세요.
pt_br: Execute a cena para ver o ícone Godot girar.
uk: Запустіть сцену, щоб побачити, як значок Godot повертається на місці.

source: In C#, notice how the ``delta`` argument taken by ``_Process()`` is a ``double``. We therefore need to convert it to ``float`` when we apply it to the rotation.
es: En C#, nota cómo el argumento ``delta`` tomado por ``_Process()`` es un ``double``. Necesitaremos entonces convertirlo a ``float`` cuando lo aplicamos a la rotación.

source: Moving forward
de: Vorwärtskommen
es: Moviendo hacia adelante
fr: Avancer
ja: 前進させるには
pt_br: Adicionando movimento
uk: Рухатися вперед

source: Let's now make the node move. Add the following two lines inside of the ``_process()`` function, ensuring the new lines are indented the same way as the ``rotation += angular_speed * delta`` line before them.
es: Ahora hagamos que el nodo se mueva. Agrega las siguientes dos líneas a la función ``_process()``, asegurándote de que las nuevas líneas tengan la misma indentación que la anterior ``rotation += angular_speed * delta`` .

source: As we already saw, the ``var`` keyword defines a new variable. If you put it at the top of the script, it defines a property of the class. Inside a function, it defines a local variable: it only exists within the function's scope.
de: Wie wir bereits gesehen haben, definiert das Schlüsselwort ``var`` eine neue Variable. Wenn Sie es an den Anfang des Skripts setzen, definiert es eine Eigenschaft der Klasse. Innerhalb einer Funktion definiert es eine lokale Variable: Sie existiert nur innerhalb des Funktionsbereichs.
es: Como ya vimos, la palabra clave ``var`` define una nueva variable. Si lo coloca en la parte superior del script, define una propiedad de la clase. Dentro de una función, define una variable local: solo existe dentro del alcance de la función.
fr: Comme nous l'avons déjà vu, le mot-clé ``var`` définit une nouvelle variable. Si vous le placez en haut du script, il définit une propriété de la classe. À l'intérieur d'une fonction, il définit une variable locale : elle n'existe que dans la portée de la fonction.
ja: すでに見たように、 ``var`` キーワードは新しい変数を定義します。スクリプトの先頭に配置すると、クラスのプロパティとして定義されます。関数内で定義されたものはローカル変数となり、関数のスコープ内でのみ参照されます。
ko: 이미 살펴보았듯이 ``var`` 키워드는 새로운 변수를 정의합니다. 이를 스크립트 상단에 넣으면, 클래스의 속성을 정의합니다. 함수 내부에서는 지역 변수(함수 범위 내에서만 존재)를 정의합니다.
pt_br: Como já vimos, a palavra-chave ``var`` define uma nova variável. Se você colocá-lo no início do script, ela define uma propriedade da classe. Dentro de uma função, define uma variável local: ela só existe dentro do escopo da função.
uk: Як ми вже бачили, ключове слово ``var`` визначає нову змінну. Якщо розмістити його у верхній частині сценарію, він визначає властивість класу. Усередині функції він визначає локальну змінну: вона існує лише в межах функції.

source: We define a local variable named ``velocity``, a 2D vector representing both a direction and a speed. To make the node move forward, we start from the Vector2 class's constant ``Vector2.UP``, a vector pointing up, and rotate it by calling the Vector2 method ``rotated()``. This expression, ``Vector2.UP.rotated(rotation)``, is a vector pointing forward relative to our icon. Multiplied by our ``speed`` property, it gives us a velocity we can use to move the node forward.
es: Definiremos una variable local llamada ``velocity``, un vector 2D que representa tanto una dirección como una velocidad. Para hacer que el nodo avance, comenzamos con la constante de clase ``Vector2.UP``, un vector que apunta hacia arriba, y lo rotamos llamando al método de Vector2 ``rotated()``. Esta expresión, ``Vector2.UP.rotated(rotation)``, es un vector que apunta hacia adelante en relación con nuestro icono. Multiplicado por nuestra propiedad ``speed``, nos da una velocidad que podemos usar para mover el nodo hacia adelante.

source: We add ``velocity * delta`` to the node's ``position`` to move it. The position itself is of type :ref:`Vector2 <class_Vector2>`, a built-in type in Godot representing a 2D vector.
de: Wir fügen ``velocity * delta`` zu der Nodes ``position`` hinzu, um ihn zu verschieben. Die Position selbst ist vom Typ :ref:`Vector2 <class_Vector2>`, einem eingebauten Typ in Godot, der einen 2D-Vektor darstellt.
es: Agregamos ``velocity * delta`` a la ``posición`` del nodo para moverlo. La posición en sí es de tipo :ref:`Vector2 <class_Vector2>`, un tipo incorporado en Godot que representa un vector 2D.
fr: Nous ajoutons ``velocity * delta`` à la ``position`` du noeud pour le déplacer. La position elle-même est de type :ref:`Vector2 <class_Vector2>`, un type intégré dans Godot représentant un vecteur 2D.
ja: ノードの\ ``position``\ に \ ``velocity * delta``\ を追加して移動しています。このposition自体は :ref:`Vector2 <class_Vector2>` というタイプで、2次元ベクトルを表すGodotの組み込み型です。
ko: 노드의 ``position``에 ``velocity * delta``를 더하여 이동합니다. position 자체는 2D 벡터를 나타내는 Godot에 내장된 타입인 :ref:`Vector2 <class_Vector2>` 타입입니다.
pt_br: Adicionamos ``velocity * delta`` à ``posição`` do nó para movê-lo. A própria posição é do tipo :ref:`Vector2 <class_Vector2>`, um tipo embutido em Godot representando um vetor 2D.
uk: Ми додаємо ``velocity * delta`` до ``position`` вузла, щоб перемістити його. Сама позиція має тип :ref:`Vector2 <class_Vector2>`, вбудований у Godot тип , що представляє 2D вектор.

source: Run the scene to see the Godot head run in circles.
de: Führen Sie die Szene aus, um den Godot-Kopf im Kreis laufen zu sehen.
es: Ejecute la escena para ver la cabeza de Godot correr en círculos.
fr: Exécutez la scène pour voir la tête de Godot tourner en rond.
ja: シーンを実行してGodotの頭がぐるぐる回るのを確認してください。
ko: 씬을 실행하여 Godot 머리가 원을 그리며 움직이는 것을 확인하세요.
pt_br: Execute a cena para ver a cabeça do Godot se mover em círculos.
uk: Запустіть сцену, щоб побачити, як голова Godot рухається по колу.

source: Moving a node like that does not take into account colliding with walls or the floor. In :ref:`doc_your_first_2d_game`, you will learn another approach to moving objects while detecting collisions.
de: Beim Verschieben eines solchen Nodes werden Kollisionen mit Wänden oder dem Boden nicht berücksichtigt. In :ref:`doc_your_first_2d_game` lernen Sie einen anderen Ansatz, um Objekte zu bewegen und dabei Kollisionen zu erkennen.
es: Mover un nodo como ese no tiene en cuenta la colisión con las paredes o el suelo. En :ref:`doc_your_first_2d_game`, aprenderá otro enfoque para mover objetos mientras detecta colisiones.
fr: Déplacer un nœud comme cela ne prend pas en compte les collisions avec les murs ou le sol. Dans :ref:`Votre premier jeu 2d<doc_your_first_2d_game>`, vous apprendrez une autre approche pour déplacer des objets tout en détectant les collisions.
ja: このようなノードの移動では、壁や床との衝突は考慮されません。 ref:`doc_your_first_2d_game` では、衝突を検出しながらオブジェクトを移動させる別のアプローチを学びます。
ko: 지금의 노드 이동은 벽이나 바닥과의 충돌을 고려하지 않고 있습니다. :ref:`doc_your_first_2d_game`에서는 충돌을 감지하면서 물체를 움직이는 또 다른 접근 방식을 배워볼 것입니다.
pt_br: Mover um nó assim não leva em consideração a colisão com paredes ou o chão. Em :ref:`doc_your_first_2d_game`, você aprenderá outra abordagem para mover objetos enquanto detecta colisões.
uk: Переміщення такого вузла не враховує зіткнення зі стінами або підлогою. У :ref:`doc_your_first_2d_game` ви дізнаєтеся про інший підхід до рухомих об’єктів під час виявлення зіткнень.

source: Our node currently moves by itself. In the next part, :ref:`doc_scripting_player_input`, we'll use player input to control it.
es: Actualmente nuestro nodo se mueve solo. En la siguiente parte :ref:`doc_scripting_player_input`, usaremos la entrada del jugador para controlarlo.

source: Complete script
de: Vollständiges Skript
es: Script completo
fr: Script en entier
ja: 完全なスクリプト
pt_br: Script completo
uk: Завершений скрипт

source: Here is the complete ``sprite_2d.gd`` file for reference.
es: Aquí está el archivo ``sprite_2d.gd`` completo como referencia.

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
ko: 번역 상태
pt_br: Progresso da Tradução
uk: Стан перекладу

source: Please create a new project to start with a clean slate. Your project should contain one picture: the Godot icon, which we often use for prototyping in the community.
de: Bitte legen Sie ein neues Projekt an, um mit einer blanken Fläche zu beginnen. Ihr Projekt sollte ein Bild enthalten: das Godot-Symbol, das wir häufig für die Prototypenerstellung in der Community verwenden.
fr: Veuillez créer un nouveau projet pour commencer avec une page blanche. Votre projet doit contenir une image : l'icône Godot, que nous utilisons souvent pour le prototypage dans la communauté.
ja: では 新規project を作成して下さい、白紙の状態から始めます。プロジェクトには1つの画像ファイルが含まれている必要があります。今回はコミュニティでのプロトタイピングによく使用されるGodotアイコンを使います。
ko: 초기 상태에서 시작하기 위해 새 프로젝트를 만드세요. 당신의 프로젝트에는 하나의 그림이 포함되어야 합니다: 우리가 커뮤니티에서 프로토타이핑에 자주 사용하는 Godot 아이콘입니다.
pt_br: Crie um novo projeto para começar do zero. Seu projeto deve conter uma imagem: o ícone Godot, que costumamos usar para prototipagem na comunidade.
uk: Будь ласка, створіть новий проект, щоб почати з чистого аркуша. Ваш проект має містити одну картинку: значок Godot, який ми часто використовуємо для створення прототипів у спільноті.

source: We need to create a Sprite node to display it in the game. In the Scene dock, click the Other Node button.
de: Wir müssen ein Sprite-Node erstellen, um es im Spiel anzuzeigen. Klicken Sie im Szenen-Dock auf die Schaltfläche Anderes Node.
fr: Nous devons créer un nœud Sprite pour l'afficher dans le jeu. Dans le dock Scène, cliquez sur le bouton Autre nœud.
ja: ゲームに表示するには、Spriteノード を作成する必要があります。シーンドックで、[Other Node] ボタンをクリックします。
ko: 게임에 표시하기 위해 Sprite 노드를 만들어야 합니다. 씬 독에서 기타(Other) 노드 버튼을 클릭합니다.
pt_br: Nós precisamos criar um nó de Sprite para mostrá-lo no jogo. No painel de cena, clique em "Outro Nó".
uk: Нам потрібно створити вузол Sprite, щоб відобразити його в грі. На панелі «Сцена» натисніть кнопку «Інший вузол».

source: Type "Sprite" in the search bar to filter nodes and double-click on Sprite to create the node.
de: Geben Sie „Sprite“ in die Suchleiste ein, um Nodes zu filtern, und doppelklicken Sie auf Sprite, um das Node zu erstellen.
fr: Tapez "Sprite" dans la barre de recherche pour filtrer les nœuds et double-cliquez sur Sprite pour créer le nœud.
ja: 検索バーに「Sprite」と入力してノードをフィルタリングし、Spriteをダブルクリックしてノードを作成します。
ko: 검색 창에 "Sprite"를 입력하여 노드를 필터링하고 Sprite를 두 번 클릭하여 노드를 만듭니다.
pt_br: Digite "Sprite" na barra de pesquisa para filtrar os nós e clique duas vezes no Sprite para criar o nó.
uk: Введіть «Sprite» у рядку пошуку, щоб відфільтрувати вузли і двічі клацніть на Sprite, щоб створити вузол.

source: Your Scene tab should now only have a Sprite node.
de: Die Registerkarte "Szene" sollte jetzt nur noch ein Sprite-Node enthalten.
fr: Votre onglet Scène devrait maintenant avoir seulement un nœud Sprite.
ja: これで、[シーン]タブにスプライトノードのみが追加されました。
ko: 현재 씬 탭에는 Sprite 노드만 있어야 합니다.
pt_br: Sua aba de cena agora deve ter apenas um nó Sprite.
uk: Ваша вкладка «Сцена» тепер має лише вузол Sprite.
