Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/audio/audio_streams.po
Languages: es, fr, pt_br

source: Audio streams
es: Corriente de Audio
fr: Flux audio
pt_br: Fluxos de áudio

source: Introduction
es: Introducción
pt_br: Introdução

source: As you might have already read in :ref:`doc_audio_buses`, sound is sent to each bus via an AudioStreamPlayer node. There are different kinds of AudioStreamPlayers. Each one loads an AudioStream and plays it back.
es: Como ya habrán leído en :ref:`doc_audio_buses`, el sonido se envía a cada bus a través de un nodo AudioStreamPlayer. Hay diferentes tipos de AudioStreamPlayer. Cada uno carga un AudioStream y lo reproduce.
fr: Comme vous l'avez peut-être déjà lu dans :ref:`doc_audio_buses`, le son est envoyé à chaque bus via un nœud AudioStreamPlayer. Il existe différents types de AudioStreamPlayers. Chacun charge un AudioStream et le lit.
pt_br: Como você já deve ter lido em :ref:`doc_audio_buses`, um som é enviado para cada barramento a partir de um nó AudioStreamPlayer. Existem diferentes tipos de AudioStreamPlayers. Cada um carrega um AudioStream e o reproduz.

source: An audio stream is an abstract object that emits sound. The sound can come from many places, but is most commonly loaded from the filesystem. Audio files can be loaded as AudioStreams and placed inside an AudioStreamPlayer. You can find information on supported formats and differences in :ref:`doc_importing_audio_samples`.
es: Un flujo de audio es un objeto abstracto que emite sonido. El sonido puede provenir de muchos lugares, pero generalmente se carga desde el sistema de archivos. Los archivos de audio se pueden cargar como AudioStreams y colocarse dentro de un AudioStreamPlayer. Puede encontrar información sobre formatos compatibles y diferencias en :ref:`doc_importing_audio_samples`.
fr: Un flux audio est un objet abstrait qui émet un son. Le son peut provenir de plusieurs endroits, mais il est le plus souvent chargé depuis le système de fichiers. Les fichiers audio peuvent être chargés comme AudioStreams et placés dans un AudioStreamPlayer. Vous trouverez des informations sur les formats pris en charge et leurs différences dans :ref:`doc_importing_audio_samples`.
pt_br: Um fluxo de áudio é um objeto abstrato que emite som. O som pode vir de muitos lugares, mas é mais comumente carregado a partir do sistema de arquivos. Os arquivos de áudio podem ser carregados como AudioStreams e colocados dentro de um AudioStreamPlayer. Você pode encontrar informações sobre formatos suportados e diferenças em :ref:`doc_importing_audio_samples`.

source: There are other types of AudioStreams, such as AudioStreamRandomPitch. This one makes a random adjustment to the sound's pitch every time it's played back. This can be helpful for adding variation to sounds that are played back often.
es: Hay otros tipos de AudioStreamPlayer, como AudioStreamRandomPitch. Este hace un ajuste aleatorio del tono del sonido cada vez que se reproduce. Esto puede ser útil para añadir variación a los sonidos que se reproducen a menudo.
fr: Il existe d'autres types d'AudioStream, comme AudioStreamRandomPitch. Celui-ci effectue un ajustement aléatoire de la hauteur du son à chaque fois qu'il est joué. Ceci peut être utile pour ajouter des variations aux sons qui sont joués souvent.

source: This is the standard, non-positional stream player. It can play to any bus. In 5.1 sound setups, it can send audio to stereo mix or front speakers.
es: Este es el reproductor de stream estándar, no posicional. Puede reproducirse en cualquier bus. En configuraciones de sonido 5.1, puede enviar audio a la mezcla estéreo o a los altavoces frontales.
fr: C'est le lecteur de flux standard non positionnel. Il peut jouer sur n'importe quel bus. Dans les configurations de son 5.1, il peut envoyer de l'audio au mixage stéréo ou aux enceintes avant.
pt_br: Este é o reprodutor de stream padrão não posicional. Pode tocar em qualquer ônibus. Em configurações de som 5.1, ele pode enviar áudio para mixagem estéreo ou alto-falantes frontais.

source: This is a variant of AudioStreamPlayer, but emits sound in a 2D positional environment. When close to the left of the screen, the panning will go left. When close to the right side, it will go right.
es: Es una variante del AudioStreamPlayer, pero emite sonido en un entorno de posición 2D. Cuando esté cerca de la izquierda de la pantalla, la panorámica irá hacia la izquierda. Cuando esté cerca del lado derecho, irá a la derecha.
fr: C'est une variante de l'AudioStreamPlayer, il émet des son pour un environnement 2d. Quand il est proche du bord gauche de l'écran, le "Panning" va vers la gauche. Quand il est proche du droit, le "Panning" le suit.
pt_br: Esta é uma variante do AudioStreamPlayer, mas emite som em um ambiente posicional 2D. Quando próximo à esquerda da tela, o movimento panorâmico irá para a esquerda. Quando perto do lado direito, ele vai para a direita.

source: Area2Ds can be used to divert sound from any AudioStreamPlayer2Ds they contain to specific buses. This makes it possible to create buses with different reverb or sound qualities to handle action happening in a particular parts of your game world.
es: Area2Ds puede utilizarse para desviar el sonido de cualquier AudioStreamPlayer2Ds que contengan a buses específicos. Esto permite crear buses con diferentes calidades de reverberación o sonido para manejar la acción que ocurre en una parte determinada del mundo del juego.
fr: Les Area2D peuvent être utilisés pour dévier le son depuis n'importe lequel des AudioStreamPlayer2D qu'elles contiennent jusqu'à certains bus spécifiques. Cela rend possible de créer des bu avec différentes réverbération ou qualité sonore pour gérer les actions qui se produisent à certains endroits spécifiques de votre monde de jeu.
pt_br: Area2Ds pode ser usado para desviar o som de qualquer AudioStreamPlayer2Ds que eles contêm para barramentos específicos. Isso torna possível criar barramentos com diferentes qualidades de reverb ou som para lidar com a ação que acontece em uma determinada parte do seu mundo de jogo.

source: This is a variant of AudioStreamPlayer, but emits sound in a 3D positional environment. Depending on the location of the player relative to the screen, it can position sound in stereo, 5.1 or 7.1 depending on the chosen audio setup.
es: Es una variante del AudioStreamPlayer, pero emite sonido en un entorno posicional 3D. Dependiendo de la ubicación del reproductor con respecto a la pantalla, puede posicionar el sonido en estéreo, 5.1 o 7.1 dependiendo de la configuración de audio elegida.
fr: Il s'agit d'une variante d'AudioStreamPlayer, mais qui émet du son dans un environnement positionnel 3D. Selon l'emplacement du joueur par rapport à l'écran, il peut positionner le son en stéréo, 5.1 ou 7.1 selon la configuration audio choisie.
pt_br: Esta é uma variante do AudioStreamPlayer, mas emite som em um ambiente posicional 3D. Dependendo da localização do reprodutor em relação à tela, ele pode posicionar o som em estéreo 5.1 ou 7.1 dependendo da configuração de áudio escolhida.

source: Similar to AudioStreamPlayer2D, an Area can divert the sound to an audio bus.
es: Similar a AudioStreamPlayer2D, un Area puede desviar el sonido a un bus de audio.
fr: Similairement à un AudioStreamPlayer2D, une Area peut dévier le son vers un bus audio.
pt_br: Semelhante ao AudioStreamPlayer2D, uma Área pode desviar o som para um barramento de áudio.

source: Unlike for 2D, the 3D version of AudioStreamPlayer has a few more advanced options:
es: A diferencia de la 2D, la versión 3D de AudioStreamPlayer tiene algunas opciones más avanzadas:
fr: Contrairement à sa version 2D, l'AudioStreamPlayer a quelques options plus avancée :
pt_br: Ao contrário do 2D, a versão 3D do AudioStreamPlayer possui algumas opções mais avançadas:

source: Reverb buses
es: Buses de reverberación
fr: Bus de réverbération
pt_br: Barramentos de reverberação

source: Godot allows for 3D audio streams that enter a specific Area node to send dry and wet audio to separate buses. This is useful when you have several reverb configurations for different types of rooms. This is done by enabling this type of reverb in the **Reverb Bus** section of the Area's properties:
es: Godot permite que los flujos de audio 3D que entran en un nodo específico del área envíen audio seco y húmedo a buses separados. Esto es útil cuando se tienen varias configuraciones de reverberación para diferentes tipos de habitaciones. Esto se hace habilitando este tipo de reverberación en la sección **Reverb Bus** de las propiedades del Area:
fr: Godot permet aux flux audios 3D qui entrent dans la zone d’un nœud Area donné, d'envoyer l’audio à différents bus, en appliquant l’effet (*wet*) ou pas (*dry*). Ceci est utile quand vous avez plusieurs configurations de réverbérations pour différents type de pièces. L'effet est obtenu en activant ce type de réverbération dans la section **Reverb bus** des propriétés de l'Area :
pt_br: Godot permite fluxos de áudio 3D que entram em um nó de área específico para enviar áudio seco e úmido para barramentos separados. Isso é útil quando você tem várias configurações de reverberação para diferentes tipos de salas. Isso é feito habilitando esse tipo de reverberação na seção **Reverb Bus** das propriedades da área:

source: At the same time, a special bus layout is created where each area receives the reverb info from each area. A Reverb effect needs to be created and configured in each reverb bus to complete the setup for the desired effect:
es: Al mismo tiempo, se crea un diseño especial de bus donde cada área recibe la información de reverberación de cada área. Es necesario crear y configurar un efecto de reverberación en cada bus de reverberación para completar la configuración del efecto deseado:
fr: Au même moment, une disposition de bus spéciale est crée où chaque Area reçoit l'information des réverbérations depuis chacune des Area. Un effet de réverbération a besoin d'être crée et configuré dans chaque bus de réverbération pour finir la mise en place de l'effet désiré :
pt_br: Ao mesmo tempo, um layout de barramento especial é criado, onde cada área recebe as informações de reverberação de cada área. Um efeito de reverberação precisa ser criado e configurado em cada barramento de reverberação para completar a configuração do efeito desejado:

source: The Area's **Reverb Bus** section also has a parameter named **Uniformity**. Some types of rooms bounce sounds more than others (like a warehouse), so reverberation can be heard almost uniformly across the room even though the source may be far away. Playing around with this parameter can simulate that effect.
es: La sección de **Reverb Bus** del área también tiene un parámetro llamado **Uniformidad**. Algunos tipos de habitaciones rebotan los sonidos más que otros (como un almacén), por lo que la reverberación puede ser escuchada casi uniformemente a través de la habitación aunque la fuente pueda estar lejos. Jugando con este parámetro se puede simular ese efecto.
fr: La section **Reverb bus** de l'Area a aussi un paramètre nommé **Uniformity**. Certains types de pièces réfléchissent plus les sons que d'autres (comme un entrepôts par exemple), donc la réverbération peut être entendu quasi-uniformément à travers la pièce, même si la source de son est très éloignée. Jouer avec ce paramètre peut simuler cet effet.
pt_br: A seção **Reverb Bus** da área também tem um parâmetro chamado **Uniformity**. Alguns tipos de salas refletem mais sons do que outras (como um armazém), então a reverberação pode ser ouvida quase uniformemente em toda a sala, mesmo que a fonte esteja longe. Brincar com esse parâmetro pode simular esse efeito.

source: When the relative velocity between an emitter and listener changes, this is perceived as an increase or decrease in the pitch of the emitted sound. Godot can track velocity changes in the AudioStreamPlayer3D and Camera nodes. Both nodes have this property, which must be enabled manually:
es: Cuando la velocidad relativa entre un emisor y un oyente cambia, esto se percibe como un aumento o disminución del tono del sonido emitido. Godot puede rastrear los cambios de velocidad en los nodos AudioStreamPlayer3D y Camera. Ambos nodos tienen esta propiedad, que debe ser activada manualmente:
fr: Lorsque la vitesse relative entre une source et un récepteur de son change, ceci est perçu comme une augmentation ou diminution de la fréquence du son émis. Godot peut garder la traces de ces changements de vitesse dans les nœuds AudioStreamPlayer3D et Camera. Chacun de ces nœuds ont cette propriétés qui doit être activé manuellement :
pt_br: Quando a velocidade relativa entre um emissor e um ouvinte muda, isto é percebido como um aumento ou diminuição do tom do som emitido. Godot pode rastrear mudanças de velocidade nos nós AudioStreamPlayer3D e Câmera. Ambos os nós têm esta propriedade, que deve ser habilitada manualmente:

source: Enable it by setting it depending on how objects will be moved: use **Idle** for objects moved using ``_process``, or **Physics** for objects moved using ``_physics_process``. The tracking will happen automatically.
es: Habilítalo configurándolo en función de cómo se moverán los objetos: usa **Idle** para los objetos movidos mediante ``_process``, o **Physics** para los objetos movidos mediante ``_physics_process``. El rastreo ocurrirá automáticamente.
fr: Activez-le en le paramétrant en fonction de la façon dont les objets seront déplacés : utilisez **Idle** pour les objets déplacés avec ``_process``, ou **Physics** pour les objets déplacés avec ``_physics_process``. Le suivi se fera automatiquement.
pt_br: Basta habilitá-lo, definindo-o dependendo de como os objetos serão movidos : Use **idle** para objetos movidos usando``_process``, ou **Physics** para objetos movidos usando ``_physics_process``. O rastreamento ocorrerá automaticamente.

source: Translation status
es: Estado de traducción
fr: État de la traduction
pt_br: Progresso da Tradução

source: AudioStream
fr: Flux audio
