Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/thread_safe_apis.po
Languages: es, fr, ja, zh_cn

source: Thread-safe APIs
es: APIs thread safe
fr: Les API sûres pour plusieurs fils d'exécution
zh_cn: 线程安全的 API

source: Threads
es: Hilos
fr: Tâches Parallèles
ja: スレッド
zh_cn: 线程

source: Threads are used to balance processing power across CPUs and cores. Godot supports multithreading, but not in the whole engine.
es: Los hilos (threads) se utilizan para equilibrar la potencia de procesamiento entre las CPUs y los núcleos. Godot admite el multihilo, pero no en todo el motor.
fr: Les threads sont utilisés pour équilibrer la puissance de traitement entre les processeurs et les cœurs. Godot prend en charge le multithreading, mais pas dans l'ensemble du moteur.
ja: スレッドは、CPUとコア間で処理能力のバランスを取るために使用されます。 Godotはマルチスレッドをサポートしていますが、エンジン全体ではサポートしていません。
zh_cn: 线程是用来平衡各CPU和核心的处理能力.Godot支持多线程, 但不是在整个引擎中.

source: Below is a list of ways multithreading can be used in different areas of Godot.
es: Debajo se menciona una lista de los modos en que se puede usar multithreading en las distintas partes de Godot.
fr: Vous trouverez ci-dessous une liste de façons dont le multithreading peut être utilisé dans différents domaines de Godot.
ja: 以下は、Godotのさまざまな領域でマルチスレッドを使用する方法の一覧です。
zh_cn: 下面是可以在Godot的不同区域使用多线程的方法列表.

source: Global scope
es: Ámbito Global
fr: Portée globale
ja: グローバル スコープ
zh_cn: 全局作用域

source: This makes them ideal for code that creates dozens of thousands of instances in servers and controls them from threads. Of course, it requires a bit more code, as this is used directly and not within the scene tree.
es: Esto los hace ideales para el código que crea decenas de miles de instancias en servidores y las controla desde hilos. Por supuesto, esto requiere un poco más de código, ya que se utiliza directamente y no dentro del árbol de escenas.
fr: Cela les rend idéales pour le code qui crée des dizaines de milliers d'instances dans les serveurs et les contrôle à partir de threads. Bien sûr, cela nécessite un peu plus de code, car celui-ci est utilisé directement et non dans l'arbre des scènes.
ja: これは、サーバーに数十万のインスタンスを作成し、スレッドから制御するコードに最適です。もちろん、これはシーンツリー内ではなく直接使用されるため、多少のコードが必要です。
zh_cn: 这使它们成为在服务器中创建数十万个实例并从线程控制它们的代码的理想选择. 当然, 还需要更多的代码, 因为这是直接使用的而不是嵌入场景树中使用.

source: Scene tree
es: Árbol de escenas
fr: Scene tree (Arbre de scène)
ja: シーンツリー
zh_cn: 场景树

source: Interacting with the active scene tree is **NOT** thread-safe. Make sure to use mutexes when sending data between threads. If you want to call functions from a thread, the *call_deferred* function may be used:
es: Interactuar con el árbol de escenas activo **NO** es seguro para hilos. Asegúrate de utilizar mutexes al enviar datos entre hilos. Si deseas llamar funciones desde un hilo, puedes utilizar la función *call_deferred*:
fr: L'interaction avec l'arbre des scènes actif n'est **PAS** thread safe. Veillez à utiliser des mutexes lors de l'envoi de données entre les threads. Si vous souhaitez appeler des fonctions à partir d'un thread, la fonction *call_deferred* peut être utilisée :
zh_cn: 与活动场景树的交互是线程 **不** 安全的. 当在线程之间发送数据时, 请确保使用mutexes. 如果你想从一个线程调用函数, 可以使用 *call_deferred* 函数:

source: However, creating scene chunks (nodes in tree arrangement) outside the active tree is fine. This way, parts of a scene can be built or instantiated in a thread, then added in the main thread:
es: Sin embargo, crear fragmentos de escena (nodos en una disposición de árbol) fuera del árbol activo está bien. De esta manera, se pueden construir o instanciar partes de una escena en un hilo y luego agregarlas en el hilo principal:
fr: Cependant, il est possible de créer des morceaux de scènes (nœuds dans l'arborescence) en dehors de l'arbre actif. De cette façon, des parties d'une scène peuvent être construites ou instanciées dans un fil, puis ajoutées dans le fil principal :
ja: ただし、アクティブなツリーの外側にシーンチャンク(ツリー配置のノード)を作成することは問題ありません。このようにして、シーンの一部をスレッドで構築またはインスタンス化し、メインスレッドに追加できます:
zh_cn: 但是, 可以在激活的场景树外创建场景块(以树形式排列的节点). 这样, 可以在线程中构建或实例化部分场景, 然后将其添加到主线程中:

source: Still, this is only really useful if you have **one** thread loading data. Attempting to load or create scene chunks from multiple threads may work, but you risk resources (which are only loaded once in Godot) tweaked by the multiple threads, resulting in unexpected behaviors or crashes.
es: Aún así, esto solo es realmente útil si tienes **un solo** hilo cargando datos. Intentar cargar o crear fragmentos de escena desde varios hilos puede funcionar, pero corres el riesgo de que los recursos (que solo se cargan una vez en Godot) sean modificados por los múltiples hilos, lo que puede llevar a comportamientos inesperados o fallos.
fr: Pourtant, cela n'est vraiment utile que si vous avez **un** thread de chargement de données. Tenter de charger ou de créer des morceaux de scène à partir de plusieurs threads peut fonctionner, mais vous risquez des ressources (qui ne sont chargées qu'une seule fois dans Godot) modifiées par les plusieurs threads, entraînant des comportements inattendus ou des plantages.
ja: ただし、これはデータをロードするスレッドが\ **1つ**\ しかない場合にのみ本当に役立ちます。複数のスレッドからシーンチャンクをロードまたは作成しようとすると、一応は動作する場合もありますが、リソース(Godotで一度だけロードされる)が複数のスレッドによって微調整され、それにより予期しない動作やクラッシュが発生するリスクがあります。
zh_cn: 不过, 只有当你有 **一个** 线程加载数据时, 这才真正有用. 从多个线程加载或创建场景块可能有效, 但你要冒着资源被多线程调整的风险(在Godot中只加载一次), 从而导致意外行为或崩溃.

source: Only use more than one thread to generate scene data if you *really* know what you are doing and you are sure that a single resource is not being used or set in multiple ones. Otherwise, you are safer just using the servers API (which is fully thread-safe) directly and not touching scene or resources.
es: Solo utiliza más de un hilo para generar datos de escena si *realmente* sabes lo que estás haciendo y estás seguro de que un solo recurso no está siendo utilizado o establecido en múltiples lugares. De lo contrario, es más seguro utilizar directamente la API de los servidores (que es completamente segura para hilos) y no modificar la escena o los recursos.
fr: N'utilisez plusieurs fils pour générer des données de scène que si vous savez *vraiment* ce que vous faites et que vous êtes sûr qu'une ressource n'est pas utilisée ou définie dans plusieurs. Au contraire, il sera plus sûr d'utiliser directement l'API des serveurs (qui est entièrement sécurisée) et en ne touchant pas la scènes ou les ressources.
ja: 自分が何をしているかを\ *本当に*\ 知っていて、単一のリソースが複数のリソースで使用または設定されていないことが確実な場合にのみ、複数のスレッドを使用してシーンデータを生成できます。それ以外の場合は、サーバーAPI(完全にスレッドセーフ)を直接使用するだけにとどめ、シーンやリソースに触れない方が安全です。
zh_cn: 只有当你 "真正" 知道自己在做什么, 并且确信一个资源没有被多个资源使用或设置时, 才可以使用多个线程来生成场景数据. 否则, 直接使用服务端的API(它是完全线程安全的)而不接触场景或资源会更安全.

source: Rendering
es: Renderización
fr: Rendu
ja: レンダリング
zh_cn: 渲染

source: Note that the Multi-Threaded thread model has several known bugs, so it may not be usable in all scenarios.
es: Ten en cuenta que el modelo de hilos "Multi-Threaded" tiene varios errores conocidos, por lo que puede no ser utilizable en todos los escenarios.
fr: Notez que le modèle de threads multithreads comporte plusieurs bogues connus, de sorte qu'il peut ne pas être utilisable dans tous les scénarios.
zh_cn: 请注意，Multi-Thtreaded 线程模型有若干已知的问题，所以无法胜任所有场景。

source: GDScript arrays, dictionaries
es: Arrays y diccionarios GDScript
fr: Tableaux GDScript, dictionnaires
ja: GDScriptの配列、辞書
zh_cn: GDScript 数组、字典

source: In GDScript, reading and writing elements from multiple threads is OK, but anything that changes the container size (resizing, adding or removing elements) requires locking a mutex.
es: En GDScript, leer y escribir elementos desde múltiples hilos está bien, pero cualquier cosa que cambie el tamaño del contenedor (redimensionar, agregar o eliminar elementos) requiere bloquear un mutex.
fr: Dans GDScript, la lecture et l'écriture d'éléments à partir de plusieurs threads sont possibles, mais tout ce qui modifie la taille du conteneur (redimensionnement, ajout ou suppression d'éléments) nécessite le verrouillage d'un mutex.
zh_cn: 在 GDScript 中，可以从多个线程读取和写入元素，但是任何改变容器大小的操作（调整大小、添加或删除元素）都需要锁定互斥锁。

source: Resources
es: Recursos
fr: Ressources
ja: リソース
zh_cn: 资源

source: Modifying a unique resource from multiple threads is not supported. However handling references on multiple threads is supported, hence loading resources on a thread is as well - scenes, textures, meshes, etc - can be loaded and manipulated on a thread and then added to the active scene on the main thread. The limitation here is as described above, one must be careful not to load the same resource from multiple threads at once, therefore it is easiest to use **one** thread for loading and modifying resources, and then the main thread for adding them.
es: Modificar un recurso único desde múltiples hilos no está soportado. Sin embargo, manipular referencias en múltiples hilos sí está soportado, por lo tanto, cargar recursos en un hilo también lo está. Escenas, texturas, mallas, etc., se pueden cargar y manipular en un hilo y luego agregar al escena activa en el hilo principal. La limitación aquí es, como se describió anteriormente, que debes tener cuidado de no cargar el mismo recurso desde múltiples hilos al mismo tiempo. Por lo tanto, lo más fácil es utilizar **un solo** hilo para cargar y modificar recursos, y luego utilizar el hilo principal para agregarlos.
fr: La modification d'une ressource unique à partir de plusieurs threads n'est pas prise en charge. Cependant, la gestion des références sur plusieurs threads est prise en charge, de sorte que le chargement de ressources sur un thread l'est également - les scènes, les textures, les maillages, etc - peuvent être chargés et manipulés sur un thread et ensuite ajoutés à la scène active sur le fil principal. La limitation ici est comme décrite ci-dessus, il faut faire attention à ne pas charger la même ressource à partir de plusieurs threads en même temps, il est donc plus facile d'utiliser **un** thread pour le chargement et la modification des ressources, puis le thread principal pour les ajouter.
zh_cn: 不支持从多个线程修改一个唯一的资源. 但是支持处理多个线程上的引用, 因此在一个线程上加载资源也是如此, 场景, 纹理, 网格等都可以在一个线程上加载和操作, 然后添加到主线程的活动场景中. 这里的限制如上所述, 必须注意不要同时从多个线程上加载相同的资源, 因此最简单的方法是用 **一个** 线程来加载和修改资源, 然后用主线程来添加资源.

source: Translation status
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
zh_cn: 翻译状态
