Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/performance/using_multiple_threads.po
Languages: es, fr, zh_cn

source: Using multiple threads
es: Usando múltiples hilos
fr: Utiliser plusieurs fils d'exécution
zh_cn: 使用多线程

source: Threads
es: Hilos
fr: Tâches Parallèles
zh_cn: 线程

source: Threads allow simultaneous execution of code. It allows off-loading work from the main thread.
es: Los hilos permiten la ejecución simultánea de código, lo que permite descargar trabajo del hilo principal.
fr: Les threads permettent l'exécution simultanée de code. Cela permet de décharger le travail du thread principal.
zh_cn: 线程允许同时执行代码。它允许从主线程卸载工作。

source: Godot supports threads and provides many handy functions to use them.
es: Godot admite hilos y proporciona muchas funciones útiles para utilizarlos.
fr: Godot supporte les threads et fournit de nombreuses fonctions pratiques pour les utiliser.
zh_cn: Godot 支持线程，并提供了许多方便使用的功能。

source: If using other languages (C#, C++), it may be easier to use the threading classes they support.
es: Si estás utilizando otros lenguajes como C# o C++, puede ser más fácil utilizar las clases de hilos que admiten esos lenguajes.
fr: Si vous utilisez d'autres langages (C#, C++), il peut être plus facile d'utiliser directement les classes de threads qu'ils supportent.
zh_cn: 如果使用其他语言（C#、C++），它们支持的线程类可能会更容易使用。

source: Before using a built-in class in a thread, read :ref:`doc_thread_safe_apis` first to check whether it can be safely used in a thread.
es: Antes de utilizar una clase incorporada en un hilo, lee :ref:`doc_thread_safe_apis` primero para comprobar si se puede utilizar de forma segura en un hilo.
fr: Avant d'utiliser une classe intégrée dans un thread, lisez d'abord :ref:`doc_thread_safe_apis` pour vérifier si elle peut être utilisée en toute sécurité dans un thread.
zh_cn: 在线程中使用内置类之前，请先阅读 :ref:`doc_thread_safe_apis`\ ，检查在线程中使用是否安全。

source: Creating a Thread
es: Creando un hilo
fr: Création d’un thread
zh_cn: 创建线程

source: To create a thread, use the following code:
zh_cn: 创建线程请使用如下代码：

source: Your function will, then, run in a separate thread until it returns. Even if the function has returned already, the thread must collect it, so call :ref:`Thread.wait_to_finish()<class_Thread_method_wait_to_finish>`, which will wait until the thread is done (if not done yet), then properly dispose of it.
es: Tu función se ejecutará en un hilo separado hasta que regrese. Incluso si la función ya ha regresado, el hilo debe recogerla, por lo que debes llamar a :ref:`Thread.wait_to_finish()<class_Thread_method_wait_to_finish>`, lo cual esperará hasta que el hilo haya terminado (si aún no ha terminado) y luego lo desechará correctamente.
fr: Votre fonction s'exécutera alors dans un thread séparé jusqu'à ce qu'elle retourne. Même si la fonction est déjà retournée, le thread doit la collecter, alors appelez :ref:`Thread.wait_to_finish()<class_Thread_method_wait_to_finish>`, qui attendra que le thread soit terminé (si ce n'est pas encore fait), puis supprimez-le correctement.
zh_cn: 然后, 你的函数将在一个单独的线程中运行, 直到它返回. 即使函数已经返回, 线程也必须收集它, 所以调用 :ref:`Thread.wait_to_finish()<class_Thread_method_wait_to_finish>` , 它将等待线程完成(如果还没有完成), 然后妥善处理它.

source: Mutexes
zh_cn: Mutex

source: Accessing objects or data from multiple threads is not always supported (if you do it, it will cause unexpected behaviors or crashes). Read the :ref:`doc_thread_safe_apis` documentation to understand which engine APIs support multiple thread access.
es: Acceder a objetos o datos desde múltiples hilos no siempre es compatible (si lo haces, puede provocar comportamientos inesperados o fallos). Lee la documentación de :ref:`doc_thread_safe_apis` para comprender qué APIs del motor admiten el acceso desde múltiples hilos de forma segura.
fr: Accéder à des objets ou des données depuis plusieurs threads n'est pas toujours supporté (si vous le faites, cela provoquera des comportements inattendus ou des plantages). Lisez :ref:`doc_thread_safe_apis` pour comprendre quelles API du moteur supportent l'accès par plusieurs threads.
zh_cn: 并不总是支持从多个线程访问对象或数据(如果你这样做, 会导致意外行为或崩溃). 请阅读 :ref:`doc_thread_safe_apis` 文档, 了解哪些引擎API支持多线程访问.

source: When processing your own data or calling your own functions, as a rule, try to avoid accessing the same data directly from different threads. You may run into synchronization problems, as the data is not always updated between CPU cores when modified. Always use a :ref:`Mutex<class_Mutex>` when accessing a piece of data from different threads.
es: Cuando proceses tus propios datos o llames a tus propias funciones, como regla general, trata de evitar acceder directamente a los mismos datos desde diferentes hilos. Puedes encontrar problemas de sincronización, ya que los datos no siempre se actualizan entre los núcleos de la CPU cuando se modifican. Siempre utiliza un :ref:`Mutex<class_Mutex>` al acceder a un fragmento de datos desde diferentes hilos.
fr: En règle générale, lorsque vous traitez vos propres données ou que vous appelez vos propres fonctions, essayez d'éviter d'accéder aux mêmes données directement depuis différents threads. Vous pouvez rencontrer des problèmes de synchronisation, car les données ne sont pas toujours mises à jour entre les cœurs du processeur lorsqu'elles sont modifiées. Utilisez toujours un :ref:`Mutex<class_Mutex>` lorsque vous accédez à une donnée depuis différents threads.
zh_cn: 在处理自己的数据或调用自己的函数时, 通常情况下, 尽量避免从不同的线程直接访问相同的数据. 你可能会遇到同步问题, 因为数据被修改后,CPU核之间并不总是更新. 当从不同线程访问一个数据时, 一定要使用 :ref:`Mutex<class_Mutex>` .

source: When calling :ref:`Mutex.lock()<class_Mutex_method_lock>`, a thread ensures that all other threads will be blocked (put on suspended state) if they try to *lock* the same mutex. When the mutex is unlocked by calling :ref:`Mutex.unlock()<class_Mutex_method_unlock>`, the other threads will be allowed to proceed with the lock (but only one at a time).
es: Al llamar a :ref:`Mutex.lock()<class_Mutex_method_lock>`, un hilo garantiza que todos los demás hilos se bloquearán (colocados en estado suspendido) si intentan *bloquear* el mismo mutex. Cuando se desbloquea el mutex llamando a :ref:`Mutex.unlock()<class_Mutex_method_unlock>`, los otros hilos podrán continuar con el bloqueo (pero solo uno a la vez).
fr: Lors de l'appel de :ref:`Mutex.lock()<class_Mutex_method_lock>`, un thread assure que tous les autres threads seront bloqués (mis en état suspendu) s'ils tentent de *verrouiller* le même mutex. Lorsque le mutex est déverrouillé en appelant :ref:`Mutex.unlock()<class_Mutex_method_unlock>`, les autres threads seront autorisés à verrouiller le mutex (mais un seul à la fois).
zh_cn: 当调用 :ref:`Mutex.lock()<class_Mutex_method_lock>` 时, 一个线程确保所有其他线程如果试图 *锁* 同一个mutex, 就会被阻塞(进入暂停状态). 当通过调用 :ref:`Mutex.unlock()<class_Mutex_method_unlock>` 来解锁该mutex时, 其他线程将被允许继续锁定(但每次只能锁定一个).

source: Here is an example of using a Mutex:
es: Aquí hay un ejemplo del uso de un Mutex:
fr: Voici un exemple d'utilisation d'un Mutex :
zh_cn: 下面是一个使用 Mutex 的例子:

source: Semaphores
es: Semáforos
zh_cn: Semaphore

source: Sometimes you want your thread to work *"on demand"*. In other words, tell it when to work and let it suspend when it isn't doing anything. For this, :ref:`Semaphores<class_Semaphore>` are used. The function :ref:`Semaphore.wait()<class_Semaphore_method_wait>` is used in the thread to suspend it until some data arrives.
es: A veces quieres que tu hilo trabaje "bajo demanda". En otras palabras, le indicas cuándo debe trabajar y lo suspendes cuando no está haciendo nada. Para esto, se utilizan los :ref:`Semáforos<class_Semaphore>`. La función :ref:`Semaphore.wait()<class_Semaphore_method_wait>` se utiliza en el hilo para suspenderlo hasta que llegue algún dato.
fr: Parfois, vous voulez que votre thread fonctionne *"à la demande "*. En d'autres termes, lui dire quand il doit travailler et le laissez suspendu quand il ne fait rien. Pour cela, on utilise :ref:`Semaphores<classe_Semaphore>`. La fonction :ref:`Semaphore.wait()<class_Semaphore_method_wait>` est utilisée dans le thread pour le suspendre jusqu'à ce que des données arrivent.
zh_cn: 有时你希望你的线程能“按需”工作。换句话说，告诉它什么时候工作，让它在不工作的时候暂停。为此，可以使用信号量 :ref:`Semaphore <class_Semaphore>`\ 。线程中使用函数 :ref:`Semaphore.wait()<class_Semaphore_method_wait>` 来暂停它的工作，直到有数据到达。

source: The main thread, instead, uses :ref:`Semaphore.post()<class_Semaphore_method_post>` to signal that data is ready to be processed:
es: El hilo principal, en cambio, utiliza :ref:`Semaphore.post()<class_Semaphore_method_post>` para indicar que los datos están listos para ser procesados:
fr: Le thread principal, au contraire, utilise :ref:`Semaphore.post()<class_Semaphore_method_post>` pour signaler que les données sont prêtes à être traitées :
zh_cn: 而主线程则使用 :ref:`Semaphore.post()<class_Semaphore_method_post>` 来表示数据已经准备好被处理:

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
