Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/compiling/compiling_for_macos.po
Languages: es, zh_cn

source: Compiling for macOS
es: Compilando para macOS
zh_cn: 为 macOS 平台编译

source: This page describes how to compile macOS editor and export template binaries from source. If you're looking to export your project to macOS instead, read :ref:`doc_exporting_for_macos`.
es: Esta página describe cómo compilar el editor y las plantillas de exportación de macOS desde el código fuente. Si estás buscando exportar tu proyecto a macOS, lee :ref:`doc_exporting_for_macos`.
zh_cn: 这个页面描述的是如何从源码编译 macOS 编辑器和导出模板二进制文件。如果你要找的是导出项目到 macOS，请阅读 :ref:`doc_exporting_for_macos`\ 。

source: Requirements
es: Requerimientos
zh_cn: 需求

source: For compiling under macOS, the following is required:
es: Para compilar en macOS, se requiere lo siguiente:
zh_cn: 在 macOS 下编译时，需要以下条件：

source: `SCons 3.0+ <https://scons.org/pages/download.html>`_ build system.
es: El sistema de construcción `SCons 3.0+ <https://scons.org/pages/download.html>`_.
zh_cn: `SCons 3.0+ <https://scons.org/pages/download.html>`_ 构建系统.

source: `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_ (or the more lightweight Command Line Tools for Xcode).
es: `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_ (o las herramientas de línea de comandos más ligeras para Xcode).
zh_cn: `Xcode <https://apps.apple.com/us/app/xcode/id497799835>`_\ （或更轻量的 Xcode 命令行工具）。

source: Installing Homebrew will also fetch the Command Line Tools for Xcode automatically if you don't have them already.
es: La instalación de Homebrew también descargará automáticamente las Command Line Tools para Xcode si aún no las tienes.
zh_cn: 如果你还没有 Xcode 命令行工具，安装 Homebrew 也会自动进行获取。

source: To get the Godot source code for compiling, see :ref:`doc_getting_source`.
es: Para obtener el código fuente de Godot para compilarlo, consulta la sección :ref:`doc_getting_source`.
zh_cn: 要获取编译所需的 Godot 源码，请参阅 :ref:`doc_getting_source`\ 。

source: For a general overview of SCons usage for Godot, see :ref:`doc_introduction_to_the_buildsystem`.
es: Para obtener una visión general del uso de SCons para Godot, consulta la sección :ref:`doc_introduction_to_the_buildsystem`.
zh_cn: 有关 Godot 的 SCons 用法的一般概述，请参阅 :ref:`doc_introduction_to_the_buildsystem`。

source: Compiling
es: Compilando
zh_cn: 编译

source: Start a terminal, go to the root directory of the engine source code.
es: Para comenzar, abre una terminal y ve al directorio raíz del código fuente del motor (game engine).
zh_cn: 启动终端, 进入引擎源代码的根目录.

source: To compile for Intel (x86-64) powered Macs, use::
es: Para compilar para Macs con procesadores Intel (x86-64), utiliza el siguiente comando::
zh_cn: 若要为英特尔（x86-64）架构的 Mac 编译，请使用： ::

source: To compile for Apple Silicon (ARM64) powered Macs, use::
es: Para compilar para Macs con procesadores Apple Silicon (ARM64), utiliza el siguiente comando::
zh_cn: 要为 Apple Silicon（ARM64）驱动的 Mac 编译，请使用： ::

source: To support both architectures in a single "Universal 2" binary, run the above two commands and then use ``lipo`` to bundle them together::
es: Para admitir ambas arquitecturas en un único archivo binario "Universal 2", ejecuta los dos comandos anteriores y luego utiliza ``lipo`` para combinarlos juntos::
zh_cn: 如果要通过“Universal 2”二进制来同时支持这两种架构，请运行上述两个命令，然后使用 ``lipo`` 将它们打包在一起： ::

source: If you want to use separate editor settings for your own Godot builds and official releases, you can enable :ref:`doc_data_paths_self_contained_mode` by creating a file called ``._sc_`` or ``_sc_`` in the ``bin/`` folder.
es: Si deseas utilizar configuraciones de editor separadas para tus propias compilaciones de Godot y las versiones oficiales, puedes habilitar :ref:`doc_data_paths_self_contained_mode` creando un archivo llamado ``._sc_`` o ``_sc_`` en la carpeta ``bin/``.
zh_cn: 如果你想为自己的 Godot 构建和官方发布使用单独的编辑器设置，你可以通过在 ``bin/`` 文件夹中创建一个名为 ``._sc_`` 或 ``_sc_`` 的文件来启用 :ref:`doc_data_paths_self_contained_mode`\ 。

source: Running a headless/server build
zh_cn: 运行无头/服务器构建

source: And then use the ``--headless`` command line argument::
zh_cn: 然后使用 ``--headless`` 命令行参数： ::

source: To compile a debug *server* build which can be used with :ref:`remote debugging tools <doc_command_line_tutorial>`, use::
es: Para compilar una versión *servidor* con depuración que se puede utilizar con :ref:`herramientas de depuración remota <doc_command_line_tutorial>`, utiliza:
zh_cn: 如果要编译调试版本的\ *服务器*\ ，支持\ :ref:`远程调试工具 <doc_command_line_tutorial>`\ ，那么请使用： ::

source: To compile a release *server* build which is optimized to run dedicated game servers, use::
es: Para compilar una versión de servidor *release* que esté optimizada para ejecutar servidores de juego dedicados, utiliza el siguiente comando::
zh_cn: 如果要编译发布版本的\ *服务器*\ ，针对运行专门的游戏服务器进行优化，那么请使用： ::

source: Building export templates
es: Construyendo plantillas de exportación
zh_cn: 构建导出模板

source: Official templates are universal binaries which support both Intel x86_64 and ARM64 architectures. You can also create export templates that support only one of those two architectures by leaving out the ``lipo`` step below.
es: Las plantillas oficiales son binarios universales que admiten las arquitecturas tanto de Intel x86_64 como ARM64. También puedes crear plantillas de exportación que admitan solo una de esas dos arquitecturas omitiendo el paso de ``lipo`` que se menciona a continuación.
zh_cn: 官方模板是通用的二进制文件，同时支持英特尔x86_64和ARM64架构。你也可以通过省略下面的 ``lipo`` 步骤，创建只支持架构中的一种的导出模板。

source: For Intel x86_64::
es: Para Intel x86_64::
zh_cn: 对于英特尔 x86_64： ::

source: To support both architectures in a single "Universal 2" binary, run the above two commands blocks and then use ``lipo`` to bundle them together::
es: Para admitir ambas arquitecturas en un único archivo binario "Universal 2", ejecuta los dos bloques de comandos anteriores y luego utiliza ``lipo`` para combinarlos juntos::
zh_cn: 要使用“Universal 2”二进制来同时支持这两种架构，请运行上述两个命令块，然后使用 ``lipo`` 将它们捆绑在一起： ::

source: Using Pyston for faster development
es: Usando Pyston para un desarrollo mas rápido
zh_cn: 使用 Pyston 加快开发速度

source: Cross-compiling for macOS from Linux
es: Compilando para macOS desde Linux
zh_cn: 从 Linux 交叉编译 macOS

source: It is possible to compile for macOS in a Linux environment (and maybe also in Windows using the Windows Subsystem for Linux). For that, you'll need to install `OSXCross <https://github.com/tpoechtrager/osxcross>`__ to be able to use macOS as a target. First, follow the instructions to install it:
es: Es posible compilar para macOS en un entorno Linux (y tal vez también en Windows utilizando el Subsistema de Windows para Linux). Para ello, deberás instalar `OSXCross <https://github.com/tpoechtrager/osxcross>`__ para poder utilizar macOS como destino. Primero, sigue las instrucciones para instalarlo:
zh_cn: 在Linux环境下为macOS进行编译是可行的(也许也可以在Windows中使用Windows Subsystem for Linux). 为此, 你需要安装 `OSXCross <https://github.com/tpoechtrager/osxcross>`__ , 以便能够使用macOS作为目标. 首先, 按照说明来安装它:

source: Clone the `OSXCross repository <https://github.com/tpoechtrager/osxcross>`__ somewhere on your machine (or download a ZIP file and extract it somewhere), e.g.::
es: Clona el repositorio `OSXCross <https://github.com/tpoechtrager/osxcross>`__ en algún lugar de tu máquina (o descarga un archivo ZIP y extráelo en algún lugar), por ejemplo:
zh_cn: 在你的机器上某处克隆 `OSXCross 资源库 <https://github.com/tpoechtrager/osxcross>`__\ （或者下载一个 ZIP 文件并解压缩），例如： ::

source: Follow the instructions to package the SDK: https://github.com/tpoechtrager/osxcross#packaging-the-sdk
es: Sigue las instrucciones para empaquetar el SDK en el siguiente enlace: https://github.com/tpoechtrager/osxcross#packaging-the-sdk
zh_cn: 按照说明打包SDK:https://github.com/tpoechtrager/osxcross#packaging-the-sdk

source: Follow the instructions to install OSXCross: https://github.com/tpoechtrager/osxcross#installation
es: Para instalar OSXCross, sigue las instrucciones en el siguiente enlace: https://github.com/tpoechtrager/osxcross#installation
zh_cn: 按照说明安装OSXCross:https://github.com/tpoechtrager/osxcross#installation

source: After that, you will need to define the ``OSXCROSS_ROOT`` as the path to the OSXCross installation (the same place where you cloned the repository/extracted the zip), e.g.::
es: Después de eso, necesitarás definir ``OSXCROSS_ROOT`` como la ruta de la instalación de OSXCross (el mismo lugar donde clonaste el repositorio o extrajiste el archivo ZIP), por ejemplo:
zh_cn: 然后，你需要将 ``OSXCROSS_ROOT`` 定义为 OSXCross 的安装路径（与你克隆软件库/提取压缩包的地方相同），例如： ::

source: Now you can compile with SCons like you normally would::
es: Ahora puedes compilar con SCons como lo harías normalmente::
zh_cn: 现在你可以像平时一样用 SCons 进行编译： ::

source: If you have an OSXCross SDK version different from the one expected by the SCons buildsystem, you can specify a custom one with the ``osxcross_sdk`` argument::
es: Si tienes una versión de SDK de OSXCross diferente de la esperada por el sistema de construcción de SCons, puedes especificar una personalizada mediante el argumento ``osxcross_sdk``::
zh_cn: 如果你的 OSXCross SDK 版本与 SCons 构建系统所期望的不同，你可以用 ``osxcross_sdk`` 参数指定一个自定义的版本： ::

source: Translation status
es: Estado de traducción
zh_cn: 翻译状态
