Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/object_class.po
Languages: fr, zh_tw

source: Object class
fr: Classe Object
zh_tw: Object 類別

source: This page describes the C++ implementation of objects in Godot. Looking for the Object class reference? :ref:`Have a look here. <class_Object>`
zh_tw: 本頁說明的是 Godot 中 Object 的 C++ 實作。在找 Object 類別的參照文件嗎？ :ref:`請參考這裡。 <class_Object>`

source: General definition
fr: Définition générale
zh_tw: 一般性定義

source: :ref:`Object <class_object>` is the base class for almost everything. Most classes in Godot inherit directly or indirectly from it. Objects provide reflection and editable properties, and declaring them is a matter of using a single macro like this.
fr: :ref:`Object <class_object>` est la classe de base pour presque tout. La plupart des classes de Godot en héritent directement ou indirectement. Les Objects fournissent des propriétés de réflexion et d'édition, et les déclarer est une question d'utilisation d'une seule macro comme celle-ci.
zh_tw: :ref:`Object <class_object>` 幾乎是所有東西的基礎類別。在 Godot 中幾乎所有的類別都是直接或間接地繼承 Object。Object 提供了反射 (Reflection) 與可編輯的屬性，而定義 Object 就只需要像這樣呼叫單一巨集即可。

source: This makes Objects gain a lot of functionality, like for example
fr: Cela permet aux Objects d'acquérir de nombreuses fonctionnalités, comme par exemple
zh_tw: 這樣一來可以讓 Object 有更多的功能，如

source: References:
fr: Références :
zh_tw: 參考資料：

source: Registering an Object
fr: Déclarer un Object
zh_tw: 註冊 Object

source: ClassDB is a static class that holds the entire list of registered classes that inherit from Object, as well as dynamic bindings to all their methods properties and integer constants.
fr: ClassDB est une classe statique qui contient la liste complète des classes déclarées qui héritent d'Object, ainsi que des liens dynamiques vers toutes les propriétés de leurs méthodes et constantes entières.
zh_tw: ClassDB 是一個靜態類別，其中保存了一組註冊過的類別列表，這些類別都是從 Object 繼承來的。另外，也保存了這些類別所有的方法屬性與整數常數的動態保定。

source: Classes are registered by calling:
fr: Les classes sont déclarées en appelant :
zh_tw: 類別在呼叫時會被註冊：

source: Registering it will allow the class to be instanced by scripts, code, or creating them again when deserializing.
fr: La déclarer permettra à la classe d'être instanciée par des scripts, du code, ou de les recréer lors de la désérialisation.
zh_tw: 註冊後該類別即可通過腳本、程式碼或在復原序列化時重新建立這些類別。

source: Registering as virtual is the same but it can't be instanced.
fr: Déclarer comme virtuelle est la même chose, mais elle ne peut pas être instancié.
zh_tw: 作為虛擬類別註冊也一樣，但這些類別無法被實體化。

source: Object-derived classes can override the static function ``static void _bind_methods()``. When one class is registered, this static function is called to register all the object methods, properties, constants, etc. It's only called once. If an Object derived class is instanced but has not been registered, it will be registered as virtual automatically.
fr: Les classes dérivées d'Object peuvent surcharger la fonction statique ``static void _bind_methods()``. Lorsqu'une classe est déclarée, cette fonction statique est appelée pour déclarer toutes les méthodes, propriétés, constantes, etc. de l'Object. Elle n'est appelée qu'une seule fois. Si une classe dérivée d'un Object est instanciée mais n'a pas été déclarée, elle sera automatiquement déclarée comme virtuelle.
zh_tw: 從 Object 沿伸而來的類別可以複寫靜態函式 ``static void _bind_methods()`` 。當某個類別被註冊後，會呼叫該靜態方法來註冊所有物件方法、屬性與常數…等。該方法只會被呼叫一次。若某個由 Object 沿伸來的類別被實體化，但尚未進行註冊的話，該類別會自動被虛擬地進行註冊。

source: Inside ``_bind_methods``, there are a couple of things that can be done. Registering functions is one:
fr: A l'intérieur de ``bind_methods``, il y a deux ou trois choses qui peuvent être faites. La déclaration des fonctions en est une :
zh_tw: 在 ``_bind_methods`` 中可做一些事。其中一項便是註冊函式：

source: Default values for arguments can be passed in reverse order:
fr: Les valeurs par défaut des arguments peuvent être transmises dans l'ordre inverse :
zh_tw: 引數的預設值可以通過相反的順序來傳遞：

source: ``D_METHOD`` is a macro that converts "methodname" to a StringName for more efficiency. Argument names are used for introspection, but when compiling on release, the macro ignores them, so the strings are unused and optimized away.
fr: ``D_METHOD`` est une macro qui convertit le "methodname" en un StringName pour plus d'efficacité. Les noms d'arguments sont utilisés pour l'introspection, mais lors de la compilation de version release, la macro les ignore, de sorte que les chaînes de caractères(string) sont inutilisées et optimisées(optimized away).
zh_tw: ``D_METHOD`` 是用來更有效率地將「methodname」轉換到 StringName 的巨集。引數名稱只是用來自我檢查的，在進行釋出編譯時，該巨集會忽略這些引數名稱，這樣一來這個字串就不會被使用並被進行最佳化。

source: Check ``_bind_methods`` of Control or Object for more examples.
fr: Consultez ``_bind_methods`` de Control ou Object pour plus d'exemples.
zh_tw: 更多範例請參考 Control 或 Object 的 ``_bind_methods``。

source: If just adding modules and functionality that is not expected to be documented as thoroughly, the ``D_METHOD()`` macro can safely be ignored and a string passing the name can be passed for brevity.
fr: Si l'on se contente d'ajouter des modules et des fonctionnalités qui ne sont pas censés être documentés de manière aussi complète, la macro ``D_METHOD()`` peut être ignorée sans risque et une chaîne de caractère passant le nom peut être passée pour plus de brièveté.
zh_tw: 如果只是要新增沒有要加到說明文件裡的模組與功能時，則將 ``D_METHOD()`` 巨集忽略掉也沒關係，然後使用字串來傳遞名稱來讓程式碼更簡潔。

source: Constants
fr: Constantes
zh_tw: 常數

source: Classes often have enums such as:
fr: Les classes ont souvent des énumérations telles que :
zh_tw: 類別通常也有如下列舉類型：

source: For these to work when binding to methods, the enum must be declared convertible to int, for this a macro is provided:
fr: Pour qu'elles fonctionnent lorsqu'elles sont liées à des méthodes, l'énumération doit être déclarée convertible en int, pour cela une macro est fournie :
zh_tw: 如果要讓列舉類型能繫結到方法上，則必須將列舉類型定義為可轉換為 Int 的形式，為此，可使用這個巨集：

source: The constants can also be bound inside ``_bind_methods``, by using:
fr: Les constantes peuvent également être liées à l'intérieur de ``bind_methods``, en utilisant :
zh_tw: 這些常數也可以在 ``_bind_methods`` 中繫結，使用：

source: Properties (set/get)
fr: Propriétés (set/get)
zh_tw: 屬性 (Set/Get)

source: Objects export properties, properties are useful for the following:
fr: Les objets exportent des propriétés, les propriétés sont utiles pour :
zh_tw: Object 可匯出屬性，屬性適用於下列情況：

source: Serializing and deserializing the object.
fr: Sérialiser et dé-sérialiser l’objet.
zh_tw: 序列化與復原序列化物件。

source: Creating a list of editable values for the Object derived class.
fr: Création d'une liste de valeurs modifiables pour la classe dérivée de l'objet.
zh_tw: 為由 Object 衍生類別建立一組可編輯數值的列表。

source: Properties are usually defined by the PropertyInfo() class. Usually constructed as:
fr: Les propriétés sont généralement définies par la classe PropertyInfo(). Généralement construites sous la forme :
zh_tw: 屬性通常是通過 PropertyInfo() 類別定義的。結構通常如下：

source: For example:
fr: Par exemple :
zh_tw: 如：

source: This is an integer property, named "amount", hint is a range, range goes from 0 to 49 in steps of 1 (integers). It is only usable for the editor (edit value visually) but won't be serialized.
fr: Il s'agit d'une propriété entière, nommée "amount", l'indice est une plage, la plage va de 0 à 49 par pas de 1 (entiers). Elle n'est utilisable que dans l'éditeur (pour éditer visuellement sa valeur) mais elle ne sera pas sérialisée.
zh_tw: 這個範例中製作了一個整數屬性，名為「amount」，Hint 則為一個範圍 (range)，為 0 值 49 且間隔為 1 的值 (整數)。Hint 只會用於編輯器 (用於進行視覺化編輯)，而不會被序列化。

source: Another example:
fr: Un autre exemple :
zh_tw: 另一個範例：

source: This is a string property, can take any string but the editor will only allow the defined hint ones. Since no usage flags were specified, the default ones are PROPERTY_USAGE_STORAGE and PROPERTY_USAGE_EDITOR.
fr: Il s'agit d'une propriété de type chaîne de caractère(string), qui peut prendre n'importe quelle chaîne de caractère mais l'éditeur n'autorisera que ceux définis avec un indice. Comme aucun drapeau d'utilisation n'a été spécifié, les drapeaus par défaut sont PROPERTY_USAGE_STORAGE et PROPERTY_USAGE_EDITOR.
zh_tw: 這個範圍是一個字串屬性，其中可以保存任何字串，但編輯器只允許使用在 Hint 中定義的值。由於沒有指定使用旗標 (Usage Flag)，預設的旗標為 PROPERTY_USAGE_STORAGE 與 PROPERTY_USAGE_EDITOR。

source: There are plenty of hints and usage flags available in object.h, give them a check.
fr: Il existe de nombreux conseils et indicateurs d'utilisation disponibles dans object.h, vérifiez-les.
zh_tw: 在 object.h 中還有許多可使用的 Hint 與使用旗標，請參考該檔案瞭解詳情。

source: Properties can also work like C# properties and be accessed from script using indexing, but this usage is generally discouraged, as using functions is preferred for legibility. Many properties are also bound with categories, such as "animation/frame" which also make indexing impossible unless using operator [].
fr: Les propriétés peuvent également fonctionner comme des propriétés C # et être accessibles à partir d'un script en, utilisant une indexation, mais cette utilisation est généralement déconseillée, car l'utilisation de fonctions est à privilégier pour la lisibilité. De nombreuses propriétés sont également liées à des catégories, telles que "animation/frame" qui rendent également l'indexation impossible à moins d'utiliser l'opérateur [].
zh_tw: 屬性的運作也與 C# 屬性類似，且能在腳本中通過索引進行存取，但這種使用方法並不推薦，建議使用函式來提升可讀性。許多屬性也會與分類互相關連，如「animation/frame (動畫/幀)」，這時候除非使用 [] 運算元，否則將無法使用索引來存取。

source: From ``_bind_methods()``, properties can be created and bound as long as set/get functions exist. Example:
fr: A partir de ``_bind_methods()``, les propriétés peuvent être créées et liées tant que les fonctions set/get existent. Exemple :
zh_tw: 在 ``_bind_methods()`` 中，只要有 set/get 函式就能建立屬性並進行繫結。如：

source: This creates the property using the setter and the getter.
fr: Cela crée la propriété en utilisant le setter et le getter.
zh_tw: 這個範例會通過該 Setter 與 Getter 來建立屬性。

source: Binding properties using ``_set``/``_get``/``_get_property_list``
fr: Liaison (Binding) des propriétés à l'aide de ``_set``/``_get``/``_get_property_list``
zh_tw: 使用 ``_set``/``_get``/``_get_property_list`` 來繫結屬性

source: An additional method of creating properties exists when more flexibility is desired (i.e. adding or removing properties on context).
fr: Il existe une méthode de création de propriétés supplémentaire lorsque plus de flexibilité est souhaitée (par exemple, l'ajout ou la suppression de propriétés dans un contexte donné).
zh_tw: 當有需要更大的靈活性時 (如依據上下文來新增或移除屬性)，還有另一個方法可以用來建立屬性。

source: The following functions can be overridden in an Object derived class, they are NOT virtual, DO NOT make them virtual, they are called for every override and the previous ones are not invalidated (multilevel call).
fr: Les fonctions suivantes peuvent être surchargée dans une classe dérivée, elles ne sont PAS virtuelles, NE LES RENDEZ PAS virtuelles, elles sont appelées à chaque surcharge et les précédentes ne sont pas invalidées (appel à plusieurs niveaux).
zh_tw: 下列函式可以在由 Object 衍生來的物件中複寫，這些方法 **並非** 虛擬方法，**請勿** 將這些方法宣告為虛擬方法，因為這些方法會在每次複寫時被呼叫，而母級類別中的方法並不會失效 (多層呼叫)。

source: This is also a little less efficient since ``p_property`` must be compared against the desired names in serial order.
fr: C'est aussi un peu moins efficace car `` p_property`` doit être comparé aux noms souhaités dans l'ordre de la série.
zh_tw: 這種做法也比較沒效率，因為 ``p_property`` 必須要依照順序比較所需的名稱。

source: Dynamic casting
fr: Casting dynamique
zh_tw: 動態型別轉換

source: Godot provides dynamic casting between Object-derived classes, for example:
fr: Godot fournit un casting dynamique entre les classes dérivées d’objets, par exemple :
zh_tw: Godot 提供了在 Object 衍生類別間轉換型別的方法，如：

source: If cast fails, NULL is returned. This system uses RTTI, but it also works fine (although a bit slower) when RTTI is disabled. This is useful on platforms where a small binary size is ideal, such as HTML5 or consoles (with low memory footprint).
fr: En cas d'échec du casting, NULL est renvoyé. Ce système utilise RTTI, mais il fonctionne aussi bien (bien qu'un peu plus lentement) lorsque RTTI est désactivé. Cela est utile sur les plateformes où un binaire de petite taille est idéal, comme pour du HTML5 ou les consoles (avec une empreinte mémoire faible).
zh_tw: 若轉換型別失敗，會回傳 NULL。該系統使用 RTTI，但當 RTTI 禁用時也可以使用 (雖然會比較慢)。這種做法適用於在需要減少二進位大小的平台上，如 HTML5 或遊戲主機 (有較少使用記憶體)。

source: Signals
fr: Signaux
zh_tw: 訊號

source: Objects can have a set of signals defined (similar to Delegates in other languages). Connecting to them is rather easy:
fr: Les objets peuvent avoir un ensemble de signaux définis (semblable aux délégations(Delegates) dans d'autres langues). Se connecter est assez simple :
zh_tw: 物件可以定義一系列的訊號 (類似其他語言中的 Delegate)。要連接訊號也很簡單：

source: The method ``_node_entered_tree`` must be registered to the class using ``ClassDB::bind_method`` (explained before).
zh_tw: ``_node_entered_tree`` 方法必須要通過 ``ClassDB::bind_method`` 來註冊 (稍後會說明)。

source: Adding signals to a class is done in ``_bind_methods``, using the ``ADD_SIGNAL`` macro, for example:
fr: L'ajout des signaux à la classe se fait dans ``_bind_methods``, en utilisant la macro ``ADD_SIGNAL`` , pour exemple :
zh_tw: 通過 ``_bind_methods`` 來將訊號加至類別中，使用 ``ADD_SIGNAL`` 巨集，如：

source: References
zh_tw: 參照

source: :ref:`Reference <class_reference>` inherits from Object and holds a reference count. It is the base for reference counted object types. Declaring them must be done using Ref<> template. For example:
fr: :ref:`Reference <class_reference>` hérite de Object et contient un compteur de références. Il constitue la base pour les types d'objets dont les références sont comptées. Leur déclaration doit être faite en utilisant le modèle Ref<>. Par exemple :
zh_tw: :ref:`Reference <class_reference>` 是從 Object 繼承來的，內涵了參照計數。該類別為參照計數物件型別的基礎類別。要定義 Reference，必須要使用 Ref<> 樣板。如：

source: ``myref`` is reference counted. It will be freed when no more Ref<> templates point to it.
fr: `` myref`` est comptée par référence. Elle sera libéré lorsque plus aucun Template de type Ref <> ne l'utilisera.
zh_tw: ``myref`` 有進行參照計數。該變數會在沒有任何 Ref<> 樣板指向這個變數時釋放。

source: Resources:
fr: Ressources :
zh_tw: 資源：

source: :ref:`Resource <class_resource>` inherits from Reference, so all resources are reference counted. Resources can optionally contain a path, which reference a file on disk. This can be set with ``resource.set_path(path)``. This is normally done by the resource loader though. No two different resources can have the same path, attempt to do so will result in an error.
fr: :ref:`Resource <class_resource>` hérite de Reference, donc toutes les références aux ressources sont comptées. Les ressources peuvent facultativement contenir un chemin d'accès, qui fait référence à un fichier sur le disque. Ceci peut être défini avec ``resource.set_path(path)``. Cependant, c'est généralement le chargeur de ressources qui s'en charge. Deux ressources différentes ne peuvent pas avoir le même chemin, tenter de le faire entraînera une erreur.
zh_tw: :ref:`Resource <class_resource>` 繼承自 Reference，因此所有資源都是參照計數的。資源可以選擇是否要包含路徑，用來參照到硬碟上的檔案。要包含路徑，可以通過 ``resource.set_path(path)`` 來設定，但設定路徑通常是由資源加載器來進行的。兩個不同的資源不能具有相同的路徑，如果設定了相同路徑會發生錯誤。

source: Resources without a path are fine too.
fr: Une ressource sans chemin est également correcte.
zh_tw: 資源也可以不包含路徑。

source: Resource loading
fr: Chargement des ressources
zh_tw: 載入資源

source: Resources can be loaded with the ResourceLoader API, like this:
fr: Les ressources peuvent être chargées en utilisant l'API ResourceLoader, comme ceci :
zh_tw: 可以通過 ResourceLoader API 來載入資源，如：

source: If a reference to that resource has been loaded previously and is in memory, the resource loader will return that reference. This means that there can be only one resource loaded from a file referenced on disk at the same time.
fr: Si une référence à cette ressource a déjà été chargée précédemment et existe en mémoire, le chargeur de ressources retournera cette référence. Cela signifie qu'il ne peut y avoir qu'une seule ressource chargée par fichier référencé sur le disque à la fois.
zh_tw: 如果之前已經有加載過該資源的參照，且該參照仍在記憶體中的話，則資源加載器會直接回傳該參照。者表示，參照到硬碟上同一個檔案的資源一次只能被加載一次。

source: Resource saving
fr: Enregistrement de ressources
zh_tw: 保存資源

source: Saving a resource can be done with the resource saver API:
fr: L'enregistrement d'une ressource peut être effectué avec l'API de sauvegarde de ressources :
zh_tw: 可以通過 ResourceSaver API 來保存資源：

source: Instance will be saved. Sub resources that have a path to a file will be saved as a reference to that resource. Sub resources without a path will be bundled with the saved resource and assigned sub-IDs, like "res://someresource.res::1". This also helps to cache them when loaded.
fr: L'instance sera sauvegardée. Les sous-ressources qui ont un chemin à un fichier seront sauvegardées en tant que référence à cette ressource. Les sous-ressources sans chemin seront regroupées avec la ressource sauvegardée et se verront attribuer des sous-identifiants, comme "res://someresource.res::1". Cela permet également de les mettre en cache lorsqu'elles sont chargées.
zh_tw: 這個範例會保存資源實體。擁有檔案路徑的子資源會被作為參照保存在該資源中。而沒有路徑的子資源則會被捆綁在保存的資源中，並分配一個 Sub-ID，如「res://someresource.res::1」。這樣一來有助於在載入時進行快取。

source: The method ``_node_entered_tree`` must be registered to the class using ``ClassDB::register_method`` (explained before).
fr: La méthode ``_node_entered_tree`` doit être enregistrée dans la classe en utilisant ``ClassDB::register_method`` (comme expliqué précédemment).

source: resourceinteractiveloader (TODO)
fr: resourceinteractiveloader (à faire / TODO)
