Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/development/cpp/using_cpp_profilers.po
Languages: de

source: Using C++ profilers
de: Verwenden von C++-Profilern

source: To optimize Godot's performance, you need to know what to optimize first. To this end, profilers are useful tools.
de: Um die Leistung von Godot zu optimieren, müssen Sie zunächst wissen, was zu optimieren ist. Zu diesem Zweck sind Profiler nützliche Werkzeuge.

source: There is a built-in GDScript profiler in the editor, but using C++ profiler may be useful in cases where the GDScript profiler is not accurate enough or is missing information due to bugs in the profiler.
de: Es gibt einen eingebauten GDScript-Profiler im Editor, aber die Verwendung des C++-Profilers kann in Fällen nützlich sein, in denen der GDScript-Profiler nicht genau genug ist oder Informationen aufgrund von Fehlern im Profiler fehlen.

source: Recommended profilers
de: Empfohlene Profiler

source: `VerySleepy <http://www.codersnotes.com/sleepy/>`__ (Windows only)
de: `VerySleepy <http://www.codersnotes.com/sleepy/>`__ (nur Windows)

source: `HotSpot <https://github.com/KDAB/hotspot>`__ (Linux only)
de: `HotSpot <https://github.com/KDAB/hotspot>`__ (nur Linux)

source: `Xcode Instruments <https://developer.apple.com/xcode/>`__ (macOS only)
de: `Xcode Instruments <https://developer.apple.com/xcode/>`__ (nur macOS)

source: These profilers may not be the most powerful or flexible options, but their standalone operation and limited feature set tends to make them easier to use.
de: Diese Profiler sind vielleicht nicht die leistungsstärksten oder flexibelsten Optionen, aber ihr eigenständiger Betrieb und ihr begrenzter Funktionsumfang machen sie tendenziell einfacher in der Anwendung.

source: Setting up Godot
de: Godot einrichten

source: To get useful profiling information, it is **absolutely required** to use a Godot build that includes debugging symbols. Official binaries do not include debugging symbols, since these would make the download size significantly larger.
de: Um nützliche Profiling-Informationen zu erhalten, ist es **absolut erforderlich**, einen Godot-Build zu verwenden, der Debugsymbole enthält. Offizielle Binärdateien enthalten keine Debugsymbole, da diese die Downloadgröße erheblich vergrößern würden.

source: To get profiling data that best matches the production environment, you should compile binaries with the following SCons options:
de: Um Profilersdaten zu erhalten, die am besten mit der Produktionsumgebung übereinstimmen, sollten Sie die Binärdateien mit den folgenden SCons-Optionen kompilieren:

source: For editor binaries: ``target=release_debug use_lto=yes``
de: Für Editor-Binärdateien: ``target=release_debug use_lto=yes``

source: For debug export templates: ``target=release_debug use_lto=yes``
de: Für Debug-Exportvorlagen: ``target=release_debug use_lto=yes``

source: For release export templates: ``tools=no target=release debug_symbols=yes`` - ``debug_symbols=yes`` is required as export templates are stripped from debugging symbols by default.
de: Für Release-Exportvorlagen: ``tools=no target=release debug_symbols=yes`` - ``debug_symbols=yes`` ist erforderlich, da Debugging Symbole standardmäßig aus Exportvorlagen entfernt werden.

source: It is possible to run a profiler on less optimized builds (e.g. ``target=debug`` without LTO), but results will naturally be less representative of real world conditions.
de: Es ist möglich, einen Profiler auf weniger optimierten Builds laufen zu lassen (z.B. ``target=debug`` ohne LTO), aber die Ergebnisse werden natürlich weniger repräsentativ für die realen Bedingungen sein.

source: Do *not* strip debugging symbols on the binaries using the ``strip`` command after compiling the binaries. Otherwise, you will no longer get useful profiling information when running a profiler.
de: Entfernen Sie *nicht* Debugging-Symbole in den Binärdateien mit dem Befehl ``strip`` nach dem Kompilieren der Binärdateien. Andernfalls erhalten Sie keine nützlichen Profiling-Informationen mehr, wenn Sie einen Profiler ausführen.

source: Benchmarking startup/shutdown times
de: Benchmarking von Start-/Stopzeiten

source: If you're looking into optimizing Godot's startup/shutdown performance, you can tell the profiler to use the ``--quit`` command line option on the Godot binary. This will exit Godot just after it finished starting. The ``--quit`` option works with ``--editor``, ``--project-manager`` or ``--path <path to project directory>`` (which runs a project directly).
de: Wenn Sie die Leistung beim Starten und Stoppen von Godot optimieren wollen, können Sie dem Profiler sagen, dass er die Kommandozeilenoption ``--quit`` für die Godot-Binärdatei verwenden soll. Dies wird Godot beenden, kurz nachdem es gestartet ist. Die Option ``--quit`` funktioniert mit ``--editor``, ``--project-manager`` oder ``--path <Pfad zum Projektverzeichnis>`` (der ein Projekt direkt startet).

source: See :ref:`doc_command_line_tutorial` for more command line arguments supported by Godot.
de: Siehe :ref:`doc_command_line_tutorial` für weitere von Godot unterstützte Kommandozeilenargumente.

source: Profiler-specific instructions
de: Profiler-spezifische Anweisungen

source: Start the Godot editor or your project first. If you start the project manager, make sure to edit or run a project first. Otherwise, the profiler will not track the child process since the project manager will spawn a child process for every project edited or run.
de: Starten Sie zuerst den Godot-Editor oder Ihr Projekt. Wenn Sie den Projektmanager starten, stellen Sie sicher, dass Sie zuerst ein Projekt bearbeiten oder ausführen. Andernfalls wird der Profiler den untergeordneten Prozess nicht verfolgen, da der Projektmanager für jedes bearbeitete oder ausgeführte Projekt einen untergeordneten Prozess erzeugt.

source: Open VerySleepy and select the Godot executable in the list of processes on the left:
de: Öffnen Sie VerySleepy und wählen Sie die ausführbare Godot-Datei in der Liste der Prozesse auf der linken Seite aus:

source: Click the **Profile All** button on the right to start profiling.
de: Klicken Sie rechts auf die Schaltfläche **Profile All**, um die Profilierung zu starten.

source: Perform the actions you wish to profile in the editor or project. When you're done, click **Stop** (*not* Abort).
de: Führen Sie die Aktionen aus, die Sie im Editor oder im Projekt profilieren möchten. Wenn Sie fertig sind, klicken Sie auf **Stop** (*nicht* Abbruch).

source: Wait for the results window to appear.
de: Warten Sie, bis das Ergebnisfenster angezeigt wird.

source: Once the results window appears, filter the view to remove external modules (such as the graphics driver). You can filter by module by finding a line whose **Module** matches the Godot executable name, right-clicking that line then choosing **Filter Module to <Godot executable name>** in the dropdown that appears.
de: Sobald das Ergebnisfenster angezeigt wird, filtern Sie die Ansicht, um externe Module (wie z. B. den Grafiktreiber) zu entfernen. Sie können nach Modulen filtern, indem Sie eine Zeile suchen, deren **Modul** mit dem Namen der ausführbaren Godot-Datei übereinstimmt, mit der rechten Maustaste auf diese Zeile klicken und dann **Modul nach <Name der ausführbaren Godot-Datei> filtern** in der angezeigten Dropdown-Liste wählen.

source: Your results window should now look something like this:
de: Ihr Ergebnisfenster sollte nun etwa so aussehen:

source: Open HotSpot. Click **Record Data**:
de: Öffnen Sie HotSpot. Klicken Sie auf **Daten aufzeichnen**:

source: In the next window, specify the path to the Godot binary that includes debug symbols.
de: Im nächsten Fenster geben Sie den Pfad zur Godot-Binärdatei an, die Debugsymbole enthält.

source: Specify command line arguments to run a specific project, with or without the editor.
de: Geben Sie Befehlszeilenargumente an, um ein bestimmtes Projekt auszuführen, mit oder ohne Editor.

source: The path to the working directory can be anything if an absolute path is used for the ``--path`` command line argument. Otherwise, it must be set to that the relative path to the project is valid.
de: Der Pfad zum Arbeitsverzeichnis kann beliebig sein, wenn für das Kommandozeilenargument ``--path`` ein absoluter Pfad verwendet wird. Ansonsten muss er so gesetzt werden, dass der relative Pfad zum Projekt gültig ist.

source: Make sure **Elevate Privileges** is checked if you have administrative privileges. While not essential for profiling Godot, this will ensure all events can be captured. Otherwise, some events may be missing in the capture. Your settings should now look something like this:
de: Stellen Sie sicher, dass **Privilegien erhöhen** aktiviert ist, wenn Sie über Administratorrechte verfügen. Dies ist zwar für die Profilierung von Godot nicht unbedingt erforderlich, stellt aber sicher, dass alle Ereignisse erfasst werden können. Andernfalls fehlen möglicherweise einige Ereignisse in der Aufzeichnung. Ihre Einstellungen sollten jetzt etwa so aussehen:

source: Click **Start Recording** and perform the actions you wish to profile in the editor/project.
de: Klicken Sie auf **Aufzeichnung starten** und führen Sie die Aktionen aus, die Sie im Editor/Projekt profilieren möchten.

source: Quit the editor/project normally or use the **Stop Profiling** button in HotSpot to stop profiling early. Stopping profiling early can result in cleaner profiles if you're not interested in the engine's quit procedure.
de: Beenden Sie den Editor/das Projekt normal oder verwenden Sie die Schaltfläche **Profilierung stoppen** in HotSpot, um die Profilerstellung vorzeitig zu beenden. Das vorzeitige Beenden der Profilerstellung kann zu saubereren Profilen führen, wenn Sie nicht an der Beendigungsprozedur der Engine interessiert sind.

source: Click **View Results** and wait for the profiling visualization to be generated:
de: Klicken Sie auf **Ergebnisse anzeigen** und warten Sie, bis die Profilierungsvisualisierung generiert wird:

source: Use the tabs at the top to navigate between the different views. These views show the same data, but in different ways. The **Flame Graph** tab is a good way to see which functions take up the most time at a glance. These functions are therefore the most important ones to optimize, since optimizing them will improve performance the most.
de: Verwenden Sie die Registerkarten am oberen Rand, um zwischen den verschiedenen Ansichten zu navigieren. Diese Ansichten zeigen die gleichen Daten, aber auf unterschiedliche Weise. Die Registerkarte **Flammdiagramm** ist eine gute Möglichkeit, um auf einen Blick zu sehen, welche Funktionen die meiste Zeit in Anspruch nehmen. Diese Funktionen sind daher die wichtigsten, die optimiert werden sollten, da eine Optimierung dieser Funktionen die Leistung am meisten verbessert.

source: At the bottom of all tabs except **Summary**, you will also see a list of CPU threads started by the engine among with the CPU utilization for each thread. This lets you see threads that can be a bottleneck at a given point in time.
de: Unten auf allen Registerkarten außer **Zusammenfassung** sehen Sie außerdem eine Liste der von der Engine gestarteten CPU-Threads mit der CPU-Auslastung für jeden Thread. So können Sie sehen, welche Threads zu einem bestimmten Zeitpunkt einen Engpass darstellen können.

source: If you don't want the startup procedure to be included in the profile, you can also attach HotSpot to a running process by clicking **Record Data** then setting the **Launch Application** dropdown option to **Attach To Process(es)**.
de: Wenn Sie nicht möchten, dass der Startvorgang in das Profil aufgenommen wird, können Sie HotSpot auch an einen laufenden Prozess anhängen, indem Sie auf **Daten aufzeichnen** klicken und die Dropdown-Option **Anwendung starten** auf **An Prozess(e) anhängen** setzen.

source: This process attachment-based workflow is similar to the one used by VerySleepy.
de: Dieser prozessanlagenbasierte Workflow ähnelt dem von VerySleepy verwendeten.

source: Open Xcode. Select **Open Developer Tool** - **Instruments** from the **Xcode** app menu:
de: Öffnen Sie Xcode. Wählen Sie **Entwicklerwerkzeug öffnen** - **Instrumente** aus dem App-Menü **Xcode**:

source: Double-click on **Time Profiler** in the **Instruments** window:
de: Doppelklicken Sie auf **Time Profiler** im Fenster **Instrumente**:

source: In the Time Profiler window, click on the **Target** menu, select **Choose target...** and specify the path to the Godot binary, command line arguments and environment variables in the next window.
de: Klicken Sie im Time Profiler-Fenster auf das Menü **Ziel**, wählen Sie **Ziel wählen...** und geben Sie im nächsten Fenster den Pfad zum Godot-Binärdatei, die Befehlszeilenargumente und die Umgebungsvariablen an.

source: You can also attach the Time Profiler to a running process by selecting it from the **Target** menu.
de: Sie können den Time Profiler auch an einen laufenden Prozess anhängen, indem Sie ihn aus dem Menü **Ziel** auswählen.

source: Click the **Start an immediate mode recording** button to start profiling.
de: Klicken Sie auf die Schaltfläche **Sofortaufnahme starten**, um die Profilerstellung zu starten.

source: Perform the actions you wish to profile in the editor or project. When you're done, click the **Stop** button.
de: Führen Sie die Aktionen aus, die Sie im Editor oder im Projekt profilieren möchten. Wenn Sie fertig sind, klicken Sie auf die Schaltfläche **Stop**.

source: Wait for the results to appear.
de: Warten Sie, bis die Ergebnisse angezeigt werden.

source: At the bottom of the window you will see a call tree for all CPU threads started, and the **Heaviest Stack Trace** overview.
de: Im unteren Teil des Fensters sehen Sie einen Aufrufbaum für alle gestarteten CPU-Threads und die Übersicht **Heaviest Stack Trace**.

source: Select **Hide system libraries** in the **Call Tree** menu (at the bottom of window) to remove external modules.
de: Wählen Sie **Systembibliotheken ausblenden** im Menü **Aufrufbaum** (am unteren Rand des Fensters), um externe Module zu entfernen.

source: You can use the timeline at the top of the window to display details for the specific time period.
de: Sie können die Zeitleiste am oberen Rand des Fensters verwenden, um Details für den jeweiligen Zeitraum anzuzeigen.

source: Translation status
de: Übersetzungsstatus
