Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/cutout_animation.po
Languages: es, fr, ja, ru, uk, zh_cn

source: We want the left arm to appear *behind* the hip and the torso. We could move the left arm nodes behind the hip (above the hip node in the scene hierarchy), but then the left arm is no longer in its proper place in the hierarchy. This means it wouldn't be affected by the movement of the torso. We'll fix this problem with ``RemoteTransform2D`` nodes.
es: Queremos que el brazo izquierdo aparezca *detrás* de la cadera y el torso. Podríamos mover los nodos del brazo izquierdo detrás de la cadera (por encima del nodo de la cadera en la jerarquía de la escena), pero entonces el brazo izquierdo ya no está en su lugar correcto en la jerarquía. Esto significa que no se vería afectado por el movimiento del torso. Arreglaremos este problema con los nodos de ``RemoteTransform2D``.
fr: Nous voulons que le bras gauche apparaisse *derrière* la hanche et le torse. Nous pourrions déplacer les nœuds du bras gauche derrière la hanche (au-dessus du nœud de la hanche dans la hiérarchie de la scène), mais alors le bras gauche n'est plus à sa place dans la hiérarchie. Cela signifie qu'il ne serait pas affecté par le mouvement du torse. Nous allons corriger ce problème avec les nœuds ``RemoteTransform2D``.
ru: Мы хотим, чтобы левая рука располагалась *за* бедром и туловищем. Можно было бы переместить узлы левой руки за бедро (над узлом бедра в иерархии сцены), но тогда левая рука больше не будет находиться на своем правильном месте в иерархии. Это значит, что на неё не будет влиять движение туловища. Мы исправим эту проблему с помощью узла ``RemoteTransform2D``.
uk: Ми хочемо, щоб ліва рука розмістилася *позаду* стегна і тулуба. Ми могли б перемістити вузли лівої руки за стегно (над вузлом стегна в ієрархії сцени), але тоді ліва рука більше не буде знаходитися на своєму належному місці в ієрархії. Це означає, що на неї не впливатиме рух тулуба. Ми виправимо цю проблему за допомогою вузлів ``RemoteTransform2D``.
zh_cn: 我们希望左臂出现在臀部和躯干的 *后面* . 我们可以将左臂节点在场景层次结构中移到臀部节点上面, 但这样一来, 左臂在层次结构中的位置就不对了, 这意味着它不会受到躯干移动的影响. 我们用 ``RemoteTransform2D`` 节点来解决这个问题.

source: You can also fix depth ordering problems by adjusting the Z property of any node inheriting from Node2D.
es: También puedes arreglar los problemas de ordenamiento de profundidad ajustando la propiedad Z de cualquier nodo heredado de Nodo2D.
fr: Vous pouvez également résoudre les problèmes d'ordonnancement de la profondeur en ajustant la propriété Z de tout nœud héritant de Node2D.
ja: Node2Dから継承するノードのZプロパティを調整することで、深度の順序の問題を修正することもできます。
ru: Можно также исправить проблемы упорядочения глубины, настроив свойство Z любого узла, наследующего от Node2D.
uk: Ви також можете виправити цю проблему впорядкуванням глибини, регулюючи властивість Z будь-якого вузла, що успадковується від Node2D.
zh_cn: 还可以通过调整从二维节点继承的任何节点的Z属性, 来修复深度排序问题.

source: RemoteTransform2D node
es: Nodo RemoteTransform2D
fr: Nœud RemoteTransform2D
ja: RemoteTransform2Dノード
ru: Узел RemoteTransform2D
uk: Вузол RemoteTransform2D
zh_cn: RemoteTransform2D 节点

source: The :ref:`RemoteTransform2D <class_RemoteTransform2D>` node transforms nodes somewhere else in the hierarchy. This node applies its own transform (including any transformation it inherits from its parents) to the remote node it targets.
es: El nodo :ref:`RemoteTransform2D <clase_RemoteTransform2D>` transforma los nodos en algún otro lugar de la jerarquía. Este nodo aplica su propia transformación (incluyendo cualquier transformación que herede de sus padres) al nodo remoto al que apunta.
fr: Le nœud :ref:`RemoteTransform2D <class_RemoteTransform2D>` transforme les nœuds quelque part ailleurs dans la hiérarchie. Ce nœud applique sa propre transformation (y compris toute transformation héritée de ses parents) au nœud distant qu'il cible.
ja: :ref:`RemoteTransform2D <class_RemoteTransform2D>` ノードは、階層内の別の場所にあるノードを変形します。このノードは、自身の幾何学変換(親から継承した幾何学変換の状態を含む)をターゲットのリモートノードに適用します。
ru: Узел :ref:`RemoteTransform2D <class_RemoteTransform2D>` преобразует узлы в другом месте иерархии. Этот узел применяет собственное преобразование (включая любое преобразование, унаследованное от его родителей) к другому узлу, указанному как цель.
uk: Вузол :ref:`RemoteTransform2D <class_RemoteTransform2D>`перетворює вузли в іншому місці ієрархії. Цей вузол застосовує своє власне перетворення (включаючи будь-яке перетворення, яке він успадковує від своїх предків) до віддаленого вузла, на який він націлений.
zh_cn: :ref:`RemoteTransform2D <class_RemoteTransform2D>` 节点对层次结构中其他地方的节点进行变换. 这个节点将自己的变换, 包括它从父节点继承的任何变换, 应用到它所针对的遥控节点.

source: This allows us to correct the visibility order of our elements, independently of the locations of those parts in the cutout hierarchy.
es: Esto nos permite corregir el orden de visibilidad de nuestros elementos, independientemente de la ubicación de esas partes en la jerarquía de recortes.
fr: Cela nous permet de corriger l'ordre de visibilité de nos éléments, indépendamment de la location de ces parties dans la hiérarchie du cutout.
ru: Это позволяет нам корректировать порядок видимости наших элементов, независимо от расположения этих частей в иерархии вырезок.
uk: Це дозволяє нам коригувати порядок видимості наших елементів, незалежно від розташування цих частин в ієрархії вирізок.
zh_cn: 这使我们能够修正元素的可见性顺序, 这些部分独立于在剪裁层次结构中的位置.

source: Create a ``RemoteTransform2D`` node as a child of the torso. Call it ``remote_arm_l``. Create another RemoteTransform2D node inside the first and call it ``remote_hand_l``. Use the ``Remote Path`` property of the two new nodes to target the ``arm_l`` and ``hand_l`` sprites respectively:
es: Crear un nodo ``RemoteTransform2D`` como un hijo del torso. Llámalo ``remote_arm_l``. Crea otro nodo RemoteTransform2D dentro del primero y llámalo ``remote_hand_l``. Usa la propiedad ``Remote Path`` de los dos nuevos nodos para apuntar a los sprites ``arm_l`` y ``hand_l`` respectivamente:
fr: Créez un nœud ``RemoteTransform2D`` en tant qu'enfant du torse. Appelez le ``remote_arm_l``. Créez un autre nœud RemoteTransform2D à l'intérieur du premier et appelez le ``remote_hand_l``. Utilisez la propriété ``Remote Path`` des deux nouveaux nœuds pour cibler les sprites ``arm_l`` et ``hand_l`` respectivement :
ja: 胴体の子として ``RemoteTransform2D`` ノードを作成します。それを ``remote_arm_l`` と呼びます。最初のノード内に別のRemoteTransform2Dノードを作成し、\ ``remote_hand_l`` と呼びます。 2つの新しいノードの ``Remote Path` プロパティを使用して、それぞれ ``arm_l`` スプライトと ``hand_l`` スプライトをターゲットにします。
ru: Создайте узел ``RemoteTransform2D`` в качестве дочернего элемента туловища. Назовите его ``remote_arm_l``. Создайте другой узел ``RemoteTransform2D`` внутри первого узла и назовите его ``remote_hand_l``. Свойство ``Remote Path`` двух новых узлов используется для назначения спрайтов arm_l и hand_l соответственно:
uk: Створіть вузол ``RemoteTransform2D`` в якості нащадка тулуба. Назвіть його ``remote_arm_l``. Створіть інший вузол RemoteTransform2D всередині першого і назвіть його ``remote_hand_l``. Використовуйте властивість ``Remote Path`` двох нових вузлів для націлювання на спрайти ``arm_l`` та ``hand_l`` спрайти відповідно:
zh_cn: 创建一个 ``RemoteTransform2D`` 节点作为躯干的子节点。命名为 ``remote_arm_l``\ 。在第一个节点中再创建一个 RemoteTransform2D 节点并将其命名为 ``remote_hand_l``\ 。让这两个新节点的 ``Remote Path`` 属性分别指向 ``arm_l`` 和 ``hand_l`` 精灵：

source: Moving the ``RemoteTransform2D`` nodes now moves the sprites. So we can create animations by adjusting the ``RemoteTransform2D`` transforms:
es: Al mover los nodos de ``RemoteTransform2D`` ahora se mueven los sprites. Así que podemos crear animaciones ajustando las transformaciones de ``RemoteTransform2D``:
fr: Le déplacement des nœuds ``RemoteTransform2D`` déplace maintenant les sprites. Ainsi, nous pouvons créer des animations en ajustant les transformations ``RemoteTransform2D`` :
ja: ``RemoteTransform2D`` ノードを移動すると、それに対応するスプライトが移動します。\ ``RemoteTransform2D`` の幾何学変換を調整することでアニメーションを作成できます:
ru: Перемещение узлов ``RemoteTransform2D`` теперь перемещает спрайты. Таким образом, мы можем создавать анимации, настраивая трансформации ``RemoteTransform2D``:
uk: Переміщення вузлів ``RemoteTransform2D`` тепер переміщує спрайти. Таким чином, ми можемо створювати анімації, регулюючи перетворення ``RemoteTransform2D``:
zh_cn: 移动 ``RemoteTransform2D`` 节点现在可以移动精灵. 所以可以通过调整 ``RemoteTransform2D`` 变换来创建动画:

source: Completing the skeleton
es: Completando el esqueleto
fr: Compléter le squelette
ja: スケルトンの完成
ru: Завершение создания скелета
uk: Завершення скелета
zh_cn: 完成骨架

source: Complete the skeleton by following the same steps for the rest of the parts. The resulting scene should look similar to this:
es: Completa el esqueleto siguiendo los mismos pasos para el resto de las partes. La escena resultante debería ser similar a esta:
fr: Complétez le squelette en suivant les mêmes étapes pour le reste des pièces. La scène qui en résulte devrait ressembler à celle-ci :
ja: 残りのパーツについても同じ手順を実行して、スケルトンを完成させます。結果のシーンは次のようになります:
ru: Завершите построение скелета, выполнив те же действия для остальных деталей. Получившаяся сцена должна выглядеть примерно так:
uk: Завершіть побудову скелета, виконавши ті ж кроки для решти частин. Отримана сцена повинна виглядати так:
zh_cn: 按照其余部分的相同步骤完成骨架。生成的场景应该类似于：

source: The resulting rig will be easy to animate. By selecting the nodes and rotating them you can animate forward kinematics (FK) efficiently.
es: El rig resultante será fácil de animar. Seleccionando los nodos y rotándolos puedes animar forward kinematics (FK) eficientemente.
fr: Le rig résultant sera facile à animer. En sélectionnant les nœuds et en les faisant pivoter, vous pouvez animer efficacement la cinématique d'avance (FK).
ja: 結果として得られるリグは、アニメーション化が容易になります。ノードを選択して回転させると、フォワードキネマティック(FK)が効率的にアニメートされます。
ru: Полученный каркас будет легко анимировать. Выбирая узлы и вращая их можно эффективно выполнять анимацию с прямой кинематикой (FK).
uk: Отриманий скелет буде легко анімувати. Вибравши вузли і обертаючи їх, ви можете ефективно анімувати пряму кінематику.
zh_cn: 生成的装备很容易制作动画. 通过选择节点并旋转它们, 你可以有效地为前向运动学(FK)设置动画.

source: For simple objects and rigs this is fine, but there are limitations:
es: Para objetos simples y aparejos esto está bien, pero hay limitaciones:
fr: Ceci est bien pour de simples objets et rigs, mais il y a des limitations :
ja: 単純なオブジェクトとリグの場合、これは問題ありませんが、制限があります:
ru: Для простых объектов и каркасов это нормально, но есть ограничения:
uk: Для простих об'єктів і скелетів це нормально, але є обмеження:
zh_cn: 对于简单的物体和装配来说已经足够了, 但仍然有限制:

source: Selecting sprites in the main viewport can become difficult in complex rigs. The scene tree ends up being used to select parts instead, which can be slower.
es: La selección de los sprites en el mirador principal puede resultar difícil en los aparejos complejos. El árbol de la escena termina siendo usado para seleccionar partes en su lugar, lo que puede ser más lento.
fr: Sélectionner des sprite dans la fenêtre d’affichage principale peut devenir difficile dans les rigs complexes. L'arbre de scène finit par être utilisé pour sélectionner des parties à la place, ce qui peut s’avérer plus lent.
ja: 複雑なリグでは、メイン ビューポートでスプライトを選択するのが難しくなる場合があります。代わりに、シーンツリーがパーツの選択に使用されることになり、作業がより遅くなる可能性があります。
uk: Вибір спрайтів в головному вікні перегляду може ускладнитися в складних скелетах. В результаті для вибору частин використовується дерево сцени, що сповільнює роботу.
zh_cn: 在复杂的装配中, 在主视口中选择精灵会变得很困难. 场景树最终被替代, 用来选择部件, 这可能会比较慢.

source: Inverse Kinematics (IK) is useful for animating extremities like hands and feet, and can't be used with our rig in its current state.
es: La Cinemática Inversa (IK) es útil para animar las extremidades como las manos y los pies, y no puede ser usada con nuestro equipo en su estado actual.
fr: les Inverse Kinematics (IK) sont utiles pour animer des extrémités comme les mains ou les pieds et ne peuvent être utilisées avec notre rig dans son état actuel.
ja: インバースキネマティクス(IK)は、手や足などの四肢をアニメートするのに便利ですが、現在の状態のリグでは使用できません。
ru: Обратная кинематика (IK), полезная для анимации конечностей, таких как руки и ноги, не может использоваться с нашим каркасом в его текущем виде.
uk: Обернена кінематика, корисна для анімації кінцівок, таких як руки і ноги, не може бути використана зі структурою нашого скелета.
zh_cn: 反向动力学（Inverse Kinematics、IK）对于手脚等肢体的运动非常有用，目前我们的绑定还无法使用。

source: To solve these problems we'll use Godot's skeletons.
es: Para resolver estos problemas usaremos los esqueletos de Godot.
fr: Pour résoudre ces problèmes, nous utiliserons les squelettes de Godot.
ja: これらの問題を解決するために、Godotのスケルトンを使用します。
ru: Для решения этих проблем мы используем скелетоны Godot.
uk: Для вирішення цих проблем ми будемо використовувати скелети Godot.
zh_cn: 为了解决这些问题，我们将会使用 Godot 的骨架。

source: Skeletons
es: Esqueletos
fr: Squelettes
ja: スケルトン
ru: Скелетоны
uk: Скелети
zh_cn: 骨架

source: In Godot there is a helper to create "bones" between nodes. The bone-linked nodes are called skeletons.
es: En Godot hay un ayudante para crear "bones" entre los nodos. Los nodos vinculados a los huesos se llaman esqueletos.
fr: Dans Godot, il y a une aide pour créer des "os" entre les nœuds. Les nœuds liés aux os sont appelés squelettes.
ja: ゴドーにはノード間に「ボーン」を作成するヘルパーがあります。ボーンにリンクされたノードはスケルトンと呼ばれます。
ru: В Godot есть помощник для создания «костей» между узлами. Связанные костями узлы называются скелетонами.
uk: В Godot є помічник для створення «кісток» між вузлами. Вузли, зв'язані кістками, називаються скелетами.
zh_cn: 在 Godot 中，有一个在节点之间创建“骨骼”的辅助工具。骨骼连接起的节点称为骨架。

source: As an example, let's turn the right arm into a skeleton. To create a skeleton, a chain of nodes must be selected from top to bottom:
es: Como ejemplo, convirtamos el brazo derecho en un esqueleto. Para crear un esqueleto, se debe seleccionar una cadena de nodos de arriba a abajo:
fr: A titre d'exemple, transformons le bras droit en squelette. Pour créer un squelette, une chaîne de nœuds doit être sélectionnée de haut en bas :
ja: 例として、右腕をスケルトンに変えてみましょう。スケルトンを作成するには、ノードのチェーンを上から下に選択する必要があります:
ru: В качестве примера давайте превратим правую руку в скелетон. Чтобы создать скелетон, необходимо выбрать цепочку узлов сверху вниз:
uk: Як приклад, давайте перетворимо праву руку в скелет. Для створення скелета необхідно вибрати ланцюжок вузлів зверху вниз:
zh_cn: 举个例子，让我们把右臂变成一个骨架。要创建一个骨架，必须从上到下选择节点链：

source: Then, click on the Skeleton menu and select ``Make Bones``.
es: Luego, haz clic en el menú Esqueleto y selecciona ``Make Bones``.
fr: Ensuite, cliquez sur le menu Squelette et sélectionnez ``Make Bones``.
ja: 次に、[スケルトンのオプション]メニューをクリックし、\ ``Make Bones``\ (v3.1.2ではMake Custom Bone(s)...です)を選択します。
ru: Затем, щелкните по меню Скелетон и выберите пункт ``Создать кости``.
uk: Потім натисніть на меню **Скелет** і вибрати **Створити кістки** .
zh_cn: 然后单击“骨架”菜单并选择 ``制作骨骼``\ 。

source: This will add bones covering the arm, but the result may be surprising.
es: Esto añadirá los huesos que cubren el brazo, pero el resultado puede ser sorprendente.
fr: Cela ajoutera des os couvrant le bras, mais le résultat peut être surprenant.
ja: これにより、腕を覆う骨が追加されますが、結果に驚くかもしれません。
ru: Это добавит кости, покрывающие руку, но в результате нас ждёт сюрприз.
uk: Це додасть руці кістки, але результат може здивувати.
zh_cn: 这将增加覆盖在手臂上的骨头, 但结果可能令人惊讶.

source: Why does the hand lack a bone? In Godot, a bone connects a node with its parent. And there's currently no child of the hand node. With this knowledge let's try again.
es: ¿Por qué la mano carece de un hueso? En Godot, un hueso conecta un nodo con su padre. Y actualmente no hay ningún hijo del nodo de la mano. Con este conocimiento vamos a intentarlo de nuevo.
fr: Pourquoi la main n'a pas d'os ? Dans Godot, un os relie un nœud à son parent. Et il n'y a actuellement aucun enfant du nœud de la main. Sachant cela, essayons encore une fois.
ja: 手には骨がないのはなぜですか？ Godotでは、ボーンはノードをその親に接続します。そして、現在、手のノードに子はありません。この知識を得た上でもう一度試してみましょう。
ru: Почему в руке не хватает костей? В Godot кость соединяет узел со своим родителем, и в настоящее время у нас нет потомка узла руки. Теперь зная это, давайте попробуем еще раз.
uk: Чому у руці відсутня кістка? У Godot кістка з'єднує вузол з його предком. І в даний час вузлу руки не хватає ще одного нащадка. Знаючи це спробуємо ще раз.
zh_cn: 为什么这只手缺少一根骨骼？在 Godot 中，使用骨骼把节点和它的父节点连接起来。当前没有手节点的子节点。有了这些知识，让我们再试一次。

source: The first step is creating an endpoint node. Any kind of node will do, but :ref:`Marker2D <class_Marker2D>` is preferred because it's visible in the editor. The endpoint node will ensure that the last bone has orientation.
zh_cn: 第一步是创建端点节点。任何类型的节点都可以，但是 :ref:`Marker2D <class_Marker2D>` 是首选，因为它在编辑器中可见。端点节点将确保最后一个骨骼具有方向。

source: Now select the whole chain, from the endpoint to the arm and create bones:
es: Ahora selecciona toda la cadena, desde el punto final hasta el brazo y crea huesos:
fr: Sélectionnez maintenant toute la chaîne, de l'extrémité au bras et créez des os :
ja: 次に、終点から腕までのチェーン全体を選択し、ボーンを作成します:
ru: Теперь выберите всю цепочку от конечной точки до руки и создайте кости:
uk: Тепер виберіть весь ланцюжок, від кінцевої точки до руки і створіть кістки:
zh_cn: 现在选择整个链, 从端点到手臂并创建骨骼:

source: The result resembles a skeleton a lot more, and now the arm and forearm can be selected and animated.
es: El resultado se parece mucho más a un esqueleto, y ahora el brazo y el antebrazo pueden ser seleccionados y animados.
fr: Le résultat ressemble beaucoup plus à un squelette, et maintenant le bras et l'avant-bras peuvent être sélectionnés et animés.
ja: 結果はスケルトンにとても似ており、腕と前腕を選択してアニメーション化できるようになりました。
ru: Результат намного больше напоминает скелетон, и руку с предплечьем теперь можно выбирать и анимировать.
uk: Результат набагато більше нагадує скелет, і тепер руку і передпліччя можна вибирати і анімувати.
zh_cn: 结果更像骨架了，现在可以选择手臂和前臂并设置动画。

source: Create endpoints for all important extremities. Generate bones for all articulable parts of the cutout, with the hip as the ultimate connection between all of them.
es: Crear puntos finales para todas las extremidades importantes. Generar huesos para todas las partes articulables del recorte, con la cadera como la última conexión entre todas ellas.
fr: Créez des points de terminaison pour toutes les extrémités importantes. Générer des os pour toutes les parties articulables du cutout, avec la hanche comme la connexion centrale entre chacun d'eux.
ja: すべての重要な四肢の終点を作成します。カットアウトの関節化が可能なすべての部分で骨を生成し、腰をすべての最終的な接続先として使用します。
ru: Создайте конечные точки для всех важных конечностей. Создайте кости для всех суставных частей вырезок, с бедром в качестве конечной связи между всеми остальными.
uk: Створіть кінцеві точки для всіх важливих кінцівок. Створіть кістки для всіх частин вирізки, з стегном в якості кінцевого зв'язку між усіма ними.
zh_cn: 为所有重要的末端创建端点. 为剪纸的所有可关节部分生成骨骼, 臀部是它们之间的最终连接.

source: You may notice that an extra bone is created when connecting the hip and torso. Godot has connected the hip node to the scene root with a bone, and we don't want that. To fix this, select the root and hip node, open the Skeleton menu, click ``clear bones``.
es: Puede que noten que se crea un hueso extra al conectar la cadera y el torso. Godot ha conectado el nodo de la cadera a la raíz de la escena con un hueso, y no queremos eso. Para arreglar esto, selecciona el nodo de la raíz y la cadera, abre el menú de Esqueleto, haz clic en ``clear bones``.
fr: Vous remarquerez peut-être qu'un os supplémentaire est créé lors de la connexion de la hanche et du torse. Godot a relié le nœud de la hanche à la racine de la scène avec un os, et nous ne voulons pas cela. Pour résoudre ce problème, sélectionnez le nœud racine et le nœud de hanche, ouvrez le menu Squelette, cliquez sur " Effacer les os ".
ja: 腰と胴体を接続すると、余分な骨が作成されることに気付くかもしれません。 Godotは腰ノードをボーンでシーンルートに接続しましたが、これは望ましくありません。これを修正するには、ルートと腰ノードを選択し、スケルトンメニューを開き、\ ``ボーンをクリア``(v3.1.2ではカスタムボーンをクリア)をクリックします。
ru: Вы можете заметить, что при соединении бедра и туловища создаётся дополнительная кость. Godot соединил бедренный узел с корнем сцены костью, но мы этого не хотим. Чтобы это исправить, выберите корневой и бедренный узел, откройте меню Скелетон, щелкните ``очистить кости``.
uk: Ви можете помітити появу додаткової кістки при з'єднанні стегна і тулуба. Godot з'єднав кісткою вузол стегна з коренем сцени, але нам цього не треба. Щоб виправити це, виберіть кореневий і стегновий вузол, відкрийте меню **Скелет**, натисніть кнопку **Очистити кістки**.
zh_cn: 你可能会注意到，在连接臀部和躯干时，会多出一根骨骼。Godot 用骨骼将臀部节点连接到了场景根部，我们不希望这样。要解决这个问题，选择根部和臀部节点，打开“骨架”菜单，点击 ``清除骨骼``\ 。

source: Your final skeleton should look something like this:
es: El esqueleto finalizado debería verse similar a esto:
fr: Votre squelette final devrait ressembler à ceci :
ja: 最終的なスケルトンは次のようになります:
ru: В итоге ваша сцена должна выглядеть примерно так:
uk: В результаті ваш скелет має виглядати приблизно так:
zh_cn: 你的骨架最后看上去应该是这样的：

source: You might have noticed a second set of endpoints in the hands. This will make sense soon.
es: Puede que hayas notado un segundo conjunto de puntos finales en las manos. Esto tendrá sentido pronto.
fr: Vous avez peut-être remarqué une deuxième série de points d'extrémité dans les mains. Cela aura bientôt un sens.
ja: 手の中に2つ目の終点のセットが表示されていることに気付いたかもしれません。これは少し先で理解できます。
ru: Возможно, вы заметили второй набор конечных точек на руках. Скоро это обретёт смысл.
uk: Можливо, ви помітили другий набір кінцевих точок на руках. Це отримає сенс найближчим часом.
zh_cn: 你可能已经注意到了手上的第二组端点. 这很快就会有意义.

source: Now that the whole figure is rigged, the next step is setting up the IK chains. IK chains allow for more natural control of extremities.
es: Ahora que todo el esqueleto está conectado, el siguiente paso es configurar las cadenas IK. Las cadenas IK permiten un control más natural de las extremidades.
fr: Maintenant que le rig est terminé pour l'ensemble du personnage, l'étape suivante consiste à mettre en place les chaînes IK. Les chaînes IK permettent un contrôle plus naturel des extrémités.
ja: フィギュア全体がリギングされたので、次のステップはIKチェーンの設定です。IKチェーンを使用すると、四肢をより自然に制御できます。
ru: Теперь, когда вся фигура покрыта каркасом, следующим шагом является настройка цепочек ИК. Цепочки ИК позволяют более естественно управлять конечностями.
uk: Тепер, коли фігура має скелет, пора приступити до створення ланцюжків ІК. Ланцюжки ІК забезпечують природніший контроль кінцівок.
zh_cn: 现在整个人物已经装配好了，下一步就是设置 IK 链。IK 链可以更自然的控制四肢。

source: IK chains
es: cadenas IK
fr: Chaînes IK
ja: IKチェーン
ru: Цепочки ИК
uk: Ланцюжки IK
zh_cn: IK 链

source: IK stands for inverse kinematics. It's a convenient technique for animating the position of hands, feet and other extremities of rigs like the one we've made. Imagine you want to pose a character's foot in a specific position on the ground. Without IK chains, each motion of the foot would require rotating and positioning several other bones (the shin and the thigh at least). This would be quite complex and lead to imprecise results. IK allows us to move the foot directly while the shin and thigh self-adjust.
zh_cn: IK 是反向动力学（Inverse Kinematics）的缩写，给手部、足部以及其它需绑定肢体（例如我们刚刚制作的那个）的动画带来便利。想象一下，你想要将角色的脚放在地面上的特定位置。如果没有 IK 链，脚的每次运动都需要旋转和定位其他几个骨骼（至少得涉及大腿及小腿）。这将非常复杂并导致不精确的结果。而 IK 允许我们直接移动脚，同时小腿和大腿进行自我调整。

source: **IK chains in Godot currently work in the editor only**, not at runtime. They are intended to ease the process of setting keyframes, and are not currently useful for techniques like procedural animation.
zh_cn: **Godot 中的 IK 链目前仅在编辑器中可用** ，而在运行时不可用。它们旨在简化设置关键帧的过程，目前对于程序动画等技术没有用处。
