Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/cutout_animation.po
Languages: es, fr, ja, ru, uk, zh_cn

source: To create an IK chain, select a chain of bones from endpoint to the base for the chain. For example, to create an IK chain for the right leg, select the following:
es: Para crear una cadena IK, selecciona una cadena de huesos desde el punto final hasta la base de la cadena. Por ejemplo, para crear una cadena IK para la pierna derecha, seleccione lo siguiente:
fr: Pour créer une chaîne IK, sélectionnez une chaîne d'os de l'extrémité à la base pour la chaîne. Par exemple, pour créer une chaîne IK pour la jambe droite, sélectionnez ce qui suit :
ja: IKチェーンを作成するには、チェーンの終点からベースまでのボーンのチェーンを選択します。たとえば、右脚のIKチェーンを作成するには、次を選択します:
ru: Чтобы создать цепочку IK, выберите цепочку из костей от конечной точки до основания цепочки. Например, чтобы создать цепочку ИК для правой ноги, выберите следующее:
uk: Щоб створити ланцюжок ІК, виберіть ланцюжок кісток від кінцевої точки до основи ланцюга. Наприклад, щоб створити ланцюжок ІК для правої ноги, виберіть наступні вузли:
zh_cn: 要创建 IK 链，请选择从端点到链基的骨骼链。例如，要为右腿创建一条 IK 链，选择以下：

source: Then enable this chain for IK. Go to Edit > Make IK Chain.
es: Entonces habilita esta cadena para IK. Ve a Edición > Hacer cadena IK.
fr: Alors activez cette chaîne pour IK. Allez dans Edit > Make IK Chain.
ja: 次に、このチェーンをIKに対して有効にします。 [スケルトンのオプション] -> [IKチェーンを作成]に移動します。
ru: Затем включите эту цепочку в ИК. Перейдите в раздел Правка > Создать цепочку ИК.
uk: Потім увімкніть цей ланцюжок для IK. Перейдіть до **Скелет > Створити ланцюжок ІК**.
zh_cn: 然后为 IK 启用此链。转到“编辑 > 制作 IK 链”。

source: As a result, the base of the chain will turn *Yellow*.
es: Como resultado, la base de la cadena se volverá *amarilla*.
fr: En conséquence, la base de la chaîne deviendra *Jaune*.
ja: その結果、チェーンのベースが\ *黄色*\ に変わります。
ru: В результате, основание цепи станет *жёлтым*.
uk: В результаті основа ланцюжка *пожовтіє*.
zh_cn: 结果，链的基部将变为\ *黄色*\ 。

source: Once the IK chain is set up, grab any child or grand-child of the base of the chain (e.g. a foot), and move it. You'll see the rest of the chain adjust as you adjust its position.
zh_cn: 一旦 IK 链设置完毕，抓住任何链基（例如脚部）的任意嵌套子节点并移动。当你调整其位置时，会看到链的剩余部分也随之调整。

source: Animation tips
es: Recomendaciones para animaciones
fr: Astuces d’animation
ja: アニメーションのヒント
ru: Советы по анимации
uk: Поради щодо анімації
zh_cn: 动画提示

source: The following section will be a collection of tips for creating animation for your cutout rigs. For more information on how the animation system in Godot works, see :ref:`doc_introduction_animation`.
es: La siguiente sección será una colección de consejos para crear animaciones para sus rigs cutout. Para más información sobre cómo funciona el sistema de animación en Godot, ver :ref:`doc_introduction_animation`.
fr: La section qui suit est une collection d’astuces pour créer des animations pour vos cutout rigs. Pour plus d’informations sur le fonctionnement du système d’animation de Godot, référez-vous à :ref:`doc_introduction_animation`.
uk: У наступному розділі буде колекція порад щодо анімування скелетів вирізок. Для отримання додаткових відомостей про те, як працює система анімації в Godot, дивіться :ref:`doc_introduction_animation`.
zh_cn: 下一节将是创建剪纸动画的技巧集合。关于 Godot 中的动画系统如何工作的更多信息，请参阅 :ref:`doc_introduction_animation`\ 。

source: Setting keyframes and excluding properties
es: Asignando keyframes y excluyendo propiedades
fr: Définition des clés d'animation et exclusion des propriétés
ja: キーフレームの設定とプロパティの除外
ru: Установка ключевых кадров и исключение свойств
uk: Встановлення ключових кадрів і виключення властивостей
zh_cn: 设置关键帧和排除属性

source: Special contextual elements appear in the top toolbar when the animation editor window is open:
es: Los elementos contextuales especiales aparecerán en la barra de herramientas superior cuando se abra el panel del editor de animación:
fr: Des éléments contextuels spéciaux apparaissent dans la barre d'outils supérieure lorsque la fenêtre de l'éditeur d'animation est ouverte :
ja: アニメーションエディタウィンドウが開いていると、特別なコンテキスト要素が上部のツールバーに表示されます:
ru: При открытом окне редактора анимации на верхней панели инструментов появляются специальные контекстные элементы:
uk: Спеціальні контекстні елементи з'являються на верхній панелі інструментів, коли відкривається вікно редактора анімації:
zh_cn: 当动画编辑器窗口打开时, 特殊的上下文元素会出现在顶部工具栏中:

source: The key button inserts location, rotation, and scale keyframes for the selected objects or bones at the current playhead position.
es: El botón clave inserta la ubicación, rotación y escala de los fotogramas clave de los objetos o huesos seleccionados en la posición actual de la cabeza de juego.
fr: Le bouton de clé permet d'insérer des clés d'animation de localisation, de rotation et d'échelle pour les objets ou les os sélectionnés à la position actuelle de la tête de lecture.
ja: キーボタンは、選択したオブジェクトまたはボーンの位置、回転、およびスケールのキーフレームを現在の再生ヘッドの位置に挿入します。
ru: Клавиша с ключом вставляет ключевые кадры положения, поворота и масштаба для выбранных объектов или костей в текущей позиции точки воспроизведения.
uk: Кнопка ключа вставляє ключові кадри розташування, обертання та масштабування для вибраних об'єктів, або кісток, у поточному положенні точки відтворення.
zh_cn: 按键按钮在当前游戏开始位置为选定的对象或骨骼插入位置, 旋转和缩放关键帧.

source: The "loc", "rot", and "scl" toggle buttons to the left of the key button modify its function, allowing you to specify which of the three properties keyframes will be created for.
es: Los botones de conmutación "loc", "rot" y "scl" a la izquierda del botón de la llave modifican su función, permitiéndote especificar para cuál de las tres propiedades se crearán los fotogramas de clave.
fr: Les boutons de basculement "loc", "rot" et "scl" (pour "location", "rotation" et "agrandissement") à gauche du bouton clé modifient sa fonction, vous permettant de spécifier pour laquelle des trois propriétés les clés d'animations seront créées.
ja: キーボタンの左側にある "loc"、"rot" および "scl" トグルボタンはその機能を変更し、3つのプロパティのとれにキーフレームが作成されるかを指定できるようにします。
ru: Кнопки переключения «loc», «rot» и «scl» слева от кнопки с ключом изменяют её назначение, позволяя указать, для какого из трех свойств будут созданы ключевые кадры.
uk: Кнопки перемикання "loc", "rot" і "scl" ліворуч від кнопки ключа змінюють її функцію, дозволяючи вказати, для яких з трьох властивостей будуть створені ключові кадри.
zh_cn: 通过切换关键帧按钮左边的 "位置" , "旋转" 和 "缩放" 按钮, 可以修改其功能, 允许你指定将为三个属性中的哪一个创建关键帧.

source: Here's an illustration of how this can be useful: Imagine you have a node which already has two keyframes animating its scale only. You want to add an overlapping rotation movement to the same node. The rotation movement should begin and end at different times from the scale change that's already set up. You can use the toggle buttons to have only rotation information added when you add a new keyframe. This way, you can avoid adding unwanted scale keyframes which would disrupt the existing scale animation.
es: Aquí hay una ilustración de cómo esto puede ser útil: Imagina que tienes un nodo que ya tiene dos fotogramas clave animando sólo su escala. Quieres añadir un movimiento de rotación superpuesto al mismo nodo. El movimiento de rotación debería comenzar y terminar en momentos diferentes del cambio de escala que ya está configurado. Puedes usar los botones de alternancia para que sólo se añada información de rotación cuando añadas un nuevo fotograma clave. De esta manera, puedes evitar añadir fotogramas clave de escala no deseados que podrían interrumpir la animación de escala existente.
fr: Voici une illustration de l'utilité de cette méthode : Imaginez que vous avez un nœud qui a déjà deux clés d'animation animant uniquement son échelle. Vous voulez ajouter un mouvement de rotation chevauchant au même nœud. Le mouvement de rotation devrait commencer et se terminer à des moments différents du changement d'échelle déjà établi. Vous pouvez utiliser les boutons de basculement pour que seules les informations de rotation soient ajoutées lorsque vous ajoutez une nouvelle clé d'animation. De cette façon, vous pouvez éviter d'ajouter des clés d'animation d'échelle non désirées qui perturberaient l'animation d'échelle existante.
ja: これがどのように役立つかを説明します: すでに2つのキーフレームがそのスケールのみをアニメーション化しているノードがあるとします。そして、その同じノードにオーバーラップする回転移動を追加しますが、この回転動作は、既に設定されているスケールの変更とは異なる時間に開始および終了する必要があります。このような場合は、トグルボタンを使用することで、新しいキーフレームを追加するときに回転情報のみを追加できます。これにより、既存のスケールアニメーションを乱すような不要なスケールキーフレームの追加を回避できます。
ru: Вот пример того, как это может быть полезно: Представьте, что у Вас есть узел, который уже имеет два ключевых кадра, анимирующих только его масштаб. Требуется добавить перекрывающееся вращательное движение к тому же узлу. Движение вращения должно начинаться и заканчиваться в разное время от уже установленного изменения масштаба. С помощью кнопок переключения можно добавлять только информацию о повороте при добавлении нового ключевого кадра. Таким образом, можно избежать добавления нежелательных ключевых кадров масштаба, что нарушило бы существующую анимацию масштаба.
uk: Ось зразок того, як це може бути корисно: уявіть, що у вас є вузол, який вже має два ключових кадри, що анімують лише його масштаб. Потрібно додати рух обертання, до того самого вузла. Рух обертання повинен починатися і закінчуватися в інший час ніж вже налаштовані зміни масштабу. Кнопки перемикання можна використовувати, щоб додавати лише відомості про обертання під час додавання нового ключового кадру. Таким чином, ви можете уникнути додавання небажаних ключових кадрів масштабу, які порушать існуючу анімацію масштабу.
zh_cn: 下面是一个例子, 说明如何使用其的: 假设你有一个节点, 其中已经有两个关键帧只对其缩放进行动画. 你想在同一个节点重叠添加旋转移动. 旋转运动应该在不同的时间开始和结束, 与已经设置的缩放变化不同. 在添加新关键帧时, 可以使用切换按钮, 只添加旋转信息. 这样, 你就可以避免添加不需要的缩放关键帧, 破坏现有的缩放动画.

source: Creating a rest pose
es: Creando una posición de descanso
fr: Créer une position de repos
ja: レストポーズの作成
ru: Создание позы покоя
uk: Створення пози спокою
zh_cn: 创建放松姿势

source: Think of a rest pose as a default pose that your cutout rig should be set to when no other pose is active in your game. Create a rest pose as follows:
es: Piensa en una pose de descanso como una pose predeterminada que tu equipo de recorte debe estar configurado cuando ninguna otra pose esté activa en tu juego. Crea una pose de descanso de la siguiente manera:
fr: Pensez à une pose au repos dans laquelle votre « cutout rig » devrait être lorsqu’aucune autre pose n’est active dans votre jeu. Créez un pose au repos comme suit :
ja: レストポーズは、ゲーム内で他のポーズがアクティブでないときに、カットアウトリグを設定する既定のポーズと考えてください。次のように、レストポーズを作成します:
ru: Думайте о позе покоя как о позе по умолчанию, в которую должен быть установлен Ваш каркас во время, когда в Вашей игре никакая другая поза не активна. Создайте позу покоя следующим образом:
uk: Подумайте про позу спокою, як про позу за замовчуванням, до якої повинен повертатися ваш скелет, коли жодна інша поза не активна у вашій грі. Створіть позу спокою наступним чином:
zh_cn: 将放松姿势视为默认姿势，当游戏中没有其他姿势处于活动状态时，应该将其设置为剪纸绑定。创造一个放松姿势如下：

source: 1. Make sure the rig parts are positioned in what looks like a "resting" arrangement.
es: 1. Asegúrate de que las piezas de la plataforma estén colocadas en lo que parece un montaje "en reposo".
fr: 1. Assurez-vous que les parties du rig sont positionnées dans ce qui semble être une pose au "repos".
ja: 1. リグパーツが「休息」の位置に配置されていることを確認します。
ru: 1. Убедитесь, что части каркаса расположены так, что бы это выглядело как «отдыхающее» расположение.
uk: 1. Переконайтеся, що кістки скелету розташовані в позі, яку можна назвати позою "спокою".
zh_cn: 1. 确保绑定部件处于 "休息" 状态.

source: Create a new animation, rename it "rest".
es: Crea una nueva animación, renómbrala a "rest" (descanso).
fr: Créez une nouvelle animation, renommez-la "rest".
ja: 新しいアニメーションを作成し、"rest" に名前を変更します。
ru: Создайте новую анимацию, переименуйте ее в "rest".
uk: Створіть нову анімацію, перейменуйте її на "rest".
zh_cn: 创建一个新动画, 重命名为 "rest".

source: Select all nodes in your rig (box selection should work fine).
es: Selecciona todos los nodos de tu equipo (la selección de la caja debería funcionar bien).
fr: Sélectionnez tous les nœuds dans votre rig (la sélection rectangulaire devrait faire l’affaire).
ja: リグ内のすべてのノードを選択します(ボックス選択は正常に機能するはずです)。
ru: Выберите все узлы в Вашем каркасе (подойдёт прямоугольное выделение).
uk: Виберіть усі вузли у вашого скелета (можна скористатися вибором коробкою).
zh_cn: 选择装配中的所有节点(应该可以框选).

source: 4. Make sure the "loc", "rot", and "scl" toggle buttons are all active in the toolbar.
es: 4. Asegúrate de que los botones de conmutación "loc", "rot" y "scl" estén todos activos en la barra de herramientas.
fr: 4. Assurez-vous que les boutons de basculement "loc", "rot" et "scl" sont tous actifs dans la barre d'outils.
ja: 4. ツールバーで「loc」、「rot」および「scl」のトグルボタンがすべてアクティブになっていることを確認します。
ru: 4. Убедитесь, что кнопки переключения «loc», «rot» и «scl» на панели инструментов активны.
uk: 4. Переконайтеся, що перемикачі "loc", "rot" і "scl" активні на панелі інструментів.
zh_cn: 4. 确保工具栏中的 "位置" , "旋转" 和 "缩放" 切换按钮都是活动的.

source: 5. Press the key button. Keys will be inserted for all selected parts storing their current arrangement. This pose can now be recalled when necessary in your game by playing the "rest" animation you've created.
es: 5. Presione el botón llave. Se insertarán las teclas para todas las partes seleccionadas que guarden su disposición actual. Esta pose puede ahora ser recordada cuando sea necesario en su juego jugando la animación "descanso" que ha creado.
fr: 5. Appuyez sur le bouton clé. Les clés seront insérées pour toutes les pièces sélectionnées en mémorisant leur disposition actuelle. Cette pose peut maintenant être rappelée si nécessaire dans votre jeu en jouant l'animation "rest" (repos) que vous avez créée.
ja: 5. キーボタンを押します。現在の配置を保存している選択したすべての部品にキーが挿入されます。このポーズは、作成した "rest" アニメーションを再生することで、ゲームで必要なときに呼び出すことができます。
ru: 5. Нажмите кнопку с ключом. Ключи будут вставлены для всех выбранных частей с их текущим расположением. Теперь эту позу можно будет установить, когда это необходимо в Вашей игре, проигрывая анимацию «rest», которую Вы создали.
uk: 5. Натисніть кнопку ключа. Ключі будуть вставлені для всіх вибраних частин і збережуть їх поточне розташування. Цю позу тепер можна за необхідності вставляти у вашу гру, відтворюючи анімацію "відпочинку".
zh_cn: 5. 按下关键帧按钮。关键帧将插入所有选择的部件，以存储它们的当前布局。现在，当你需要的时候，你可以通过播放你创建的“放松”动画来再次调出你的姿势。

source: Modifying rotation only
es: Modificando la rotación solamente
fr: Modification de la rotation uniquement
ja: 回転のみを修正する
ru: Изменение только поворота
uk: Зміна лише обертання
zh_cn: 只修改旋转

source: When animating a cutout rig, often it's only the rotation of the nodes that needs to change. Location and scale are rarely used.
es: Cuando se anima un equipo de recorte, a menudo es sólo la rotación de los nodos lo que necesita cambiar. La ubicación y la escala se utilizan raramente.
fr: Lorsqu'on anime un rig de cutout, ce n'est souvent que la rotation des nœuds qui doit changer. La position et l'échelle sont rarement utilisés.
ja: カットアウトリグをアニメーション化する場合、多くの場合、変更する必要があるのはノードの回転だけです。場所と縮尺はほとんど使用されません。
ru: При анимации вырезок часто требуется только поворот узлов. Положение и масштаб меняются редко.
uk: При анімації вирізок, часто необхідно змінити тільки поворот вузлів. Розташування і масштаб використовуються нечасто.
zh_cn: 当制作剪纸动画绑定时, 通常只需要改变节点的旋转. 很少使用位置和比例.

source: So when inserting keys, you might find it convenient to have only the "rot" toggle active most of the time:
es: Así que al insertar las teclas, puede que te convenga tener sólo la palanca de "rot" activa la mayor parte del tiempo:
fr: Ainsi, lors de l'insertion des clés, vous pouvez trouver pratique de n'avoir que le bouton "rot" actif la plupart du temps :
ja: したがって、キーを挿入する際には、ほとんどの場合、「rot」トグルのみをアクティブにすると便利です。
ru: Поэтому, при вставке ключей может оказаться удобным большую часть времени иметь активным только переключатель «rot»:
uk: Таким чином, при вставці ключів вам може бути зручно більшу частину часу мати активним тільки перемикач "rot":
zh_cn: 因此, 在插入键时, 你可能会发现在大多数时间里只有 "rot" 切换键处于激活状态, 会很方便:

source: This will avoid the creation of unwanted animation tracks for position and scale.
es: Esto evitará la creación de pistas de animación no deseadas para la posición y la escala.
fr: Cela évitera la création de pistes d'animation non désirées pour la position et l'échelle.
ja: これにより、位置と縮尺の不要なアニメーショントラックが作成されることを回避できます。
ru: Это позволит избежать создания нежелательных треков анимации для положения и масштаба.
uk: Це дозволить уникнути створення небажаних анімаційних доріжок для позиції та масштабу.
zh_cn: 这将避免为坐标和缩放创建不必要的动画轨道.

source: Keyframing IK chains
es: Fotogramas clave de cadenas IK
fr: Animer des chaînes IK
ja: IKチェーンのキーフレーム
ru: ИК цепочки ключевых кадров
uk: Ключові кадри ланцюжків ІК
zh_cn: 关键帧 IK 链

source: When editing IK chains, it's not necessary to select the whole chain to add keyframes. Selecting the endpoint of the chain and inserting a keyframe will automatically insert keyframes for all other parts of the chain too.
es: Cuando se editan cadenas IK, no es necesario seleccionar toda la cadena para añadir fotogramas clave. Al seleccionar el punto final de la cadena e insertar un fotograma clave, se insertarán automáticamente fotogramas clave hasta la base de la cadena.
fr: Lors de l'édition des chaînes IK, il n'est pas nécessaire de sélectionner toute la chaîne pour ajouter des clés d'animation. La sélection du point d'extrémité de la chaîne et l'insertion d'une clé d'animation entraîne automatiquement l'insertion de clés d'animation pour toutes les autres parties de la chaîne également.
ja: IKチェーンを編集する場合、キーフレームを追加するためにチェーン全体を選択する必要はありません。チェーンの終点を選択してキーフレームを挿入すると、チェーンの他のすべての部分にもキーフレームが自動的に挿入されます。
ru: При редактировании ИК цепочек нет необходимости выбирать всю цепочку для добавления ключевых кадров. При выборе конечной точки цепочки и вставке ключевого кадра также автоматически вставляются ключевые кадры для всех остальных частей цепочки.
uk: При редагуванні ланцюжків IK не обов'язково вибирати весь ланцюжок для додавання ключових кадрів. Досить вибрати кінцеву точку ланцюжка та вставити ключовий кадр для неї, для всіх інших частин ланцюжка ключові кадри створяться автоматично.
zh_cn: 编辑IK链时, 不需要选择整个链来添加关键帧. 选择链的端点并插入关键帧将自动为链的所有其他部分插入关键帧.

source: Visually move a sprite behind its parent
es: Visualmente mueve un sprite detrás de su padre
fr: Déplacer visuellement un sprite derrière son parent
ja: 親の背後にスプライトを視覚的に移動する
ru: Визуальное перемещение спрайта позади родителя
uk: Візуальне переміщення спрайта позаду його батька
zh_cn: 视觉上移动父级后面的精灵

source: Sometimes it is necessary to have a node change its visual depth relative to its parent node during an animation. Think of a character facing the camera, who pulls something out from behind his back and holds it out in front of him. During this animation the whole arm and the object in his hand would need to change their visual depth relative to the body of the character.
es: A veces es necesario que un nodo cambie su profundidad visual en relación con su nodo padre durante una animación. Piensa en un personaje frente a la cámara, que saca algo de detrás de su espalda y lo sostiene frente a él. Durante esta animación todo el brazo y el objeto en su mano necesitarían cambiar su profundidad visual en relación al cuerpo del personaje.
fr: Il est parfois nécessaire de faire changer la profondeur visuelle d'un nœud par rapport à son nœud parent pendant une animation. Pensez à un personnage face à la caméra, qui sort quelque chose de derrière son dos et le tient devant lui. Au cours de cette animation, le bras entier et l'objet dans sa main devraient changer leur profondeur visuelle par rapport au corps du personnage.
ja: アニメーション中に、親ノードを基準にしてノードの視覚的な深さ(前後関係)を変更する必要がある場合があります。カメラの方を向くキャラクターを考えてみてください。キャラクターが背中の後ろから何かを引き出し、目の前に差し出します。このアニメーション中に、腕全体と手のオブジェクトは、キャラクターの体に対して視覚的な深さを変更する必要があります。
ru: Иногда во время анимации необходимо, чтобы узел изменял свою визуальную глубину относительно родительского узла. Подумайте о персонаже, обращенном лицом к камере, который вытаскивает что-то из-за спины и держит это перед собой. Во время этой анимации вся рука и объект в ней должны были изменить свою визуальную глубину относительно тела персонажа.
uk: Іноді необхідно, щоб вузол змінив свою візуальну глибину відносно батьківського вузла під час анімації. Уявіть персонажа, повернутого до камери, який витягує щось з-за спини і тримає це перед собою. Під час цієї анімації вся рука і об'єкт в його руці повинні були б змінити свою візуальну глибину відносно тіла персонажа.
zh_cn: 有时, 在动画过程中, 需要让节点相对于其父节点更改其可视深度. 想象一个面对镜头的角色, 他从背后拿出一个东西放在面前. 在这个动画过程中, 整个手臂和他手中的物体都需要改变相对于角色身体的视觉深度.

source: To help with this there's a keyframable "Behind Parent" property on all Node2D-inheriting nodes. When planning your rig, think about the movements it will need to perform and give some thought to how you'll use "Behind Parent" and/or RemoteTransform2D nodes. They provide overlapping functionality.
es: Para ayudar con esto, hay una propiedad "Detrás del padre" en todos los nodos heredados de Node2D. Cuando planifiques tu equipo, piensa en los movimientos que tendrá que realizar y piensa en cómo usarás los nodos "Behind Parent" y/o RemoteTransform2D. Ellos proporcionan funcionalidad de superposición.
fr: Pour corriger ça, il y a une propriété "Behind Parent" (montrer derrière le parent) sur tous les nœuds qui héritent de Node2D. Quand vous planifiez votre squelette, pensez aux mouvements qu'il aura besoin de faire et réfléchissez à comment vous utiliserez "Behind Parent" et/ou les nœuds RemoteTransform2D. Ils fournissent des fonctionnalités qui se chevauchent.
ja: これを支援するために、すべてのNode2D継承ノードにキーフレーム化が可能な "Behind Parent" プロパティがあります。リグを計画するときは、実行する必要のある動きについて考え、"Behind Parent" やRemoteTransform2Dノードをどのように使用するかについて考えてください。これらは、重複する機能を提供しています。
ru: Чтобы помочь с этим, все узлы, наследованные от Node2D, имеют свойство «Behind Parent». При планировании каркаса подумайте о движениях, которые ему потребуется выполнить, и подумайте, как использовать «Behind Parent» и/или RemoteTransform2D узлов. Они обеспечивают функции перекрытия.
uk: Тут може допомогти властивість ``Behind Parent``, яка є на всіх вузлах успадкованих від Node2D. Створюючи каркас з вирізок, подумайте про рухи, які йому потрібно буде виконати, і про те, чи ви будете використовувати ``Behind Parent``, чи вузол RemoteTransform2D. Вони забезпечують функцію перекриття.
zh_cn: 为了帮助解决这个问题，在所有 Node2D 的派生节点上都有一个可制作关键帧的“Behind Parent”（在父级之后）属性。规划绑定时，请考虑它需要执行的动作，并考虑如何使用“Behind Parent”和/或 RemoteTransform2D 节点。它们提供重叠的功能。

source: Setting easing curves for multiple keys
es: Configurar las curvas de relajación para múltiples teclas
fr: Réglage des courbes de transition pour plusieurs clés
ja: 複数のキーのイージング曲線を設定する
ru: Настройка кривых замедления для нескольких ключей
uk: Встановлення кривих пом'якшення для кількох ключів
zh_cn: 为多个关键帧设置缓动曲线

source: To apply the same easing curve to multiple keyframes at once:
es: Para aplicar la misma curva de relajación a varios fotogramas clave a la vez:
fr: Pour appliquer la même courbe d'assouplissement à plusieurs clés d'animation à la fois :
ru: Чтобы применить одну и ту же кривую замедления сразу к нескольким ключевым кадрам:
uk: Щоб застосувати одну і ту ж криву пом'якшення до декількох ключових кадрів одночасно:
zh_cn: 要将同一缓动曲线同时应用于多个关键帧:

source: Select the relevant keys.
es: Seleccione las teclas correspondientes.
fr: Sélectionnez les clés appropriées.
ja: 関連するキーを選択します。
ru: Выберите соответствующие ключи.
uk: Виберіть відповідні ключі.
zh_cn: 选择相关的关键帧.
