Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/cutout_animation.po
Languages: es, fr, ja, ru, uk, zh_cn

source: Click on the pencil icon in the bottom right of the animation panel. This will open the transition editor.
es: Haz clic en el ícono de lápiz en la parte inferior derecha del panel de animación, esto abrirá el editor de transiciones.
fr: Cliquez sur l'icône crayon en bas à droite du panneau d'animation. Cela ouvrira l'éditeur de transition.
ru: Щелкните значок карандаша в правом нижнем углу панели анимации. Откроется редактор переходов.
uk: Натисніть на значок олівця в нижньому правому куті панелі анімації. Відкриється редактор переходу.
zh_cn: 点击动画面板右下角的铅笔图标. 这将打开过渡编辑器.

source: In the transition editor, click on the desired curve to apply it.
es: En el editor de transiciones, haga clic en la curva deseada para aplicarla.
fr: Dans l'éditeur de transition, cliquez sur la courbe souhaitée pour l'appliquer.
ru: В редакторе переходов щелкните нужную кривую, чтобы применить ее.
uk: У редакторі натисніть на потрібну криву, щоб застосувати її.
zh_cn: 在过渡编辑器中, 点击所需曲线进行应用.

source: 2D Skeletal deform
es: Deformación esquelética 2D
fr: Déformation squelettique 2D
ja: 2Dスケルタル(ボーン)変形
ru: 2D Деформация скелета
uk: 2D деформація скелета
zh_cn: 2D 骨架变形

source: Skeletal deform can be used to augment a cutout rig, allowing single pieces to deform organically (e.g. antennae that wobble as an insect character walks).
es: La deformación esquelética puede utilizarse para aumentar un aparejo de recorte, permitiendo que las piezas individuales se deformen orgánicamente (por ejemplo, las antenas que se tambalean cuando un personaje de insecto camina).
fr: La déformation squelettique peut être utilisée pour améliorer un rig de cutout, en permettant à des parties séparées de se déformer organiquement (par exemple, des antennes qui tremblent pendant qu'un personnage d'insecte marche).
ja: スケルタル変形を使用して、カットリグを補強し、単一のピースを有機的に変形させることができます(たとえば、昆虫のキャラクターが歩くとぐらつく触覚)。
ru: Деформация скелета может быть использована для увеличения вырезки, позволяя отдельным деталям деформироваться органически (например, усики, которые колеблются, когда ходит персонаж насекомое).
uk: Деформація скелета може бути використана для збільшення вирізок, що дозволяє окремим частинам органічно деформуватися (наприклад, вусики, які коливаються, коли ходить персонаж комахи).
zh_cn: 骨架变形（Skeletal Deform）可以用来增强剪纸绑定，允许单个部件有组织地变形（例如，像昆虫走路时摆动的触角一样）。

source: This process is described in a :ref:`separate tutorial <doc_2d_skeletons>`.
es: Este proceso se describe en un :ref:`separate tutorial <doc_2d_skeletons>`.
fr: Ce processus est décrit dans :ref:`un tutoriel séparé <doc_2d_skeletons>`.
ja: このプロセスは、\ :ref:`別のチュートリアル <doc_2d_skeletons>` で説明されています。
ru: Этот процесс описан в отдельном :ref:`учебном пособии <doc_2d_skeletons>`.
uk: Цей процес описаний в :ref:`окремому уроці <doc_2d_skeletons>`.
zh_cn: 这个过程在\ :ref:`单独的教程 <doc_2d_skeletons>`\ 中讲述。

source: Translation status
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
uk: Стан перекладу
zh_cn: 翻译状态

source: **Combine animation styles**: AnimatedSprite allows traditional cel animation to be used alongside cutout animation. In cel animation different animation frames use entirely different drawings rather than the same pieces positioned differently. In an otherwise cutout-based animation, cel animation can be used selectively for complex parts such as hands, feet, changing facial expressions, etc.
ru: **Объединение стилей анимации**: AnimableSprite позволяет использовать традиционную анимацию наряду с вырезной анимацией. В традиционной анимации различные кадры используют совершенно разные изображения, а не одни и те же части, расположенные по-разному. С другой стороны, в вырезной анимации традиционная анимация может использоваться выборочно для сложных частей, таких как руки, ноги, изменение мимики и т.д.

source: Get your assets: :download:`gbot_resources.zip <files/gbot_resources.zip>`.
ru: Загрузите ресурсы: :download:`gbot_resources.zip <files/gbot_resources.zip>`.

source: This small cross in the middle of the :ref:`Sprite <class_Sprite>` is the rotation pivot:
ru: Этот маленький крестик в середине спрайта является точкой вращения:

source: The pivot can be adjusted by changing the *offset* property in the Sprite:
ru: Точку вращения можно настроить путем изменения свойства *offset* в Sprite:

source: The pivot can also be adjusted *visually*. While hovering over the desired pivot point, press :kbd:`V` to move the pivot there for the selected Sprite. There is also a tool in the tool bar that has a similar function.
ru: Точка вращения также может быть настроена *визуально*. Наведите курсор на нужную точку вращения и нажмите клавишу :kbd:`V`, чтобы переместить её для выбранного спрайта. На панели инструментов также имеется инструмент, выполняющий аналогичную функцию.

source: The first step is creating an endpoint node. Any kind of node will do, but :ref:`Position2D <class_Position2D>` is preferred because it's visible in the editor. The endpoint node will ensure that the last bone has orientation.
ru: Первый шаг — создание узла конечной точки. Будет работать любой узел, но :ref:`Position2D <class_Position2D>` является более предпочтительным, так как он виден в редакторе. Узел конечной точки обеспечит ориентацию последней кости.

source: IK stands for inverse kinematics. It's a convenient technique for animating the position of hands, feet and other extremities of rigs like the one we've made. Imagine you want to pose a character's foot in a specific position on the ground. Without IK chains, each motion of the foot would require rotating and positioning several other bones (the shin and the thigh at least). This would be quite complex and lead to imprecise results.
ru: ИК означает инверсную кинематику. Это удобная техника для анимации положения рук, ног и других конечностей каркасов, подобных тем, что мы сделали. Представьте, что вы хотите поставить ногу персонажа в определенное положение на земле. Без цепочек ИК каждое движение стопы потребует вращения и позиционирования некоторых других костей (голень и бедро, по крайней мере). Это будет довольно сложно и приведёт к неточным результатам.

source: IK allows us to move directly the foot while the shin and thigh self-adjust.
ru: ИК позволяет двигать стопу непосредственно, а голень и бедро сами примут необходимое положение.

source: Once the IK chain is set-up grab any child or grand-child of the base of the chain (e.g. a foot) and move it. You'll see the rest of the chain adjust as you adjust its position.
ru: Когда настроите ИК цепочку, захватите любую дочернюю или внучатую часть основания цепочки (например, ступню) и переместите её. Вы увидите, как остальная часть цепочки корректируется, когда Вы изменяете её положение.

source: The following section will be a collection of tips for creating animation for your cutout rigs. For more information on how the animation system in Godot works, see :ref:`doc_animations`.
ru: Следующий раздел представляет собой набор советов по созданию анимации для ваших вырезок. Дополнительные сведения о работе системы анимации в Godot см. в разделе :ref:`doc_animations`.
