Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/animation/cutout_animation.po
Languages: es, fr, ja, ru, uk, zh_cn

source: Cutout animation
es: Animación de cortes
fr: Animation d'éléments découpés
ja: カットアウトアニメーション
ru: Вырезная анимация
uk: Анімація вирізок
zh_cn: 剪纸动画

source: What is it?
es: ¿Qué es eso?
fr: Qu'est-ce que c'est ?
ja: それは何ですか？
ru: Что это?
uk: Що це таке?
zh_cn: 它是什么？

source: Traditionally, `cutout animation <https://en.wikipedia.org/wiki/Cutout_animation>`__ is a type of `stop motion animation <https://en.wikipedia.org/wiki/Stop_motion>`__ in which pieces of paper (or other thin material) are cut into special shapes and arranged in two-dimensional representations of characters and objects. Characters' bodies are usually made out of several pieces. The pieces are arranged and photographed once for each frame of the film. The animator moves and rotates the parts in small increments between each shot to create the illusion of movement when the images are played back quickly in sequence.
es: Tradicionalmente, la `animación de recorte <https://en.wikipedia.org/wiki/Cutout_animation>`__ es un tipo de `animación de stop motion <https://en.wikipedia.org/wiki/Stop_motion>`__ en la que los trozos de papel (u otro material delgado) se cortan en formas especiales y se disponen en representaciones bidimensionales de personajes y objetos. Los cuerpos de los personajes suelen estar hechos de varias piezas. Los pedazos se arreglan y se fotografían una vez por cada cuadro de la película. El animador mueve y rota las piezas en pequeños incrementos entre cada toma para crear la ilusión de movimiento cuando las imágenes se reproducen rápidamente en secuencia.
fr: Traditionnellement, `cutout animation <https://en.wikipedia.org/wiki/Cutout_animation>`__ est un type d'animation en stop motion `stop motion animation <https://en.wikipedia.org/wiki/Stop_motion>`__ dans laquelle des morceaux de papiers (ou d'autre matériaux fins) sont découpés en formes spéciales et arrangé dans des représentations d'objets et de personnage en 2D. Le corps des personnages est généralement fait de plusieurs pièces. Ces pièces sont arrangé et photographié une fois par image clé du film. L'animateur bouge et tourne les morceaux à petits pas entre chaque photo pour créer l'illusion du mouvement quand les images sont montrés les unes après les autres.
ja: `カットアウトアニメーション <https://en.wikipedia.org/wiki/Cutout_animation>`__ は `ストップモーションアニメーション <https://en.wikipedia.org/wiki/Stop_motion>`__ の一種で、紙片(または他の薄い素材)を特殊な形状にカットし、キャラクターやオブジェクトを2次元に配置します。キャラクターの体は通常、いくつかのピースで構成されています。このピースは、フィルムの各フレームごとに配置され、撮影されます。アニメーターは、各ショット間でパーツを少しずつ移動および回転させて、イメージを順番にすばやく再生して動いているように見せます。
ru: Традиционно `вырезная анимация <https://en.wikipedia.org/wiki/Cutout_animation>`__ — это вид `покадровой анимации <https://en.wikipedia.org/wiki/Stop_motion>`__, при котором куски бумаги (или другого тонкого материала) разрезаются на специальные формы и располагаются в двумерных пространстве, представляя собой персонажи и объекты. Тела персонажей обычно изготавливаются из нескольких частей. Кусочки располагают и фотографируют один раз для каждого кадра фильма. Аниматор перемещает и поворачивает детали с небольшими изменениями между каждым снимком, создавая иллюзию движения при быстром последовательном воспроизведении изображений.
uk: Традиційна `анімація вирізок <https://en.wikipedia.org/wiki/Cutout_animation>`__ це тип `покадрової (лялькової) анімації<https://en.wikipedia.org/wiki/Stop_motion>`__ в якому шматочки паперу (або іншого тонкого матеріалу) розрізають на спеціальні форми і формують з них двовимірних персонажів і об'єкти. Тіла персонажів зазвичай складаються з декількох частин. Частини розташовуються і фотографуються один раз для кожного кадру фільму. Аніматор рухає і обертає частини невеликими зміщеннями між кожним знімком, щоб створити ілюзію руху, під час швидкого відтворення послідовності світлин.
zh_cn: 传统意义上, `剪影动画 <https://en.wikipedia.org/wiki/Cutout_animation>`__ 是一种 `定格动画 <https://zh.wikipedia.org/zh-cn/%E5%AE%9A%E6%A0%BC%E5%8A%A8%E7%94%BB>`__ . 在剪影动画中, 人们把纸片(或者其他的薄材料)剪成特殊的形状, 来组合成角色和物体的二维形象. 角色的身体通常是由几个部件组成的. 这些部件在动画的每一帧中形成一种组合, 之后对其摄影. 动画制作者在两次摄影之间将这些部分进行很小幅度的移动和旋转, 这样, 当这些摄影的画面以很快的速度连续依次播放时, 就可以造成这些角色和物体在连续运动的假象.

source: Simulations of cutout animation can now be created using software as seen in `South Park <https://en.wikipedia.org/wiki/South_Park>`__ and `Jake and the Never Land Pirates <https://en.wikipedia.org/wiki/Jake_and_the_Never_Land_Pirates>`__.
es: Las simulaciones de animación de recortes pueden ser creadas ahora usando software como se ve en `South Park <https://en.wikipedia.org/wiki/South_Park>`__ y `Jake and the Never Land Pirates <https://en.wikipedia.org/wiki/Jake_and_the_Never_Land_Pirates>`__.
fr: Les simulations d'animation de découpe peuvent maintenant être créées à l'aide d'un logiciel tel qu'il est vu dans `South Park <https://en.wikipedia.org/wiki/South_Park>`__ et `Jake and the Never Land Pirates <https://en.wikipedia.org/wiki/Jake_and_the_Never_Land_Pirates>`__.
ja: カットアウトアニメーションのシミュレーションを、\ `South Park <https://en.wikipedia.org/wiki/South_Park>`__ と `Jake and the Never Land Pirates <https://en.wikipedia.org/wiki/Jake_and_the_Never_Land_Pirates>`__ に見られるように、ソフトウェアを使用して作成できるようになりました。
ru: Вырезная анимация теперь может быть создана с помощью программного обеспечения, как, например, в `South Park <https://en.wikipedia.org/wiki/South_Park>`__ и `Jake and the Never Land Pirates <https://en.wikipedia.org/wiki/Jake_and_the_Never_Land_Pirates>`__.
uk: Моделювання анімації вирізок тепер можна створити за допомогою програмного забезпечення, як в фільмах `Південний парк <https://en.wikipedia.org/wiki/South_Park>`__ і `Джейк та Пірати, що ніколи не приземляються <https://en.wikipedia.org/wiki/Jake_and_the_Never_Land_Pirates>`__.
zh_cn: 现在可以用软件制作剪纸动画的模拟，如\ `《南方公园》 <https://zh.wikipedia.org/zh-cn/%E5%8D%97%E6%96%B9%E5%85%AC%E5%9C%92>`__\ 和\ `《杰克与梦幻岛海盗》 <https://zh.wikipedia.org/zh-cn/%E5%82%91%E5%85%8B%E8%88%87%E5%A4%A2%E5%B9%BB%E5%B3%B6%E6%B5%B7%E7%9B%9C>`__\ 。

source: In video games, this technique has also become popular. Examples of this are `Paper Mario <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__ or `Rayman Origins <https://en.wikipedia.org/wiki/Rayman_Origins>`__ .
es: En los videojuegos, esta técnica también se ha hecho popular. Ejemplos de esto son "Paper Mario" <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__ o "Rayman Origins" <https://en.wikipedia.org/wiki/Rayman_Origins>`__ .
fr: Dans les jeux vidéo, cette technique est également devenue populaire. Des exemples de ceci sont `Paper Mario <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__ ou `Rayman Origins <https://en.wikipedia.org/wiki/Rayman_Origins>`__ .
ja: ビデオゲームでは、このテクニックも人気となっています。その例としては、 `ペーパーマリオ <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__ または「`レイマン オリジン <https://en.wikipedia.org/wiki/Rayman_Origins>`__ があります。
ru: В видеоиграх эта техника также стала популярной. Примерами этого являются `Paper Mario <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__ или `Rayman Origins <https://en.wikipedia.org/wiki/Rayman_Origins>`__ .
uk: У відеоіграх ця техніка також стала популярною. Прикладами можуть бути `Паперовий Маріо <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__, або `Rayman Origins <https://en.wikipedia.org/wiki/Rayman_Origins>`__ .
zh_cn: 在视频游戏中，这种技术也变得流行。例如\ `《纸片马里奥》 <https://en.wikipedia.org/wiki/Super_Paper_Mario>`__\ 或 `《雷曼 起源》 <https://zh.wikipedia.org/zh-cn/%E9%9B%B7%E5%B0%84%E8%B6%85%E4%BA%BA_%E8%B5%B7%E6%BA%90>`__\ 。

source: Cutout animation in Godot
es: Animación de recortes en Godot
fr: Animation cutout dans Godot
ja: Godotのカットアウトアニメーション
ru: Вырезная анимация в Godot
uk: Анімація вирізок в Godot
zh_cn: Godot 中的剪纸动画

source: Godot provides tools for working with cutout rigs, and is ideal for the workflow:
es: Godot proporciona herramientas para trabajar con equipos de corte, y es ideal para el flujo de trabajo:
fr: Godot fournit des outils pour travailler avec des rigs de cutout et est idéal pour le processus de travail :
ja: Godotは、カットアウトリグを操作するためのツールを提供し、ワークフローに最適です:
ru: Godot предоставляет инструменты для работы с вырезанными частями и идеально подходит для следующих задач:
uk: Godot надає інструменти, які ідеально підходять, для роботи з конструкцією вирізок:
zh_cn: Godot 提供了一些工具，用于剪纸动画的绑定，而且是工作流的理想选择：

source: **The animation system is fully integrated with the engine**: This means animations can control much more than just motion of objects. Textures, sprite sizes, pivots, opacity, color modulation, and more, can all be animated and blended.
es: **El sistema de animación está completamente integrado con el motor**: Esto significa que las animaciones pueden controlar mucho más que el movimiento de los objetos. Las texturas, los tamaños de los sprites, los pivotes, la opacidad, la modulación del color y más, pueden ser animados y mezclados.
fr: **Le système d'animation est entièrement intégré au moteur** : Cela signifie que les animations peuvent contrôler beaucoup plus que le simple mouvement des objets. Les textures, la taille des sprites, les pivots, l'opacité, la modulation des couleurs, et plus encore, peuvent tous être animés et mélangés.
ja: **アニメーションシステムはエンジンと完全に統合されています**: これは、アニメーションがオブジェクトの動き以上のものを制御できることを意味します。テクスチャ、スプライトサイズ、ピボット、不透明度、色変調などをすべてアニメーション化およびブレンドできます。
ru: **Анимационная система полностью интегрирована с движком**: Это означает, что анимация может управлять гораздо больше, чем просто движением объектов. Текстуры, размеры спрайта, оси вращения, непрозрачность, цветовая модуляция и многое другое могут быть анимированы и смешаны.
uk: **Повна інтеграція системи анімації з рушієм:** Це означає, що анімація може контролювати набагато більше, ніж просто рух об'єктів. Текстури, розміри спрайтів, непрозорість, модуляція кольорів тощо, можуть бути анімовані та змішані.
zh_cn: **动画系统与引擎完全集成**\ ：这意味着动画可以控制的不仅仅是物体的运动。纹理、精灵大小、轴心、不透明度、颜色调制等都可以进行动画和混合。

source: **Combine animation styles**: AnimatedSprite2D allows traditional cel animation to be used alongside cutout animation. In cel animation different animation frames use entirely different drawings rather than the same pieces positioned differently. In an otherwise cutout-based animation, cel animation can be used selectively for complex parts such as hands, feet, changing facial expressions, etc.
zh_cn: **混合动画风格** ：AnimatedSprite2D 允许将传统赛璐璐动画与剪纸动画一起使用。在赛璐璐动画中，不同的动画帧使用完全不同的绘图，而不是相同的片段位置不同。在其他基于剪纸的动画中，赛璐璐动画可以选择性地用于复杂的部件，例如手、脚、改变面部表情等。

source: **Custom Shaped Elements**: Custom shapes can be created with :ref:`Polygon2D <class_Polygon2D>` allowing UV animation, deformations, etc.
es: **Elementos de Forma Personalizada**: Las formas personalizadas pueden ser creadas con :ref:`Polygon2D <class_Polygon2D>` permitiendo animación UV, deformaciones, etc.
fr: **Éléments sur mesure** : Des formes personnalisées peuvent être créées avec :ref:`Polygon2D <class_Polygon2D>` permettant l'animation UV, les déformations, etc.
ja: **カスタムシェイプエレメント**: カスタムシェイプは、\ :ref:`Polygon2D <class_Polygon2D>` で作成でき、UVアニメーション、変形などが可能です。
ru: **Пользовательские формы**: Пользовательские формы могут быть созданы с помощью :ref:`Polygon2D <class_Polygon2D>` и позволяют совершать UV анимации, деформации и т.д.
uk: **Власні форми елементів:** Свої фігури можна створити за допомогою :ref:`Polygon2D <class_Polygon2D>`, що дозволяє анімацію текстурних координат, деформації тощо.
zh_cn: **自定义形状元素** : 可以用 :ref:`Polygon2D <class_Polygon2D>` 创建自定义形状, 允许UV动画, 变形等.

source: **Particle Systems**: A cutout animation rig can be combined with particle systems. This can be useful for magic effects, jetpacks, etc.
es: **Sistemas de partículas**: Un equipo de animación de recortes puede combinarse con sistemas de partículas. Esto puede ser útil para efectos de magia, jetpack, etc.
fr: **Systèmes de particules** : Un rig d'animation de découpes peut être combiné avec des systèmes de particules. Cela peut être utile pour les effets de magie, les jetpacks, etc.
ru: **Системы частиц**: Части вырезной анимации могут быть скомбинированы с системами частиц. Это может быть полезно для создания магических эффектов, реактивных ранцев и т.д.
uk: **Системи частинок:** Конструкція анімованих вирізок може бути поєднана з системами частинок. Це може бути корисно для магічних ефектів, реактивних рюкзаків і т. д.
zh_cn: **粒子系统** : 剪纸式动画配件可以与粒子系统相结合, 这对魔法效果, 喷气背包等很有用.

source: **Custom Colliders**: Set colliders and influence areas in different parts of the skeletons, great for bosses and fighting games.
es: **Colisionadores Personalizados**: Colisionadores y áreas de influencia en diferentes partes de los esqueletos, ideales para jefes y juegos de lucha.
fr: **Custom Colliders** : Définissez des collisionneurs et des zones d'influence dans différentes parties des squelettes, ce qui est idéal pour les boss et les jeux de combat.
ja: **カスタムコライダー**: スケルトンの異なる部分にコライダー(衝突検知)と影響領域を設定し、ボスや格闘ゲームに最適です。
ru: **Пользовательские коллайдеры**: Установка коллайдеров и зон влияния в различных частях скелета; отлично подходит для боссов и файтингов.
uk: **Власні форми зіткнень:** Можна підігнати форми зіткнень і зони впливу в різних частинах скелетів; відмінно підходить для босів і бойових ігор.
zh_cn: **自定义碰撞器**\ ：在骨架的不同部位设置碰撞器和影响区域，非常适合 Boss 和格斗游戏。

source: **Animation Tree**: Allows complex combinations and blending between several animations, the same way it works in 3D.
es: **Árbol de la Animación**: Permite combinaciones complejas y mezclas entre varias animaciones, de la misma manera que funciona en 3D.
fr: **Animation Tree** : Permet des combinaisons complexes et des mélanges entre plusieurs animations, de la même façon que cela fonctionne en 3D.
ja: **アニメーションツリー**: 3Dでの動作と同じように、複数のアニメーションを複雑に組み合わせたりブレンドしたりできます。
ru: **Дерево анимации**: Позволяет выполнять сложные комбинации и смешение между несколькими анимациями так же, как и в 3D.
uk: **Дерево анімації:** Дозволяє складні комбінації та змішування між кількома анімаціями, так само, як в 3D.
zh_cn: **动画树** : 允许在几个动画之间进行复杂的组合和混合, 与3D动画的工作方式相同.

source: And much more!
es: ¡Y mucho más!
fr: Et bien plus encore !
ja: さらに多くも！
ru: И многое другое!
uk: Та багато інших можливостей!
zh_cn: 以及更多！

source: Making of GBot
es: Creando a GBot
fr: Fabrication de GBot
ja: GBotの作成
ru: Делаем GBot-а
uk: Створення GBot-а
zh_cn: 制作 GBot

source: For this tutorial, we will use as demo content the pieces of the `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__ character, created by Andreas Esau.
es: Para este tutorial, usaremos como contenido de demostración las piezas del personaje `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__, creado por Andreas Esau.
fr: Pour ce tutoriel, nous utiliserons comme contenu de démonstration les morceaux du personnage `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__, créé par Andreas Esau.
ja: このチュートリアルでは、Andreas Esauが作成した `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__ キャラクターの一部をデモコンテンツとして使用します。
ru: Для этого учебного пособия мы будем использовать в качестве демонстрационного контента фрагменты персонажа `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__ , созданные Андреасом Исау.
uk: Для цього уроку ми будемо використовувати в якості демонстраційного вмісту фрагменти персонажа `GBot<https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__, створені Андреасом Ісау.
zh_cn: 在本教程中，我们将使用由 Andreas Esau 创建的 `GBot <https://www.youtube.com/watch?v=S13FrWuBMx4&list=UUckpus81gNin1aV8WSffRKw>`__ 角色作为演示。

source: Get your assets: `cutout_animation_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/cutout_animation_assets.zip>`_.
zh_cn: 在此获取你的资源：`cutout_animation_assets.zip <https://github.com/godotengine/godot-docs-project-starters/releases/download/latest-4.x/cutout_animation_assets.zip>`_ 。

source: Setting up the rig
es: Preparando el mecanismo de montaje
fr: Mettre en place le rig
ja: リグのセットアップ
uk: Налаштування скелета
zh_cn: 设置装配

source: Create an empty Node2D as root of the scene, we will work under it:
es: Crear un Nodo2D vacío como raíz de la escena, trabajaremos bajo él:
fr: Créer un node2d vide en tant que racine de la scène où nous travaillerons :
ja: 空のNode2Dをシーンのルートとして作成し、その下で作業します:
ru: Создайте пустой Node2D как корень сцены, мы будем работать в нём:
uk: Створіть порожній вузол Node2D в якості кореня сцени:
zh_cn: 创建一个空的Node2D作为场景的根, 我们将在它下面工作:

source: The first node of the model is the hip. Generally, both in 2D and 3D, the hip is the root of the skeleton. This makes it easier to animate:
es: El primer nodo del modelo es la cadera. Generalmente, tanto en 2D como en 3D, la cadera es la raíz del esqueleto. Esto hace que sea más fácil de animar:
fr: Le premier nœud du modèle est la hanche. Généralement, en 2D et 3D, la hanche est la racine du squelette. Cela facilite l'animation :
ja: モデルの最初のノードは腰です。一般に、2Dと3Dの両方で、腰はスケルトンのルートです。これにより、アニメーションが簡単になります:
ru: Первый узел модели - бедро. Как правило, как в 2D, так и в 3D бедро является корнем скелета. Это упрощает анимацию:
uk: Першим вузлом моделі є стегно. Як правило, як в 2D, так і в 3D, стегно є коренем скелета. Це полегшує анімацію:
zh_cn: 模型的第一个节点是臀部。一般来说，无论是 2D 还是 3D，臀部都是骨架的根部。这使得它更容易制作动画：

source: Next will be the torso. The torso needs to be a child of the hip, so create a child sprite and load the torso texture, later accommodate it properly:
es: Lo siguiente será el torso. El torso necesita ser un hijo de la cadera, para crear un sprite hijo y cargar la textura del torso, más tarde la acomodaremos correctamente:
fr: Le prochain sera le torse. Le torse doit être un enfant de la hanche, alors créez un sprite enfant et chargez la texture du torse, puis adaptez-le correctement :
ja: 次は胴体になります。胴体は腰の子である必要があるため、子スプライトを作成して胴体のテクスチャをロードし、後で適切に調整します:
ru: Дальше будет туловище. Туловище должно быть потомком бедра, поэтому создайте дочерний спрайт и загрузите текстуру туловища, чтобы потом его правильно разместить:
uk: Далі буде тулуб. При створенні спрайту пам'ятайте, що тулуб повинен бути нащадком стегна, завантажте текстуру тулуба, і правильно розташуйте:
zh_cn: 接下来将是躯干, 躯干需要是臀部的子级, 所以要创建一个子级精灵, 并加载躯干纹理, 然后适当地调整它:

source: This looks good. Let's see if our hierarchy works as a skeleton by rotating the torso. We can do this be pressing :kbd:`E` to enter rotate mode, and dragging with the left mouse button. To exit rotate mode hit :kbd:`ESC`.
es: Esto se ve bien. Veamos si nuestra jerarquía funciona como un esqueleto rotando el torso. Podemos hacerlo presionando :kbd:`E` para entrar en el modo de rotación, y arrastrando con el botón izquierdo del ratón. Para salir del modo de rotación pulsa :kbd:`ESC`.
fr: Ça a l'air bon. Voyons si notre hiérarchie fonctionne comme un squelette en faisant tourner le torse. Nous pouvons faire cela en appuyant sur :kbd:`E` pour entrer en mode de rotation, et en faisant glisser avec le bouton gauche de la souris. Pour quitter le mode de rotation, appuyez sur :kbd:`ESC`.
ja: これはよさそうです。胴体を回転させて、階層がスケルトンとして機能するかどうかを見てみましょう。これを行うには、\ :kbd`E` を押して回転モードに入り、マウスの左ボタンでドラッグします。回転モードを終了するには、\ :kbd:`ESC` を押します。
ru: Выглядит хорошо. Давайте посмотрим, работает ли наша иерархия, как скелет, вращая туловище. Это можно сделать, нажав клавишу :kbd:`E` для перехода в режим вращения и двигая мышью с зажатой левой кнопкой. Для выхода из режима вращения нажмите :kbd:`ESC`.
uk: Виглядає добре. Давайте подивимося, як працює наша конструкція при обертанні тулуба. Ми можемо зробити це натисканням :kbd:`E`, щоб увійти в режим обертання, і порухати мишку з затиснутою лівою кнопкою. Щоб вийти з режиму обертання, натисніть :kbd:`ESC`.
zh_cn: 这看起来不错。让我们通过旋转躯干来看看层次结构是否能像骨架一样工作。可以按 :kbd:`E` 进入旋转模式，然后用鼠标左键拖动。要退出旋转模式，请按 :kbd:`ESC`\ 。

source: The rotation pivot is wrong and needs to be adjusted.
es: El pivote de rotación está mal y necesita ser ajustado.
fr: Le pivot de rotation est incorrect et doit être ajusté.
ja: 回転ピボットが間違っているため、調整する必要があります。
ru: Точка вращения неверна и нуждается в настройке.
uk: Центр обертання неправильний і потрібує регулювання.
zh_cn: 旋转轴心错误，需要调整。

source: This small cross in the middle of the :ref:`Sprite2D <class_Sprite2D>` is the rotation pivot:
zh_cn: :ref:`Sprite2D <class_Sprite2D>` 中间的这个小十字就是旋转轴心：

source: Adjusting the pivot
es: Ajustando el pivote
fr: Ajustement du pivot
ja: ピボットの調整
ru: Настройка точки вращения
uk: Налаштування центра
zh_cn: 调整轴心

source: The pivot can be adjusted by changing the *offset* property in the Sprite2D:
zh_cn: 可以通过更改 Sprite2D 中的 *offset* 属性来调整轴心：

source: The pivot can also be adjusted *visually*. While hovering over the desired pivot point, press :kbd:`V` to move the pivot there for the selected Sprite2D. There is also a tool in the tool bar that has a similar function.
zh_cn: 轴心也可以进行\ *可视化*\ 的调整。将鼠标悬停在所需的轴心点上时，按 :kbd:`V` 移动所选 Sprite2D 的轴心。工具栏中还有一个工具也有类似的功能。

source: Continue adding body pieces, starting with the right arm. Make sure to put each sprite in its correct place in the hierarchy, so its rotations and translations are relative to its parent:
es: Continúe añadiendo piezas al cuerpo, empezando por el brazo derecho. Asegúrate de poner cada sprite en su lugar correcto en la jerarquía, para que sus rotaciones y traslaciones sean relativas a su padre:
fr: Continuez à ajouter des morceaux de corps, en commençant par le bras droit. Assurez-vous de placer chaque sprite à sa place correcte dans la hiérarchie, afin que ses rotations et translations soient relatives à son parent :
ja: 右腕からボディピースを追加していきます。各スプライトを階層内の正しい位置に配置し、その回転と移動が親に対して相対的になるようにしてください:
ru: Продолжайте добавлять части тела, начиная с правой руки. Убедитесь, что каждый спрайт помещен на правильное место в иерархии, чтобы его вращения и перемещения были относительно родителя:
uk: Продовжуйте додавати частини тіла, починаючи з правої руки. Обов'язково помістіть кожен спрайт на правильне місце в ієрархії, щоб його обертання і переміщення відбувалися відносно його предка:
zh_cn: 继续添加身体部件, 从右臂开始. 确保将每个精灵放在其在层次结构中的正确位置, 其旋转和平移都是相对于其父级而言的:

source: With the left arm there's a problem. In 2D, child nodes appear in front of their parents:
es: Con el brazo izquierdo hay un problema. En 2D, los nodos hijos aparecen delante de sus padres:
fr: Avec le bras gauche, il y a un problème. En 2D, les nœuds enfants apparaissent devant leurs parents :
ja: 左腕には問題があります。2D では、子ノードは親ノードの前に表示されます:
ru: С левой рукой есть проблема. В 2D дочерние узлы располагаются поверх родительских:
uk: З лівою рукою є проблема. У 2D дочірні вузли розміщуються поверх предків:
zh_cn: 左臂有些问题. 在二维中, 子节点出现在父节点的前面:
