Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_containers.po
Languages: cs, es, fr, zh_cn

source: Using Containers
cs: Používání kontejnerů
es: Usando Containers
fr: Utilisation de Containers
zh_cn: 使用容器

source: :ref:`Anchors <doc_size_and_anchors>` are an efficient way to handle different aspect ratios for basic multiple resolution handling in GUIs,
fr: :ref:`Les Ancres <doc_size_and_anchors>` sont un moyen efficace de gérer les différents rapports de taille pour une gestion basique des résolutions multiples dans les interfaces graphiques,

source: For more complex user interfaces, they can become difficult to use.
cs: Pro složitější uživatelská rozhraní však mohou být obtížně použitelná.
es: En el caso de las interfaces de usuario más complejas, pueden llegar a ser difíciles de usar.
fr: Pour les interfaces utilisateur plus complexes, elles peuvent devenir difficiles à utiliser.
zh_cn: 对于更复杂的用户界面, 它们可能会变得难以使用.

source: This is often the case of games, such as RPGs, online chats, tycoons or simulations. Another common case where more advanced layout features may be required is in-game tools (or simply just tools).
cs: Toto je často případ her, jako jsou RPG, online chaty, tycoony nebo simulace. Dalším běžným případem, ve kterém mohou být vyžadovány pokročilejší funkce rozvržení, jsou nástroje zabudované přímo ve hře nebo zcela samostatné nástroje.
es: Este es a menudo el caso de los juegos, como los RPG, los chats online, los tycoons o las simulaciones. Otro caso común en el que pueden requerirse características de diseño más avanzadas es el de las herramientas dentro del juego (o simplemente las herramientas).
fr: C'est souvent le cas des jeux, tels que les RPG, les chats en ligne, les tycoons ou les simulations. Un autre cas courant où des fonctionnalités de mise en page plus avancées peuvent être nécessaires est celui des outils dans le jeu (ou simplement des outils).
zh_cn: 这通常是游戏的情况下, 如角色扮演类, 在线聊天, 大富翁类或模拟类游戏. 另一个需要更高级布局功能的常见情况是游戏内工具(或者仅仅是工具).

source: All these situations require a more capable OS-like user interface, with advanced layout and formatting. For that, :ref:`Containers <class_container>` are more useful.
cs: Všechny tyto situace vyžadují mocnější uživatelské rozhraní podobné OS, s pokročilým rozvržením a formátováním. Zde jsou užitečnější :ref:`Kontejnery <class_container>`.
es: Todas estas situaciones requieren una interfaz de usuario más capaz, como un sistema operativo, con un diseño y formato avanzados. Para eso, :ref:`Containers <class_container>` son más útiles.
fr: Toutes ces situations nécessitent une interface utilisateur plus performante, de type OS, avec une mise en page et un formatage avancés. Pour cela, :ref:`Containers <class_container>` sont plus utiles.
zh_cn: 这些情况需要一个更强大的类似操作系统的用户界面，具有先进的布局和格式。用 :ref:`Container <class_container>` 会更方便。

source: Container layout
cs: Rozložení kontejneru
es: Esquema de Containers
fr: Conteneurs de disposition
zh_cn: 容器布局

source: Containers provide a huge amount of layout power (as an example, the Godot editor user interface is entirely done using them):
cs: Kontejnery nám poskytují obrovskou moc nad rozvržením (například uživatelské rozhraní editoru Godota je kompletně připraveno právě pomocí kontejnerů):
es: Los contenedores proporcionan una enorme cantidad de potencia de diseño (por ejemplo, la interfaz de usuario del editor de Godot está totalmente hecha con ellos):
fr: Les conteneurs fournissent une énorme puissance de mise en page (par exemple, l'interface utilisateur de l'éditeur Godot est entièrement réalisée avec eux) :
zh_cn: 容器提供了巨大的布局能力(例如,Godot编辑器的用户界面就是完全使用它们完成的):

source: When a :ref:`Container <class_Container>`-derived node is used, all children :ref:`Control <class_Control>` nodes give up their own positioning ability. This means the *Container* will control their positioning and any attempt to manually alter these nodes will be either ignored or invalidated the next time their parent is resized.
cs: Když je použit uzel odvozený z :ref:`Container <class_Container>`, vzdají se všechny podřízené uzly :ref:`Control <class_Control>` svých vlastních polohovacích možností. To znamená, že *Container* bude řídit jejich umístění a jakýkoliv pokus o ruční změnu těchto uzlů bude při příští změně velikosti jejich rodičů ignorován nebo zneplatněn.
es: Cuando se usa un nodo :ref:`Container <class_Container>` derivado, todos los nodos :ref:`Control <class_Control>` hijos renuncian a su propia capacidad de posicionamiento. Esto significa que el *Contenedor* controlará su posicionamiento y cualquier intento de alterar manualmente estos nodos será o bien ignorado o invalidado la próxima vez que su padre sea redimensionado.
fr: Quand un nœud dérivé de :ref:`Container <class_Container>` est utilisé, tous les nœuds enfants :ref:`Control <class_Control>` abandonnent leur propre capacité de positionnement. Cela signifie que le *Container* contrôlera leur positionnement et que toute tentative de modification manuelle de ces nœuds sera soit ignorée soit invalidée lors du prochain redimensionnement de leur parent.
zh_cn: 当使用 :ref:`Container <class_Container>` 派生的节点时，所有作为子项的 :ref:`Control <class_Control>` 节点都会放弃自我定位能力。这意味着\ *容器*\ 将控制它们的位置，任何手动更改这些节点的尝试，都将在它们的父节点下一次调整大小时被忽略或失效。

source: Likewise, when a *Container* derived node is resized, all its children will be re-positioned according to it, with a behavior based on the type of container used:
cs: A podobně, jakmile se změní velikost uzlu odvozeného z *Container*, budou všechny jeho podřízené uzly přemístěny podle chování použitého typu kontejneru:
es: De la misma manera, cuando un nodo derivado de *Contenedor* es redimensionado, todos sus hijos serán reubicados de acuerdo a él, con un comportamiento basado en el tipo de contenedor utilizado:
fr: De même, lorsqu'un nœud dérivé de *Container* est redimensionné, tous ses enfants seront repositionnés en fonction de celui-ci, avec un comportement basé sur le type de conteneur utilisé :
zh_cn: 同样，调整 *Container* 派生节点的大小时，它的所有子节点都将根据它重新定位，其行为基于所用的容器类型：

source: Example of *HBoxContainer* resizing children buttons.
cs: Příklad toho jak *HBoxContainer* mění velikost podřízených uzlů.
es: Ejemplo de *HBoxContainer* cambiando el tamaño de los botones para niños.
fr: Exemple de *HBoxContainer* redimensionnant les boutons enfants.
zh_cn: *HBoxContainer* 调整子按钮大小的例子。

source: The real strength of containers is that they can be nested (as nodes), allowing the creation of very complex layouts that resize effortlessly.
cs: Skutečnou sílou kontejnerů je to, že je lze vzájemně vnořovat (jako uzly), což umožňuje jednoduše vytvářet velmi složitá rozložení, která bez problémů mění velikost.
es: La verdadera fuerza de los contenedores es que pueden anidarse (como nodos), lo que permite crear diseños muy complejos que se redimensionan sin esfuerzo.
fr: La vraie force des conteneurs est qu'ils peuvent être emboîtés (en tant que nœuds), permettant la création de mises en page très complexes qui se redimensionnent sans effort.
zh_cn: 容器的真正优势在于它们可以嵌套(作为节点), 允许创建非常复杂的布局, 调整毫不费力.

source: Size flags
fr: Size flags (Marqueurs de dimension)

source: When adding a node to a container, the way the container treats each child depends mainly on their *size flags*. These flags can be found by inspecting any control that is a child of a *Container*.
fr: Lors de l'ajout d'un nœud à un conteneur, la façon dont le conteneur traite chaque enfant dépend principalement de ses *size flags*. Ces drapeaux peuvent être trouvés en inspectant tout control qui est un enfant d'un *Container*.

source: Size flags are independent for vertical and horizontal sizing and not all containers make use of them (but most do):
fr: les size flags sont indépendants pour la taille verticale et horizontale et tous les conteneurs ne les utilisent pas (mais la plupart le font) :

source: **Fill**: Ensures the control *fills* the designated area within the container. No matter if a control *expands* or not (see below), it will only *fill* the designated area when this is toggled on (it is by default).
cs: **Fill** : Zajišťuje, že prvek *vyplní* určenou oblast v kontejneru. Bez ohledu na to, zda se ovládací prvek *rozšiřuje - expands* nebo ne (viz níže), *vyplní* pouze určenou oblast (ve výchozím stavu zapnuto).
es: **Fill**: Asegura que el control *llena* el área designada dentro del contenedor. No importa si un control se *expande* o no (ver más abajo), sólo *llenará* el área designada cuando éste esté activado (es por defecto).
fr: **Fill** : Veille à ce que le control *remplisse* la zone désignée à l'intérieur du conteneur. Peu importe si un control *s'étend* ou non (voir ci-dessous), il ne *remplit* la zone désignée que lorsque ce drapeau est activée (c'est le cas par défaut).
zh_cn: **Fill填充** : 确保控件 *fills填充* 容器内指定的区域. 无论控件是否 *expands扩展* (见下面), 当此选项被选中时(默认情况), 只 *填充* 指定区域.

source: **Expand**: Attempts to use as much space as possible in the parent container (in each axis). Controls that don't expand will be pushed away by those that do. Between expanding controls, the amount of space they take from each other is determined by the *Ratio* (see below).
fr: **Expand** : Tente d'utiliser le plus d'espace possible dans le conteneur parent (dans chaque axe). Les Controls qui ne s'étendent pas seront repoussées par ceux qui le font. Entre ceux qui s'étendent, l'espace qu'ils prendront par rapport aux autres est déterminé par le *Ratio* (voir ci-dessous).

source: **Shrink Center** When expanding (and if not filling), try to remain at the center of the expanded area (by default it remains at the left or top).
fr: **Shrink Center** Lors de l'expansion (et si pas de remplissage), essaye de rester au centre de la zone (par défaut, reste à gauche ou en haut).

source: **Ratio** Simple ratio of how much expanded controls take up the available space in relation to each other. A control with "2", will take up twice as much available space as one with "1".
fr: **Ratio** Rapport simple de combien les controls élargis occupent l'espace disponible les uns par rapport aux autres. Un control avec "2", prendra deux fois plus d'espace disponible qu'un control avec "1".

source: Experimenting with these flags and different containers is recommended to get a better grasp on how they work.
cs: Doporučujeme experimentovat s těmito příznaky a různými kontejnery, abyste lépe pochopili, jak fungují.
es: Se recomienda experimentar con estas banderas y diferentes contenedores para comprender mejor cómo funcionan.
fr: Il est recommandé d'expérimenter avec ces drapeaux et différents conteneurs pour mieux comprendre leur fonctionnement.
zh_cn: 建议使用这些标记和不同的容器进行试验, 以便更好地了解它们是如何工作的.

source: Container types
cs: Typy kontejnerů
es: Tipos de Container
fr: Types de conteneurs
zh_cn: 容器类型

source: Godot provides several container types out of the box as they serve different purposes:
cs: Godot sám poskytuje několik typů kontejnerů pro různé účely:
es: Godot proporciona varios tipos de contenedores prefabricados que sirven para diferentes propósitos:
fr: Godot fournit plusieurs types de conteneurs de base car ils servent à des fins différentes :
zh_cn: Godot提供了几种开箱即用的容器类型, 因为它们有不同的用途:

source: Arranges child controls vertically or horizontally (via :ref:`HBoxContainer <class_HBoxContainer>` and :ref:`VBoxContainer <class_VBoxContainer>`). In the opposite of the designated direction (as in, vertical for an horizontal container), it just expands the children.
cs: Uspořádá podřízené ovládací prvky vodorovně nebo svisle (prostřednictvím :ref:`HBoxContainer <class_HBoxContainer>` a :ref:`VBoxContainer <class_VBoxContainer>` ). Ve směru opačném k zarovnání (tzn. ve svislém směru pro vodorovný kontejner), podřízené uzly pouze rozšiřuje.
es: Organiza los controles secundarios de forma vertical u horizontal (mediante :ref:`HBoxContainer <class_HBoxContainer>` y :ref:`VBoxContainer <class_VBoxContainer>`). En la dirección opuesta a la designada (es decir, vertical para un contenedor horizontal), simplemente expande los hijos. Esta disposición te permite alinear y distribuir los controles de manera conveniente en tus interfaces gráficas.
fr: Arrangez les contrôles enfants verticalement ou horizontalement (via :ref:`HBoxContainer <class_HBoxContainer>` et :ref:`VBoxContainer <class_VBoxContainer>`). Dans la direction opposée à la direction désignée (verticale pour un conteneur horizontal), cela ne fait qu'agrandir les enfants.
zh_cn: 将子控件垂直或者水平排列（使用 :ref:`HBoxContainer <class_HBoxContainer>` 和 :ref:`VBoxContainer <class_VBoxContainer>` ）。而在相对方向上（比如水平容器的垂直方向），子节点会被扩展。

source: These containers make use of the *Ratio* property for children with the *Expand* flag set.
cs: Tyto kontejnery využívají vlastnost *Ratio* pro podřízené uzly s nastaveným příznakem *Expand* .
es: Estos contenedores hacen uso de la propiedad *Ratio* para los niños con la bandera *Expandir* puesta.
fr: Ces conteneurs utilisent la propriété *Ratio* pour les enfants avec le drapeau *Expand* activé.
zh_cn: 这些容器会用到设置了 *Expand（扩展）* 选项的子节点的 *Ratio（比例）* 属性。

source: Grid Container
cs: Mřížkový kontejner
es: Contenedor Rejilla
fr: Conteneur de grille
zh_cn: 网格容器

source: Arranges child controls in a grid layout (via :ref:`GridContainer <class_GridContainer>`, amount of columns must be specified). Uses both the vertical and horizontal expand flags.
cs: Uspořádá podřízené ovládací prvky v rozvržení mřížky (prostřednictvím :ref:`GridContainer <class_GridContainer>`, musí být zadáno množství sloupců). Používá příznaky vertikální i horizontální roztažení.
es: Dispone los controles hijo en un diseño de cuadrícula (mediante :ref:`GridContainer <class_GridContainer>`, se debe especificar la cantidad de columnas). Utiliza las banderas de expansión vertical y horizontal.
fr: Arrange les controls enfants dans une disposition en grille (via :ref:`GridContainer <class_GridContainer>`, la quantité de colonnes doit être spécifiée). Utilise les flags expand verticale et horizontale.
zh_cn: 将子控件按照网格排列（使用 :ref:`GridContainer <class_GridContainer>` ，必须指定列数），会同时用到垂直和水平扩展选项。

source: Margin Container
cs: Kontejner pro okraje
es: Contenedor Margen
fr: Conteneur de marge
zh_cn: 边距容器

source: Child controls are expanded towards the bounds of this control (via :ref:`MarginContainer <class_MarginContainer>`). Padding will be added on the margins depending on the theme configuration.
cs: Podřízené ovládací prvky jsou rozšířeny směrem k hranicím tohoto ovládacího prvku (prostřednictvím :ref:`MarginContainer <class_MarginContainer>`). Vnitřní okraje (padding) budou přidány v závislosti na konfiguraci motivu.
es: Los controles de hijos se expanden hacia los límites de este control (vía :ref:`MarginContainer <clase_MarginContainer>`). Se añadirá un relleno en los márgenes dependiendo de la configuración del tema.
fr: Les controls enfants sont étendus vers les limites de ce control (via :ref:`MarginContainer <class_MarginContainer>`). Des espaces seront ajoutés dans les marges en fonction de la configuration du thème.
zh_cn: 将子节点扩展到该控件的边界（使用 :ref:`MarginContainer <class_MarginContainer>` ），会根据主题的设置来添加不同大小的边距。

source: Again, keep in mind that the margins are a *Theme* value, so they need to be edited from the constants overrides section of each control:
cs: Opět mějte na paměti, že vnější okraje (margins) jsou hodnotou *Theme*, takže je třeba je upravovat v sekci potlačení konstant každého ovládacího prvku:
es: De nuevo, ten en cuenta que los márgenes son un valor *Theme*, por lo que deben ser editados desde la sección de sobreescrituras constantes de cada control:
fr: Encore une fois, gardez à l'esprit que les marges sont une valeur de *Theme*, donc elles doivent être éditées dans la section de réécriture des constantes de chaque Control :
zh_cn: 同样, 请记住, 边距是一个 *Theme* 值, 所以它们需要从每个控件的常量重写部分进行编辑:

source: Tab Container
cs: Karta (Tab) Kontejner
es: Contenedor Pestaña
fr: Conteneur d'onglet
zh_cn: 选项卡容器

source: Allows you to place several child controls stacked on top of each other (via :ref:`TabContainer <class_TabContainer>`), with only the *current* one visible.
cs: Umožňuje naskládat několik podřízených ovládacích prvků na sebe (pomocí :ref:`TabContainer <class_TabContainer>`), přičemž je zobrazen pouze ten *aktuální* .
es: Permite colocar varios controles hijo apilados unos encima de otros (vía :ref:`TabContainer <class_TabContainer>`), con sólo el *corriente* visible.
fr: Vous permet de placer plusieurs contrôles enfants empilés les uns sur les autres (via :ref:`TabContainer <class_TabContainer>`), avec seulement celui qui est *current* de visible.
zh_cn: 允许你将多个子控件堆叠在一起（使用 :ref:`TabContainer <class_TabContainer>` ），只会显示 *当前* 控件。

source: Changing the *current* one is done via tabs located at the top of the container, via clicking:
cs: Změna *aktuálního* se provádí pomocí karet umístěných v horní části kontejneru kliknutím na:
es: El cambio de la *corriente* se realiza a través de las pestañas situadas en la parte superior del contenedor, mediante un clic:
fr: Changer de *current* se fait via les onglets situés en haut du conteneur, par un clic :
zh_cn: 点击容器顶部的选项卡可以更改 *当前* 控件：

source: The titles are generated from the node names by default (although they can be overridden via *TabContainer* API).
cs: Názvy jsou ve výchozím nastavení generovány z názvů uzlů (i když je lze přepsat pomocí *TabContainer* API).
es: Los títulos se generan a partir de los nombres de los nodos por defecto (aunque pueden ser anulados a través de la API *TabContainer*).
fr: Les titres sont générés par défaut à partir des noms de nœuds (bien qu'ils puissent être réécrit via l'API *TabContainer*).
zh_cn: 标题默认是根据节点名称生成的（尽管可以通过 *TabContainer* 的 API 重写）。

source: Settings such as tab placement and *StyleBox* can be modified in the *TabContainer* theme overrides.
cs: Nastavení, jako je umístění karet a *StyleBox*, lze změnit ve vlastnotech motivů pro *TabContainer*.
es: Los ajustes como la colocación de las pestañas y *StyleBox* pueden ser modificados en el tema *TabContainer*.
fr: Les paramètres tels que le placement des onglets et la *StyleBox* peuvent être modifiés en réécrivant le thème du *TabContainer*.
zh_cn: 可以在 *TabContainer* 的主题覆盖项中修改类似选项卡位置和 *StyleBox* 等设置。

source: Accepts only one or two children controls, then places them side to side with a divisor (via :ref:`HSplitContainer <class_HSplitContainer>` and :ref:`VSplitContainer <class_VSplitContainer>`). Respects both horizontal and vertical flags, as well as *Ratio*.
cs: Přijme pouze jeden nebo dva podřízené ovládací prvky a poté mezi ně umístí oddělovač (prostřednictvím :ref:`HSplitContainer <class_HSplitContainer>` nebo :ref:`VSplitContainer <class_VSplitContainer>`). Respektuje horizontální i vertikální příznaky, stejně jako *Ratio*.
es: Acepta sólo uno o dos control hijos, y luego los coloca de lado a lado con un divisor (vía :ref:`HSplitContainer <class_HSplitContainer>` y :ref:`VSplitContainer <class_VSplitContainer>`). Respeta tanto las banderas horizontal como las vertical, así como *Ratio*.
fr: Accepte seulement un ou deux controls enfants, puis les place côte à côte avec un diviseur (via :ref:`HSplitContainer <class_HSplitContainer>` et :ref:`VSplitContainer <class_VSplitContainer>`). Respecte les flags horizontaux et verticaux, ainsi que le *Ratio*.
zh_cn: 只接受单个或者两个子控件，会将它们相邻放置，中间是分隔线（使用 :ref:`HSplitContainer <class_HSplitContainer>` 和 :ref:`VSplitContainer <class_VSplitContainer>` ），会使用到水平和垂直选项以及 *Ratio* 属性。

source: The divisor can be dragged around to change the size relation between both children:
cs: Oddělovač lze přetáhnout a změnit poměr velikostí mezi oběma podřízenými uzly:
es: El divisor puede ser arrastrado para cambiar la relación de tamaño entre ambos niños:
fr: Le diviseur peut être déplacé pour modifier la relation de taille entre les deux enfants :
zh_cn: 可以通过拖动分隔线来调整两个子节点所占区域的大小：

source: Simple container that draws a *StyleBox*, then expands children to cover its whole area (via :ref:`PanelContainer <class_PanelContainer>`, respecting the *StyleBox* margins). It respects both the horizontal and vertical size flags.
fr: Conteneur simple qui dessine une *StyleBox*, puis agrandit les enfants pour couvrir toute sa surface (via :ref:`PanelContainer <class_PanelContainer>`, en respectant les marges de la *StyleBox*). Il respecte les flags de taille horizontale et verticale.

source: This container is useful as top-level, or just to add custom backgrounds to sections of a layout.
cs: Tento kontejner je užitečný jako nejvyšší úroveň uživatelského rozhraní nebo pouze pro přidání vlastního pozadí pro určitou sekci.
es: Este contenedor es útil como nivel superior, o simplemente para añadir fondos personalizados a secciones de un diseño.
fr: Ce conteneur est utile comme niveau supérieur, ou simplement pour ajouter des arrière-plans personnalisés à des sections d'une mise en page.
zh_cn: 这个容器作为顶层非常有用, 或者只是为布局各个部分添加自定义背景.

source: Accepts a single child node. If this node is bigger than the container, scrollbars will be added to allow panning the node around (via :ref:`ScrollContainer <class_ScrollContainer>`). Both vertical and horizontal size flags are respected, and the behavior can be turned on or off per axis in the properties.
fr: Accepte un seul nœud enfant. Si ce nœud est plus grand que le conteneur, des barres de défilement seront ajoutées pour permettre de voir le nœud en entier (via :ref:`ScrollContainer <class_ScrollContainer>`). Les flags de taille verticale et horizontale sont respectés, et le comportement peut être activé ou désactivé par axe dans les propriétés.

source: Mouse wheel and touch drag (when touch is available) are also valid ways to pan the child control around.
cs: Kolečko myši a tažení dotykem (pokud je k dispozici dotyk) jsou také platné způsoby, jak posouvat podřízených prvkem.
es: La rueda del ratón y el arrastre táctil (cuando el tacto está disponible) también son formas válidas de desplazar el control del hijo.
fr: La molette de la souris et le glissement tactile (lorsque le tactile est disponible) sont également des moyens valables de faire pivoter le enfant control.
zh_cn: 鼠标滚轮和触摸拖动(当触摸可用时)也是平移子控件的有效方法.

source: As in the example above, one of the most common ways to use this container is together with a *VBoxContainer* as child.
cs: Stejně jako ve výše uvedeném příkladě je jedním z nejčastějších způsobů použivání tohoto kontejneru společně podřízeným *VBoxContainer* kontejnerem.
es: Como en el ejemplo anterior, una de las formas más comunes de usar este contenedor es junto con un *VBoxContainer* de hijo.
fr: Comme dans l'exemple ci-dessus, une des façons les plus courantes d'utiliser ce conteneur est de l'utiliser avec un *VBoxContainer* en tant qu'enfant.
zh_cn: 正如上面的例子中所展示的，使用此容器最常见的方法之一，是将 *VBoxContainer* 作为子容器一起使用。

source: This is a special control that will only accept a single *Viewport* node as child, and it will display it as if it was an image (via :ref:`ViewportContainer <class_ViewportContainer>`).
fr: C'est un control spécial qui n'acceptera qu'un seul nœud *Viewport* comme enfant, et il l'affichera comme si c'était une image (via :ref:`ViewportContainer <class_ViewportContainer>`).

source: Creating custom Containers
cs: Vytváření vlastních kontejnerů
es: Creando contenedores personalizados
fr: Création de conteneurs personnalisés
zh_cn: 创建自定义容器

source: It is possible to easily create a custom container using script. Here is an example of a simple container that fits children to its rect size:
fr: Il est possible de créer facilement un conteneur personnalisé à l'aide d'un script. Voici un exemple d'un conteneur simple qui adaptent ses enfants à sa rect size :

source: Translation status
cs: Stav překladu
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态

source: Box Containers
cs: Krabicové kontejnery
es: Contenedores Box
zh_cn: 盒式容器

source: Split Container
cs: Rozdělovací kontejner
es: Contenedor Divisor
zh_cn: 拆分容器

source: PanelContainer
cs: Panel kontejner
