Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/gui_containers.po
Languages: cs, es, fr, zh_cn

source: ScrollContainer
cs: Kontejner pro scrolování

source: :ref:`Anchors <doc_size_and_anchors>` are an efficient way to handle different aspect ratios for basic multiple resolution handling in GUIs.
es: :ref:`Anchors <doc_size_and_anchors>` son una forma eficiente de manejar diferentes relaciones de aspecto para el manejo básico de resolución múltiple en las GUI.
zh_cn: :ref:`Anchors <doc_size_and_anchors>` 是 GUI 中处理基本多分辨率时应对不同纵横比的有效方法。

source: Sizing options
zh_cn: 大小选项
