Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/ui/size_and_anchors.po
Languages: de, es, fr, ja, zh_cn

source: Size and anchors
de: Größe und Bezugspunkte (Anker)
es: Tamaño y anclas
fr: Taille et ancrages
ja: サイズとアンカー
zh_cn: 大小和锚点

source: If a game was always going to be run on the same device and at the same resolution, positioning controls would be a simple matter of setting the position and size of each one of them. Unfortunately, that is rarely the case.
de: Wenn ein Spiel immer auf demselben Gerät und mit derselben Auflösung ausgeführt werden würde, wäre es einfach, die Position und Größe jedes einzelnen Spiels zu bestimmen. Dies ist leider selten der Fall.
es: Si un juego siempre va a ser ejecutado en el mismo dispositivo y con la misma resolución, los controles de posicionamiento serían una simple cuestión de establecer la posición y el tamaño de cada uno de ellos. Desafortunadamente, ese es raramente el caso.
fr: Si un jeu devait toujours être exécuté sur le même appareil et à la même résolution, les controls de positionnement seraient une simple question de réglage de la position et de la taille de chacun d'entre eux. Malheureusement, c'est rarement le cas.
ja: ゲームが常に同じデバイスの同じ解像度で実行される場合には、位置の制御は、それぞれの位置とサイズを設定するだけの簡単な問題です。ですが残念ながら、それはめった当てはまりません。
zh_cn: 如果一个游戏总是用同一分辨率在同样的设备上运行, 摆放控件将是一个简单的事, 只要逐个设置它们的位置属性和大小属性即可. 不幸的是, 能像这样处理的情况很少.

source: Only TVs nowadays have a standard resolution and aspect ratio. Everything else, from computer monitors to tablets, portable consoles and mobile phones have different resolutions and aspect ratios.
de: Nur Fernseher haben heutzutage eine Standardauflösung und ein Standard-Seitenverhältnis. Alles andere, von Computermonitoren bis hin zu Tablets, tragbaren Konsolen und Mobiltelefonen, hat unterschiedliche Auflösungen und Seitenverhältnisse.
es: Sólo los televisores de hoy en día tienen una resolución y relación de aspecto estándar. Todo lo demás, desde los monitores de ordenador hasta las tabletas, las consolas portátiles y los teléfonos móviles tienen diferentes resoluciones y relaciones de aspecto.
fr: De nos jours, seuls les téléviseurs ont une résolution et un format d'image standard. Tout le reste, des écrans d'ordinateur aux tablettes, des consoles portables aux téléphones mobiles, ont des résolutions et des rapports d'aspect différents.
ja: 最近のテレビだけが標準的な解像度とアスペクト比を備えています。パソコン用モニターやタブレット、ポータブルコンソール、携帯電話に至るまで、他のすべては異なる解像度とアスペクト比を持っています。
zh_cn: 如今只有电视机有标准分辨率和纵横比. 而其他所有设备, 从计算机显示器到平板电脑, 便携游戏主机和手机等等, 都有不同的分辨率和纵横比.

source: There are several ways to handle this, but for now, let's just imagine that the screen resolution has changed and the controls need to be re-positioned. Some will need to follow the bottom of the screen, others the top of the screen, or maybe the right or left margins.
de: Es gibt verschiedene Möglichkeiten, um damit umzugehen, aber stellen wir uns vorerst vor, dass sich die Bildschirmauflösung geändert hat und die Steuerelemente neu positioniert werden müssen. Einige müssen dem unteren Bildschirmrand folgen, andere dem oberen Bildschirmrand oder möglicherweise dem rechten oder linken Rand.
es: Hay varias maneras de manejar esto, pero por ahora, imaginemos que la resolución de la pantalla ha cambiado y los controles deben ser reubicados. Algunos necesitarán seguir la parte inferior de la pantalla, otros la parte superior de la pantalla, o tal vez los márgenes derecho o izquierdo.
fr: Il y a plusieurs façons de gérer cela, mais pour l'instant, imaginons que la résolution de l'écran ait changé et que les controls doivent être repositionnées. Certains devront suivre le bas de l'écran, d'autres le haut de l'écran, ou peut-être les marges de droite ou de gauche.
ja: これを処理する方法はいくつかありますが、今のところは、画面の解像度が変更され、コントロールを再配置する必要があることを想像してみましょう。画面の上部や下部に合わせる必要があったり、あるいは、右または左の余白を必要とするものです。
zh_cn: 有几种方法来处理这个问题, 但现在, 让我们想象一下, 屏幕分辨率已经改变, 控件需要重新定位. 有的需要跟随屏幕的底部, 有的需要跟随屏幕的顶部, 也有的需要跟随左右边距.

source: This is done by editing the *margin* properties of controls. Each control has four margins: left, right, bottom and top. By default, all of them represent a distance in pixels relative to the top-left corner of the parent control or (in case there is no parent control) the viewport.
de: Dies erfolgt durch Bearbeiten der *margin* -Eigenschaften von Steuerelementen. Jedes Steuerelement hat vier Ränder: links, rechts, unten und oben. Standardmäßig stellen alle einen Abstand in Pixel relativ zur oberen linken Ecke des übergeordneten Steuerelements oder (falls kein übergeordnetes Steuerelement vorhanden ist) des Ansichtsfensters dar.
ja: これは、コントロールの *Margin* プロパティを編集することにより行われます。各コントロールには、Left、Right、Bottom、Top という4つのマージンがあります。デフォルトでは、それらはすべて、親コントロールまたは(親コントロールがない場合は)ビューポートの左上隅からの相対的な距離をピクセル単位で表します。

source: When horizontal (left, right) and/or vertical (top, bottom) anchors are changed to 1, the margin values become relative to the bottom-right corner of the parent control or viewport.
de: Werden horizontale (links, rechts) und/oder vertikale (oben, unten) Anker auf 1 geändert, so werden auch die Randwerte relativ zur unteren rechten Ecke des übergeordneten Steuerelements oder Ansichtsfensters verwendet.

source: Here, the control is set to expand its bottom-right corner with that of the parent, so when re-sizing the parent, the control will always cover it, leaving a 20 pixel margin:
de: Hier ist das Steuerelement so eingestellt, dass es seine untere rechte Ecke mit der des übergeordneten Elements erweitert. Wenn Sie also die Größe des übergeordneten Elements ändern, wird es vom Steuerelement immer abgedeckt, sodass ein Rand von 20 Pixel verbleibt:
ja: ここでは、コントロールは親の右下隅を基準にして拡大するように設定されているので、親のサイズを変更すると、コントロールは常に20ピクセルの余白を残して親を覆います:

source: Centering a control
de: Zentrierung eines Steuerelements
es: Centrando un control
fr: Centrage d’un contrôle
ja: コントロールのセンタリング
zh_cn: 使控件居中

source: To center a control in its parent, set its anchors to 0.5 and each margin to half of its relevant dimension. For example, the code below shows how a TextureRect can be centered in its parent:
de: Um ein Steuerelement in seinem übergeordneten Element zu zentrieren, setzen Sie seine Anker auf 0,5 und jeden Rand auf die Hälfte seiner relevanten Dimension. Der folgende Code zeigt beispielsweise, wie ein TextureRect in seinem übergeordneten Element zentriert werden kann:
es: Para centrar un control en su padre, pongan sus anclas a 0.5 y cada margen a la mitad de su dimensión relevante. Por ejemplo, el siguiente código muestra cómo una TextureRect puede ser centrada en su padre:
fr: Pour centrer un *Control* dans son parent, réglez ses ancres à 0,5 et chaque marge à la moitié de sa dimension intrinsèque. Par exemple, le code ci-dessous montre comment un *TextureRect* peut être centré dans son parent :
ja: コントロールを親の中央に配置するには、アンカーを0.5に設定し、各マージンを関連する寸法の半分に設定します。たとえば、次のコードは、TextureRectを親の中央に配置する方法を示しています:
zh_cn: 要将控件集中到其父控件中, 其锚定值为0.5, 每个边距为其相关尺寸的一半. 例如, 下面的代码显示了如何将纹理矩形居中到它的父节点:

source: Setting each anchor to 0.5 moves the reference point for the margins to the center of its parent. From there, we set negative margins so that the control gets its natural size.
de: Wenn Sie jeden Ankerpunkt auf 0,5 setzen, wird der Referenzpunkt für die Ränder in die Mitte des übergeordneten Ankers verschoben. Von dort aus setzen wir negative Ränder, damit das Steuerelement seine natürliche Größe erhält.
es: Poniendo cada ancla a 0.5 mueve el punto de referencia de los márgenes al centro de su padre. A partir de ahí, establecemos márgenes negativos para que el control obtenga su tamaño natural.
fr: Le réglage de chaque ancre à 0,5 déplace le point de référence pour les marges au centre de son parent. A partir de là, nous fixons des marges négatives pour que le control ait sa taille naturelle.
ja: 各アンカーを0.5に設定すると、マージンの参照ポイントがその親の中心に移動します。そこから、コントロールが自然なサイズになるように負のマージンを設定します。
zh_cn: 将每个锚定值设置为0.5, 将边缘的参考点移动到父锚点的中心. 在此基础上, 我们设置了负边距, 以便控件获得其自然大小.

source: Translation status
de: Übersetzungsstatus
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
zh_cn: 翻译状态

source: Layout Presets
es: Presets de Diseño
fr: Préréglages de mise en page
zh_cn: 布局预设

source: Instead of manually adjusting the margin and anchor values, you can use the toolbar's Layout menu, above the viewport. Besides centering, it gives you many options to align and resize control nodes.
es: En lugar de ajustar manualmente los valores de margen y anclaje, puedes utilizar el menú de Diseño en la barra de herramientas, ubicada encima del viewport. Además de centrar, este menú te proporciona muchas opciones para alinear y redimensionar nodos de control. Esto te permite trabajar de manera más eficiente al organizar y diseñar interfaces gráficas.
fr: Au lieu d'ajuster manuellement les valeurs de marge et d'ancrage, vous pouvez utiliser le menu Layout de la barre d'outils, au-dessus de la fenêtre d'affichage. Outre le centrage, il vous offre de nombreuses options pour aligner et redimensionner les nœuds Control.
zh_cn: 除了手动调整边距和锚点的值之外，你还可以使用视口上方工具栏中的“布局”菜单。其中有居中等诸多选项，可以用来对齐并调整节点的大小。
