Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/kdevelop.po
Languages: es, fr, zh_tw

source: `KDevelop <https://www.kdevelop.org>`_ is a free, open source IDE for all desktop platforms.
es: `KDevelop <https://www.kdevelop.org>`_ es un IDE gratuito y de código abierto disponible para todas las plataformas de escritorio.
fr: `KDevelop <https://www.kdevelop.org>`_ est un IDE libre et open source pour toutes les plateformes de bureau.
zh_tw: `KDevelop <https://www.kdevelop.org>`_ 是一個免費且可用於所有桌面平台的開放原始碼 IDE。

source: Importing the project
es: Importando el proyecto
fr: Importation du projet
zh_tw: 匯入專案

source: From the KDevelop's main screen select **Open Project**.
es: Desde la pantalla principal de KDevelop, selecciona **Abrir Proyecto**.
fr: Dans l'écran principal de KDevelop, sélectionnez **Open Project**.
zh_tw: 在 KDevelop 的主畫面中選擇 **Open Project** 。

source: KDevelop's main screen.
es: Pantalla principal de KDevelop.
fr: L'écran principal de KDevelop.
zh_tw: KDevelop 的主畫面。

source: Navigate to the Godot root folder and select it.
es: Navega hasta la carpeta raíz de Godot y selecciónala.
fr: Naviguez jusqu'au dossier racine de Godot et sélectionnez-le.
zh_tw: 前往 Godot 根目錄並選擇該資料夾。

source: On the next screen, choose **Custom Build System** for the **Project Manager**.
es: En la siguiente pantalla, elige **Custom Build System** para el **Gestor de Proyectos**.
fr: Sur l'écran suivant, choisissez **Custom Build System** pour le **Project Manager**.
zh_tw: 在下一個畫面中，將 **Project Manager** 設為 **Custom Build System** 。

source: After the project has been imported, open the project configuration by right-clicking on it in the **Projects** panel and selecting **Open Configuration..** option.
es: Después de que el proyecto haya sido importado, abre la configuración del proyecto haciendo clic derecho sobre él en el panel de **Proyectos** y seleccionando la opción **Abrir Configuración...**.
fr: Après l'importation du projet, ouvrez la configuration du projet en cliquant avec le bouton droit de la souris sur celui-ci dans le panneau **Projects** et en sélectionnant l'option **Open Configuration..**.
zh_tw: 專案匯入後，在 **Projects** 面板中右鍵點擊專案來開啟專案設定，並選擇 **Open Configuration...** 選項。

source: Under **Language Support** open the **Includes/Imports** tab and add the following paths:
es: Bajo **Soporte de Lenguaje**, abre la pestaña **Inclusiones/Importaciones** y agrega las siguientes rutas:
fr: Sous **Language Support**, ouvrez l'onglet **Includes/Imports** et ajoutez les chemins d'accès suivants :
zh_tw: 在 **Language Support** 中開啟 **Includes/Imports** 分頁，然後新增下列路徑：

source: Apply the changes.
es: Aplicar los cambios.
fr: Appliquez les changements.
zh_tw: 套用更改。

source: Under **Custom Build System** add a new build configuration with the following settings:
es: Bajo **Sistema de Construcción Personalizado**, agrega una nueva configuración de compilación con la siguiente configuración:
fr: Sous **Custom Build System**, ajoutez une nouvelle configuration de compilation avec les paramètres suivants :
zh_tw: 在 **Custom Build System** 中新增一個新的建置設定，並填入下列設定：

source: *blank*
zh_tw: **留空**

source: Enable
es: Activar
fr: Activer
zh_tw: 啟用

source: **True**
zh_tw: **是**

source: Arguments
es: Argumentos
zh_tw: 參數

source: See :ref:`doc_introduction_to_the_buildsystem` for a full list of arguments.
es: Lee :ref:`doc_introduction_to_the_buildsystem` para una lista completa de parámetros.
fr: Voir :ref:`doc_introduction_to_the_buildsystem` pour une liste complète des arguments.
zh_tw: 有關完整的參數列表，請參考 :ref:`doc_introduction_to_the_buildsystem` 。

source: Apply the changes and close the configuration window.
es: Aplica los cambios y cierra la ventana de configuración.
fr: Appliquez les changements et fermez la fenêtre de configuration.
zh_tw: 套用更改並關閉設定視窗。

source: Debugging the project
es: Depurando el proyecto
fr: Débogage du projet
zh_tw: 對專案進行除錯

source: Select **Run > Configure Launches...** from the top menu.
es: Selecciona **Run > Configure Launches...** en el menú superior.
fr: Sélectionnez **Run > Configure Launches...** dans le menu du haut.
zh_tw: 從上方選單中選擇 **Run > Configure Launches...** 。

source: Click **Add** to create a new launch configuration.
es: Haz clic en **Agregar** para crear una nueva configuración de lanzamiento.
fr: Cliquez sur **Add** pour créer une nouvelle configuration de lancement.
zh_tw: 點擊 **新增** 來建立新的執行設定。

source: Select **Executable** option and specify the path to your executable located in the ``<Godot root directory>/bin`` folder. The name depends on your build configuration, e.g. ``godot.linuxbsd.editor.dev.x86_64`` for 64-bit LinuxBSD platform with ``platform=editor`` and ``dev_build=yes``.
zh_tw: 選擇 **Executable** 選項，然後指定位於 ``<Godot 根目錄>/bin`` 資料夾中的可執行檔。執行檔的名稱會依據建置選項而有所不同，如有啟用 ``tools`` 的 64 位元 X11 平台版為``godot.x11.tools.64`` 。

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
es: Si tienes algún problema, busca ayuda en alguno de los `canales de la comunidad Godot <https://godotengine.org/community>`_.
fr: Si vous rencontrez des problèmes, demandez de l'aide sur l'un des `canaux communautaires de Godot <https://godotengine.org/community>`__.
zh_tw: 若遇到任何問題，請在 `任何一個 Godot 的社群頻道 <https://godotengine.org/community>`__ 中尋求幫助。

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_tw: 翻譯狀態

source: Build Directory
es: Directorio de Construcción

source: Executable
es: Ejecutable
