Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/visual_studio.po
Languages: es, fr, zh_cn

source: `Visual Studio Community <https://visualstudio.microsoft.com>`__ is a Windows-only IDE by `Microsoft <https://microsoft.com>`_ that's free for individual use or non-commercial use within organizations. It has many useful features, such as memory view, performance view, source control and more.
es: `Visual Studio Community <https://visualstudio.microsoft.com>`__ es un IDE solo disponible para Windows desarrollado por `Microsoft <https://microsoft.com>`_. Es gratuito para uso individual o uso no comercial dentro de organizaciones. Tiene muchas características útiles, como vista de memoria, vista de rendimiento, control de código fuente y más.
zh_cn: `Visual Studio Community <https://visualstudio.microsoft.com>`__ 是\ `微软 <https://microsoft.com>`_\ 的一个只面向 Windows 的 IDE，个人或者组织内的非商业使用是免费的。它有很多有用的功能，如内存视图、性能视图、源码控制等。

source: Importing the project
es: Importando el proyecto
fr: Importation du projet
zh_cn: 导入项目

source: Visual Studio requires a solution file to work on a project. While Godot does not come with the solution file, it can be generated using SCons.
es: Visual Studio requiere un archivo de solución para trabajar en un proyecto. Aunque Godot no incluye el archivo de solución, se puede generar utilizando SCons.
fr: Visual Studio a besoin d'un fichier de solution pour travailler sur un projet. Bien que Godot ne soit pas fourni avec le fichier de solution, il peut être généré à l'aide de SCons.
zh_cn: Visual Studio需要一个解决方案文件来处理一个项目. 虽然Godot没有附带解决方案文件, 但可以使用SCons生成.

source: Navigate to the Godot root folder and open a Command Prompt or PowerShell window.
es: Dirígete a la carpeta raíz de Godot y abre una ventana de Command Prompt o PowerShell.
fr: Naviguez jusqu'au dossier racine de Godot et ouvrez une fenêtre d'invite de commande ou une fenêtre PowerShell.
zh_cn: 导航到Godot根文件夹, 打开命令提示符或PowerShell窗口.

source: You can now open the project by double-clicking on the ``godot.sln`` in the project root or by using the **Open a project or solution** option inside of the Visual Studio.
es: Ahora puedes abrir el proyecto haciendo doble clic en el archivo ``godot.sln`` en la raíz del proyecto o utilizando la opción **Open a project or solution** dentro de Visual Studio.
fr: Vous pouvez maintenant ouvrir le projet en double-cliquant sur le ``godot.sln`` dans la racine du projet ou en utilisant l'option **Open a project or solution** à l'intérieur de Visual Studio.
zh_cn: 现在你可以通过双击项目根目录下的 ``godot.sln`` 或使用Visual Studio中的 **打开项目或解决方案** 选项来打开项目.

source: Use the **Build** top menu to build the project.
es: Utiliza el menú superior **Build** para compilar el proyecto.
fr: Utilisez le menu supérieur **Build** pour compiler le projet.
zh_cn: 从顶部菜单 **Build** [编译]来编译构建这个项目.

source: Debugging the project
es: Depurando el proyecto
fr: Débogage du projet
zh_cn: 调试项目

source: Visual Studio features a powerful debugger. This allows the user to examine Godot's source code, stop at specific points in the code, inspect the current execution context, and make live changes to the codebase.
es: Visual Studio cuenta con un depurador potente. Esto permite al usuario examinar el código fuente de Godot, detener la ejecución en puntos específicos del código, inspeccionar el contexto de ejecución actual y realizar cambios en vivo en el código.
fr: Visual Studio dispose d'un puissant débogueur. Il permet à l'utilisateur d'examiner le code source de Godot, de s'arrêter à des points précis du code, d'inspecter le contexte d'exécution actuel et d'apporter des modifications en direct à la base de code.
zh_cn: Visual Studio具有强大的调试器, 允许用户检查Godot的源代码, 在代码中的特定点中断, 检查当前的执行上下文, 并对代码库进行实时修改.

source: To configure the launch options to use with the debugger use **Project > Properties** from the top menu:
es: Para configurar las opciones de lanzamiento que se utilizarán con el depurador, selecciona **Project > Properties** desde el menú superior:
fr: Pour configurer les options de lancement à utiliser avec le débogueur, utilisez **Project > Properties** dans le menu du haut :
zh_cn: 要配置与调试器一起使用的启动选项, 请使用顶部菜单中的 **Project > Properties** [项目 > 属性]:

source: To learn more about command line arguments, refer to the :ref:`command line tutorial <doc_command_line_tutorial>`.
es: Para obtener más información sobre los argumentos de la línea de comandos, consulta el :ref:`tutorial de línea de comandos <doc_command_line_tutorial>`.
fr: Pour en savoir plus sur les arguments de la ligne de commande, reportez-vous au :ref:`tutoriel de la ligne de commande <doc_command_line_tutorial>`.
zh_cn: 要了解更多的命令行参数, 请参考 :ref:`命令行教程 <doc_command_line_tutorial>` .

source: Even if you start the project without a debugger attached it can still be connected to the running process using **Debug > Attach to Process...** menu.
es: Incluso si inicias el proyecto sin un depurador adjunto, aún puedes conectarte al proceso en ejecución utilizando el menú **Debug > Attach to Process...**.
fr: Même si vous démarrez le projet sans débogueur attaché, il peut toujours être connecté au processus en cours en utilisant le menu **Debug > Attach to Process...**.
zh_cn: 即使你在没有连接调试器的情况下启动项目, 也可以使用 **Debug > Attach to Process...** [调试 >附加到进程]菜单连接到正在运行的进程.

source: To check that everything is working, put a breakpoint in ``main.cpp`` and press :kbd:`F5` to start debugging.
es: Para asegurarte de que todo funciona correctamente, coloca un punto de interrupción en ``main.cpp`` y presiona :kbd:`F5` para iniciar la depuración.
fr: Pour vérifier que tout fonctionne, mettez un breakpoint dans ``main.cpp`` et appuyez sur :kbd:`F5` pour commencer le débogage.
zh_cn: 要检查一切是否正常，请将断点放在 ``main.cpp`` 中，然后按 :kbd:`F5` 开始调试。

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
es: Si tienes algún problema, busca ayuda en alguno de los `canales de la comunidad Godot <https://godotengine.org/community>`_.
fr: Si vous rencontrez des problèmes, demandez de l'aide sur l'un des `canaux communautaires de Godot <https://godotengine.org/community>`__.
zh_cn: 如果遇到问题, 也可在 `Godot 社区论坛 <https://godotengine.org/community>`__ 中寻求帮助.

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
