Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/visual_studio_code.po
Languages: es, fr, zh_cn

source: `Visual Studio Code <https://code.visualstudio.com>`_ is a free cross-platform code editor by `Microsoft <https://microsoft.com>`_ (not to be confused with :ref:`doc_configuring_an_ide_vs`).
es: `Visual Studio Code <https://code.visualstudio.com>`_ es un editor de código gratuito multiplataforma desarrollado por `Microsoft <https://microsoft.com>`_ (no confundir con :ref:`doc_configuring_an_ide_vs`).
fr: `Visual Studio Code <https://code.visualstudio.com>`_ est un éditeur de code multiplateforme gratuit de `Microsoft <https://microsoft.com>`_ (à ne pas confondre avec :ref:`doc_configuring_an_ide_vs`).
zh_cn: `Visual Studio Code <https://code.visualstudio.com>`_ 是\ `微软 <https://microsoft.com>`_\ 推出的免费跨平台代码编辑器（请勿与 :ref:`doc_configuring_an_ide_vs` 混淆）。

source: Importing the project
es: Importando el proyecto
fr: Importation du projet
zh_cn: 导入项目

source: Make sure the C/C++ extension is installed. You can find instructions in the `official documentation <https://code.visualstudio.com/docs/languages/cpp>`_. Alternatively, `clangd <https://open-vsx.org/extension/llvm-vs-code-extensions/vscode-clangd>`_ can be used instead.
es: Asegúrate de tener instalada la extensión C/C++ en Visual Studio Code. Puedes encontrar instrucciones en la `documentación oficial <https://code.visualstudio.com/docs/languages/cpp>`_. Alternativamente, puedes usar `clangd <https://open-vsx.org/extension/llvm-vs-code-extensions/vscode-clangd>`_ en su lugar.
zh_cn: 确保已安装 C/C++ 扩展。你可以在\ `官方文档 <https://code.visualstudio.com/docs/languages/cpp>`_\ 中找到说明。或者也可以用 `clangd <https://open-vsx.org/extension/llvm-vs-code-extensions/vscode-clangd>`_ 代替。

source: When using the clangd extension, run ``scons compiledb=yes``.
es: Cuando uses la extensión clangd, ejecuta ``scons compiledb=yes``.
fr: Lorsque vous utilisez l'extension glangd, lancer ``scons compiledb=yes``.
zh_cn: 使用 clangd 扩展时，请执行 ``scons compiledb=yes``\ 。

source: From the Visual Studio Code's main screen open the Godot root folder with **File > Open Folder...**.
es: Desde la pantalla principal de Visual Studio Code, abre la carpeta raíz de Godot con **File > Open Folder...**.
fr: Depuis l'écran principal du Visual Studio Code, ouvrez le dossier racine de Godot avec **File > Open Folder...**.
zh_cn: 现在在VS Code中打开克隆的godot文件夹 **文件 > 打开文件夹...** .

source: Press :kbd:`Ctrl + Shift + P` to open the command prompt window and enter *Configure Task*.
es: Presiona :kbd:`Ctrl + Shift + P` para abrir la ventana del símbolo de comando y escribe *Configure Task*.
fr: Appuyez sur :kbd:`Ctrl + Shift + P` pour ouvrir la fenêtre d'invite de commande et entrez *Configure Task*.
zh_cn: 按 :kbd:`Ctrl + Shift + P` 打开命令提示符窗口，然后输入 *Configure Task*\ 。

source: Select the **Create tasks.json file from template** option.
es: Selecciona la opción **Create tasks.json file from template**.
fr: Sélectionnez l'option **Create tasks.json file from template**.
zh_cn: 选择从模板中创建tasks.json文件选项.

source: Then select **Others**.
es: Luego selecciona **Others**.
fr: Sélectionnez ensuite **Others**.
zh_cn: 然后选择\ **其他**\ 。

source: Within the ``tasks.json`` file find the ``"tasks"`` array and add a new section to it:
es: Dentro del archivo ``tasks.json``, busca el array ``"tasks"`` y agrega una nueva sección a él:
fr: Dans le fichier ``tasks.json``, trouvez le tableau ``"tasks"`` et ajoutez-y une nouvelle section :
zh_cn: 在 ``tasks.json`` 文件中找到 ``"tasks"`` 数组, 并在其中添加一个新部分:

source: An example of a filled out ``tasks.json``.
es: Un ejemplo de cómo podría quedar el archivo ``tasks.json``.
fr: Un exemple de ``tasks.json`` rempli.
zh_cn: 填好了 ``tasks.json`` 的一个例子.

source: Arguments can be different based on your own setup and needs. See :ref:`doc_introduction_to_the_buildsystem` for a full list of arguments.
es: Los parámetros pueden ser diferente según tu configuración y necesidades. Ver :ref:`doc_introduction_to_the_buildsystem` para una lista completa de parámetros.
fr: Les arguments peuvent être différents selon votre propre configuration et vos besoins. Voir :ref:`doc_introduction_to_the_buildsystem` pour une liste complète des arguments.
zh_cn: 参数可以根据你自己的设置和需要而不同. 参见 :ref:`doc_introduction_to_the_buildsystem` 以获取完整的参数列表.

source: Debugging the project
es: Depurando el proyecto
fr: Débogage du projet
zh_cn: 调试项目

source: To run and debug the project you need to create a new configuration in the ``launch.json`` file.
es: Para ejecutar y depurar el proyecto, necesitas crear una nueva configuración en el archivo ``launch.json``.
fr: Pour exécuter et déboguer le projet, vous devez créer une nouvelle configuration dans le fichier ``launch.json``.
zh_cn: 为了构建项目, 我们需要配置文件 ``launch.json``.

source: Press :kbd:`Ctrl + Shift + D` to open the Run panel.
es: Presiona :kbd:`Ctrl + Shift + D` para abrir el panel de ejecución (Run).
fr: Appuyez sur :kbd:`Ctrl + Shift + D` pour ouvrir le panneau Run.
zh_cn: 按 :kbd:`Ctrl + Shift + D` 打开“运行”面板。

source: If ``launch.json`` file is missing you will be prompted to create a new one.
es: Si falta el archivo ``launch.json``, se te pedirá que crees uno nuevo.
fr: Si le fichier ``launch.json`` est manquant, vous serez invité à en créer un nouveau.
zh_cn: 如果缺少 ``launch.json`` 文件, 系统会提示你创建一个新的文件.

source: Select **C++ (GDB/LLDB)**. There may be another platform specific option here. If selected, adjust the configuration example provided accordingly.
es: Selecciona **C++ (GDB/LLDB)**. Puede haber otra opción específica de plataforma aquí. Si está seleccionada, ajusta el ejemplo de configuración proporcionado en consecuencia.
fr: Sélectionnez **C++ (GDB/LLDB)**. Il peut y avoir une autre option spécifique à la plate-forme ici. Si elle est sélectionnée, adaptez l'exemple de configuration fourni en conséquence.
zh_cn: 选择 **C++ (GDB/LLDB)** . 这里可能还有其他特定平台的选项. 如果选择了, 请相应调整所提供的配置示例.

source: Within the ``launch.json`` file find the ``"configurations"`` array and add a new section to it:
es: Dentro del archivo ``launch.json``, encuentra la matriz ``"configurations"`` y agrega una nueva sección a la misma:
fr: Dans le fichier ``launch.json``, trouvez le tableau ``"configurations"`` et ajoutez-y une nouvelle section :
zh_cn: 在 ``launch.json`` 文件中找到 ``"configurations"`` 数组, 并添加一个新部分:

source: An example of a filled out ``launch.json``.
es: Un ejemplo de un archivo ``launch.json`` completo.
fr: Un exemple de ``launch.json`` rempli.
zh_cn: 填写好的 ``launch.json`` 的例子.

source: Due to sporadic performance issues, it is recommended to use LLDB over GDB on Unix-based systems. Make sure that the `CodeLLDB extension <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_ is installed.
es: Debido a problemas de rendimiento esporádicos, se recomienda usar LLDB en lugar de GDB en sistemas basados en Unix. Asegúrate de que la extensión `CodeLLDB <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_ esté instalada.
fr: En raison de problèmes de performances sporadiques, il est recommandé d'utiliser LLDB plutôt que GDB sur les systèmes basés sur Unix. Assurez-vous que l'extension `CodeLLDB <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_ est installée.
zh_cn: 由于偶然的性能问题，建议在基于Unix的系统上使用LLDB而不是GDB。确保 `CodeLLDB extension <https://marketplace.visualstudio.com/items?itemName=vadimcn.vscode-lldb>`_ 已经安装。

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
es: Si tienes algún problema, busca ayuda en alguno de los `canales de la comunidad Godot <https://godotengine.org/community>`_.
fr: Si vous rencontrez des problèmes, demandez de l'aide sur l'un des `canaux communautaires de Godot <https://godotengine.org/community>`__.
zh_cn: 如果遇到问题, 也可在 `Godot 社区论坛 <https://godotengine.org/community>`__ 中寻求帮助.

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
