Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/contributing/development/configuring_an_ide/xcode.po
Languages: es, fr, zh_cn, zh_tw

source: `Xcode <https://developer.apple.com/xcode>`_ is a free macOS-only IDE. You can download it from the Mac App Store.
es: `Xcode <https://developer.apple.com/xcode>`_ es un IDE gratuito exclusivo para macOS. Puedes descargarlo desde la Mac App Store.
fr: `Xcode <https://developer.apple.com/xcode>`_ est un IDE gratuit pour uniquement macOS. Vous pouvez le télécharger sur le Mac App Store.
zh_cn: `Xcode <https://developer.apple.com/xcode>`_ 是一个免费的macOS专用IDE, 你可以从Mac App Store下载它.
zh_tw: `Xcode <https://developer.apple.com/xcode>`_ 是僅可用於 macOS 的免費 IDE。可以從 Mac App Store 中下載。

source: Importing the project
es: Importando el proyecto
fr: Importation du projet
zh_cn: 导入项目
zh_tw: 匯入專案

source: From Xcode's main screen create a new project using the **Other > External Build System** template.
es: Desde la pantalla principal de Xcode, crea un nuevo proyecto utilizando la plantilla **Other > External Build System**.
fr: Depuis l'écran principal de Xcode, créez un nouveau projet en utilisant le modèle **Other > External Build System**.
zh_cn: 在Xcode的主屏幕上, 使用 **Other > External Build System** [其他>外部构建系统]模板创建一个新项目.
zh_tw: 從 Xcode 的主畫面中通過 **Other > External Build System** 樣板來建立新專案。

source: Now choose a name for your project and set the path to scons executable in build tool (to find the path you can type ``where scons`` in a terminal).
zh_tw: 現在為您的專案選擇名稱，並在建置工具中設定 scons 執行檔的路徑（要尋找路徑，您可以在終端機中鍵入「where scons」）。

source: Open the main target from the **Targets** section and select the **Info** tab.
zh_tw: 從 **Targets** 段落中開啟建構目標，並選擇 **Info** 分頁。

source: Fill out the form with the following settings:
es: Completa los detalles con la siguiente configuración:
fr: Remplissez le formulaire avec les paramètres suivants :
zh_cn: 按以下设置填写表格:
zh_tw: 填寫下列設定：

source: Arguments
es: Argumentos
zh_cn: 参数
zh_tw: 參數

source: See :ref:`doc_introduction_to_the_buildsystem` for a full list of arguments.
es: Lee :ref:`doc_introduction_to_the_buildsystem` para una lista completa de parámetros.
fr: Voir :ref:`doc_introduction_to_the_buildsystem` pour une liste complète des arguments.
zh_cn: 参见 :ref:`doc_introduction_to_the_buildsystem`, 获取完整的参数列表.
zh_tw: 有關完整的參數列表，請參考 :ref:`doc_introduction_to_the_buildsystem` 。

source: A full path to the Godot root folder
es: Una ruta completa a la carpeta raíz de Godot
fr: Un chemin complet vers le dossier racine de Godot
zh_cn: 到Godot根文件夹的完整路径
zh_tw: Godot 根目錄的完整路徑

source: Add a Command Line Tool target which will be used for indexing the project by choosing **File > New > Target...**.
es: Agrega un destino de herramienta de línea de comandos que se utilizará para indexar el proyecto seleccionando **Archivo > Nuevo > Destino...**.
fr: Ajoutez une cible pour l'outil en ligne de commande qui sera utilisée pour l'indexation du projet en choisissant **File > New > Target...**.
zh_cn: 通过选择 **File > New > Target...** [文件 > 新建 > 目标...], 添加一个命令行工具目标, 它将用于为项目建立索引.
zh_tw: 選擇 **File > New > Target...** 來新增一個用於對專案進行索引的 Command Line Tool 目標。

source: Select **macOS > Application > Command Line Tool**.
zh_tw: 選擇 **OS X > Application > Command Line Tool** 。

source: Name it something so you know not to compile with this target (e.g. ``GodotXcodeIndex``).
es: Nómbralo de manera que sepas que no se debe compilar con este objetivo (por ejemplo, ``GodotXcodeIndex``).
fr: Donnez-lui un nom pour que vous sachiez qu'il ne faut pas compiler avec cette cible (e.g. ``GodotXcodeIndex``).
zh_cn: 为它命名, 以使你知道不使用该目标进行编译(例如 ``GodotXcodeIndex``).
zh_tw: 請為該建置目標命名，這樣才能分辨出該建置目標不是要用來編譯的 (如 ``GodotXcodeIndex``)。

source: For this target open the **Build Settings** tab and look for **Header Search Paths**.
es: Para este objetivo, abre la pestaña **Build Settings** y busca la opción **Header Search Paths** (Rutas de búsqueda de encabezados).
fr: Pour cette cible, ouvrez l'onglet **Build Settings** et cherchez **Header Search Paths**.
zh_cn: 前往新创建的目标(target)的 **构建设置(Build Settings)** 选项卡, 搜索 **标头搜索路径(标头搜索路径)** .
zh_tw: 開啟該建置目標的 **Build Settings** 分頁，並找到 **Header Search Paths** 。

source: Set **Header Search Paths** to the absolute path to the Godot root folder. You need to include subdirectories as well. To achieve that, add two two asterisks (``**``) to the end of the path, e.g. ``/Users/me/repos/godot-source/**``.
es: Establece **Header Search Paths** a la ruta absoluta de la carpeta raíz de Godot. Debes incluir también los subdirectorios. Para lograrlo, agrega dos asteriscos (``**``) al final de la ruta, por ejemplo, ``/Users/yo/repos/godot-source/**``.
fr: Définissez **Header Search Paths** sur le chemin absolu vers le dossier racine de Godot. Vous devez également inclure les sous-répertoires. Pour cela, ajoutez deux astérisques (``**``) à la fin du chemin, par exemple ``/Users/me/repos/godot-source/**``.
zh_cn: 将 **Header Search Paths** 设置为 Godot 根文件夹的绝对路径。子目录也需要包含进来，为此，请在路径末尾添加两个星号（\ ``**``\ ），例如 ``/Users/me/repos/godot-source/**``\ 。
zh_tw: 將 **Header Search Paths** 設為 Godot 根目錄的絕對路徑。也需要包含子資料夾。要包含子資料夾，請在路徑的結尾新增兩個星號 (``**``) ，如 ``/Users/me/repos/godot-source/**`` 。

source: Add the Godot source to the project by dragging and dropping it into the project file browser.
es: Arrastra y suelta los fuentes de Godot en el navegador de archivos de proyecto.
fr: Ajoutez la source Godot au projet en la faisant glisser dans le navigateur de fichiers du projet.
zh_cn: 将Godot源码拖放到项目文件浏览器中, 将其添加到项目中.
zh_tw: 將 Godot 原始碼拖放到專案檔案瀏覽器中來將這些檔案新增至專案中。

source: Select **Create groups** for the **Added folders** option and check *only* your command line indexing target in the **Add to targets** section.
zh_tw: 接下來，選擇 **Added folders** 選項中的 **Create groups** ，然後請檢查 **Add to targets** 中應該 **只** 包含命令行索引建置目標。

source: Xcode will now index the files. This may take a few minutes.
es: Xcode ahora indexará los archivos. Esto puede llevar algunos minutos.
fr: Xcode va maintenant indexer les fichiers. Cela peut prendre quelques minutes.
zh_cn: Xcode现在将索引这些文件. 这可能需要几分钟的时间.
zh_tw: Xcode 接著會開始索引檔案。會需要花一點時間。

source: Once Xcode is done indexing, you should have jump-to-definition, autocompletion, and full syntax highlighting.
es: Una vez que Xcode haya terminado de indexar, deberías tener la función de ir a la definición, autocompletado y resaltado completo de la sintaxis.
fr: Une fois l'indexation de Xcode terminée, vous devriez avoir le saut à la définition, l'autocomplétion et la mise en évidence syntaxique complète.
zh_cn: 一旦Xcode完成了索引, 你应该有跳转定义, 自动完成和完整的语法突出显示.
zh_tw: Xcode 索引完成後，就可以使用跳至定義 (Jump-to-Definition) 功能、自動補全、以及完整的語法醒目提示功能。

source: Debugging the project
es: Depurando el proyecto
fr: Débogage du projet
zh_cn: 调试项目
zh_tw: 對專案進行除錯

source: To enable debugging support you need to edit the external build target's build and run schemes.
es: Para habilitar el soporte de depuración, necesitas editar los esquemas de compilación y ejecución del objetivo de compilación externo.
fr: Pour activer le support de débogage, vous devez modifier les schémas de compilation et d’exécution de la cible de compilation externe.
zh_cn: 要启用调试支持, 需要编辑外部构建目标的构建和运行方案.
zh_tw: 若要啟用除錯功能，則需要編輯外部建置目標的建置並執行 Scheme。

source: Open the scheme editor of the external build target.
es: Abre el editor de esquemas del objetivo de compilación externo.
fr: Ouvrez l'éditeur de schéma de la cible de compilation externe.
zh_cn: 打开外部构建目标的方案编辑器.
zh_tw: 開啟外部建置目標的 Scheme 編輯器。

source: Locate the **Build > Post Actions** section.
es: Localiza la sección **Build > Post Actions**.
fr: Localisez la section **Build > Post Actions**.
zh_cn: 定位到 **Build > Post Actions** 区.
zh_tw: 移至 **Build > Post Actions** 部分。

source: Add a new script run action
es: Agrega un nuevo script de ejecución
fr: Ajouter un nouveau script d'action exécution
zh_cn: 增加一个新的脚本运行操作
zh_tw: 新增一個新的腳本執行動作

source: Under **Provide build settings from** select your project. This allows to reference the project directory within the script.
es: Bajo **Provide build settings from**, selecciona tu proyecto. Esto permite hacer referencia al directorio del proyecto dentro del script.
fr: Sous **Provide build settings from**, sélectionnez votre projet. Cela permet de référencer le répertoire du projet dans le script.
zh_cn: 在 **Provide build settings from** [提供构建设置]下选择你的项目. 这允许在脚本中引用项目目录.
zh_tw: 在 **Provide build settings from** 中選擇專案。這樣一來便可以在腳本中參照到專案資料夾。

source: Create a script that will give the binary a name that Xcode can recognize, e.g.:
es: Crea un script que le dé al binario un nombre que Xcode pueda reconocer, por ejemplo:
fr: Créer un script qui donnera au binaire un nom que Xcode pourra reconnaître, par exemple :
zh_cn: 创建一个脚本, 给二进制文件起一个Xcode可以识别的名字, 例如:
zh_tw: 建立用來提供 Xcode 可識別之二進位檔名稱的腳本，如：

source: Build the external build target.
es: Construye el objetivo de compilación externo.
fr: Compiler la cible de compilation externe.
zh_cn: 构建外部构建目标.
zh_tw: 建置外部建置目標。

source: Open the scheme editor again and select **Run**.
es: Abre el editor de esquemas nuevamente y selecciona **Ejecutar**.
fr: Ouvrez à nouveau l'éditeur de schéma et sélectionnez **Run**.
zh_cn: 再次打开方案编辑器, 然后选择 **运行** .
zh_tw: 再次開啟 Scheme 編輯器，然後選擇 **Run** 。

source: Set the **Executable** to the file you linked in your post-build action script.
es: Establece el **Ejecutable** como el archivo que enlazaste en tu script de acción posterior a la compilación.
fr: Définissez l'**Executable** au fichier que vous avez lié dans votre script d'action post-compilation.
zh_cn: 将 **可执行文件(Executable)** 设置为你在传递构建动作脚本中链接的文件.
zh_tw: 將 **Executable** 設為連結到 post-build 操作腳本的檔案。

source: Check **Debug executable**.
es: Marca la casilla **Debug executable**.
fr: Cochez **Debug executable**.
zh_cn: 勾选 **调试可执行文件(Debug executable)** (如果还未准备好).
zh_tw: 勾選 **Debug executable** 。

source: You can add two arguments on the **Arguments** tab: the ``-e`` flag opens the editor instead of the Project Manager, and the ``--path`` argument tells the executable to open the specified project (must be provided as an *absolute* path to the project root, not the ``project.godot`` file).
zh_tw: 可以在 **Arguments** 分頁中新增兩個參數：用於開啟編輯器而非專案管理員的 ``-e`` 旗標，以及用於告訴編輯器要開啟哪個特定專案的 ``--path`` 參數 (必須提供專案根目錄的 **絕對** 路徑，而非 ``project.godot`` 檔案)。

source: To check that everything is working, put a breakpoint in ``platform/macos/godot_main_macos.mm`` and run the project.
zh_tw: 要檢查是否一切正常，請在 ``platform/osx/godot_main_osx.mm`` 中新增一個斷點，並執行專案。

source: If you run into any issues, ask for help in one of `Godot's community channels <https://godotengine.org/community>`__.
es: Si tienes algún problema, busca ayuda en alguno de los `canales de la comunidad Godot <https://godotengine.org/community>`_.
fr: Si vous rencontrez des problèmes, demandez de l'aide sur l'un des `canaux communautaires de Godot <https://godotengine.org/community>`__.
zh_cn: 如果遇到问题, 也可在 `Godot 社区论坛 <https://godotengine.org/community>`__ 中寻求帮助.
zh_tw: 若遇到任何問題，請在 `任何一個 Godot 的社群頻道 <https://godotengine.org/community>`__ 中尋求幫助。

source: Translation status
es: Estado de traducción
fr: État de la traduction
zh_cn: 翻译状态
zh_tw: 翻譯狀態

source: Directory
es: Directorio
zh_cn: 目录
