Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/logic_preferences.po
Languages: ja, ru

source: Logic preferences
ja: ロジックの設定
ru: Настройки логики

source: Ever wondered whether one should approach problem X with strategy Y or Z? This article covers a variety of topics related to these dilemmas.
ja: 問題Xにアプローチするときに、戦略をYにするかZするかについて悩んだことはありませんか？この記事では、これらのジレンマに関連するさまざまなトピックについて説明します。
ru: Вы когда-нибудь задумывались, следует ли подходить к проблеме X со стратегией Y или Z? В этой статье рассматриваются различные темы, связанные с этими дилеммами.

source: Loading vs. preloading
ja: ロード(load) 対 プリロード(preload)
ru: Загрузка и предварительная загрузка

source: In GDScript, there exists the global :ref:`preload <class_@GDScript_method_preload>` method. It loads resources as early as possible to front-load the "loading" operations and avoid loading resources while in the middle of performance-sensitive code.
ja: GDScript には、グローバル :ref:`preload <class_@GDScript_method_preload>` メソッドが存在します。"読み込み" 処理を前もって行い、パフォーマンスに敏感なコードの途中で、リソースの読み込が発生することを回避するために、できるだけ早くリソースを読み込みます。
ru: В GDScript существует глобальный метод :ref:`preload <class_ @ GDScript_method_preload>`. Он загружает ресурсы как можно раньше, чтобы предварительно загрузить «загрузочные» операции и избежать загрузки ресурсов в середине кода, чувствительного к производительности.

source: So, when exactly does preloading occur versus loading, and when should one use either? Let's see an example:
ja: それでは、load と比較して preload が発生するのは正確にはいつですか？例を見てみましょう:
ru: Итак, когда именно происходит предварительная загрузка во время загрузки и когда следует ее использовать? Посмотрим на пример:

source: Preloading allows the script to handle all the loading the moment one loads the script. Preloading is useful, but there are also times when one doesn't wish for it. To distinguish these situations, there are a few things one can consider:
ja: preload により、スクリプトは、スクリプトを読み込んだ瞬間にすべての読み込みを処理できます。preload は便利ですが、それを望まない場合もあります。これらの状況を区別するために、考慮できることがいくつかあります。
ru: Предварительная загрузка позволяет сценарию обрабатывать всю загрузку в момент загрузки сценария. Предварительная загрузка полезна, но бывают случаи, когда этого не хочется. Чтобы различать эти ситуации, следует учесть несколько вещей:

source: If one cannot determine when the script might load, then preloading a resource, especially a scene or script, could result in further loads one does not expect. This could lead to unintentional, variable-length load times on top of the original script's load operations.
ja: スクリプトがいつロードされるかを判断できない場合、リソース、特にシーンまたはスクリプトをプリロードすると、予期しない追加のロードが発生する可能性があります。これにより、元のスクリプトのロード操作に加えて、意図しない可変長のロード時間が発生する可能性があります。
ru: Если невозможно определить, когда может загрузиться сценарий, то предварительная загрузка ресурса, особенно сцены или сценария, может привести к дальнейшим загрузкам, которых нельзя было ожидать. Это может привести к непреднамеренной загрузке переменной длины поверх операций загрузки исходного сценария.

source: If something else could replace the value (like a scene's exported initialization), then preloading the value has no meaning. This point isn't a significant factor if one intends to always create the script on its own.
ja: シーンのエクスポートされた初期化など、他の何かが値を置き換えることができる場合、値をプリロードしても意味がありません。スクリプトを常に独自に作成する場合、この点は重要な要素ではありません。
ru: Если что-то еще может заменить значение (например, экспортированная инициализация сцены), то предварительная загрузка значения не имеет смысла. Этот момент не является существенным фактором, если кто-то намеревается всегда создавать сценарий самостоятельно.

source: If one wishes only to 'import' another class resource (script or scene), then using a preloaded constant is often the best course of action. However, in exceptional cases, one my wish not to do this:
ja: 別のクラスリソース(スクリプトまたはシーン)のみを「インポート」したい場合は、多くの場合、プリロードされた定数を使用することが最善のアクションです。ただし、例外的なケースでは、これを行いたくない場合もあります:

source: If the 'imported' class is liable to change, then it should be a property instead, initialized either using an ``export`` or a ``load`` (and perhaps not even initialized until later).
ja: 'imported' クラスが変更される可能性がある場合は、代わりにプロパティとして ``export`` または ``load`` を使用して初期化する必要があります(そして、後で初期化されることはありません)。
ru: Если 'импортированный' класс подлежит изменению, то вместо этого он должен быть свойством, инициализированным либо с помощью ``export``, либо ``load`` (и, возможно, даже не инициализированного позже).

source: If the script requires a great many dependencies, and one does not wish to consume so much memory, then one may wish to, load and unload various dependencies at runtime as circumstances change. If one preloads resources into constants, then the only way to unload these resources would be to unload the entire script. If they are instead loaded properties, then one can set them to ``null`` and remove all references to the resource entirely (which, as a :ref:`Reference <class_Reference>`-extending type, will cause the resources to delete themselves from memory).
ja: スクリプトが非常に多くの依存関係を必要とし、あまり多くのメモリを消費したくない場合、状況の変化に応じて実行時にさまざまな依存関係をロードおよびアンロードすることができます。リソースを定数にプリロードする場合、これらのリソースをアンロードする唯一の方法は、スクリプト全体をアンロードすることです。それらが代わりにプロパティとしてロードされた場合、それらを ``null`` に設定し、リソースへのすべての参照を完全に削除できます(これは :ref:`Reference <class_Reference>` 拡張型として、リソースがメモリから自分自身を削除します)。
ru: Если для сценария требуется очень много зависимостей, и кто-то не желает расходовать так много памяти, то может потребоваться загружать и выгружать различные зависимости во время выполнения по мере изменения обстоятельств. Если предварительно загрузить ресурсы в константы, то единственный способ выгрузить эти ресурсы — это выгрузить весь сценарий. Если вместо этого они загружают свойства, то можно установить для них значение `` null `` и полностью удалить все ссылки на ресурс (что, как расширяющийся тип :ref:`Reference <class_Reference>`, приведет к самоудалению ресурсов из памяти).

source: Large levels: static vs. dynamic
ja: 大きなレベル(ステージ): 静的レベル 対 動的レベル
ru: Большие уровни: статические против динамических

source: If one is creating a large level, which circumstances are most appropriate? Should they create the level as one static space? Or should they load the level in pieces and shift the world's content as needed?
ja: 大きなレベルを作成している場合、どの状況が最も適切ですか？レベルを1つの静的な空間として作成する必要がありますか？または、レベルを断片的にロードし、必要に応じてワールドのコンテンツをシフトする必要がありますか？
ru: Если кто-нибудь создает большой уровень, какие обстоятельства являются самыми подходящими? Должны ли они создавать уровень как одно статичное пространство? Или они должны загружать уровень по частям и перемещать содержимое мира по мере необходимости?

source: Well, the simple answer is , "when the performance requires it." The dilemma associated with the two options is one of the age-old programming choices: does one optimize memory over speed, or vice versa?
ja: そうですね、簡単な答えは、「パフォーマンスにそれが必要な場合」です。2つのオプションに関連するジレンマは、昔からのプログラミングの選択肢の1つです: 例えば次のような。速度よりメモリの最適化を優先するか、それとも逆か？
ru: Что ж, простой ответ: «когда этого требует производительность». Дилемма, связанная с этими двумя вариантами, является одним из старых вопросов программирования: оптимизировать ли память вместо скорости или наоборот?

source: The naive answer is to use a static level that loads everything at once. But, depending on the project, this could consume a large amount of memory. Wasting users' RAM leads to programs running slow or outright crashing from everything else the computer tries to do at the same time.
ja: 素朴な答えは、すべてを一度にロードする静的レベルを使用することです。ただし、プロジェクトによっては、大量のメモリを消費する可能性があります。ユーザーのRAMを浪費すると、コンピュータが同時に実行しようとする他のすべてのプログラムが、低速化または完全にクラッシュしてしまいます。
ru: Наивный ответ - использовать статический уровень, который загружает все сразу. Но, в зависимости от проекта, это может потреблять большой объем памяти. Исчерпание оперативной памяти пользователей приводит к тому, что программы работают медленно или полностью вылетают из-за всего остального, что компьютер пытается делать одновременно.

source: No matter what, one should break larger scenes into smaller ones (to aid in reusability of assets). Developers can then design a node that manages the creation/loading and deletion/unloading of resources and nodes in real-time. Games with large and varied environments or procedurally generated elements often implement these strategies to avoid wasting memory.
ja: 何があっても、大きなシーンを小さなシーンに分割する必要があります(資産の再利用性を高めるため)。開発者は、リソースとノードの作成/ロード、削除/アンロードをリアルタイムで管理するノードを設計できます。大規模で多様な環境や手続き的に生成された要素を持つゲームは、多くの場合、メモリの無駄を避けるためにこれらの戦略を実装します。
ru: Несмотря ни на что, нужно разбивать большие сцены на более мелкие (чтобы способствовать повторному использованию ресурсов). Затем разработчики могут проектировать узел, который управляет созданием/загрузкой и удалением/выгрузкой ресурсов и узлов в режиме реального времени. Игры с большими и разнообразными средами или процедурно генерируемыми элементами часто реализуют эти стратегии, чтобы избежать траты памяти.

source: On the flip side, coding a dynamic system is more complex, i.e. uses more programmed logic, which results in opportunities for errors and bugs. If one isn't careful, they can develop a system that bloats the technical debt of the application.
ja: 裏を返せば、動的システムのコーディングはより複雑です。つまり、より多くのプログラムされたロジックを使用するため、エラーやバグが発生する可能性があります。注意しないと、アプリケーションの技術的負債を膨らませるシステムを開発してしまいます。
ru: С другой стороны, кодирование динамической системы является более сложным, т.к. использует больше программируемой логики, которая приводит к возможностям для ошибок и багов. Если кто-то не будет осторожен, они могут разработать систему, которая раздувает технический долг приложения.

source: As such, the best options would be...
ja: そのため、最良のオプションは...
ru: Таким образом, лучшими вариантами были бы ...

source: To use a static level for smaller games.
ja: 小さなゲームには静的レベルを使用する。
ru: Использовать статические уровни для небольших игр.

source: If one has the time/resources on a medium/large game, create a library or plugin that can code the management of nodes and resources. If refined over time, so as to improve usability and stability, then it could evolve into a reliable tool across projects.
ja: 中規模または大規模のゲームでは、時間/リソースが確保できる場合は、ノードとリソースの管理をコーディングできるライブラリまたはプラグインを作成します。使いやすさと安定性を改善するために時間の経過とともに改良されれば、プロジェクト全体で信頼性の高いツールに進化する可能性があります。
ru: Если у вас есть время / ресурсы для средней / большой игры, создайте библиотеку или плагин, который может кодировать управление узлами и ресурсами. Если со временем доработать, чтобы улучшить удобство использования и стабильность, то он может превратиться в надежный инструмент для всех проектов.

source: Code the dynamic logic for a medium/large game because one has the coding skills, but not the time or resources to refine the code (game's gotta get done). Could potentially refactor later to outsource the code into a plugin.
ja: コーディングスキルはあるが、コードを絞り込むための時間やリソースは持っていないため、中規模/大規模ゲームの動的ロジックをコーディングします(ゲームを完成させる必要があるので)。後でリファクタリングして、コードをプラグインにアウトソースできます。
ru: Кодируйте динамическую логику для средней / большой игры, потому что у вас есть навыки кодирования, но нет времени или ресурсов для уточнения кода (игра должна быть завершена). Позже потенциально можно провести рефакторинг, чтобы передать код в плагин.

source: For an example of the various ways one can swap scenes around at runtime, please see the :ref:`"Change scenes manually" <doc_change_scenes_manually>` documentation.
ja: 実行時にシーンを入れ替えるさまざまな方法の例については、\ :ref:`「手動でシーンを変更する」 <doc_change_scenes_manually>` ドキュメントを参照してください。
ru: Примеры различных способов, которыми можно менять местами сцены во время выполнения, можно найти в документации :ref:`«Изменить сцены вручную» <doc_change_scenes_manually>`.

source: Its counterpart, the :ref:`load <class_@GDScript_method_load>` method, loads a resource only when it reaches the load statement. That is, it will load a resource in-place which can cause slowdowns when it occurs in the middle of sensitive processes. The ``load`` function is also an alias for :ref:`ResourceLoader.load(path) <class_ResourceLoader_method_load>` which is accessible to *all* scripting languages.
ru: Его аналог, метод :ref:`load <class_ @ GDScript_method_load>`, загружает ресурс только тогда, когда он достигает оператора load. То есть он загрузит ресурс на месте, что может вызвать замедление, когда это произойдет в середине важных процессов. Функция ``load`` также является псевдонимом для :ref:`ResourceLoader.load(path) <class_ResourceLoader_method_load>`, который доступен для *всех* языков сценариев.
