Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/node_alternatives.po
Languages: ru, zh_cn

source: When and how to avoid using nodes for everything
ru: Когда и как избежать использования узлов для всего
zh_cn: 何时以及如何避免为任何事情使用节点

source: Nodes are cheap to produce, but even they have their limits. A project may have tens of thousands of nodes all doing things. The more complex their behavior though, the larger the strain each one adds to a project's performance.
ru: Узлы дёшевы в производстве, но даже они имеют свои пределы. В проекте могут быть десятки тысяч узлов, которые всё делают. Однако чем сложнее их поведение, тем большее напряжение они вносят в работу проекта.
zh_cn: 节点产生成本低廉, 但是它们也有一定的局限性. 一个项目可能有成千上万个节点在做所有事情. 他们的行为越复杂, 每个节点对项目性能增加的压力就越大.

source: Godot provides more lightweight objects for creating APIs which nodes use. Be sure to keep these in mind as options when designing how you wish to build your project's features.
ru: Godot предоставляет более лёгкие объекты для создания API, которые используют узлы. Обязательно помните об этом как о вариантах при разработке того, как вы хотите построить функции своего проекта.
zh_cn: Godot为创建节点使用的API, 提供了更轻量级的对象. 在设计如何构建项目的特性时, 请务必将这些作为选项牢记在心.

source: :ref:`Object <class_Object>`: The ultimate lightweight object, the original Object must use manual memory management. With that said, it isn't too difficult to create one's own custom data structures, even node structures, that are also lighter than the :ref:`Node <class_Node>` class.
ru: :ref:`Object <class_Object>`: Максимальный лёгкий объект, исходный объект должен использовать ручное управление памятью. С учётом сказанного, нетрудно создать свои собственные структуры данных, даже структуры узлов, которые также легче, чем класс :ref:`Node <class_Node>`.
zh_cn: :ref:`Object <class_Object>`: 终极轻量级对象, 原始对象必须使用手动内存管理. 尽管如此, 创建自己的自定义数据结构并不难, 甚至于节点结构, 也比 :ref:`Node <class_Node>` 类更轻.

source: **Example:** See the :ref:`Tree <class_Tree>` node. It supports a high level of customization for a table of content with an arbitrary number of rows and columns. The data that it uses to generate its visualization though is actually a tree of :ref:`TreeItem <class_TreeItem>` Objects.
ru: **Пример:** Смотрите узел :ref:`Tree <class_Tree>`. Он поддерживает высокий уровень настройки для таблицы содержимого с произвольным количеством строк и столбцов. Данные, которые он использует для создания своей визуализации, на самом деле представляют собой дерево объектов :ref:`TreeItem <class_TreeItem>`.
zh_cn: **示例** : 参见 :ref:`Tree <class_Tree>` 节点. 它支持对, 具有任意行数和列数的内容表, 进行高级定制. 用来生成可视化的数据实际上是 :ref:`TreeItem <class_TreeItem>` 对象的树.

source: **Advantages:** Simplifying one's API to smaller scoped objects helps improve its accessibility improve iteration time. Rather than working with the entire Node library, one creates an abbreviated set of Objects from which a node can generate and manage the appropriate sub-nodes.
ru: **Преимущества:** Упрощение API для объектов с меньшей областью видимости помогает улучшить его доступность, сократить время итерации. Вместо того, чтобы работать со всей библиотекой узла, создаётся сокращенный набор объектов, из которых узел может генерировать соответствующие подузлы и управлять ими.
zh_cn: **优点:** 将一个人的API简化为较小范围的对象, 有助于提高其可访问性, 改善迭代时间. 与其使用整个Node库, 不如创建一组简略的Objects, 节点可以从这些Objects中生成和管理相应的子节点.

source: One should be careful when handling them. One can store an Object into a variable, but these references can become invalid without warning. For example, if the object's creator decides to delete it out of nowhere, this would trigger an error state when one next accesses it.
ru: С ними нужно быть осторожным. Можно сохранить объект в переменной, но эти ссылки могут стать недействительными без предупреждения. Например, если создатель объекта решит удалить его из ниоткуда, это вызовет состояние ошибки при следующем доступе к нему.
zh_cn: 处理它们时要小心. 可以将 ``Object`` 存储到变量中, 但是这些引用可能在没有警告的情况下失效. 例如, 如果对象的创建者决定删除它, 这将在下一次访问时, 触发错误状态.

source: :ref:`Reference <class_Reference>`: Only a little more complex than Object. They track references to themselves, only deleting loaded memory when no further references to themselves exist. These are useful in the majority of cases where one needs data in a custom class.
ru: :ref:`Reference <class_Reference>`: Немного сложнее, чем Object. Они отслеживают ссылки на самих себя, удаляя загруженную память только в том случае, если больше не существует ссылок на себя. Они полезны в большинстве случаев, когда нужны данные в настраиваемом классе.
zh_cn: :ref:`Reference <class_Reference>`: 只比Object更复杂一点. 它们跟踪对自己的引用, 只有当对自己没有另外的引用存在时, 才会删除加载的内存. 在大多数需要在自定义类中获取数据的情况下, 很有用.

source: **Example:** See the :ref:`File <class_File>` object. It functions just like a regular Object except that one need not delete it themselves.
ru: **Пример:** Смотрите объект :ref:`File <class_File>`. Он работает так же, как обычный объект, за исключением того, что его не нужно удалять.
zh_cn: **示例** 参见 :ref:`File <class_File>` 对象. 它的功能就像普通 ``Object`` 一样, 只是不需要人为删除它.

source: **Advantages:** same as the Object.
ru: **Преимущества:** такие же, как и у объекта.
zh_cn: **优势:** 与 ``Object`` 相同.

source: :ref:`Resource <class_Resource>`: Only slightly more complex than Reference. They have the innate ability to serialize/deserialize (i.e. save and load) their object properties to/from Godot resource files.
ru: :ref:`Resource <class_Resource>`: Немного сложнее, чем Reference. У них есть врожденная способность сериализовать/десериализовать (т.е. сохранять и загружать) свойства своих объектов в/из файлов ресурсов Godot.
zh_cn: :ref:`Resource <class_Resource>`: 只比 ``Reference`` 稍微复杂一点. 它们天然具有将其对象属性, 序列化和反序列化Godot资源文件的能力(即保存和加载).

source: **Example:** Scripts, PackedScene (for scene files), and other types like each of the :ref:`AudioEffect <class_AudioEffect>` classes. Each of these can be save and loaded, therefore they extend from Resource.
ru: **Пример:** Scripts, PackedScene (для файлов сцены) и другие типы, например каждый из классов :ref:`AudioEffect <class_AudioEffect>`. Каждый из них может быть сохранён и загружен, поэтому они происходят из Resource.
zh_cn: **示例** : 脚本, ``PackedScene`` (用于场景文件), 以及其他类型, 比如 :ref:`AudioEffect <class_AudioEffect>` 类. 每一个都可以保存和加载, 因此它们从 ``Resource`` 扩展.

source: **Advantages:** Much has :ref:`already been said <doc_resources>` on :ref:`Resource <class_Resource>`'s advantages over traditional data storage methods. In the context of using Resources over Nodes though, their main advantage is in Inspector-compatibility. While nearly as lightweight as Object/Reference, they can still display and export properties in the Inspector. This allows them to fulfill a purpose much like sub-Nodes on the usability front, but also improve performance if one plans to have many such Resources/Nodes in their scenes.
ru: **Преимущества:** Многое :ref:`уже было сказано <doc_resources>` о преимуществах :ref:`Resource <class_Resource>`перед традиционными методами хранения данных. Однако в контексте использования ресурсов перед узлами их главное преимущество заключается в совместимости с Inspector. Хотя они почти такие же лёгкие, как Object/Reference, они всё же могут отображать и экспортировать свойства в Inspector. Это позволяет им выполнять задачу, во многом схожую с подузлами с точки зрения удобства использования, но также повышает производительность, если кто-то планирует иметь много таких ресурсов/узлов в своих сценах.
zh_cn: **优势** : 关于 :ref:`Resource <class_Resource>` 与传统数据存储方法相比的优势, :ref:`已经说了 <doc_resources>` 很多. 然而, 通过 ``Node`` 使用 ``Resource`` 的上下文, 它们的主要优点是在属性检查器的兼容性方面. 虽然几乎和 ``Object/Reference`` 一样轻量级, 它们仍然可以在属性检查器中显示和导出属性. 这使他们可以实现, 与可用性方面的子节点非常相似的目的, 而且如果计划在其场景中, 拥有许多此类 ``Resource/Node``, 还可以提高性能.
