Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/getting_started/workflow/best_practices/what_are_godot_classes.po
Languages: fr, zh_cn

source: Applying object-oriented principles in Godot
fr: Application des principes orientés objet dans Godot
zh_cn: 在Godot中应用面向对象的原则

source: The engine offers two main ways to create reusable objects: scripts and scenes. Neither of these technically define classes under the hood.
fr: Le moteur offre deux principaux moyens de créer des objets réutilisables : les scripts et les scènes. Aucun de ces deux moyens ne définit techniquement des classes sous le capot.
zh_cn: 引擎提供了两种创建可重用对象的主要方式: 脚本和场景. 这两种方式在技术上都没有在引擎下定义类.

source: Still, many best practices using Godot involve applying object-oriented programming principles to the scripts and scenes that compose your game. That is why it's useful to understand how we can think of them as classes.
fr: Néanmoins, de nombreuses bonnes pratiques d'utilisation de Godot impliquent l'application des principes de la programmation orientée objet aux scripts et aux scènes qui composent votre jeu. C'est pourquoi il est utile de comprendre comment nous pouvons les considérer comme des classes.
zh_cn: 尽管如此, 使用Godot的许多最佳实践涉及到将面向对象的编程原则应用到组成你的游戏的脚本和场景中. 这就是为什么了解我们如何将它们视为类是很有用的.

source: This guide briefly explains how scripts and scenes work in the engine's core to help you understand how they work under the hood.
fr: Ce guide explique brièvement le fonctionnement des scripts et des scènes dans le noyau du moteur pour vous aider à comprendre comment ils fonctionnent sous le capot.
zh_cn: 本指南简要介绍了脚本和场景在引擎核心中的工作方式, 以帮助您了解它们在引擎中的工作方式.

source: How scripts work in the engine
fr: Comment les scripts fonctionnent dans le moteur
zh_cn: 脚本在引擎中的工作原理

source: The engine provides built-in classes like :ref:`Node <class_Node>`. You can extend those to create derived types using a script.
fr: Le moteur fournit des classes intégrées comme :ref:`Node <class_Node>`. Vous pouvez les étendre pour créer des types dérivés à l'aide d'un script.
zh_cn: 引擎提供了内置的类, 如 :ref:`Node <class_Node>` . 你可以使用脚本扩展这些类来创建派生类型.

source: These scripts are not technically classes. Instead, they are resources that tell the engine a sequence of initializations to perform on one of the engine's built-in classes.
fr: Ces scripts ne sont pas techniquement des classes. Au lieu de cela, ce sont des ressources qui indiquent au moteur une séquence d’initialisations à effectuer sur l’une des classes intégrées du moteur.
zh_cn: 这些脚本在技术上不是类. 相反, 它们是告诉引擎在内置类中执行一系列初始化的资源.

source: Godot's internal classes have methods that register a class's data with a :ref:`ClassDB <class_ClassDB>`. This database provides runtime access to class information. ``ClassDB`` contains information about classes like:
fr: Les classes internes de Godot ont des méthodes qui enregistrent les données d'une classe avec un :ref:`ClassDB <class_ClassDB>`. Cette base de données fournit un accès runtime aux informations de classe. ``ClassDB`` contient des informations sur les classes comme :
zh_cn: Godot的内部类具有使用一个 :ref:`ClassDB <class_ClassDB>` 注册一个类数据的方法. 该数据库提供对类信息的运行时访问.``ClassDB`` 包含有关类的信息, 例如:

source: Properties.
fr: Propriétés.
zh_cn: 属性.

source: Methods.
fr: Méthodes.
zh_cn: 方法.

source: Constants.
fr: Constantes.
zh_cn: 常量.

source: Signals.
fr: Signaux.
zh_cn: 信号.

source: This ``ClassDB`` is what objects check against when performing an operation like accessing a property or calling a method. It checks the database's records and the object's base types' records to see if the object supports the operation.
fr: Ce ``ClassDB`` est ce que les objets vérifient quand ils exécutent une opération comme accéder à une propriété ou appeler une méthode. Il vérifie les enregistrements de la base de données et les enregistrements des types de base de l'objet pour voir si l'objet supporte l'opération.
zh_cn: 这个 ``ClassDB`` 是对象在执行访问属性或调用方法等操作时的检查对象. 它检查数据库的记录和对象的基本类型记录, 以确定对象是否支持该操作.

source: Attaching a :ref:`Script <class_Script>` to your object extends the methods, properties, and signals available from the ``ClassDB``.
fr: Attacher un :ref:`Script <class_Script>` à votre objet étend les méthodes, propriétés et signaux disponibles à partir de ``ClassDB``.
zh_cn: 将 :ref:`Script <class_Script>` 附加到你的对象中, 可以扩展 ``ClassDB`` 中的方法, 属性和信号.

source: Even scripts that don't use the ``extends`` keyword implicitly inherit from the engine's base :ref:`Reference <class_Reference>` class. As a result, you can instantiate scripts without the ``extends`` keyword from code. Since they extend ``Reference`` though, you cannot attach them to a :ref:`Node <class_Node>`.
fr: Même les scripts qui n'utilisent pas le mot-clé ``extends`` héritent implicitement de la classe de base du moteur :ref:`Reference <class_Reference>`. En conséquence, vous pouvez instancier des scripts sans le mot-clé ``extends`` du code. Mais comme ils étendent de ``Reference``, vous ne pouvez pas les attacher à une classe :ref:`Node <class_Node>`.
zh_cn: 即使是不使用 ``extends`` 关键字的脚本, 也会隐式地继承引擎的基础 :ref:`Reference <class_Reference>` 类. 因此, 你可以从代码中实例化脚本, 而无需使用 ``extends`` 关键字. 不过由于它们扩展了 ``Reference`` , 你不能把它们附加到一个 :ref:`Node <class_Node>` .

source: Scenes
fr: Les scènes
zh_cn: 场景

source: The behavior of scenes has many similarities to classes, so it can make sense to think of a scene as a class. Scenes are reusable, instantiable, and inheritable groups of nodes. Creating a scene is similar to having a script that creates nodes and adds them as children using ``add_child()``.
fr: Le comportement des scènes présente de nombreuses similitudes avec les classes, il peut donc être logique de considérer une scène comme une classe. Les scènes sont des groupes de nœuds réutilisables, instanciables et héritables. Créer une scène est similaire à avoir un script qui crée des nœuds et les ajoute comme des enfants en utilisant ``add_child()``.
zh_cn: 场景的行为与类有很多相似之处, 所以把场景看成一个类是有意义的. 场景是可重用, 可实例化, 可继承的节点组. 创建场景类似于有一个脚本, 创建节点并使用 ``add_child()`` 将其添加为子节点.

source: We often pair a scene with a scripted root node that makes use of the scene's nodes. As such, the scene is often an extension of the script's declarative code.
fr: Nous couplons souvent une scène avec un nœud racine scripté qui utilise les nœuds de la scène. En tant que telle, la scène est souvent une extension du code déclaratif du script.
zh_cn: 我们经常将场景与使用场景节点的脚本根节点配对. 因此, 场景通常是脚本声明性代码的扩展.

source: The content of a scene helps to define:
fr: Le contenu d'une scène aide à définir :
zh_cn: 场景的内容有助于定义:

source: What nodes are available to the script
fr: Quels nœuds sont disponibles pour le script
zh_cn: 脚本可使用哪些节点

source: How they are organized
fr: Comment ils sont organisés
zh_cn: 它们是如何组织的

source: How they are initialized
fr: Comment ils sont initialisés
zh_cn: 它们是如何初始化的

source: What signal connections they have with each other
fr: Quelles connections signal elles ont, les une avec les autres
zh_cn: 它们彼此之间有什么信号连接

source: Why is any of this important to scene organization? Because instances of scenes *are* objects. As a result, many object-oriented principles that apply to written code also apply to scenes: single responsibility, encapsulation, and others.
fr: Pourquoi l'organisation de la scène est-elle si importante ? Parce que les instances de scènes *sont* des objets. Par conséquent, de nombreux principes orientés objet qui s'appliquent au code écrit s'appliquent également aux scènes : responsabilité unique, encapsulation, et autres.
zh_cn: 为什么这些对场景组织很重要？因为场景的实例 *是* 对象. 因此, 许多适用于书写代码的面向对象原则也适用于场景: 单一职责, 封装等.

source: The scene is *always an extension of the script attached to its root node*, so you can interpret it as part of a class.
fr: La scène est *toujours une extension du script attaché à son noeud racine*, vous pouvez donc l'interpréter comme faisant partie d'une classe.
zh_cn: 场景 *总是脚本的延伸, 附着在它的根节点上* , 所以你可以把它解释为一个类的一部分.

source: Most of the techniques explained in this best practices series build on this point.
fr: La plupart des techniques expliquées dans cette série de bonnes pratiques s'appuient sur ce point.
zh_cn: 此系列最佳实践中所解释的大部分技术都建立在这一点上.
