Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: es, fr, ja, uk, zh_cn

source: Matrices and transforms
es: Matrices y transformaciones
fr: Les matrices et les transformations
ja: 行列と変換
uk: Матриці та перетворення
zh_cn: 矩阵与变换

source: Introduction
es: Introducción
ja: はじめに
uk: Вступ
zh_cn: 前言

source: Before reading this tutorial, we recommend that you thoroughly read and understand the :ref:`doc_vector_math` tutorial, as this tutorial requires a knowledge of vectors.
es: Antes de leer este tutorial, recomendamos leer y entender el tutorial anterior :ref:`doc_vector_math`, ya que éste requiere conocimiento sobre vectores.
fr: Avant de lire ce tutoriel, nous vous recommandons de lire attentivement et de comprendre le tutoriel :ref:`doc_vector_math`, car ce tutoriel nécessite une connaissance des vecteurs.
ja: このチュートリアルを読むには、まずベクトルの知識が必要なので、\ :ref:`doc_vector_math` チュートリアルをよく読んで理解することをお勧めします。
uk: Перед тим як читати цю статтю, радимо вам пройти урок :ref:`doc_vector_math`так як вам потрібно знати базові концепції векторів щоб зрозуміти цю статтю.
zh_cn: 在阅读本教程之前，我们推荐你从头到尾阅读并且理解 :ref:`doc_vector_math` 教程，因为本教程需要一点向量的知识。

source: This tutorial is about *transformations* and how we represent them in Godot using matrices. It is not a full in-depth guide to matrices. Transformations are most of the time applied as translation, rotation, and scale, so we will focus on how to represent those with matrices.
es: Este tutorial trata sobre las *transformaciones* y cómo las representamos en Godot usando matrices. No es una guía completa y detallada de las matrices. Las transformaciones se aplican la mayoría de las veces como traslación, rotación y escala, por lo que nos centraremos en cómo representarlas con matrices.
fr: Ce tutoriel traite des *transformations* et de la façon dont nous les représentons dans Godot à l'aide de matrices. Il ne s'agit pas d'un guide complet et approfondi sur les matrices. Les transformations sont la plupart du temps appliquées sous forme de translation, de rotation et de mise à l'échelle. Nous nous concentrerons donc sur la façon de représenter celles-ci à l'aide de matrices.
ja: このチュートリアルでは、*変換*と、行列を使用してGodotでそれらを表現する方法について説明します。行列の詳細なガイドではありません。変換はほとんどの場合、平行移動、回転、スケールとして適用されるため、これらを行列で表現する方法に焦点を当てます。
uk: Ця стаття розповідає про *перетворення* та про те, як ми представляємо їх у Godot за допомогою матриць. Це не є поглиблений посібник з матриць. Перетворення в основному застосовуються для переміщення, обертання та масштабування, тому ми зосередимося на тому, як це робити за допомогою матриць.
zh_cn: 这个教程介绍的是\ *变换*\ 以及我们如何在 Godot 中使用矩阵表示它。这不是完整深入的矩阵指南。变换大多数时候被应用为平移、旋转、缩放，所以我们将会关注如何用矩阵表示这些变换。

source: Most of this guide focuses on 2D, using :ref:`class_Transform2D` and :ref:`class_Vector2`, but the way things work in 3D is very similar.
es: La mayor parte de esta guía se centra en el 2D, usando :ref:`class_Transform2D` y :ref:`class_Vector2`, pero la forma en que funcionan las cosas en el 3D es muy similar.
fr: La majeure partie de ce guide se concentre sur la 2D, en utilisant :ref:`class_Transform2D` et :ref:`class_Vector2`, mais la façon dont les choses fonctionnent en 3D est très similaire.
ja: このガイドのほとんどは、\ :ref:`class_Transform2D` と :ref:`class_Vector2` を使用して2Dに焦点を当てていますが、3Dでの動作は非常に似ています。
uk: Більша частина цього посібника зосереджена на 2D і використовує :ref:`class_Transform2D` та :ref:`class_Vector2`, але перетворення в 3D працюють схожим чином.
zh_cn: 虽然这个指南主要关注于 2D，使用 :ref:`class_Transform2D` 和 :ref:`class_Vector2`\ ，但是 3D 中的工作方式也十分相似。

source: As mentioned in the previous tutorial, it is important to remember that in Godot, the Y axis points *down* in 2D. This is the opposite of how most schools teach linear algebra, with the Y axis pointing up.
es: Como se mencionó en el tutorial anterior, es importante recordar que en Godot, el eje Y apunta *abajo* en 2D. Esto es lo opuesto a como la mayoría de las escuelas enseñan álgebra lineal, con el eje Y apuntando hacia arriba.
fr: Comme mentionné dans le précédent tutoriel, il est important de se rappeler que dans Godot, l'axe Y pointe *vers le bas* en 2D. C'est le contraire de la façon dont la plupart des écoles enseignent l'algèbre linéaire, avec l'axe Y pointant vers le haut.
ja: 前のチュートリアルで述べたように、Godotでは、Y軸が2Dで *下* を指していることに注意することが重要です。これは、ほとんどの学校が線形代数を教える方法の反対で、学校の授業ではY軸は上向きです。
uk: Як згадувалося в попередній статті, важливо пам'ятати, що в Godot, у 2D, вісь Y вказує *вниз*. На відміну від шкільного курсу лінійної алгебри, де вісь Y вказує вгору.
zh_cn: 正如之前的教程中提到的，要记住在 Godot 中，2D 的 Y 轴是\ *向下*\ 的。这与学校里教的线性代数正好相反，在那里 Y 轴是向上的。

source: The convention is that the X axis is red, the Y axis is green, and the Z axis is blue. This tutorial is color-coded to match these conventions, but we will also represent the origin vector with a blue color.
es: La convención es que el eje X es rojo, el eje Y es verde y el eje Z es azul. Este tutorial está codificado por colores para coincidir con estas convenciones, pero también representaremos el vector de origen con un color azul.
fr: La convention est que l'axe X est rouge, l'axe Y est vert et l'axe Z est bleu. Ce tutoriel est codé par couleur pour correspondre à ces conventions, mais nous allons également représenter le vecteur d'origine avec une couleur bleue.
ja: 慣例では、X軸は赤、Y軸は緑、Z軸は青です。このチュートリアルは、これらの規則に合わせて色分けされていますが、原点ベクトルも青色で表します。
uk: Умовність полягає в тому, що вісь X - червона, вісь Y - зелена, а вісь Z - синя. Ця стаття буде використовувати колір відповідно до цієї умовності, але синім кольором ми також будемо малювати вектор походження.
zh_cn: 这里的惯例是 X 轴用红色、Y 轴用绿色、Z 轴用蓝色。本教程中的颜色都遵循这个惯例，不过我们也在原点向量上使用蓝色。

source: Matrix components and the Identity matrix
es: Componentes de la matriz y la matriz de Identidad
fr: Composantes de la matrice et matrice d'identité
ja: 行列成分と単位行列
uk: Компоненти матриці та Матриця Ідентичності
zh_cn: 矩阵分量和单位矩阵

source: The identity matrix represents a transform with no translation, no rotation, and no scale. Let's start by looking at the identity matrix and how its components relate to how it visually appears.
es: La matriz de identidad representa una transformación sin traslación, sin rotación y sin escala. Empecemos por mirar la matriz de identidad y cómo sus componentes se relacionan con la forma en que aparece visualmente.
fr: La matrice d'identité représente une transformation sans translation, sans rotation et sans mise à échelle. Commençons par regarder la matrice d'identité et comment ses composants sont liés à la façon dont elle apparaît visuellement.
ja: 単位行列は、平行移動、回転、スケールのないtransformを表します。単位行列と、その成分が視覚的にどのように表示されるかを確認することから始めましょう。
uk: Матриця ідентичності - це перетворення без переміщення, обертання і масштабування. Почнемо з погляду на матрицю ідентичності і на те, як її компоненти пов'язані з тим, як вона візуально проявляється.
zh_cn: 单位矩阵代表一个没有平移、没有旋转、没有缩放的变换。让我们开始看看单位矩阵以及它的分量如何与它的视觉表现相联系吧。

source: Matrices have rows and columns, and a transformation matrix has specific conventions on what each does.
es: Las matrices tienen filas y columnas, y una matriz de transformación tiene convenciones específicas sobre lo que hace cada una.
fr: Les matrices ont des lignes et des colonnes, et une matrice de transformation a des conventions spécifiques sur ce que chacune fait.
ja: 行列には行と列があり、変換行列にはそれぞれの動作に関する特定の規則があります。
uk: Матриці мають рядки та стовпці, а матриця перетворення має конкретні умовності щодо того, що робить кожен з них.
zh_cn: 矩阵有行和列，变换矩阵对它们有特定的约定。

source: In the image above, we can see that the red X vector is represented by the first column of the matrix, and the green Y vector is likewise represented by the second column. A change to the columns will change these vectors. We will see how they can be manipulated in the next few examples.
es: En la imagen de arriba, podemos ver que el vector X rojo está representado por la primera columna de la matriz, y el vector Y verde está igualmente representado por la segunda columna. Un cambio en las columnas cambiará estos vectores. Veremos cómo pueden ser manipulados en los próximos ejemplos.
fr: Dans l'image ci-dessus, nous pouvons voir que le vecteur X rouge est représenté par la première colonne de la matrice, et le vecteur Y vert est également représenté par la deuxième colonne. Une modification des colonnes modifiera ces vecteurs. Nous verrons comment ils peuvent être manipulés dans les quelques exemples suivants.
ja: 上の画像では、赤のXベクトルは行列の最初の列で表され、緑のYベクトルは同様に2番目の列で表されています。列を変更すると、これらのベクトルが変更されます。次のいくつかの例で、それらの操作方法を説明します。
uk: На зображенні вище ми бачимо, що червоний вектор X представлений першим стовпцем матриці, а зелений вектор Y - представлений другим стовпцем. Зміна стовпців змінить ці вектори. Ми побачимо, як ними можна маніпулювати в наступних прикладах.
zh_cn: 在上图中，我们可以看到红色的 X 向量由矩阵的第一列表示，绿色的 Y 向量则由第二列表示。改变列就会改变这些向量。我们将在接下来的几个例子中看到如何操作它们。

source: You should not worry about manipulating rows directly, as we usually work with columns. However, you can think of the rows of the matrix as showing which vectors contribute to moving in a given direction.
es: No debes preocuparte por manipular las filas directamente, ya que normalmente trabajamos con columnas. Sin embargo, se puede pensar en las filas de la matriz como mostrando qué vectores contribuyen a moverse en una dirección determinada.
fr: Vous ne devez pas vous soucier de manipuler directement les lignes, car nous travaillons généralement avec les colonnes. Cependant, vous pouvez considérer les lignes de la matrice comme montrant quels vecteurs contribuent au déplacement dans une direction donnée.
ja: 通常は列を操作するため、行を直接操作することを心配する必要はありません。ただし、マトリックスの行は、特定の方向への移動に寄与するベクトルを示すものと考えることができます。
uk: Вам не варто чіплятися за безпосереднє маніпулювання рядками, бо зазвичай ми працюємо зі стовпцями. Однак ви можете думати про рядки матриці, як про вектори, які сприяють руху в заданому напрямку.
zh_cn: 您不必担心直接操作行, 因为我们通常使用列. 然而, 你可以把矩阵的行看作是表示哪些向量有助于在给定的方向上移动.

source: When we refer to a value such as `t.x.y`, that's the Y component of the X column vector. In other words, the bottom-left of the matrix. Similarly, `t.x.x` is top-left, `t.y.x` is top-right, and `t.y.y` is bottom-right, where `t` is the Transform2D.
es: Cuando nos referimos a un valor como `t.x.y`, ese es el componente Y del vector de la columna X. En otras palabras, la parte inferior izquierda de la matriz. De manera similar, `t.x.x` está arriba a la izquierda, `t.y.x` está arriba a la derecha, y `t.y.y` está abajo a la derecha, donde `t` es la Transform2D.
fr: Lorsque nous faisons référence à une valeur telle que `t.x.y`, c'est la composante Y du vecteur de la colonne X. En d'autres termes, la partie inférieure gauche de la matrice. De même, `t.x.x` est en haut à gauche, `t.y.x` est en haut à droite, et `t.y.y` est en bas à droite, où `t` est la Transform2D.
uk: Коли ми маємо на увазі таке значення, як *t.x.y*, то це векторний компонент Y зі стовпця X. Іншими словами, внизу зліва в матриці. Аналогічно, *t.x.x* - зверху зліва, *t.y.x* - зверху справа, а *t.y.y* - внизу справа, *t* - це перетворення Transform2D.
zh_cn: 当我们指定一个值例如 `t.x.y` , 这是X列向量的Y分量. 换句话说, 是这个矩阵的左下角. 类似地, `t.x.x` 是左上角, `t.y.x` 是右上角, 然后 `t.y.y` 是右下角, 在这里 `t` 是一个 Transform2D.

source: Scaling the transformation matrix
es: Escalando la matriz de transformación
fr: Mise à l'échelle de la matrice de transformation
ja: 変換行列のスケーリング
uk: Масштабування за допомогою матриці перетворення
zh_cn: 缩放变换矩阵

source: Applying a scale is one of the easiest operations to understand. Let's start by placing the Godot logo underneath our vectors so that we can visually see the effects on an object:
es: La aplicación de una escala es una de las operaciones más fáciles de entender. Empecemos colocando el logo de Godot debajo de nuestros vectores para que podamos ver los efectos en un objeto:
fr: L'application d'une mise à l'échelle est l'une des opérations les plus faciles à comprendre. Commençons par placer le logo Godot sous nos vecteurs afin de pouvoir voir visuellement les effets sur un objet :
ja: スケールの適用は、理解するのが最も簡単な操作の1つです。まず、ベクトルの下にGodotロゴを配置して、オブジェクトに対する効果を視覚的に確認できるようにします:
uk: Масштабування є однією з найпростіших для розуміння операцій. Почнемо з розміщення логотипу Godot під нашими векторами, щоб ми могли візуально бачити вплив на об'єкт:
zh_cn: 应用一个缩放是最容易理解的操作之一. 让我们开始吧, 把Godot logo放置于我们的向量之下, 这样我们可以直观得看出应用于这些对象上的效果:

source: Now, to scale the matrix, all we need to do is multiply each component by the scale we want. Let's scale it up by 2. 1 times 2 becomes 2, and 0 times 2 becomes 0, so we end up with this:
es: Ahora, para escalar la matriz, todo lo que tenemos que hacer es multiplicar cada componente por la escala que queremos. Escalémosla por 2. 1 por 2 se convierte en 2, y 0 por 2 se convierte en 0, así que terminamos con esto:
fr: Maintenant, pour mettre la matrice à l'échelle, il suffit de multiplier chaque élément par l'échelle que nous voulons. Augmentons l'échelle de 2. 1 fois 2 devient 2, et 0 fois 2 devient 0, donc nous obtenons ceci :
ja: 行列をスケーリングするために必要なことは、各成分に必要なスケールを乗算することだけです。 2倍に拡大しましょう。1 x 2が2になり、0 x 2が0になるため、次のようになります:
uk: Тепер, щоб масштабувати матрицю, все, що нам потрібно зробити, це помножити кожен компонент на потрібний масштаб. Давайте збільшимо його на 2. 1 помножити на 2 стає 2, а 0 помножити на 2 стає 0, тому ми в кінцевому підсумку отримуємо це:
zh_cn: 现在, 为了缩放矩阵, 我们唯一需要做的就是将每个矩阵分量乘以我们想要的缩放比例. 来将它缩放两倍吧,1乘以2变成了2,0乘以2变成了0, 所以我们最后得到了这个:

source: To do this in code, we can simply multiply each of the vectors:
es: Para hacerlo en código, podemos simplemente multiplicar cada uno de los vectores:
fr: Pour faire cela en code, on peut simplement multiplier chacun des vecteurs :
ja: コードでこれを行うには、各ベクトルを単純に乗算します:
uk: Для цього в коді можна просто помножити кожен вектор:
zh_cn: 要在代码中做到这件事. 我们可以简单地乘上每个向量:

source: If we wanted to return it to its original scale, we can multiply each component by 0.5. That's pretty much all there is to scaling a transformation matrix.
es: Si quisiéramos devolverlo a su escala original, podemos multiplicar cada componente por 0.5. Eso es más o menos todo lo que hay que hacer para escalar una matriz de transformación.
fr: Si nous voulions le ramener à son échelle initiale, nous pourrions multiplier chaque composante par 0,5. C'est à peu près tout ce qu'il y a à savoir pour mettre à l'échelle une matrice de transformation.
ja: 元のスケールに戻したい場合は、各成分に0.5を掛けます。変換行列のスケーリングはこれでほぼすべてです。
uk: Якби ми хотіли повернути його до початкового масштабу, ми могли б помножити кожен компонент на 0,5. Це майже все, що треба знати для масштабування матриці перетворення.
zh_cn: 如果我们想要回到它原来的尺度, 我们可以对每个分量乘以0.5. 这几乎就是缩放一个变换矩阵的全部了.

source: To calculate the object's scale from an existing transformation matrix, you can use `length()` on each of the column vectors.
es: Para calcular la escala del objeto a partir de una matriz de transformación existente, puedes usar `length()`` en cada uno de los vectores de la columna.
fr: Pour calculer l'échelle de l'objet à partir d'une matrice de transformation existante, vous pouvez utiliser `length()` sur chacun des vecteurs de colonne.
ja: 既存の変換行列からオブジェクトのスケールを計算するには、各列ベクトルで `length()` を使用できます。
uk: Щоб обчислити масштаб об'єкта з існуючої матриці перетворення, ви можете використовувати ``length()`` на кожному векторному стовпці.
zh_cn: 要从一个已经存在的变换矩阵中计算对象的缩放尺度, 你可以对每个列向量使用 `length()` 方法.

source: In actual projects, you can use the `scaled()` method to perform scaling.
es: En los proyectos reales, puedes usar el método `scaled()` para realizar el escalado.
fr: Dans les projets réels, vous pouvez utiliser la méthode `scaled()` pour effectuer une mise à l'échelle.
ja: 実際のプロジェクトでは、\ `scaled()` メソッドを使用してスケーリングを実行できます。
uk: У реальних проектах можна використовувати метод ``scaled()`` для виконання масштабування.
zh_cn: 在实际的项目中, 你可以使用 `scaled()` 方法去执行缩放.

source: Rotating the transformation matrix
es: Rotando la matriz de transformación
fr: Rotation de la matrice de transformation
ja: 変換行列の回転
uk: Обертання за допомогою матриці перетворення
zh_cn: 旋转变换矩阵

source: We'll start the same way as earlier, with the Godot logo underneath the identity matrix:
es: Empezaremos de la misma manera que antes, con el logo de Godot debajo de la matriz de identidad:
fr: Nous allons commencer de la même manière que précédemment, avec le logo Godot sous la matrice d'identité :
ja: 単位行列の下にGodotロゴを配置して、以前と同じ方法で開始します:
uk: Почнемо з того самого логотипу Godot під матрицею ідентичності:
zh_cn: 我们将以与前面相同的方式开始, 在标识矩阵下使用Godot徽标:

source: As an example, let's say we want to rotate our Godot logo clockwise by 90 degrees. Right now the X axis points right and the Y axis points down. If we rotate these in our head, we would logically see that the new X axis should point down and the new Y axis should point left.
es: Como ejemplo, digamos que queremos girar nuestro logo de Godot en el sentido de las agujas del reloj en 90 grados. Ahora mismo el eje X apunta a la derecha y el eje Y apunta hacia abajo. Si lo rotamos en nuestra cabeza, lógicamente veríamos que el nuevo eje X apunta hacia abajo y el nuevo eje Y hacia la izquierda.
fr: A titre d'exemple, disons que nous voulons faire pivoter notre logo Godot de 90 degrés dans le sens des aiguilles d'une montre. À l'heure actuelle, l'axe X pointe vers la droite et l'axe Y pointe vers le bas. Si nous les faisons pivoter dans notre tête, nous verrons logiquement que le nouvel axe X devrait pointer vers le bas et le nouvel axe Y vers la gauche.
ja: 例として、Godotロゴを時計回りに90度回転させたいとしましょう。現在、X軸は右向き、Y軸は下向きです。これらを頭の中で回転させると、論理的には新しいX軸が下を向き、新しいY軸が左を指すはずです。
uk: Припустимо, що ми хочемо повернути наш логотип за годинниковою стрілкою на 90 градусів. Зараз вісь X вказує праворуч, а вісь Y - вниз. Якщо ми уявімо їх поворот, то зрозуміємо, що нова вісь X повинна вказувати вниз, а нова вісь Y повинна вказувати ліворуч.
zh_cn: 举个例子，假设我们想顺时针旋转 Godot 标志 90 度。现在，X 轴指向右边，Y 轴向下。如果我们在头脑中旋转这些，我们就会在逻辑上看到，新的 X 轴应该向下，新的 Y 轴应该指向左边。

source: You can imagine that you grab both the Godot logo and its vectors, and then spin it around the center. Wherever you finish spinning, the orientation of the vectors determines what the matrix is.
es: Puedes imaginar que tomas el logo de Godot y sus vectores, y luego lo giras alrededor del centro. Dondequiera que termines de girar, la orientación de los vectores determina lo que es la matriz.
fr: Vous pouvez imaginer que vous saisissez à la fois le logo Godot et ses vecteurs, puis les tourner autour du centre. Où que vous finissiez la rotation, l'orientation des vecteurs détermine ce qu'est la matrice.
ja: Godotのロゴとそのベクトルの両方をつかみ、それを中央で回転させると想像できます。回転を終了するたびに、ベクトルの向きによって行列が決まります。
uk: Ви можете уявити собі, що ви хапаєте, і логотип Godot, і його вектори, а потім крутите його відносно центру. Де б ви не спинили обертатися, орієнтація векторів визначає матрицю.
zh_cn: 你可以想象, 你抓住了godot的图标和它的向量, 然后旋转它的中心. 无论你在哪里完成旋转, 向量的方向决定了矩阵是什么.

source: We need to represent "down" and "left" in normal coordinates, so means we'll set X to (0, 1) and Y to (-1, 0). These are also the values of `Vector2.DOWN` and `Vector2.LEFT`. When we do this, we get the desired result of rotating the object:
es: Necesitamos representar "abajo" e "izquierda" en coordenadas normales, lo que significa que pondremos X en (0, 1) e Y en (-1, 0). Estos son también los valores de `Vector 2.DOWN` y `Vector 2.LEFT`. Cuando hacemos esto, obtenemos el resultado deseado de rotar el objeto:
fr: Nous devons représenter "en bas" et "à gauche" en coordonnées normales, ce qui signifie que nous allons mettre X à (0, 1) et Y à (-1, 0). Ce sont également les valeurs de `Vector2.DOWN` et `Vector2.LEFT`. Lorsque nous faisons cela, nous obtenons le résultat souhaité de la rotation de l'objet :
ja: 通常の座標で「下」と「左」を表す必要があるため、Xを (0, 1)に、Yを (-1, 0)に設定します。これらは、\ `Vector2.DOWN` および `Vector2.LEFT` の値でもあります。これを行うと、オブジェクトを回転させるという望ましい結果が得られます:
uk: Нам потрібно представляти "низ" і "ліво" у звичайних координатах, тому це означає, що ми встановимо X у (0, 1) та Y у (-1, 0). Це також значення ``Vector2.DOWN`` і ``Vector2.LEFT``. Коли ми це зробимо, то отримаємо задуманий поворот об'єкта:
zh_cn: 我们需要在法线坐标中表示“下”和“左”，因此我们将 X 设为 (0, 1)，将 Y 设为 (-1, 0)。这些也正是 Vector2.DOWN 和 Vector2.LEFT 的值，当我们这样做时，就会得到旋转对象想要的结果：

source: If you have trouble understanding the above, try this exercise: Cut a square of paper, draw X and Y vectors on top of it, place it on graph paper, then rotate it and note the endpoints.
es: Si tiene problemas para entender lo anterior, intente este ejercicio: Corte un cuadrado de papel, dibuju los vectores X e Y encima de él, colócalo en un papel cuadriculado, luego gíralo y anota los puntos finales.
fr: Si vous avez du mal à comprendre ce qui précède, essayez cet exercice : Coupez un carré de papier, tracez des vecteurs X et Y par-dessus, placez-le sur du papier millimétré, puis faites-le tourner et notez les points d'extrémité.
uk: Якщо у вас виникли проблеми з розумінням вищесказаного, спробуйте таку вправу: Витніть з паперу квадрат, намалюйте на ньому вектори X і Y, помістіть його на розграфлений папір, потім поверніть його і занотуйте куди вказують вектори. *(Примітка перекладача: Напрям вверх має координати (0, -1), вправо - (1, 0), вниз - (0, 1), вліво - (-1, 0), при обертанні картинки її вектори змінюють напрямок у який вказують)*.
zh_cn: 如果你很难理解上面的内容, 那就试试这个练习: 剪一个正方形的纸, 在上面画X和Y向量, 把它放在图表纸上, 然后旋转它并记下端点.

source: To perform rotation in code, we need to be able to calculate the values programmatically. This image shows the formulas needed to calculate the transformation matrix from a rotation angle. Don't worry if this part seems complicated, I promise it's the hardest thing you need to know.
es: Para realizar la rotación en el código, necesitamos ser capaces de calcular los valores de forma programada. Esta imagen muestra las fórmulas necesarias para calcular la matriz de transformación desde un ángulo de rotación. No te preocupes si esta parte parece complicada, te prometo que es lo más difícil que necesitas saber.
fr: Pour effectuer une rotation en code, nous devons pouvoir calculer les valeurs via le programme. Cette image montre les formules nécessaires pour calculer la matrice de transformation à partir d'un angle de rotation. Ne vous inquiétez pas si cette partie vous semble compliquée, je vous promets que c'est la chose la plus difficile à savoir.
uk: Для виконання обертання в коді нам потрібно вміти обчислювати значення програмно. Це зображення показує формули, необхідні для обчислення матриці кута повороту. Не хвилюйтеся, якщо ця частина здається складною, я обіцяю, що це найважче, що вам потрібно знати.
zh_cn: 要在代码中执行旋转, 我们需要能够以编程方式计算值. 这幅图像显示了从旋转角度计算变换矩阵所需的公式. 如果这部分看起来很复杂, 别担心, 我保证这是你需要知道的最难的事情.

source: Godot represents all rotations with radians, not degrees. A full turn is `TAU` or `PI*2` radians, and a quarter turn of 90 degrees is `TAU/4` or `PI/2` radians. Working with `TAU` usually results in more readable code.
es: Godot representa todas las rotaciones con radianes, no grados. Un giro completo es `TAU` o `PI*2` radianes, y un cuarto de giro de 90 grados es `TAU/4` o `PI/2` radianes. Trabajar con `TAU` usualmente resulta en un código más legible.
fr: Godot représente toutes les rotations avec des radians, pas des degrés. Un tour complet est en radians `TAU` ou `PI*2`, et un quart de tour de 90 degrés est en radians `TAU/4` ou `PI/2`. Travailler avec `TAU` permet généralement d'obtenir un code plus lisible.
ja: Godotはすべての回転を度ではなくラジアンで表します。 1回転は `TAU` または `PI*2` ラジアンで、90度の4分の1回転は `TAU/4` または `PI/2` ラジアンです。\ `TAU` を使用すると、通常、コードが読みやすくなります。
uk: Godot представляє всі обертання в радіанах, а не градусах. Повний поворот рівний ``TAU``, або ``PI*2``, радіан, а чверть повороту, на 90 градусів, - ``TAU/4``, або ``PI/2`` радіан. Використання ``TAU`` зазвичай дає більш читабельний код.
zh_cn: Godot 用弧度表示所有的旋转，不用角度。完整转一圈是 `TAU` 或 `PI*2` 弧度，90 度的四分之一圈是 `TAU/4` 或 `PI/2` 弧度。使用 `TAU` 通常会让代码更易读。
