Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: es, fr, ja, uk, zh_cn

source: All child transformations are affected by the parent transformations. The child has a scale of (0.5, 0.5), so you would expect it to be a 1:1 ratio square, and it is, but only relative to the parent. The child's X vector ends up being (1, 0) in world space, because it is scaled by the parent's basis vectors. Similarly, the child node's `origin` vector is set to (1, 1), but this actually moves it (2, 1) in world space, due to the parent node's basis vectors.
es: Todas las transformaciones de los hijos se ven afectadas por las transformaciones de los padres. El hijo tiene una escala de (0.5, 0.5), por lo que se esperaría que fuera un cuadrado de proporción 1:1, y lo es, pero sólo en relación con el padre. El vector X del hijo termina siendo (1, 0) en el espacio mundial, porque está escalado por los vectores base del progenitor. De manera similar, el vector nodo hijo `origen` se establece en (1, 1), pero en realidad lo mueve (2, 1) en el espacio mundial, debido a los vectores base al nodo padre.
fr: Toutes les transformations des enfants sont affectées par les transformations des parents. L'enfant a une échelle de (0,5, 0,5), on s'attendrait donc à ce que ce soit un carré de rapport 1:1, et c'est le cas, mais seulement par rapport au parent. Le vecteur X de l'enfant finit par être (1, 0) dans l'espace mondial, car il est mis à l'échelle par les vecteurs de base du parent. De même, le vecteur `origin` du nœud enfant est fixé à (1, 1), mais il est en fait déplacé (2, 1) dans l'espace mondial, en raison des vecteurs de base du nœud parent.
ja: すべての子の変換は、親の変換の影響を受けます。子のスケールは(0.5, 0.5)であるため、1:1の比率の正方形であることが予想されますが、これは親に対してのみです。子のXベクトルは、親の基底ベクトルによってスケーリングされるため、ワールド空間で(1, 0)になります。同様に、子ノードの `origin` ベクトルは(1, 1)に設定されますが、親ノードの基底ベクトルにより、実際にはワールド空間の(2, 1)に移動します。
uk: Батьківські перетворення впливають на всі дитячі перетворення. Дитина має масштаб (0,5, 0,5), тому ви очікуєте, що це буде квадрат зі співвідношенням 1:1, і це так, але тільки відносно батька. Вектор X дитини в кінцевому підсумку знаходиться (1, 0) у світовому просторі, тому що він масштабується за основними векторами батька. Аналогічно, вектор походження дочірнього вузла встановлений на (1, 1), але це, фактично, рухає його на (2, 1) у світовому просторі через вектори батьківського вузла.
zh_cn: 所有子变换都受父变换的影响. 子对象的比例为 (0.5, 0.5), 因此您会认为它是 1:1 的比例正方形, 确实如此, 但仅相对于父对象. 子对象的 X 向量最终在世界空间中为 (1, 0), 因为它是由父对象的基础向量缩放的. 类似地，子节点的 `origin` 向量被设置为(1,1), 但由于父节点的基向量, 这实际上会在世界空间中移动它 (2, 1).

source: To calculate a child transform's world space transform manually, this is the code we would use:
es: Para calcular manualmente la transformación espacial del mundo de un hijo, este es el código que usaríamos:
fr: Pour calculer manuellement la transformation de l'espace mondial d'un enfant, c'est le code que nous utiliserions :
ja: 子transformからワールド空間transformへの手動計算には、次のコードを使用します:
uk: Щоб розрахувати перетворення дитини відносно світового простору вручну, ми можемо використовувати такий код:
zh_cn: 要手动计算子变换的世界空间变换, 我们将使用以下代码:

source: In actual projects, we can find the world transform of the child by applying one transform onto another using the `*` operator:
es: En los proyectos reales, podemos encontrar la transformación del mundo del hijo aplicando una transformada sobre otra usando el operador `*`:
fr: Dans les projets actuels, nous pouvons trouver la transformation mondiale de l'enfant en appliquant une transformation sur une autre en utilisant l'opérateur `*` :
ja: 実際のプロジェクトでは、\ `*` 演算子を使用して、あるtransformを別のtransformに適用することで、子のワールドtransformを得ることができます:
uk: У реальних проектах ми можемо знайти світове перетворення дитини, застосувавши одне перетворення до іншого за допомогою оператора ``*``:
zh_cn: 在实际工程中, 我们可以通过 `*` 运算符将一个变换应用到另一个变换中, 从而找到孩子的世界变换:

source: When multiplying matrices, order matters! Don't mix them up.
es: ¡Al multiplicar las matrices, el orden importa! No las mezcles.
fr: Quand on multiplie des matrices, l'ordre compte ! Ne les mélangez pas.
ja: 行列を乗算する場合、順序が重要です！それらを混同しないでください。
uk: При множенні матриць, порядок має значення! Не змішуйте їх.
zh_cn: 当矩阵相乘时, 顺序很重要！别把它们弄混了.

source: Lastly, applying the identity transform will always do nothing.
es: Por último, la aplicación de la transformación de la identidad siempre hará nada.
fr: Enfin, appliquer la transformation d'identité ne fera rien.
ja: 最後に、恒等変換の適用は常に何も行いません。
uk: Нарешті, застосування перетворення ідентичності завжди нічого не зробить.
zh_cn: 最后, 应用身份变换始终不起任何作用.

source: If you would like additional explanation, you should check out 3Blue1Brown's excellent video about matrix composition: https://www.youtube.com/watch?v=XkY2DOUCWMU
es: Si desea una explicación adicional, debería ver el excelente vídeo de 3Blue1Brown sobre la composición de la matriz: https://www.youtube.com/watch?v=XkY2DOUCWMU
fr: Si vous souhaitez des explications supplémentaires, vous pouvez consulter l'excellente vidéo de 3Blue1Brown sur la composition des matrices : https://www.youtube.com/watch?v=XkY2DOUCWMU
ja: 追加の説明が必要な場合は、行列の構成に関する3Blue1Brownの優れたビデオをご覧ください: https://www.youtube.com/watch?v=XkY2DOUCWMU
uk: Якщо ви хочете отримати додаткове пояснення, вам слід переглянути чудове відео 3Blue1Brown про матричну композицію: https://www.youtube.com/watch?v=XkY2DOUCWMU
zh_cn: 如果您想了解更多信息，可以查看 3Blue1Brown 关于矩阵组成的精彩视频：\ https://www.bilibili.com/video/BV1ys411472E?p=5

source: Inverting a transformation matrix
es: Invirtiendo la matriz de transformación
fr: Inverser une matrice de transformation
ja: 変換行列の反転
uk: Інвертування матриці перетворення
zh_cn: 求逆变换矩阵

source: The "affine_inverse" function returns a transform that "undoes" the previous transform. This can be useful in some situations, but it's easier to just provide a few examples.
es: La función "affine_inverse" devuelve una transformación que "deshace" la transformación anterior. Esto puede ser útil en algunas situaciones, pero es más fácil dar sólo algunos ejemplos.
fr: La fonction "affine_inverse" renvoie une transformation qui "annule" la transformation précédente. Cette fonction peut être utile dans certaines situations, mais il est plus facile de se contenter de quelques exemples.
ja: "affine_inverse"関数は、前の変換を「元に戻す」transformを返します。これは状況によっては役立つ場合がありますが、いくつかの例を提供する方が簡単です。
uk: Функція ``affine_inverse`` повертає перетворення, яке "скасовує" попереднє перетворення. Це може бути корисно в деяких ситуаціях, але легше просто навести кілька прикладів.
zh_cn: "affine_inverse" 函数返回一个 "撤销" 前一个转换的转换. 这在某些情况下可能很有用, 但只提供几个示例会更容易.

source: Multiplying an inverse transform by the normal transform undoes all transformations:
es: Multiplicar una transformación inversa por la transformación normal deshace todas las transformaciones:
fr: La multiplication d'une transformation inverse par la transformation normale annule toutes les transformations :
ja: 逆transformに通常のtransformを乗算すると、すべての変換が取り消されます:
uk: Множення інвертованого перетворення на нормальне перетворення скасовує всі перетворення:
zh_cn: 将反变换乘以法线变换将撤消所有变换:

source: Transforming a position by a transform and its inverse results in the same position (same for "xform_inv"):
es: La transformación de una posición por una transformación y su inversa resulta en la misma posición (lo mismo para "xform_inv"):
fr: La transformation d'une position par une transformation et son inverse aboutit à la même position (idem pour "xform_inv") :
ja: transformとその逆のtransformによって位置を変換すると、同じ位置になります( "xform_inv"と同じ):
uk: Перетворення позиції на перетворення та її інверсію призводить до тої ж позиції (те ж саме для ``xform_inv``):
zh_cn: 通过转换转换位置及其反转会导致相同的位置(与 "xform_inv" 相同):

source: How does it all work in 3D?
es: ¿Cómo funciona todo en 3D?
fr: Comment tout cela fonctionne-t-il en 3D ?
ja: 3Dではどのように機能しますか？
uk: Як усе це працює в 3D?
zh_cn: 这一切是如何在 3D 模式下工作的？

source: One of the great things about transformation matrices is that they work very similarly between 2D and 3D transformations. All the code and formulas used above for 2D work the same in 3D, with 3 exceptions: the addition of a third axis, that each axis is of type :ref:`class_Vector3`, and also that Godot stores the :ref:`class_Basis` separately from the :ref:`class_Transform`, since the math can get complex and it makes sense to separate it.
es: Una de las grandes cosas de las matrices de transformación es que funcionan de manera muy similar entre las transformaciones 2D y 3D. Todo el código y las fórmulas utilizadas anteriormente para 2D funcionan igual en 3D, con 3 excepciones: la adición de un tercer eje, que cada eje es del tipo :ref:`clase_Vector3`, y también que Godot almacena la :ref:`class_Base` por separado de la :ref:`class_Transform`, ya que las matemáticas pueden volverse complejas y tiene sentido separarlas.
fr: L'un des grands avantages des matrices de transformation est qu'elles fonctionnent de manière très similaire entre les transformations 2D et 3D. Tout le code et les formules utilisés ci-dessus pour la 2D fonctionnent de la même façon en 3D, à trois exceptions près : l'ajout d'un troisième axe, que chaque axe est du type :ref:`class_Vector3`, et aussi que Godot stocke la :ref:`class_Basis` séparément de la :ref:`class_Transform`, puisque les mathématiques peuvent devenir complexe et qu'il est logique de la séparer.
uk: Один з плюсів матриць перетворення полягає в тому, що вони працюють дуже аналогічно між 2D і 3D перетвореннями. Всі коди та формули, що використовувалися вище для 2D, працюють однаково і в 3D, за 3-ма винятками: додавання третьої осі, кожна вісь належить до типу :ref:`class_Vector3`, Godot зберігає :ref:`class_Basis` окремо від :ref:`class_Transform`, оскільки математика може ускладнитися, і має сенс відокремити її.
zh_cn: 变换矩阵的一个伟大之处在于, 它们在2D和3D变换之间的工作方式非常相似. 上面用于2D的所有代码和公式在3D中的工作方式都相同, 只有3个不同之处: 增加了第三个轴, 每个轴的类型为 :ref:`CLASS_Vector3`, 并且Godot将 :ref:`CLASS_Basis` 与 :ref:`CLASS_Transform` 分开存储, 因为数学运算可能会很复杂, 因此将其分开是有意义的.

source: All of the concepts for how translation, rotation, scale, and shearing work in 3D are all the same compared to 2D. To scale, we take each component and multiply it; to rotate, we change where each basis vector is pointing; to translate, we manipulate the origin; and to shear, we change the basis vectors to be non-perpendicular.
es: Todos los conceptos de cómo funciona la traslación, rotación, escala e inclinación en 3D son todos iguales comparados con los de 2D. Para escalar, tomamos cada componente y lo multiplicamos; para rotar, cambiamos donde cada vector base está apuntando; para traducir, manipulamos el origen; y para inclinar, cambiamos los vectores base para que no sean perpendiculares.
fr: Tous les concepts relatifs au fonctionnement de la translation, de la rotation, de l'échelle et du cisaillement en 3D sont les mêmes qu'en 2D. Pour l'échelle, nous prenons chaque composante et la multiplions ; pour la rotation, nous modifions l'endroit où chaque vecteur de base pointe ; pour la translation, nous manipulons l'origine ; et pour le cisaillement, nous modifions les vecteurs de base pour qu'ils soient non-perpendiculaires.
ja: 3Dでの平行移動、回転、拡大縮小、およびせん断の仕組みに関するすべての概念は、2Dと比較してすべて同じです。スケーリングするには、各成分を取得して乗算します。回転するには、各基底ベクトルが指す場所を変更します。並行移動するには、原点を操作します。そしてせん断するために、基底ベクトルを非直交に変更します。
uk: Всі концепції того, як працюють переміщення, обертання, масштабування і скошення в 3D, такі самі, як і в 2D. Для масштабування беремо кожен компонент і множимо його; щоб повернути, ми змінюємо, напрям кожного основного вектора; для переміщення ми маніпулюємо походженням;а для перекосів, ми змінюємо основні вектори, щоб вони були неперпендикулярними.
zh_cn: 与二维相比, 有关平移, 旋转, 缩放和剪切在三维中的工作方式的所有概念都是相同的. 要缩放, 我们取每个分量并将其相乘；要旋转, 我们更改每个基向量指向的位置；要平移, 我们操纵原点；要剪切, 我们将基向量更改为不垂直.

source: If you would like, it's a good idea to play around with transforms to get an understanding of how they work. Godot allows you to edit 3D transform matrices directly from the inspector. You can download this project which has colored lines and cubes to help visualize the :ref:`class_Basis` vectors and the origin in both 2D and 3D: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform
es: Si quieres, es una buena idea jugar con las transformaciones para entender cómo funcionan. Godot te permite editar matrices de transformación 3D directamente desde el inspector. Puedes descargar este proyecto que tiene líneas y cubos de colores para ayudar a visualizar los vectores :ref:`class_Basis` y el origen tanto en 2D como en 3D: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform
fr: Si vous le souhaitez, il est bon de jouer avec les transformations pour comprendre leur fonctionnement. Godot vous permet d'éditer des matrices de transformation 3D directement depuis l'inspecteur. Vous pouvez télécharger ce projet qui comporte des lignes et des cubes colorés pour vous aider à visualiser les vecteurs :ref:`class_Basis` et l'origine en 2D et 3D : https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform
ja: 必要に応じて、transformを操作して、それらがどのように機能するかを理解することをお勧めします。Godotを使用すると、インスペクタから直接3D変換行列を編集できます。\ :ref:`class_Basis` ベクトルと原点を2Dと3Dの両方で視覚化するのに役立つ色付きの線とキューブを含むこのプロジェクトをダウンロードできます: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform
uk: Якщо хочете, можете по-експериментувати з перетвореннями, щоб зрозуміти їх роботу. Godot дозволяє редагувати матриці 3D-перетворення безпосередньо в Інспекторі. Ви можете завантажити цей проект, який має кольорові лінії та кубики, щоб допомогти візуалізувати вектори :ref:`class_Basis` та походження як у 2D, так і в 3D: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform
zh_cn: 如果您愿意, 最好尝试一下转换, 以了解它们是如何工作的. Godot 允许您直接从检查器编辑 3D 变换矩阵. 您可以下载此项目, 其中包含彩色线条和立方体, 以帮助在 2D 和 3D 中可视化 :ref:`class_Basis` 向量和原点: https://github.com/godotengine/godot-demo-projects/tree/master/misc/matrix_transform

source: Spatial's "Matrix" section in Godot 3.2's inspector displays the matrix as transposed, with the columns horizontal and the rows vertical. This may be changed to be less confusing in a future release of Godot.
es: La sección "Matrix" del Espacio en el inspector de Godot 3.2 muestra la matriz como se ha transpuesto, con las columnas horizontales y las filas verticales. Esto puede cambiarse para que sea menos confuso en una futura versión de Godot.
fr: La section "Matrix" de Spatial dans l'inspecteur de Godot 3.2 affiche la matrice telle qu'elle a été transposée, avec les colonnes horizontales et les lignes verticales. Cela pourrait être modifié pour être moins déroutant dans une prochaine version de Godot.
ja: Godot 3.2.xのインスペクタにあるSpatialの"Matrix"セクションでは、行列が横の列と縦の列で転置された行列として表示されます。これは、Godotの将来のリリースで混乱が少なくなるように変更される可能性があります。
uk: Розділ Просторова "Матриця" в Інспекторі Godot 3.2 відображає матрицю як перетворену горизонтальними стовпцями та вертикальними рядками. Це може бути змінено, щоб бути менш заплутаним у майбутньому випуску Godot.
zh_cn: 在 Godot 3.2 的检查器中，Spatial 的“Matrix”部分显示的是转置过的矩阵，横向的是列、纵向的是行。这一点可能会在 Godot 的未来版本中进行更改，使其不那么令人困惑。

source: You cannot edit Node2D's transform matrix directly in Godot 3.2's inspector. This may be changed in a future release of Godot.
es: No puedes editar la matriz de transformación de Node2D directamente en el inspector de Godot 3.2. Esto puede ser cambiado en una futura versión de Godot.
fr: Vous ne pouvez pas modifier la matrice de transformation de Node2D directement dans l'inspecteur de Godot 3.2. Cela pourrait être modifié dans une future version de Godot.
ja: Node2Dの変換行列をGodot 3.2.xのインスペクタで直接編集することはできません。これは、Godotの将来のリリースで変更される可能性があります。
uk: Ви не можете редагувати матрицю перетворення Node2D безпосередньо в інспекторі Godot 3.2. Це може змінитися в майбутньому випуску Godot.
zh_cn: 不能在Godot 3.2的检查器中直接编辑Node2D的变换矩阵. 在Godot的未来版本中, 这一点可能会有所改变.

source: If you would like additional explanation, you should check out 3Blue1Brown's excellent video about 3D linear transformations: https://www.youtube.com/watch?v=rHLEWRxRGiM
es: Si desea una explicación adicional, debería ver el excelente vídeo de 3Blue1Brown sobre las transformaciones lineales en 3D: https://www.youtube.com/watch?v=rHLEWRxRGiM
fr: Si vous souhaitez des explications supplémentaires, vous pouvez consulter l'excellente vidéo de 3Blue1Brown sur les transformations linéaires en 3D : https://www.youtube.com/watch?v=rHLEWRxRGiM
ja: 追加の説明が必要な場合は、3Blue1Brownの3D線形変換に関する優れたビデオをご覧ください: https://www.youtube.com/watch?v=rHLEWRxRGiM
uk: Якщо хочете отримати додаткове пояснення, вам слід ознайомитися з чудовим відео 3Blue1Brown про 3D-лінійні перетворення: https://www.youtube.com/watch?v=rHLEWRxRGiM
zh_cn: 如果你想要更多的解释，你可以查看 3Blue1Brown 关于 3D 线性变换的精彩视频：\ https://www.bilibili.com/video/BV1ys411472E?p=6

source: Representing rotation in 3D (advanced)
es: Representando una rotación en 3D (avanzado)
fr: Représentation de la rotation en 3D (avancé)
ja: 3Dでの回転の表現(高度な内容)
uk: Представлення обертання в 3D (додатково)
zh_cn: 表示 3D 中的旋转（高级）

source: The biggest difference between 2D and 3D transformation matrices is how you represent rotation by itself without the basis vectors.
es: La mayor diferencia entre las matrices de transformación 2D y 3D es cómo se representa la rotación por sí misma sin los vectores base.
fr: La plus grande différence entre les matrices de transformation 2D et 3D est la façon dont vous représentez la rotation par elle-même sans les vecteurs de base.
ja: 2Dと3D変換行列の最大の違いは、基底ベクトルなしで回転をそれ自体で表現する方法です。
uk: Найбільша відмінність між матрицями перетворення 2D і 3D полягає в тому, як ви представляєте обертання саме по собі без базових векторів.
zh_cn: 2D 和 3D 变换矩阵之间最大的区别在于您如何在没有基向量的情况下自行表示旋转。

source: With 2D, we have an easy way (atan2) to switch between a transformation matrix and an angle. In 3D, we can't simply represent rotation as one number. There is something called Euler angles, which can represent rotations as a set of 3 numbers, however, they are limited and not very useful, except for trivial cases.
es: Con el 2D, tenemos una forma fácil (atan2) de cambiar entre una matriz de transformación y un ángulo. En 3D, no podemos simplemente representar la rotación como un número. Hay algo llamado ángulos de Euler, que pueden representar las rotaciones como un conjunto de 3 números, sin embargo, son limitados y no muy útiles, excepto para casos triviales.
fr: Avec la 2D, nous avons un moyen facile (atan2) de passer d'une matrice de transformation à un angle. En 3D, nous ne pouvons pas simplement représenter la rotation comme un seul chiffre. Il existe quelque chose appelé angles d'Euler, qui peut représenter les rotations comme un ensemble de 3 nombres, mais ils sont limités et peu utiles, sauf dans des cas triviaux.
uk: З 2D ми маємо простий спосіб (atan2) перемикатися між матрицею перетворення та кутом. У 3D ми не можемо просто представити обертання як одне число. Існує те, що називається кутами Ейлера, які можуть представляти обертання у вигляді набору з 3 чисел, однак вони обмежені і не дуже корисні, за винятком тривіальних випадків.
zh_cn: 对于2D, 我们有一个在变换矩阵和角度之间切换的简单方法(Atan2). 在3D中, 我们不能简单地将旋转表示为一个数字. 有一种叫做欧拉角的东西, 它可以将旋转表示为一组3个数字, 但它们是有限的, 除了微不足道的情况外, 它们并不是很有用.

source: In 3D we do not typically use angles, we either use a transformation basis (used pretty much everywhere in Godot), or we use quaternions. Godot can represent quaternions using the :ref:`class_Quat` struct. My suggestion to you is to completely ignore how they work under-the-hood, because they are very complicated and unintuitive.
es: En la 3D no solemos utilizar ángulos, o bien utilizamos una base de transformación (utilizada prácticamente en todas partes en Godot), o bien utilizamos cuaternarios. Godot puede representar cuaternarios usando la estructura :ref:`class_Quat`. Mi sugerencia es ignorar completamente cómo funcionan bajo el capó, porque son muy complicados y poco intuitivos.
fr: En 3D, nous n'utilisons généralement pas d'angles, nous utilisons soit une base de transformation (utilisée à peu près partout dans Godot), soit des quaternions. Godot peut représenter les quaternions en utilisant la structure :ref:`class_Quat`. Je vous suggère d'ignorer complètement comment ils fonctionnent sous le capot, car ils sont très compliqués et peu intuitifs.
ja: 3Dでは、通常、角度は使用せず、変換基底(Godotのほぼどこでも使用)を使用するか、クォータニオンを使用します。Godotは、\ :ref:`class_Quat` 構造体を使用してクォータニオンを表すことができます。あなたへの私の提案は、それらが非常に複雑で直感的でないため、それらが内部でどのように機能するかは完全に無視することです。
uk: У 3D ми зазвичай не використовуємо кути, ми або використовуємо основу перетворення (використовується майже скрізь в Godot), або ми використовуємо кватерніони. Godot може представляти кватерніони за допомогою структури :ref:`class_Quat`. Я пропоную вам не ламати собі голову над тим, як вони працюють, тому що це дуже складно.
zh_cn: 在 3D 中，我们通常不使用角度，我们要么使用变换的基（在 Godot 中几乎到处都使用），要么使用四元数。Godot 可以使用 :ref:`class_Quat` 结构表示四元数。我给你的建议是完全忽略它们是如何在幕后工作的，因为它们非常复杂和不直观。

source: However, if you really must know how it works, here are some great resources, which you can follow in order:
es: Sin embargo, si realmente debes saber cómo funciona, aquí hay algunos grandes recursos, que puedes seguir en orden:
fr: Cependant, si vous voulez vraiment savoir comment cela fonctionne, voici quelques ressources intéressantes, que vous pouvez suivre dans l'ordre :
ja: ただし、実際にその仕組みを知っておく必要がある場合は、次の優れたリソースを参照してください:
uk: Однак, якщо вам дійсно треба знати, як це працює, ось деякі великі ресурси, з якими ви можете ознайомитися:
zh_cn: 然而, 如果你真的想知道它是如何工作的, 这里有一些很棒的参考资料, 你可以按顺序跟随它们:

source: https://www.youtube.com/watch?v=mvmuCPvRoWQ
zh_cn: https://www.bilibili.com/video/BV1fx41187tZ

source: https://www.youtube.com/watch?v=d4EgbgTm0Bg
zh_cn: https://www.bilibili.com/video/BV1SW411y7W1

source: Translation status
es: Estado de traducción
fr: État de la traduction
ja: 翻訳ステータス
uk: Стан перекладу
zh_cn: 翻译状态
