Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: es, fr, ja, uk, zh_cn

source: You can't set the raw values of a Transform2D in the editor, so you *must* use code if you want to shear the object.
es: No puedes establecer los valores crudos de un Transform2D en el editor, así que *debes* usar código si quieres inclinar el objeto.
fr: Vous ne pouvez pas définir les valeurs brutes d'un Transform2D dans l'éditeur, donc vous *devez* utiliser du code si vous voulez cisailler l'objet.
ja: エディタでTransform2Dの生の値を設定することはできません。そのため、オブジェクトをせん断したい場合はコードを使用する *必要* があります。
uk: Ви не можете встановити необроблені значення Transform2D у редакторі, тому ви *повинні* використовувати код, якщо хочете перекосити об'єкт.
zh_cn: 不能在编辑器中设置Transform2D的原始值, 所以想要剪切对象, 必须使用代码.

source: Due to the vectors no longer being perpendicular, the object has been sheared. The bottom-center of the grid, which is (0, 1) relative to itself, is now located at a world position of (1, 1).
es: Debido a que los vectores ya no son perpendiculares, el objeto ha sido inclinado. El centro inferior del grid, que es (0, 1) con respecto a sí mismo, se encuentra ahora en una posición mundial de (1, 1).
fr: Les vecteurs n'étant plus perpendiculaires, l'objet a été cisaillé. Le centre inférieur de la grille, qui est (0, 1) par rapport à lui-même, est maintenant situé à une position mondiale de (1, 1).
ja: ベクトルが垂直ではなくなったため、オブジェクトはせん断化されました。グリッドの下部中央は、本体に対して(0, 1)であり、それが(1, 1)のワールド位置に配置されています。
uk: Через те, що вектори більше не перпендикулярні, об'єкт перекосився. Нижній центр сітки, який (0, 1) відносно себе, у світовому положенні тепер розташований (1, 1).
zh_cn: 由于向量不再垂直, 因此对象已被剪切. 栅格的底部中心(相对于自身为(0,1))现在位于世界位置(1,1).

source: The intra-object coordinates are called UV coordinates in textures, so let's borrow that terminology for here. To find the world position from a relative position, the formula is U * X + V * Y, where U and V are numbers and X and Y are the basis vectors.
es: Las coordenadas intra-objeto se llaman coordenadas UV en las texturas, así que tomemos prestada esa terminología para aquí. Para encontrar la posición del mundo desde una posición relativa, la fórmula es U * X + V * Y, donde U y V son números y X e Y son los vectores base.
fr: Les coordonnées intra-objet sont appelées coordonnées UV dans les textures, alors empruntons cette terminologie pour ici. Pour trouver la position mondiale à partir d'une position relative, la formule est U * X + V * Y, où U et V sont des nombres et X et Y sont les vecteurs de base.
ja: オブジェクト内の座標は、テクスチャではUV座標と呼ばれます。そのため、ここではその用語を借用しましょう。相対位置からワールド位置を見つける式はU * X + V * Yです。ここで、UとVは数値で、XとYは基底ベクトルです。
uk: Внутрішні координати об'єкта називаються текстурними координатами, тому давайте запозичимо цю термінологію сюди. Щоб знайти світову позицію з відносної позиції використовується формула - U * X + V * Y, де U і V - числа, а X і Y - базові вектори.
zh_cn: 对象内部坐标在纹理中称为UV坐标, 因此我们借用此处的术语. 要从相对位置找到世界位置, 公式为U*X+V*Y, 其中U和V是数字,X和Y是基向量.

source: The bottom-right corner of the grid, which is always at the UV position of (1, 1), is at the world position of (2, 1), which is calculated from X*1 + Y*1, which is (1, 0) + (1, 1), or (1 + 1, 0 + 1), or (2, 1). This matches up with our observation of where the bottom-right corner of the image is.
es: La esquina inferior derecha del grid, que siempre está en la posición UV de (1, 1), está en la posición mundial de (2, 1), que se calcula a partir de X*1 + Y*1, que es (1, 0) + (1, 1), o (1 + 1, 0 + 1), o (2, 1). Esto coincide con nuestra observación de dónde está la esquina inferior derecha de la imagen.
fr: Le coin inférieur droit de la grille, qui est toujours à la position UV de (1, 1), est à la position mondiale de (2, 1), qui est calculée à partir de X*1 + Y*1, qui est (1, 0) + (1, 1), ou (1 + 1, 0 + 1), ou (2, 1). Cela correspond à notre observation de l'endroit où se trouve le coin inférieur droit de l'image.
ja: グリッドの右下隅は常に(1, 1)のUV位置にあり、(2, 1)のワールド位置にあります。これは、X*1 + Y*1すなわち (1, 0) + (1, 1)、 (1 + 1, 0 + 1)、または (2, 1)です。これは、画像の右下隅の位置に関する観察結果と一致します。
uk: Нижній правий кут сітки, який в текстурних координатах завжди знаходиться на (1, 1), світових знаходиться на (2, 1), які розраховуються від X*1 + Y*1, що дорівнює (1, 0) + (1, 1), або (1 + 1, 0 + 1), або (2, 1). Це узгоджується з нашим спостереженням за тим, де знаходиться правий нижній кут зображення.
zh_cn: 栅格的右下角始终位于UV位置(1,1), 位于世界位置(2,1), 该位置是从X*1+Y*1(即(1,0)+(1,1)或(1+1,0+1)或(2,1)计算得出的. 这与我们观察到的图像右下角的位置相吻合.

source: Similarly, the top-right corner of the grid, which is always at the UV position of (1, -1), is at the world position of (0, -1), which is calculated from X*1 + Y*-1, which is (1, 0) - (1, 1), or (1 - 1, 0 - 1), or (0, -1). This matches up with our observation of where the top-right corner of the image is.
es: De manera similar, la esquina superior derecha del grid, que siempre está en la posición UV de (1, -1), está en la posición mundial de (0, -1), que se calcula a partir de X*1 + Y*-1, que es (1, 0) - (1, 1), o (1 - 1, 0 - 1), o (0, -1). Esto concuerda con nuestra observación de dónde está la esquina superior derecha de la imagen.
fr: De même, le coin supérieur droit de la grille, qui est toujours à la position UV de (1, -1), est à la position mondiale de (0, -1), qui est calculée à partir de X*1 + Y*-1, qui est (1, 0) - (1, 1), ou (1 - 1, 0 - 1), ou (0, -1). Cela correspond à notre observation de l'endroit où se trouve le coin supérieur droit de l'image.
ja: 同様に、グリッドの右上隅は常に(1, -1)のUV位置にあり、X*1 + Y*-1すなわち(1, 0) - (1, 1)、(1 - 1, 0 - 1)、または(0, -1)から計算されるワールド位置(0, -1)にあります。これは、画像の右上隅の位置に関する観察結果と一致します。
uk: Аналогічно, верхній правий кут сітки, який в текстурних координатах завжди знаходиться на (1, -1), у світових знаходиться на (0, -1), які вираховуються з X*1 + Y*-1, що дорівнює (1, 0) - (1, 1), або (1 - 1, 0 - 1), або (0, -1). Це узгоджується з нашим спостереженням за тим, де знаходиться верхній правий кут зображення.
zh_cn: 同样, 栅格的右上角始终位于UV位置(1, -1), 位于世界位置(0, -1), 该位置是从X*1+Y*-1计算得出的,X*1+Y*-1是(1,0)-(1,1)或(1-1,0-1)或(0, -1). 这与我们观察到的图像右上角的位置相吻合.

source: Hopefully you now fully understand the how a transformation matrix affects the object, and the relationship between the basis vectors and how the object's "UV" or "intra-coordinates" have their world position changed.
es: Esperemos que ahora entiendas completamente cómo una matriz de transformación afecta al objeto, y la relación entre los vectores base y cómo los "UV" o "intra-coordinados" del objeto han cambiado su posición en el mundo.
fr: Nous espérons que vous comprenez maintenant parfaitement comment une matrice de transformation affecte l'objet, et la relation entre les vecteurs de base et comment les "UV" ou "intra-coordonnées" de l'objet ont changé leur position dans le monde.
ja: 変換行列がオブジェクトにどのように影響するか、基底ベクトル間の関係、およびオブジェクトの"UV"または「内部座標」のワールド位置がどのように変化するかを完全に理解できたと思います。
uk: Сподіваюся, тепер ви повністю розумієте, як матриця перетворення впливає на об'єкт, і взаємозв'язок між основними векторами і тим, як "внутрішні координати" об'єкта змінюють своє світове положення.
zh_cn: 希望您现在完全了解变换矩阵如何影响对象，以及基向量之间的关系以及对象的“UV”或“内部坐标”如何更改其世界位置。

source: In Godot, all transform math is done relative to the parent node. When we refer to "world position", that would be relative to the node's parent instead, if the node had a parent.
es: En Godot, toda la matemática de transformación se hace en relación con el nodo padre. Cuando nos referimos a la "posición del mundo", eso sería relativo al padre del nodo, si el nodo tuviera un padre.
fr: Dans Godot, toutes les transformations mathématiques sont effectuées par rapport au nœud parent. Lorsque nous parlons de "position mondiale", ce serait plutôt par rapport au parent du nœud, si le nœud avait un parent.
ja: Godotでは、すべての変換計算は親ノードを基準にして行われます。 「ワールド位置」を参照する場合、ノードに親がある場合は、そのノードの親に対する相対的な位置になります。
uk: У Godot вся математика перетворення виконується відносно батьківського вузла. Коли ми маємо на увазі "світову позицію", то говоримо про позицію відносно батьківського вузла, якщо у вузла є батько.
zh_cn: 在Godot中, 所有变换数学运算都是相对于父节点完成的. 当我们提到 "世界位置" 时, 如果节点有父节点, 那么它将相对于节点的父位置.

source: If you would like additional explanation, you should check out 3Blue1Brown's excellent video about linear transformations: https://www.youtube.com/watch?v=kYB8IZa5AuE
es: Si desea una explicación adicional, debería ver el excelente video de 3Blue1Brown sobre las transformaciones lineales: https://www.youtube.com/watch?v=kYB8IZa5AuE
fr: Si vous souhaitez des explications supplémentaires, vous pouvez consulter l'excellente vidéo de 3Blue1Brown sur les transformations linéaires : https://www.youtube.com/watch?v=kYB8IZa5AuE
ja: 追加の説明が必要な場合は、線形変換に関する3Blue1Brownの優れたビデオをご覧ください: https://www.youtube.com/watch?v=kYB8IZa5AuE
uk: Якщо ви хочете отримати додаткові пояснення, вам слід переглянути чудове відео 3Blue1Brown про лінійні перетворення: https://www.youtube.com/watch?v=kYB8IZa5AuE
zh_cn: 如果你想要更多的解释，你可以查看 3Blue1Brown 关于线性变换的精彩视频：\ https://www.bilibili.com/video/BV1ys411472E?p=4

source: Practical applications of transforms
es: Aplicaciones prácticas de las transformaciones
fr: Applications pratiques des transformations
ja: 変換の実用的な応用
uk: Практичне застосування перетворень
zh_cn: 变换的实际应用

source: In actual projects, you will usually be working with transforms inside transforms by having multiple :ref:`class_Node2D` or :ref:`class_Spatial` nodes parented to each other.
es: En los proyectos reales, normalmente trabajarás con transformaciones dentro de transformaciones teniendo múltiples nodos :ref:`class_Node2D` o :ref:`class_Spatial` separados unos de otros.
fr: Dans les projets réels, vous travaillerez généralement avec des transformations à l'intérieur de transformations en ayant plusieurs nœuds :ref:`class_Node2D` ou :ref:`class_Spatial` parentés les uns aux autres.
ja: 実際のプロジェクトでは、通常、複数の :ref:`class_Node2D` または :ref:` class_Spatial` ノードを相互にペアレント化することにより、transform内で変換を操作します。
uk: У реальних проектах ви зазвичай працюватимете з перетвореннями всередині перетворень, маючи кілька вузлів :ref:`class_Node2D` або :ref:`class_Spatial`, пов’язаних між собою.
zh_cn: 在实际项目中，您通常会通过将多个 :ref:`class_Node2D` 或 :ref:`class_Spatial` 节点设置为彼此的父级来处理变换中的变换。

source: However, sometimes it's very useful to manually calculate the values we need. We will go over how you could use :ref:`class_Transform2D` or :ref:`class_Transform` to manually calculate transforms of nodes.
es: Sin embargo, a veces es muy útil calcular manualmente los valores que necesitamos. Repasaremos cómo podrías usar :ref:`class_Transform2D` o :ref:`class_Transform` para calcular manualmente las transformaciones de los nodos.
fr: Cependant, il est parfois très utile de calculer manuellement les valeurs dont nous avons besoin. Nous allons voir comment vous pouvez utiliser :ref:`class_Transform2D` ou :ref:`class_Transform` pour calculer manuellement les transformations des nœuds.
ja: ただし、必要な値を手動で計算すると便利な場合があります。\ :ref:`class_Transform2D` または :ref:` class_Transform` を使用して手動でノードの変換を計算する方法について説明します。
uk: Однак іноді дуже корисно вручну обчислити потрібні значення. Ми розглянемо, як ви можете використовувати :ref:`class_Transform2D` або :ref:`class_Transform` для ручного обчислення перетворень вузлів.
zh_cn: 但是, 有时手动计算我们需要的值非常有用. 我们将介绍如何使用 :ref:`CLASS_Transform2D` 或 :ref:`CLASS_Transform` 手动计算节点转换.

source: Converting positions between transforms
es: Convertir las posiciones entre las transformaciones
fr: Convertir les positions entre les transformations
ja: transform間の位置の変換
uk: Конвертування позицій між перетвореннями
zh_cn: 在变换之间转换位置

source: There are many cases where you'd want to convert a position in and out of a transform. For example, if you have a position relative to the player and would like to find the world (parent-relative) position, or if you have a world position and want to know where it is relative to the player.
es: Hay muchos casos en los que se querría convertir una posición dentro y fuera de una transformación. Por ejemplo, si tienes una posición relativa al jugador y te gustaría encontrar la posición mundial (parentesco con los padres), o si tienes una posición mundial y quieres saber dónde está relativa al jugador.
fr: Il y a de nombreux cas où vous voudriez convertir une position dans et hors d'une transformation. Par exemple, si vous avez une position relative au joueur et que vous souhaitez trouver la position mondiale (par rapport au parent), ou si vous avez une position mondiale et que vous souhaitez savoir où elle se trouve par rapport au joueur.
ja: transformの内外で位置を変換したい場合が多くあります。たとえば、プレイヤーに対する相対的な位置があり、そのワールド(親相対)位置を検索する場合、またはワールド位置があり、そのプレイヤーとの相対的な位置を知りたい場合です。
uk: Є багато випадків, коли вам треба конвертувати позицію в і зовні перетворення. Наприклад, якщо у вас є позиція відносно гравця і ви хотіли б знайти світову (відносну батька) позицію, або якщо у вас є світова позиція і ви хочете знати, де вона знаходиться відносно гравця.
zh_cn: 在许多情况下, 您可能需要将位置转换为变换中的位置或将其转换为转换外的位置. 例如, 如果您有一个相对于球员的位置并想要查找世界(父级相对)位置, 或者如果您有一个世界位置并想知道它相对于球员的位置.

source: We can find what a vector relative to the player would be defined in world space as using the "xform" method:
es: Podemos encontrar lo que un vector relativo al jugador sería definido en el espacio mundial como usando el método "xform":
fr: On peut trouver ce qu'un vecteur relatif au joueur serait défini dans l'espace mondial en utilisant la méthode "xform" :
ja: "xform"メソッドを使用して、プレイヤーに対する相対的なベクトルのワールド空間内での値を得る事ができます:
uk: Ми можемо знайти, який вектор, відносно гравця, буде визначатися у світовому просторі як такий, що використовує метод ``xform``:
zh_cn: 通过“xform”方法，我们可以找到相对于玩家的向量如果定义在世界空间中的话应该是什么：

source: And we can use the "xform_inv" method to find a what world space position would be if it was instead defined relative to the player:
es: Y podemos usar el método "xform_inv" para encontrar la posición del espacio mundial que sería si en su lugar se definiera en relación con el jugador:
fr: Et nous pouvons utiliser la méthode "xform_inv" pour trouver quelle serait la position spatiale mondiale si elle était plutôt définie par rapport au joueur :
ja: そして、"xform_inv"メソッドを使用して、ワールド空間内の位置をプレイヤーに対する相対的な位置に変換した結果を得ることができます:
uk: І ми можемо використовувати метод ``xform_inv``, щоб знайти, якою була б позиція світового простору, якби вона була визначена відносно гравця:
zh_cn: 我们可以使用 "xform_inv" 方法来查找世界空间位置(如果它是相对于玩家定义的):

source: If you know in advance that the transform is positioned at (0, 0), you can use the "basis_xform" or "basis_xform_inv" methods instead, which skip dealing with translation.
es: Si se sabe de antemano que la transformación está posicionada en (0, 0), se pueden utilizar los métodos "base_xform" o "base_xform_inv" en su lugar, que se saltan el tratar con la translación.
fr: Si vous savez à l'avance que la transformation est positionnée à (0, 0), vous pouvez utiliser les méthodes "basis_xform" ou "basis_xform_inv" à la place, qui permettent d'éviter de traiter la translation.
ja: transfomが(0, 0)に配置されていることが事前にわかっている場合は、代わりに"basis_xform"または"basis_xform_inv"メソッドを使用できます。これらのメソッドは、平行移動の処理をスキップします。
uk: Якщо ви заздалегідь знаєте, що вузол перетворення розташований на (0, 0), то можете використовувати методи ``basis_xform``, або ``basis_xform_inv``, які пропускають конвертацію.
zh_cn: 如果您事先知道变换位于 (0, 0) 处，则可以改用“basis_xform”或“basis_xform_inv”方法，这将跳过处理平移的过程。

source: Moving an object relative to itself
es: Mover un objeto en relación a sí mismo
fr: Déplacement d'un objet par rapport à lui-même
ja: オブジェクトをそれ自身に対して相対的に移動する
uk: Переміщення об'єкта відносно себе
zh_cn: 相对于对象本身移动对象

source: A common operation, especially in 3D games, is to move an object relative to itself. For example, in first-person shooter games, you would want the character to move forward (-Z axis) when you press :kbd:`W`.
es: Una operación común, sobre todo en los juegos 3D, es mover un objeto relativo a sí mismo. Por ejemplo, en los juegos de disparos en primera persona, querrías que el personaje se moviera hacia adelante (eje -Z) cuando presionas :kbd:`W`.
fr: Une opération courante, en particulier dans les jeux en 3D, consiste à déplacer un objet par rapport à lui-même. Par exemple, dans les jeux de tir à la première personne, vous voudriez que le personnage se déplace vers l'avant (axe -Z) lorsque vous appuyez sur :kbd:`W`.
ja: 特に3Dゲームでの一般的な操作は、オブジェクトをそれ自体に対して移動することです。たとえば、一人称シューティングゲームでは、\ :kbd:`W` を押すと、キャラクターが前方(-Z軸)に移動します。
uk: Поширеною операцією, особливо в 3D-іграх, є переміщення об'єкта відносно себе. Наприклад, у шутерах від першої особи потрібно, щоб персонаж рухався вперед (вісь -Z) під час натискання клавіші :kbd:`W`.
zh_cn: 一种常见的操作，尤其是在 3D 游戏中，是相对于自身移动对象。例如，在第一人称射击游戏中，当您按下 :kbd:`W` 键时，您希望角色向前移动（-Z 轴）。

source: Since the basis vectors are the orientation relative to the parent, and the origin vector is the position relative to the parent, we can simply add multiples of the basis vectors to move an object relative to itself.
es: Dado que los vectores base son la orientación relativa al padre, y el vector de origen es la posición relativa al padre, podemos simplemente añadir múltiplos de los vectores base para mover un objeto con respecto a sí mismo.
fr: Puisque les vecteurs de base sont l'orientation par rapport au parent, et que le vecteur d'origine est la position par rapport au parent, nous pouvons simplement ajouter des multiples des vecteurs de base pour déplacer un objet par rapport à lui-même.
ja: 基底ベクトルは親に対する相対的な方向であり、原点ベクトルは親に対する相対的な位置であるため、単純に複数の基底ベクトルを加算して、オブジェクト自体を相対的に移動できます。
uk: Оскільки базові вектори - це орієнтація відносно предка, а вектор походження - це позиція відносно предка, ми можемо просто додати кратні базових векторів, щоб перемістити об'єкт відносно себе.
zh_cn: 由于基向量是相对于父对象的方向，而原点向量是相对于父对象的位置，因此我们可以简单地将基向量的倍数相加，以相对于对象本身移动对象。

source: This code moves an object 100 units to its own right:
es: Este código mueve un objeto 100 unidades a su propio derecho:
fr: Ce code permet de déplacer un objet de 100 unités à sa propre droite :
ja: 次のコードは、オブジェクトを 100単位右に移動します:
uk: Цей код переміщує об'єкт на 100 одиниць праворуч:
zh_cn: 此代码会让对象向它自己的右边移动 100 个单位：

source: For moving in 3D, you would need to replace "x" with "basis.x".
es: Para moverse en 3D, necesitarías reemplazar "x" por "base.x".
fr: Pour se déplacer en 3D, il faudrait remplacer "x" par "basis.x".
ja: 3Dで移動する場合は、"x"を"basis.x"に置き換える必要があります。
uk: Для переміщення в 3D вам потрібно буде замінити ``x`` на ``basis.x``.
zh_cn: 要在 3D 中移动，需要将“x”替换为“basis.x”。

source: In actual projects, you can use `translate_object_local` in 3D or `move_local_x` and `move_local_y` in 2D to do this.
es: En los proyectos reales, puedes usar "translate_object_local" en 3D o "move_local_x" y "move_local_y" en 2D para hacer esto.
fr: Dans les projets réels, vous pouvez utiliser `translate_object_local` en 3D ou `move_local_x` et `move_local_y` en 2D pour le faire.
ja: 実際のプロジェクトでは、3Dで `translate_object_local` を使用するか、2Dで `move_local_x` と `move_local_y` を使用してこれを行うことができます。
uk: У реальних проектах для цього можна використовувати ``translate_object_local`` в 3D, чи ``move_local_x`` і ``move_local_y`` в 2D.
zh_cn: 在实际工程中，您可以使用 3D 中的 `translate_object_local` 或者 2D 中的 `move_local_x` 和 `move_local_y` 来实现。

source: Applying transforms onto transforms
es: Aplicando transformaciones sobre transformaciones
fr: Application de transformations sur des transformations
ja: transformへの変換の適用
uk: Застосування перетворень на перетвореннях
zh_cn: 将变换应用于变换

source: One of the most important things to know about transforms is how you can use several of them together. A parent node's transform affects all of its children. Let's dissect an example.
es: Una de las cosas más importantes que hay que saber sobre las transformaciones es cómo se pueden usar varias de ellas juntas. La transformación de un nodo padre afecta a todos sus hijos. Diseccionemos un ejemplo.
fr: L'une des choses les plus importantes à savoir sur les transformations est la façon dont vous pouvez en utiliser plusieurs ensemble. La transformation d'un nœud parent affecte tous ses enfants. Disséquons un exemple.
ja: transformについて知っておくべき最も重要なことの1つは、transformのいくつかを一緒に使用する方法です。親ノードのtransformは、そのすべての子に影響します。例を見てみましょう。
uk: Одна з найважливіших речей, які потрібно знати про перетворення, - це те, що ви можете використовувати кілька їх разом. Перетворення батьківського вузла впливає на всіх його дітей. Давайте розглянемо приклад.
zh_cn: 关于转换, 需要了解的最重要的事情之一是如何将几个转换一起使用. 父节点的变换会影响其所有子节点. 让我们来剖析一个例子.

source: In this image, the child node has a "2" after the component names to distinguish them from the parent node. It might look a bit overwhelming with so many numbers, but remember that each number is displayed twice (next to the arrows and also in the matrices), and that almost half of the numbers are zero.
es: En esta imagen, el nodo hijo tiene un "2" después de los nombres de los componentes para distinguirlos del nodo padre. Puede parecer un poco abrumador con tantos números, pero recuerde que cada número se muestra dos veces (junto a las flechas y también en las matrices), y que casi la mitad de los números son cero.
fr: Dans cette image, le nœud enfant a un "2" après les noms des composants pour les distinguer du nœud parent. Cela peut sembler un peu écrasant avec autant de chiffres, mais souvenez-vous que chaque chiffre est affiché deux fois (à côté des flèches et également dans les matrices), et que près de la moitié des chiffres sont des zéros.
ja: この図では、子ノードは成分名の後に "2" があり、親ノードと区別しています。非常に多くの数字で少し圧倒されるように見えるかもしれませんが、各数字は2回(矢印の横とマトリックスにも)表示され、数字のほぼ半分がゼロであることに注意してください。
uk: На цьому зображенні дочірній вузол має приставку "2" до назв компонентів, щоб відрізнити їх від компонентів батьківського вузла. Це може виглядати трохи приголомшливо з такою кількістю чисел, але пам'ятайте, що кожне число відображається двічі (поруч зі стрілками, а також у матрицях), і що майже половина чисел дорівнює нулю.
zh_cn: 在此图像中, 子节点的组件名称后面有一个 "2", 以将其与父节点区分开来. 这么多数字可能看起来有点令人不知所措, 但请记住, 每个数字都会显示两次(在箭头旁边和矩阵中), 而且几乎一半的数字都是零.

source: The only transformations going on here are that the parent node has been given a scale of (2, 1), the child has been given a scale of (0.5, 0.5), and both nodes have been given positions.
es: Las únicas transformaciones que ocurren aquí son que al nodo padre se le ha dado una escala de (2, 1), al hijo se le ha dado una escala de (0.5, 0.5), y a ambos nodos se les ha dado posiciones.
fr: Les seules transformations en cours ici sont que le nœud parent a reçu une échelle de (2, 1), l'enfant a reçu une échelle de (0,5, 0,5) et les deux nœuds ont reçu des positions.
ja: ここで行われている唯一の変換は、親ノードに(2, 1)のスケールが与えられ、子に(0.5, 0.5)のスケールが与えられ、両方のノードに位置が与えられていることです。
uk: Єдині перетворення, що відбуваються тут, - це те, що батьківському вузлу була наданий масштаб (2, 1), дитині - масштаб (0,5, 0,5), і обом вузлам були надані позиції.
zh_cn: 这里进行的唯一转换是父节点的比例为(2,1), 子节点的比例为(0.5,0.5), 两个节点都指定了位置.
