Repository: godotengine/godot-docs-l10n
Catalog: sphinx/po/*/LC_MESSAGES/tutorials/math/matrices_and_transforms.po
Languages: es, fr, ja, uk, zh_cn

source: Fun fact: In addition to Y being *down* in Godot, rotation is represented clockwise. This means that all the math and trig functions behave the same as a Y-is-up CCW system, since these differences "cancel out". You can think of rotations in both systems being "from X to Y".
es: Dato curioso: Además de que la Y está *abajo* en Godot, la rotación se representa en el sentido de las agujas del reloj. Esto significa que todas las funciones matemáticas y de trigonometría se comportan igual que en un sistema de sentido de las horas de un reloj con la Y hacia arriba, ya que estas diferencias "se cancelan". Se puede pensar que las rotaciones en ambos sistemas son "de X a Y".
fr: Fait amusant : en plus du fait que Y soit *en bas* dans Godot, la rotation est représentée dans le sens des aiguilles d'une montre. Cela signifie que toutes les fonctions mathématiques et de trigonométrie se comportent de la même manière qu'un système CCW Y-is-up (Y est en haut), puisque ces différences "s'annulent". Vous pouvez penser que les rotations dans les deux systèmes sont "de X à Y".
ja: おもしろい事実: GodotではYが *下* であることに加えて、回転は時計回りに表されます。これにより、これらの違いが「キャンセルされる」ため、すべての数学およびトリガ関数が"Y-is-up CCW"(Yが上で反時計回り)システムと同じように動作することを意味します。両方のシステムの回転は「XからY」であると考えることができます。
uk: Цікавий факт: На додаток до того, що Y в Godot вказує *вниз*, обертання представлене за годинниковою стрілкою. Це означає, що всі математичні та тригерні функції поводяться так само, як і система CCW Y-зверху, оскільки ці відмінності "скасовуються". Ви можете думати, що обертання в обох системах є "від X до Y".
zh_cn: 有趣的事实：在 Godot 中，不仅 Y 是\ *朝下*\ 的，旋转也是顺时针的。这意味着所有的数学和三角函数的行为都与 Y 朝上的 CCW 坐标系相同，因为这些差异“相互抵消”了。你可以认为在这两个坐标系中的旋转都是“从 X 到 Y”。

source: In order to perform a rotation of 0.5 radians (about 28.65 degrees), we simply plug in a value of 0.5 to the formula above and evaluate to find what the actual values should be:
es: Para realizar una rotación de 0.5 radianes (unos 28,65 grados), simplemente conectamos un valor de 0.5 a la fórmula anterior y evaluamos para encontrar cuáles deberían ser los valores reales:
fr: Afin d'effectuer une rotation de 0,5 radians (environ 28,65 degrés), nous ajoutons simplement une valeur de 0,5 à la formule ci-dessus et évaluons pour trouver quelles devraient être les valeurs réelles :
ja: 0.5ラジアン(約28.65度)の回転を実行するには、0.5の値を上記の式に差し込み、実際の値がどうあるべきかを評価します:
uk: Для того щоб виконати обертання на 0,5 радіанів (близько 28,65 градусів), ми просто підключаємо значення 0,5 до формули вище і вираховуємо, які фактичні значення повинні бути:
zh_cn: 为了执行 0.5 弧度的旋转（约 28.65 度），我们只需将 0.5 代入上面的公式中，然后计算出实际值应该是什么：

source: Here's how that would be done in code (place the script on a Node2D):
es: Así es como se haría en código (colocar el script en un Nodo2D):
fr: Voici comment cela serait fait en code (placer le script sur un Node2D) :
ja: コードでそれを行う方法を次に示します(スクリプトをNode2Dに配置します):
uk: Ось як це буде зроблено в коді (помістіть скрипт на вузол Node2D):
zh_cn: 这是在代码中完成的方法（将脚本放在 Node2D 上）：

source: To calculate the object's rotation from an existing transformation matrix, you can use `atan2(t.x.y, t.x.x)`, where t is the Transform2D.
es: Para calcular la rotación del objeto a partir de una matriz de transformación existente, puedes usar `atan2(t.x.y, t.x.x)`, donde t es la Transform2D.
fr: Pour calculer la rotation de l'objet à partir d'une matrice de transformation existante, vous pouvez utiliser `atan2(t.x.y, t.x.x)`, où t est le Transform2D.
ja: 既存の変換行列からオブジェクトの回転を計算するには、\ `atan2(t.x.y, t.x.x)` を使用できます。tはTransform2Dです。
uk: Для обчислення обертання об'єкта з існуючої матриці перетворення можна використовувати ``atan2(t.x.y, t.x.x)``, де t є Transform2D.
zh_cn: 要从现有的变换矩阵中计算对象的旋转，可以使用 `atan2(t.x.y, t.x.x)`\ ，其中 t 是 Transform2D。

source: In actual projects, you can use the `rotated()` method to perform rotations.
es: En los proyectos reales, puedes usar el método `rotated()` para realizar rotaciones.
fr: Dans les projets réels, vous pouvez utiliser la méthode `rotated()` pour effectuer des rotations.
ja: 実際のプロジェクトでは、\ `rotated()` メソッドを使用して回転を実行できます。
uk: У реальних проектах ви можете використовувати метод ``rotated()`` для виконання обертань.
zh_cn: 在实际项目中，可以使用 `rotated()` 方法进行旋转。

source: Basis of the transformation matrix
es: La base de la matriz de transformación
fr: Base de la matrice de transformation
ja: 変換行列の基底
uk: Основа матриці перетворення
zh_cn: 变换矩阵的基

source: So far we have only been working with the `x` and `y`, vectors, which are in charge of representing rotation, scale, and/or shearing (advanced, covered at the end). The X and Y vectors are together called the *basis* of the transformation matrix. The terms "basis" and "basis vectors" are important to know.
es: Hasta ahora sólo hemos trabajado con los vectores `x` y `y`, que se encargan de representar la rotación, la escala y/o el esquilado (avanzado, cubierto al final). Los vectores X e Y juntos son llamados la *base* de la matriz de transformación. Es importante conocer los términos "base" y "vectores base".
fr: Jusqu'à présent, nous n'avons travaillé qu'avec les vecteurs `x` et `y`, qui sont chargés de représenter la rotation, la mise à l'échelle et/ou le cisaillement (avancé, couvert à la fin). Les vecteurs X et Y sont appelés ensemble la *base* de la matrice de transformation. Il est important de connaître les termes "base" et "vecteurs de base".
ja: これまでは、回転、スケール、および/またはせん断(高度な内容で、最後に扱います)の表現を担当するベクトル `x` および `y` のみを使用してきました。 XおよびYベクトルを合わせて変換行列の *基底* と呼ばれます。「基底」および「基底ベクトル」という用語は重要です。
uk: До сих пір ми працювали тільки з векторами ``x`` і ``y``, які відповідають за представлення обертання, масштабування та/або перекосів (висвітлені далі). Вектори X і Y разом називаються *основою* матриці перетворення. Терміни "основа" і "основні вектори" важливо знати.
zh_cn: 到目前为止，我们只使用 `x` 和 `y` 向量，它们负责表示旋转、缩放和/或剪切（高级，会在文末提及）。X 和 Y 向量合称变换矩阵的\ *基*\ （Basis）。“基”和“基向量”都是非常重要的术语。

source: You might have noticed that :ref:`class_Transform2D` actually has three :ref:`class_Vector2` values: `x`, `y`, and `origin`. The `origin` value is not part of the basis, but it is part of the transform, and we need it to represent position. From now on we'll keep track of the origin vector in all examples. You can think of origin as another column, but it's often better to think of it as completely separate.
es: Habrás notado que :ref:`class_Transform2D` tiene en realidad tres valores :ref:`class_Vector2`: `x`, `y` y "origen". El valor de "origen" no es parte de la base, pero es parte de la transformación, y lo necesitamos para representar la posición. A partir de ahora seguiremos el vector de origen en todos los ejemplos. Puedes pensar en el origen como en otra columna, pero a menudo es mejor pensar en él como algo completamente separado.
fr: Vous avez peut-être remarqué que :ref:`class_Transform2D` a en fait trois valeurs :ref:`class_Vector2` : `x`, `y`, et `origine`. La valeur `origin` ne fait pas partie de la base, mais elle fait partie de la transformation, et nous en avons besoin pour représenter la position. A partir de maintenant, nous allons suivre le vecteur d'origine dans tous les exemples. Vous pouvez considérer l'origine comme une autre colonne, mais il est souvent préférable de la considérer comme complètement séparée.
ja: :ref:`class_Transform2D` には、実際には3つの :ref:`class_Vector2` 値があります: `x`\ 、\ ` y`\ 、および `origin` です。\ `origin` 値は基底の一部ではありませんが、transformの一部であり、位置を表すために必要です。これ以降、すべての例で原点ベクトルを追跡します。originは別の列と考えることができますが、多くの場合、完全に独立していると考える方が良いでしょう。
uk: Можливо, ви помітили, що :ref:`class_Transform2D` насправді має три значення :ref:`class_Vector2`: ``x``, ``y`` і ``origin`` . Значення ``origin`` не є частиною основи, але воно є частиною перетворення, і потрібне нам, щоб представляти позицію. Відтепер ми будемо відстежувати у всіх прикладах вектор ``origin``. Ви можете думати про нього, як про іншу колонку, але краще вважати, що він йде окремо.
zh_cn: 你可能已经注意到 :ref:`class_Transform2D` 实际上有三个 :ref:`class_Vector2` 值：\ `x`\ 、\ `y`\ 、\ `origin`\ 。其中 `origin` 值不是基的一部分，而是变换的一部分，我们需要用它来表示位置。从现在开始，我们将在所有例子中记录原点向量。您可以将原点看作另一列，但把它认为是完全独立的通常更好。

source: Note that in 3D, Godot has a separate :ref:`class_Basis` structure for holding the three :ref:`class_Vector3` values of the basis, since the code can get complex and it makes sense to separate it from :ref:`class_Transform` (which is composed of one :ref:`class_Basis` and one extra :ref:`class_Vector3` for the origin).
es: Nótese que en 3D, Godot tiene una estructura :ref:`class_Basis` separada para mantener los tres valores :ref:`class_Vector3` de la base, ya que el código puede volverse complejo y tiene sentido separarlo de :ref:`class_Transform` (que está compuesto por un :ref:`class_Basis` y un extra :ref:`class_Vector3` para el origen).
fr: Notez qu'en 3D, Godot a une structure :ref:`class_Basis` séparée pour contenir les trois valeurs :ref:`class_Vector3` de la base, car le code peut devenir complexe et il est logique de la séparer de :ref:`class_Transform` (qui est composé d'une :ref:`class_Basis` et d'une :ref:`class_Vector3` supplémentaire pour l'origine).
ja: 3Dの場合、コードが複雑になる可能性があり、それを :ref:`class_Transform`(これは、原点用に1つの :ref:` class_Basis` と、1つの追加の :ref:`class_Vector3` で構成されます)から分離する方が理にかなってるため、Godoには基底の3つの :ref:`class_Vector3` 値を保持するための別個の :ref:` class_Basis` 構造を持っています。
uk: Запримітьте, що в 3D Godot має окрему структуру :ref:`class_Basis` для утримання трьох значень основи :ref:`class_Vector3`, оскільки код може ускладнитися і має сенс відокремити його від :ref:`class_Transform` (який складається з однієї :ref:`class_Basis` і одного додаткового :ref:`class_Vector3` для походження).
zh_cn: 请注意在 3D 中，Godot 有一个单独的 :ref:`class_Basis` 结构，里面包含矩阵基的三个 :ref:`class_Vector3` 的值。因为代码可能变得复杂，因此将它们从 :ref:`class_Transform`\ （由一个 :ref:`class_Basis` 和一个额外的原点 :ref:`class_Vector3` 组成）中拆分出来是值得的。

source: Translating the transformation matrix
es: Trasladando la matriz de transformación
fr: Translation de la matrice de transformation
ja: 変換行列の平行移動
uk: Переміщення за допомогою матриці перетворення
zh_cn: 变换矩阵的平移

source: Changing the `origin` vector is called a *translating* the transformation matrix. Translating is basically a technical term for "moving" the object, but it explicitly does not involve any rotation.
es: Cambiar el vector de `origen` se llama "transladar" la matriz de transformación. Transladar es básicamente un término técnico para "mover" el objeto, pero explícitamente no implica ninguna rotación.
fr: La modification du vecteur `origin` est appelée une *translation* de la matrice de transformation. La translation est essentiellement un terme technique pour "déplacer" l'objet, mais elle n'implique explicitement aucune rotation.
ja: `origin` ベクトルを変更することは、変換行列の *並行移動* と呼ばれます。並行移動とは、基本的にオブジェクトを「動かす」ための専門用語ですが、明示的には回転を伴いません。
uk: Зміна вектора ``origin`` призводить до переміщення. При цьому переміщення не передбачає ніякого обертання.
zh_cn: 对 `origin` 向量的修改称为对变换矩阵的\ *平移*\ 。平移其实上是“移动”对象的一个技术术语，但它不会包含任何旋转。

source: Let's work through an example to help understand this. We will start with the identity transform like last time, except we will keep track of the origin vector this time.
es: Trabajemos con un ejemplo para ayudar a entender esto. Empezaremos con la transformación de identidad como la última vez, excepto que esta vez seguiremos el vector de origen.
fr: Travaillons à travers un exemple pour aider à comprendre cela. Nous commencerons par la transformation d'identité comme la dernière fois, sauf que nous allons suivre le vecteur d’origine cette fois.
uk: Давайте розглянемо приклад, щоб зрозуміти це. Ми почнемо з матриці ідентичності, як минулого разу, за винятком того, що цього разу ми будемо відстежувати вектор походження.
zh_cn: 让我们通过一个例子来帮助理解这一点。我们将像上次一样从恒等变换开始，但这次我们将记录原点向量。

source: If we want the object to move to a position of (1, 2), we simply need to set its `origin` vector to (1, 2):
es: Si queremos que el objeto se mueva a una posición de (1, 2), sólo tenemos que poner su vector de `origen` en (1, 2):
fr: Si nous voulons que l'objet se déplace vers une position de (1, 2), nous devons simplement mettre son vecteur `origin` à (1, 2) :
ja: オブジェクトを(1, 2)の位置に移動させたい場合は、単にその `origin` ベクトルを(1, 2)に設定する必要があります:
uk: Якщо ми хочемо, щоб об'єкт рухався в положення (1, 2), нам просто потрібно встановити його вектор походження ``origin`` на (1, 2):
zh_cn: 如果希望对象移动到 (1, 2) 的位置，只需将其 `origin` 向量设置为 (1, 2)：

source: There is also a `translated()` method, which performs a different operation to adding or changing `origin` directly. The `translated()` method will translate the object *relative to its own rotation*. For example, an object rotated 90 degrees clockwise will move to the right when `translated()` with `Vector2.UP`.
es: También hay un método `translated()`, que realiza una operación diferente a la de añadir o cambiar el `origen` directamente. El método `translated()` traducirá el objeto *relativo a su propia rotación*. Por ejemplo, un objeto rotado 90 grados en el sentido de las agujas del reloj se moverá a la derecha cuando se `translated()` con `Vector 2.UP`.
fr: Il existe également une méthode `translated()`, qui effectue une opération différente pour ajouter ou modifier directement `origine`. La méthode `translated()` translaera l'objet *par rapport à sa propre rotation*. Par exemple, un objet tourné de 90 degrés dans le sens des aiguilles d'une montre se déplacera vers la droite lorsqu'il sera `translated()` avec `Vector2.UP`.
ja: また、\ `origin` を直接追加または変更するために異なる操作を実行する `translated()` メソッドもあります。\ `translated()` メソッドはオブジェクトを *それ自身の回転に関連して* 変換します。たとえば、時計回りに90度回転したオブジェクトは、\ `Vector2.UP` で `translated() ` を使用すると右に移動します。
uk: Існує також метод ``translated()``, який виконує іншу операцію з додавання, або зміни, ``origin`` безпосередньо. Метод ``translated()`` перемістить об'єкт *відносно його власного повороту*. Наприклад, об'єкт, повернутий на 90 градусів за годинниковою стрілкою, ``translated()`` з ``Vector2.UP`` перемістить вправо.
zh_cn: 还有一个 `translated()` 方法，它执行的是与直接增加或更改 `origin` 不同的操作。这个 `translated()` 方法将让该对象相对于它自己的旋转进行平移。例如，顺时针旋转了 90 度的对象如果用 `Vector2.UP` 调用了 `translated()`\ ，那么它就会向右移动。

source: Godot's 2D uses coordinates based on pixels, so in actual projects you will want to translate by hundreds of units.
es: El 2D de Godot usa coordenadas basadas en píxeles, por lo que en los proyectos reales querrás transladarlos por cientos de unidades.
fr: La 2D de Godot utilise des coordonnées basées sur les pixels, donc dans les projets réels, vous voudrez translater par des centaines d'unités.
ja: Godotの2Dはピクセルに基づく座標を使用するため、実際のプロジェクトでは数百という単位で並行移動を行う必要があります。
uk: Godot в 2D використовує координати, засновані на пікселях, тому в реальних проектах ви будете переміщувати на сотні одиниць.
zh_cn: Godot 的 2D 使用基于像素的坐标，所以在实际项目中，你会想要转换成数百个单位。

source: Putting it all together
es: Poniendo todo junto
fr: Mettre tout cela ensemble
ja: すべてをまとめる
uk: Збираємо все це докупи
zh_cn: 融会贯通

source: We're going to apply everything we mentioned so far onto one transform. To follow along, create a simple project with a Sprite node and use the Godot logo for the texture resource.
es: Vamos a aplicar todo lo que hemos mencionado hasta ahora en una transformación. Para seguir, crear un proyecto simple con un nodo Sprite y usar el logo de Godot para el recurso de la textura.
fr: Nous allons appliquer tout ce que nous avons mentionné jusqu'à présent à une transformation. Pour suivre, ouvrez-vous un projet simple avec un nœud Sprite et utiliser le logo Godot comme ressource de texture.
uk: Ми збираємося застосувати все, про що ми досі говорили, для одного перетворення. Щоб продовжити далі, створіть простий проект з вузлом Sprite і використайте логотип Godot для в якості його текстури.
zh_cn: 我们将把到目前为止提到的所有内容都应用到一个变换上。接下来，使用 Sprite 节点创建一个简单的项目，并使用 Godot 徽标作为其纹理资源。

source: Let's set the translation to (350, 150), rotate by -0.5 rad, and scale by 3. I've posted a screenshot, and the code to reproduce it, but I encourage you to try and reproduce the screenshot without looking at the code!
es: Pongamos la traslación a (350, 150), rotar por -0,5 rad, y escalar por 3. He publicado una captura de pantalla, y el código para reproducirla, ¡pero os animo a intentar reproducir la captura de pantalla sin mirar el código!
fr: Mettons la translation à (350, 150), une rotation de -0,5 rad, et une échelle de 3. J'ai posté une capture d'écran, et le code pour la reproduire, mais je vous encourage à essayer de reproduire la capture d'écran sans regarder le code !
ja: 平行移動を(350, 150)に設定し、-0.5 radで回転し、3でスケーリングしましょう。スクリーンショットと再現コードを投稿しましたが、コードを見ずにスクリーンショットを再現することをおすすめします！
uk: Давайте встановимо переміщення на (350, 150), поворот на -0,5 радіан і масштаб на 3. Я опублікував скріншот, і код, для його відтворення, але закликаю вас спробувати відтворити скріншот, не заглядаючи в код!
zh_cn: 让我们将平移设置为 (350, 150)，旋转设为 -0.5 rad，缩放设为 3。我把屏幕截图和重现代码都发出来了，但我鼓励您不看代码来尝试重现屏幕截图！

source: Shearing the transformation matrix (advanced)
es: Inclinando la matrix transformada (Avanzado)
fr: Cisaillement de la matrice de transformation (avancé)
ja: 変換行列のせん断(高度な内容)
uk: Перекоси за допомогою матриці перетворення (додатково)
zh_cn: 剪切变换矩阵（高级）

source: If you are only looking for how to *use* transformation matrices, feel free to skip this section of the tutorial. This section explores an uncommonly used aspect of transformation matrices for the purpose of building an understanding of them.
es: Si sólo buscas cómo *usar* las matrices de transformación, no dudes en saltarte esta sección del tutorial. Esta sección explora un aspecto poco común de las matrices de transformación con el propósito de construir una comprensión de las mismas.
fr: Si vous cherchez seulement à savoir comment *utiliser* les matrices de transformation, n'hésitez pas à sauter cette section du tutoriel. Cette section explore un aspect peu utilisé des matrices de transformation dans le but d'en faciliter la compréhension.
ja: 変換行列を *使用* する方法のみを探している場合は、チュートリアルのこのセクションをスキップしてください。このセクションでは、変換行列の理解を深める目的で、一般的に使用されない側面について説明します。
uk: Якщо ви шукаєте інформацію тільки про *використання* матриць перетворення, не соромтеся пропустити цей розділ статті. Цей розділ досліджує мало коли використовуваний аспект матриць перетворення з метою формування розуміння їх.
zh_cn: 如果您只想了解如何\ *使用*\ 变换矩阵，请随意跳过本教程的这一节。本节探讨变换矩阵的一个不常用的方面，目的是为了你建立对它们的理解。

source: You may have noticed that a transform has more degrees of freedom than the combination of the above actions. The basis of a 2D transformation matrix has four total numbers in two :ref:`class_Vector2` values, while a rotation value and a Vector2 for scale only has 3 numbers. The high-level concept for the missing degree of freedom is called *shearing*.
es: Habrá notado que una transformación tiene más grados de libertad que la combinación de las acciones anteriores. La base de una matriz de transformación 2D tiene cuatro números totales en dos :ref:`clase_Vector2` valores, mientras que un valor de rotación y un Vector2 para la escala sólo tiene 3 números. El concepto de alto nivel para el grado de libertad que falta se llama *shearing*.
fr: Vous avez peut-être remarqué qu'une transformation a plus de degrés de liberté que la combinaison des actions ci-dessus. La base d'une matrice de transformation 2D a quatre nombres totaux en deux valeurs :ref:`class_Vector2`, alors qu'une valeur de rotation et un Vector2 pour l'échelle n'ont que 3 nombres. Le concept de haut niveau pour le degré de liberté manquant est appelé *cisaillement*.
ja: transformは、上記のアクションの組み合わせよりも自由度が高いことに気づいたかもしれません。 2D変換行列の基底には、2つの :ref:`class_Vector2` 値に合計4つの数値がありますが、回転値とスケールのVector2には3つの数値しかありません。欠落している自由度の高い概念は、\ *せん断*\ と呼ばれます。
uk: Можливо, ви помітили, що перетворення має більше ступенів свободи, ніж поєднання вищезазначених дій. Основа матриці 2D-перетворення має чотири загальних числа у двох значеннях :ref:`class_Vector2`, тоді як значення обертання та Вектор2 для масштабу мають лише 3 числа. Концепція високого рівня з обмеження ступенів свободи дозволяє *перекоси*.
zh_cn: 您可能已经注意到，变换的自由度比上述操作的组合要多。2D 变换矩阵的基在两个 :ref:`class_Vector2` 值中总共有四个数，而旋转值和缩放的 Vector2 只有三个数字。缺失自由度的高级概念称为\ *剪切*\ （Shearing）。

source: Normally, you will always have the basis vectors perpendicular to each other. However, shearing can be useful in some situations, and understanding shearing helps you understand how transforms work.
es: Normalmente, siempre tendrá los vectores base perpendiculares entre sí. Sin embargo, la inclinación puede ser útil en algunas situaciones, y comprender la inclinación le ayuda a entender cómo funcionan las transformaciones.
fr: Normalement, les vecteurs de base seront toujours perpendiculaires entre eux. Cependant, le cisaillement peut être utile dans certaines situations, et comprendre le cisaillement vous aide à comprendre comment fonctionnent les transformations.
uk: Як правило, базові вектори у вас завжди будуть перпендикулярні один одному. Однак перекоси можуть бути корисними в деяких ситуаціях, а їх розуміння допомагає зрозуміти, як працюють перетворення.
zh_cn: 通常，您将始终拥有彼此垂直的基向量。但是，剪切在某些情况下可能很有用，了解剪切可以帮助您理解变换的工作原理。

source: To show you visually how it will look, let's overlay a grid onto the Godot logo:
es: Para mostrar visualmente cómo se verá, superpongamos un grid sobre el logo de Godot:
fr: Pour vous montrer visuellement ce à quoi il ressemblera, superposons une grille au logo Godot :
ja: 視覚的にどのように見えるかを示すために、グリッドをGodotロゴにオーバーレイしましょう:
uk: Щоб візуально показати вам, як це буде виглядати, давайте накладемо сітку на логотип Godot:
zh_cn: 为了直观地向您展示它的外观, 让我们在Godot徽标上叠加一个网格:

source: Each point on this grid is obtained by adding the basis vectors together. The bottom-right corner is X + Y, while the top-right corner is X - Y. If we change the basis vectors, the entire grid moves with it, as the grid is composed of the basis vectors. All lines on the grid that are currently parallel will remain parallel no matter what changes we make to the basis vectors.
es: Cada punto de este grid se obtiene sumando los vectores base. La esquina inferior derecha es X + Y, mientras que la esquina superior derecha es X - Y. Si cambiamos los vectores base, toda el grid se mueve con el, ya que la grid está compuesta de los vectores base. Todas las líneas del grid que son actualmente paralelas permanecerán paralelas sin importar los cambios que hagamos en los vectores base.
fr: Chaque point de cette grille est obtenu en additionnant les vecteurs de base. Le coin inférieur droit est X + Y, tandis que le coin supérieur droit est X - Y. Si nous changeons les vecteurs de base, toute la grille se déplace avec, car la grille est composée des vecteurs de base. Toutes les lignes de la grille qui sont actuellement parallèles le resteront, quelles que soient les modifications que nous apportons aux vecteurs de base.
ja: このグリッド上の各ポイントは、基底ベクトルを加算することにより取得されます。右下隅はX + Y、右上隅はX - Yです。基底ベクトルを変更すると、グリッドが基底ベクトルで構成されるため、グリッド全体が一緒に移動します。基底ベクトルにどのような変更を加えても、現在平行なグリッド上のすべての線は平行のままです。
uk: Кожна точка на цій сітці є отримана за допомогою додавання основних векторів. Нижній правий кут рівний X + Y, а верхній правий кут рівний X - Y. Якщо ми змінимо вектори основи, то з ними зрушиться вся сітка, так як сітка складається з основних векторів. Всі лінії на сітці, які в даний час паралельні, залишаться паралельними, незалежно від того, які зміни ми вносимо в основні вектори.
zh_cn: 此网格上的每个点都是通过将基向量相加而获得的。右下角是 X + Y，而右上角是 X - Y。如果我们更改基向量，整个栅格也会随之移动，因为栅格是由基向量组成的。无论我们对基向量做什么更改，栅格上当前平行的所有直线都将保持平行。

source: As an example, let's set Y to (1, 1):
es: Como ejemplo, pongamos Y a (1, 1):
fr: À titre d'exemple, mettons Y à (1, 1) :
ja: 例として、Yを(1, 1)に設定しましょう:
uk: Як приклад, давайте встановимо Y на (1, 1):
zh_cn: 例如, 让我们将Y设置为(1,1):
